#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x3D7 (0x3D8 - 0x1)
// ScriptStruct BaseHumanAnimBP.BaseHumanAnimBP_C.AnimBlueprintGeneratedConstantData
struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                        Pad_4793[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                __ArrayProperty_3793;                              // 0x8(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	enum class EAlphaBlendOption                 __EnumProperty_3794;                               // 0x18(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	uint8                                        Pad_4794[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                __ArrayProperty_3795;                              // 0x20(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	TArray<float>                                __ArrayProperty_3796;                              // 0x30(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	TArray<float>                                __ArrayProperty_3797;                              // 0x40(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	enum class EAlphaBlendOption                 __EnumProperty_3798;                               // 0x50(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	enum class EBlendListTransitionType          __EnumProperty_3799;                               // 0x51(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	uint8                                        Pad_4797[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                __ArrayProperty_3800;                              // 0x58(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	TArray<float>                                __ArrayProperty_3801;                              // 0x68(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	TArray<float>                                __ArrayProperty_3802;                              // 0x78(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	class FName                                  __NameProperty_3803;                               // 0x88(0x8)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	struct FAnimNodeFunctionRef                  __StructProperty_3804;                             // 0x90(0x20)(ConstParm, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	struct FAnimNodeFunctionRef                  __StructProperty_3805;                             // 0xB0(0x20)(ConstParm, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	class FName                                  __NameProperty_3806;                               // 0xD0(0x8)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	class FName                                  __NameProperty_3807;                               // 0xD8(0x8)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	class UAnimSequenceBase*                     __AnimSequenceBase_3808;                           // 0xE0(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	class UAnimSequenceBase*                     __AnimSequenceBase_3809;                           // 0xE8(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	class UAnimSequenceBase*                     __AnimSequenceBase_3810;                           // 0xF0(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	class UAnimSequenceBase*                     __AnimSequenceBase_3811;                           // 0xF8(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	class UAnimSequenceBase*                     __AnimSequenceBase_3812;                           // 0x100(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	class FName                                  __NameProperty_3813;                               // 0x108(0x8)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	TArray<float>                                __ArrayProperty_3814;                              // 0x110(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	TArray<float>                                __ArrayProperty_3815;                              // 0x120(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, EditorOnly, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	TArray<float>                                __ArrayProperty_3816;                              // 0x130(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	TArray<float>                                __ArrayProperty_3817;                              // 0x140(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	TArray<float>                                __ArrayProperty_3818;                              // 0x150(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	TArray<float>                                __ArrayProperty_3819;                              // 0x160(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	TArray<float>                                __ArrayProperty_3820;                              // 0x170(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	enum class EAnimSyncMethod                   __EnumProperty_3821;                               // 0x180(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	uint8                                        Pad_479B[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  __NameProperty_3822;                               // 0x184(0x8)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	class FName                                  __NameProperty_3823;                               // 0x18C(0x8)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	int32                                        __IntProperty_3824;                                // 0x194(0x4)(ConstParm, ExportObject, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	class FName                                  __NameProperty_3825;                               // 0x198(0x8)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	int32                                        __IntProperty_3826;                                // 0x1A0(0x4)(ConstParm, ExportObject, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	class FName                                  __NameProperty_3827;                               // 0x1A4(0x8)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	int32                                        __IntProperty_3828;                                // 0x1AC(0x4)(ConstParm, ExportObject, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	class FName                                  __NameProperty_3829;                               // 0x1B0(0x8)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	int32                                        __IntProperty_3830;                                // 0x1B8(0x4)(ConstParm, ExportObject, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	uint8                                        Pad_479C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                __ArrayProperty_3831;                              // 0x1C0(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	TArray<int32>                                __ArrayProperty_3832;                              // 0x1D0(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	class FName                                  __NameProperty_3833;                               // 0x1E0(0x8)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	TArray<float>                                __ArrayProperty_3834;                              // 0x1E8(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	TArray<float>                                __ArrayProperty_3835;                              // 0x1F8(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	enum class EAlphaBlendOption                 __EnumProperty_3836;                               // 0x208(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	uint8                                        Pad_479D[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                __ArrayProperty_3837;                              // 0x210(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	struct FInputScaleBiasClampConstants         __StructProperty_3838;                             // 0x220(0x2C)(ConstParm, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected)
	float                                        __FloatProperty_3839;                              // 0x24C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected)
	TArray<float>                                __ArrayProperty_3840;                              // 0x250(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected)
	enum class ESequenceEvalReinit               __ByteProperty_3841;                               // 0x260(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference, Interp, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected)
	bool                                         __BoolProperty_3842;                               // 0x261(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected)
	uint8                                        Pad_479F[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_3843;                              // 0x264(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, NonTransactional, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected)
	enum class EAnimSyncMethod                   __EnumProperty_3844;                               // 0x268(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected)
	enum class EAnimGroupRole                    __ByteProperty_3845;                               // 0x269(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected)
	uint8                                        Pad_47A0[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  __NameProperty_3846;                               // 0x26C(0x8)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected)
	uint8                                        Pad_47A1[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UBlendProfile*                         __BlendProfile_3847;                               // 0x278(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, EditorOnly, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected)
	class UCurveFloat*                           __CurveFloat_3848;                                 // 0x280(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected)
	bool                                         __BoolProperty_3849;                               // 0x288(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected)
	enum class EAlphaBlendOption                 __EnumProperty_3850;                               // 0x289(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected)
	enum class EBlendListTransitionType          __EnumProperty_3851;                               // 0x28A(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected)
	uint8                                        Pad_47A5[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                __ArrayProperty_3852;                              // 0x290(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected)
	struct FAnimNodeFunctionRef                  __StructProperty_3853;                             // 0x2A0(0x20)(ConstParm, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected)
	struct FAnimSubsystem_Tag                    AnimBlueprintExtension_Tag;                        // 0x2C0(0x60)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FAnimSubsystem_PropertyAccess         AnimBlueprintExtension_PropertyAccess;             // 0x320(0x80)(ConstParm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FAnimSubsystem                        AnimBlueprintExtension_NodeRelevancy;              // 0x3A0(0x8)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FAnimSubsystem_BlendSpaceGraph        AnimBlueprintExtension_BlendSpaceGraph;            // 0x3A8(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FAnimSubsystem_Base                   AnimBlueprintExtension_Base;                       // 0x3C0(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
};

// 0x348 (0x349 - 0x1)
// ScriptStruct BaseHumanAnimBP.BaseHumanAnimBP_C.AnimBlueprintGeneratedMutableData
struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
public:
	bool                                         __BoolProperty;                                    // 0x1(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference)
	bool                                         __BoolProperty_0;                                  // 0x2(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify)
	bool                                         __BoolProperty_1;                                  // 0x3(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp)
	float                                        __FloatProperty_2;                                 // 0x4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	bool                                         __BoolProperty_3;                                  // 0x8(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional)
	bool                                         __BoolProperty_4;                                  // 0x9(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	bool                                         __BoolProperty_5;                                  // 0xA(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	uint8                                        Pad_47A7[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_6;                                 // 0xC(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	float                                        __FloatProperty_7;                                 // 0x10(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, EditorOnly)
	bool                                         __BoolProperty_8;                                  // 0x14(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	uint8                                        Pad_47A8[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        __IntProperty_9;                                   // 0x18(0x4)(ConstParm, ExportObject, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	bool                                         __BoolProperty_10;                                 // 0x1C(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	bool                                         __BoolProperty_11;                                 // 0x1D(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	uint8                                        Pad_47A9[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_12;                             // 0x20(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	bool                                         __BoolProperty_13;                                 // 0x28(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly)
	uint8                                        Pad_47AA[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_14;                                // 0x2C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	TArray<float>                                __ArrayProperty_15;                                // 0x30(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, NoDestructor)
	bool                                         __BoolProperty_16;                                 // 0x40(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor)
	bool                                         __BoolProperty_17;                                 // 0x41(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor)
	uint8                                        Pad_47AB[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                __ArrayProperty_18;                                // 0x48(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor)
	bool                                         __BoolProperty_19;                                 // 0x58(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor)
	uint8                                        Pad_47AC[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_20;                             // 0x60(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	bool                                         __BoolProperty_21;                                 // 0x68(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor)
	bool                                         __BoolProperty_22;                                 // 0x69(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	bool                                         __BoolProperty_23;                                 // 0x6A(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor)
	bool                                         __BoolProperty_24;                                 // 0x6B(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	bool                                         __BoolProperty_25;                                 // 0x6C(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor)
	bool                                         __BoolProperty_26;                                 // 0x6D(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	bool                                         __BoolProperty_27;                                 // 0x6E(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	uint8                                        Pad_47AD[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_28;                                // 0x70(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	uint8                                        Pad_47AE[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_29;                             // 0x78(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	bool                                         __BoolProperty_30;                                 // 0x80(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	uint8                                        Pad_47AF[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_31;                                // 0x84(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        __FloatProperty_32;                                // 0x88(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify)
	float                                        __FloatProperty_33;                                // 0x8C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, Interp)
	float                                        __FloatProperty_34;                                // 0x90(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	bool                                         __BoolProperty_35;                                 // 0x94(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional)
	bool                                         __BoolProperty_36;                                 // 0x95(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	bool                                         __BoolProperty_37;                                 // 0x96(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	bool                                         __BoolProperty_38;                                 // 0x97(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	float                                        __FloatProperty_39;                                // 0x98(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, EditorOnly)
	float                                        __FloatProperty_40;                                // 0x9C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	float                                        __FloatProperty_41;                                // 0xA0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	bool                                         __BoolProperty_42;                                 // 0xA4(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	uint8                                        Pad_47B1[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        __IntProperty_43;                                  // 0xA8(0x4)(ConstParm, ExportObject, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	bool                                         __BoolProperty_44;                                 // 0xAC(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	bool                                         __BoolProperty_45;                                 // 0xAD(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly)
	uint8                                        Pad_47B2[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_46;                                // 0xB0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	float                                        __FloatProperty_47;                                // 0xB4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, NoDestructor)
	class UAnimSequenceBase*                     __AnimSequenceBase_48;                             // 0xB8(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor)
	bool                                         __BoolProperty_49;                                 // 0xC0(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor)
	bool                                         __BoolProperty_50;                                 // 0xC1(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor)
	bool                                         __BoolProperty_51;                                 // 0xC2(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor)
	uint8                                        Pad_47B3[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_52;                             // 0xC8(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	class UAnimSequenceBase*                     __AnimSequenceBase_53;                             // 0xD0(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor)
	float                                        __FloatProperty_54;                                // 0xD8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	uint8                                        Pad_47B4[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_55;                             // 0xE0(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor)
	bool                                         __BoolProperty_56;                                 // 0xE8(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	uint8                                        Pad_47B6[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_57;                                // 0xEC(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor)
	float                                        __FloatProperty_58;                                // 0xF0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	bool                                         __BoolProperty_59;                                 // 0xF4(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	uint8                                        Pad_47B8[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_60;                                // 0xF8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	float                                        __FloatProperty_61;                                // 0xFC(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	float                                        __FloatProperty_62;                                // 0x100(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	bool                                         __BoolProperty_63;                                 // 0x104(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, AutoWeak)
	uint8                                        Pad_47BB[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_64;                                // 0x108(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, AutoWeak)
	float                                        __FloatProperty_65;                                // 0x10C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, Interp, AutoWeak)
	bool                                         __BoolProperty_66;                                 // 0x110(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, AutoWeak)
	uint8                                        Pad_47BD[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_67;                                // 0x114(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, NonTransactional, AutoWeak)
	bool                                         __BoolProperty_68;                                 // 0x118(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, AutoWeak)
	uint8                                        Pad_47BF[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_69;                                // 0x11C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, AutoWeak)
	bool                                         __BoolProperty_70;                                 // 0x120(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, AutoWeak)
	bool                                         __BoolProperty_71;                                 // 0x121(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, EditorOnly, AutoWeak)
	bool                                         __BoolProperty_72;                                 // 0x122(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, AutoWeak)
	uint8                                        Pad_47C1[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_73;                                // 0x124(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, AutoWeak)
	float                                        __FloatProperty_74;                                // 0x128(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, AutoWeak)
	bool                                         __BoolProperty_75;                                 // 0x12C(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, AutoWeak)
	bool                                         __BoolProperty_76;                                 // 0x12D(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, AutoWeak)
	bool                                         __BoolProperty_77;                                 // 0x12E(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, AutoWeak)
	bool                                         __BoolProperty_78;                                 // 0x12F(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, AutoWeak)
	bool                                         __BoolProperty_79;                                 // 0x130(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NoDestructor, AutoWeak)
	uint8                                        Pad_47C3[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_80;                                // 0x134(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor, AutoWeak)
	float                                        __FloatProperty_81;                                // 0x138(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_82;                                 // 0x13C(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_83;                                 // 0x13D(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_84;                                 // 0x13E(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_85;                                 // 0x13F(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_86;                                 // 0x140(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_87;                                 // 0x141(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_88;                                 // 0x142(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_89;                                 // 0x143(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_90;                                 // 0x144(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_91;                                 // 0x145(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_92;                                 // 0x146(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_93;                                 // 0x147(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	float                                        __FloatProperty_94;                                // 0x148(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_95;                                 // 0x14C(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, AutoWeak)
	bool                                         __BoolProperty_96;                                 // 0x14D(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, AutoWeak)
	uint8                                        __ByteProperty_97;                                 // 0x14E(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference, Interp, AutoWeak)
	bool                                         __BoolProperty_98;                                 // 0x14F(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, AutoWeak)
	bool                                         __BoolProperty_99;                                 // 0x150(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional, AutoWeak)
	bool                                         __BoolProperty_100;                                // 0x151(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, AutoWeak)
	uint8                                        Pad_47C4[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_101;                            // 0x158(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, AutoWeak)
	bool                                         __BoolProperty_102;                                // 0x160(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, AutoWeak)
	uint8                                        Pad_47C5[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_103;                            // 0x168(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, AutoWeak)
	bool                                         __BoolProperty_104;                                // 0x170(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, AutoWeak)
	uint8                                        Pad_47C6[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_105;                            // 0x178(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, AutoWeak)
	float                                        __FloatProperty_106;                               // 0x180(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, AutoWeak)
	float                                        __FloatProperty_107;                               // 0x184(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, AutoWeak)
	bool                                         __BoolProperty_108;                                // 0x188(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, AutoWeak)
	bool                                         __BoolProperty_109;                                // 0x189(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, AutoWeak)
	uint8                                        Pad_47C8[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_110;                            // 0x190(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, AutoWeak)
	class UAnimSequenceBase*                     __AnimSequenceBase_111;                            // 0x198(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor, AutoWeak)
	class UAnimSequenceBase*                     __AnimSequenceBase_112;                            // 0x1A0(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_113;                                // 0x1A8(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor, AutoWeak)
	uint8                                        Pad_47CB[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_114;                            // 0x1B0(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor, AutoWeak)
	class UAnimSequenceBase*                     __AnimSequenceBase_115;                            // 0x1B8(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_116;                                // 0x1C0(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor, AutoWeak)
	uint8                                        Pad_47CC[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_117;                            // 0x1C8(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor, AutoWeak)
	class UAnimSequenceBase*                     __AnimSequenceBase_118;                            // 0x1D0(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_119;                                // 0x1D8(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor, AutoWeak)
	uint8                                        Pad_47CE[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_120;                            // 0x1E0(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor, AutoWeak)
	class UAnimSequenceBase*                     __AnimSequenceBase_121;                            // 0x1E8(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor, AutoWeak)
	class UAnimSequenceBase*                     __AnimSequenceBase_122;                            // 0x1F0(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_123;                                // 0x1F8(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_124;                                // 0x1F9(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	bool                                         __BoolProperty_125;                                // 0x1FA(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	uint8                                        Pad_47CF[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_126;                            // 0x200(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	class UAnimSequenceBase*                     __AnimSequenceBase_127;                            // 0x208(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, ContainsInstancedReference)
	bool                                         __BoolProperty_128;                                // 0x210(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, ContainsInstancedReference)
	uint8                                        Pad_47D0[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_129;                            // 0x218(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, ContainsInstancedReference)
	bool                                         __BoolProperty_130;                                // 0x220(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, ContainsInstancedReference)
	bool                                         __BoolProperty_131;                                // 0x221(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional, ContainsInstancedReference)
	uint8                                        Pad_47D1[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_132;                            // 0x228(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, ContainsInstancedReference)
	class UAnimSequenceBase*                     __AnimSequenceBase_133;                            // 0x230(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, ContainsInstancedReference)
	bool                                         __BoolProperty_134;                                // 0x238(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, ContainsInstancedReference)
	uint8                                        Pad_47D2[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_135;                            // 0x240(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, ContainsInstancedReference)
	bool                                         __BoolProperty_136;                                // 0x248(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, ContainsInstancedReference)
	uint8                                        Pad_47D3[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_137;                            // 0x250(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, ContainsInstancedReference)
	bool                                         __BoolProperty_138;                                // 0x258(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, ContainsInstancedReference)
	uint8                                        Pad_47D4[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_139;                            // 0x260(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, ContainsInstancedReference)
	bool                                         __BoolProperty_140;                                // 0x268(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, ContainsInstancedReference)
	bool                                         __BoolProperty_141;                                // 0x269(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, ContainsInstancedReference)
	bool                                         __BoolProperty_142;                                // 0x26A(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, ContainsInstancedReference)
	uint8                                        Pad_47D5[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_143;                               // 0x26C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_144;                                // 0x270(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_145;                                // 0x271(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_146;                                // 0x272(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_147;                                // 0x273(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_148;                                // 0x274(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_149;                                // 0x275(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor, ContainsInstancedReference)
	uint8                                        Pad_47D6[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_150;                            // 0x278(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, ContainsInstancedReference)
	class UAnimSequenceBase*                     __AnimSequenceBase_151;                            // 0x280(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_152;                                // 0x288(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor, ContainsInstancedReference)
	uint8                                        Pad_47D7[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_153;                               // 0x28C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor, ContainsInstancedReference)
	float                                        __FloatProperty_154;                               // 0x290(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_155;                                // 0x294(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	uint8                                        Pad_47D9[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_156;                               // 0x298(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	float                                        __FloatProperty_157;                               // 0x29C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	float                                        __FloatProperty_158;                               // 0x2A0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	float                                        __FloatProperty_159;                               // 0x2A4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, ContainsInstancedReference)
	class UAnimSequenceBase*                     __AnimSequenceBase_160;                            // 0x2A8(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, ContainsInstancedReference)
	class UAnimSequenceBase*                     __AnimSequenceBase_161;                            // 0x2B0(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, ContainsInstancedReference)
	class UAnimSequenceBase*                     __AnimSequenceBase_162;                            // 0x2B8(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, ContainsInstancedReference)
	class UAnimSequenceBase*                     __AnimSequenceBase_163;                            // 0x2C0(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, ContainsInstancedReference)
	class UAnimSequenceBase*                     __AnimSequenceBase_164;                            // 0x2C8(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, ContainsInstancedReference)
	bool                                         __BoolProperty_165;                                // 0x2D0(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, ContainsInstancedReference)
	uint8                                        Pad_47DC[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_166;                            // 0x2D8(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, ContainsInstancedReference)
	uint8                                        __ByteProperty_167;                                // 0x2E0(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference, EditorOnly, ContainsInstancedReference)
	uint8                                        Pad_47DD[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_168;                               // 0x2E4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, ContainsInstancedReference)
	float                                        __FloatProperty_169;                               // 0x2E8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, ContainsInstancedReference)
	bool                                         __BoolProperty_170;                                // 0x2EC(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, ContainsInstancedReference)
	bool                                         __BoolProperty_171;                                // 0x2ED(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, ContainsInstancedReference)
	bool                                         __BoolProperty_172;                                // 0x2EE(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, ContainsInstancedReference)
	uint8                                        Pad_47DE[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_173;                            // 0x2F0(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, ContainsInstancedReference)
	bool                                         __BoolProperty_174;                                // 0x2F8(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, ContainsInstancedReference)
	uint8                                        Pad_47DF[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_175;                            // 0x300(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor, ContainsInstancedReference)
	class UAnimSequenceBase*                     __AnimSequenceBase_176;                            // 0x308(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_177;                                // 0x310(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_178;                                // 0x311(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_179;                                // 0x312(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_180;                                // 0x313(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_181;                                // 0x314(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor, ContainsInstancedReference)
	uint8                                        Pad_47E0[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_182;                            // 0x318(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, ContainsInstancedReference)
	class UAnimSequenceBase*                     __AnimSequenceBase_183;                            // 0x320(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_184;                                // 0x328(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_185;                                // 0x329(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor, ContainsInstancedReference)
	uint8                                        Pad_47E1[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_186;                            // 0x330(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_187;                                // 0x338(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_188;                                // 0x339(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_189;                                // 0x33A(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_190;                                // 0x33B(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	uint8                                        Pad_47E2[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     __AnimSequenceBase_191;                            // 0x340(0x8)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, AutoWeak, ContainsInstancedReference)
	bool                                         __BoolProperty_192;                                // 0x348(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, AutoWeak, ContainsInstancedReference)
};

}


