#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x16D55 (0x1709D - 0x348)
// AnimBlueprintGeneratedClass BaseHumanAnimBP.BaseHumanAnimBP_C
class UBaseHumanAnimBP_C : public UAnimInstance
{
public:
	uint8                                        Pad_35DB[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x350(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	struct FAnimBlueprintGeneratedMutableData    __AnimBlueprintMutables;                           // 0x358(0x2FA)(ConstParm, BlueprintVisible, EditFixedSize, Parm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_35DC[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnimSubsystemInstance                AnimBlueprintExtension_Tag;                        // 0x658(0x8)(ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	struct FAnimSubsystemInstance                AnimBlueprintExtension_PropertyAccess;             // 0x660(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimSubsystemInstance_NodeRelevancy  AnimBlueprintExtension_NodeRelevancy;              // 0x668(0xA8)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimSubsystemInstance                AnimBlueprintExtension_BlendSpaceGraph;            // 0x710(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, OutParm, Transient, Config, EditConst, SubobjectReference)
	struct FAnimSubsystemInstance                AnimBlueprintExtension_Base;                       // 0x718(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_47;                   // 0x720(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_191;                   // 0x768(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_57;                 // 0x790(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_46;                   // 0x870(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_45;                   // 0x8B8(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_90;                  // 0x900(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_26;                             // 0x948(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_25;                             // 0x990(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_89;                  // 0x9D8(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_56;                 // 0xA20(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_88;                  // 0xB00(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_44;                   // 0xB48(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_9;                        // 0xB90(0x1A0)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_87;                  // 0xD30(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_61;                   // 0xD78(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_8;                        // 0xE80(0x1A0)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7;             // 0x1020(0x20)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_7;                        // 0x1040(0x1A0)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;             // 0x11E0(0x20)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_6;                        // 0x1200(0x1A0)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_5;                        // 0x13A0(0x1A0)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_43;                   // 0x1540(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_42;                   // 0x1588(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_24;                             // 0x15D0(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_86;                  // 0x1618(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_60;                   // 0x1660(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_190;                   // 0x1768(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_85;                  // 0x1790(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_3;          // 0x17D8(0x118)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_189;                   // 0x18F0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_59;                   // 0x1918(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_188;                   // 0x1A20(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_84;                  // 0x1A48(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_1;                    // 0x1A90(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_41;                   // 0x1AD8(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_40;                   // 0x1B20(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_39;                   // 0x1B68(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_4;                        // 0x1BB0(0x1A0)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0x1D50(0x20)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0x1D70(0x20)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_38;                   // 0x1D90(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_187;                   // 0x1DD8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_83;                  // 0x1E00(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_8;                     // 0x1E48(0xC8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_82;                  // 0x1F10(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_58;                   // 0x1F58(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_37;                   // 0x2060(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_186;                   // 0x20A8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_185;                   // 0x20D0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_81;                  // 0x20F8(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_184;                   // 0x2140(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_183;                   // 0x2168(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_80;                  // 0x2190(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_36;                   // 0x21D8(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_2;          // 0x2220(0x118)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_35;                   // 0x2338(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_79;                  // 0x2380(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_182;                   // 0x23C8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_7;                     // 0x23F0(0xC8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_34;                   // 0x24B8(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_78;                  // 0x2500(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_57;                   // 0x2548(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_181;                   // 0x2650(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_180;                   // 0x2678(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_56;                   // 0x26A0(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_179;                   // 0x27A8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_178;                   // 0x27D0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_23;                             // 0x27F8(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_55;                 // 0x2840(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_54;                 // 0x2920(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_77;                  // 0x2A00(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_33;                   // 0x2A48(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_76;                  // 0x2A90(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_55;                   // 0x2AD8(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_177;                   // 0x2BE0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_53;                 // 0x2C08(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_176;                   // 0x2CE8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_54;                   // 0x2D10(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_175;                   // 0x2E18(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_174;                   // 0x2E40(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_75;                  // 0x2E68(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_52;                 // 0x2EB0(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_173;                   // 0x2F90(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_32;                   // 0x2FB8(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_74;                  // 0x3000(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_73;                  // 0x3048(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, AutoWeak)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_51;                 // 0x3090(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_72;                  // 0x3170(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_172;                   // 0x31B8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_171;                   // 0x31E0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_170;                   // 0x3208(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_50;                 // 0x3230(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_71;                  // 0x3310(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_31;                   // 0x3358(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_49;                 // 0x33A0(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_169;                   // 0x3480(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_168;                   // 0x34A8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_53;                   // 0x34D0(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_167;                   // 0x35D8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_6;                     // 0x3600(0xC8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_70;                  // 0x36C8(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_52;                   // 0x3710(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_4;                  // 0x3818(0x70)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_3;                  // 0x3888(0x70)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_69;                  // 0x38F8(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_68;                  // 0x3940(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_166;                   // 0x3988(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_165;                   // 0x39B0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_164;                   // 0x39D8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_48;                 // 0x3A00(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_67;                  // 0x3AE0(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_30;                   // 0x3B28(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_163;                   // 0x3B70(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, ContainsInstancedReference)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_22;                             // 0x3B98(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_162;                   // 0x3BE0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_47;                 // 0x3C08(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_66;                  // 0x3CE8(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_161;                   // 0x3D30(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, ContainsInstancedReference)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_2;                  // 0x3D58(0x70)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_65;                  // 0x3DC8(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, AutoWeak)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt;                      // 0x3E10(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_29;                   // 0x3E58(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_28;                   // 0x3EA0(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_64;                  // 0x3EE8(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_160;                   // 0x3F30(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_159;                   // 0x3F58(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_158;                   // 0x3F80(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_46;                 // 0x3FA8(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_63;                  // 0x4088(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, AutoWeak)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_21;                             // 0x40D0(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_62;                  // 0x4118(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_1;                  // 0x4160(0x70)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_Inertialization             AnimGraphNode_Inertialization;                     // 0x41D0(0x100)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_157;                   // 0x42D0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_27;                   // 0x42F8(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_51;                   // 0x4340(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_61;                  // 0x4448(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_26;                   // 0x4490(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_60;                  // 0x44D8(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_156;                   // 0x4520(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_45;                 // 0x4548(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_155;                   // 0x4628(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_20;                 // 0x4650(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_19;                 // 0x4678(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_18;                 // 0x46A0(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17;                 // 0x46C8(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_16;                 // 0x46F0(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_154;                   // 0x4718(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_18;                      // 0x4740(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_7;            // 0x4760(0xD0)(Edit, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_38;                // 0x4830(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_37;                // 0x4870(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_6;               // 0x48B0(0x38)(BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_153;                   // 0x48E8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_36;                // 0x4910(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_44;                 // 0x4950(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_152;                   // 0x4A30(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_17;                      // 0x4A58(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x4A78(0x20)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	uint8                                        Pad_35E4[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_3;                        // 0x4AA0(0x1A0)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x4C40(0x20)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_15;                 // 0x4C60(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_14;                 // 0x4C88(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_13;                 // 0x4CB0(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12;                 // 0x4CD8(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_15;                       // 0x4D00(0x470)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_59;                  // 0x5170(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_25;                   // 0x51B8(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_24;                   // 0x5200(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_16;                      // 0x5248(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_14;                       // 0x5268(0x470)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_58;                  // 0x56D8(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_23;                   // 0x5720(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_22;                   // 0x5768(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_15;                      // 0x57B0(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_13;                       // 0x57D0(0x470)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_21;                   // 0x5C40(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_57;                  // 0x5C88(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_20;                   // 0x5CD0(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_14;                      // 0x5D18(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_12;                       // 0x5D38(0x470)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_19;                   // 0x61A8(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_56;                  // 0x61F0(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_18;                   // 0x6238(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_55;                  // 0x6280(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_17;                   // 0x62C8(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_13;                      // 0x6310(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_4;                      // 0x6330(0xC8)(ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_35;                // 0x63F8(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_4;            // 0x6438(0x20)(BlueprintVisible, BlueprintReadOnly, Parm, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_34;                // 0x6458(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_3;            // 0x6498(0x20)(BlueprintVisible, BlueprintReadOnly, Parm, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_33;                // 0x64B8(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_2;            // 0x64F8(0x20)(BlueprintVisible, BlueprintReadOnly, Parm, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_32;                // 0x6518(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_1;            // 0x6558(0x20)(BlueprintVisible, BlueprintReadOnly, Parm, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_31;                // 0x6578(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult;              // 0x65B8(0x20)(BlueprintVisible, BlueprintReadOnly, Parm, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_BlendSpaceGraph             AnimGraphNode_BlendSpaceGraph;                     // 0x65D8(0x68)(ConstParm, ExportObject, Net, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_6;            // 0x6640(0xD0)(Edit, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_151;                   // 0x6710(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x6738(0x20)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_43;                 // 0x6758(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_StrideWarping               AnimGraphNode_StrideWarping_1;                     // 0x6838(0x248)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x6A80(0x20)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_2;                        // 0x6AA0(0x1A0)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_12;                      // 0x6C40(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_3;                      // 0x6C60(0xC8)(ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_150;                   // 0x6D28(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_50;                   // 0x6D50(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_49;                   // 0x6E58(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_149;                   // 0x6F60(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_148;                   // 0x6F88(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph;                     // 0x6FB0(0xB8)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_54;                  // 0x7068(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_48;                   // 0x70B0(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_147;                   // 0x71B8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_146;                   // 0x71E0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_42;                 // 0x7208(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_20;                             // 0x72E8(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_53;                  // 0x7330(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_52;                  // 0x7378(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_41;                 // 0x73C0(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_40;                 // 0x74A0(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_145;                   // 0x7580(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x75A8(0x20)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_144;                   // 0x75C8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_16;                   // 0x75F0(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor)
	uint8                                        Pad_35E8[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_1;                        // 0x7640(0x1A0)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_39;                 // 0x77E0(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_143;                   // 0x78C0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_47;                   // 0x78E8(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_142;                   // 0x79F0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_51;                  // 0x7A18(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_15;                   // 0x7A60(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_141;                   // 0x7AA8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_46;                   // 0x7AD0(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_50;                  // 0x7BD8(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_45;                   // 0x7C20(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_19;                             // 0x7D28(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_140;                   // 0x7D70(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_139;                   // 0x7D98(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_38;                 // 0x7DC0(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_37;                 // 0x7EA0(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_18;                             // 0x7F80(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_49;                  // 0x7FC8(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_17;                             // 0x8010(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_138;                   // 0x8058(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_137;                   // 0x8080(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_36;                 // 0x80A8(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_48;                  // 0x8188(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_136;                   // 0x81D0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_135;                   // 0x81F8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_47;                  // 0x8220(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_134;                   // 0x8268(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, ContainsInstancedReference)
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_1;          // 0x8290(0x118)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_133;                   // 0x83A8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_46;                  // 0x83D0(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_16;                             // 0x8418(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_15;                             // 0x8460(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_44;                   // 0x84A8(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_45;                  // 0x85B0(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_132;                   // 0x85F8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_131;                   // 0x8620(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, ContainsInstancedReference)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_14;                             // 0x8648(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_130;                   // 0x8690(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_44;                  // 0x86B8(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_43;                   // 0x8700(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_35;                 // 0x8808(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_34;                 // 0x88E8(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_5;            // 0x89C8(0xD0)(Edit, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_129;                   // 0x8A98(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, ContainsInstancedReference)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_17;                      // 0x8AC0(0xC8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_42;                   // 0x8B88(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_128;                   // 0x8C90(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_33;                 // 0x8CB8(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_30;                // 0x8D98(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_41;                   // 0x8DD8(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_13;                             // 0x8EE0(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_16;                      // 0x8F28(0xC8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_127;                   // 0x8FF0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_32;                 // 0x9018(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_15;                      // 0x90F8(0xC8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_126;                   // 0x91C0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_31;                 // 0x91E8(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_14;                      // 0x92C8(0xC8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_125;                   // 0x9390(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_30;                 // 0x93B8(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_13;                      // 0x9498(0xC8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_124;                   // 0x9560(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_123;                   // 0x9588(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_5;                     // 0x95B0(0xC8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_29;                 // 0x9678(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_12;                      // 0x9758(0xC8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_122;                   // 0x9820(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_121;                   // 0x9848(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_4;                     // 0x9870(0xC8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_28;                 // 0x9938(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_40;                   // 0x9A18(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_120;                   // 0x9B20(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_119;                   // 0x9B48(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_39;                   // 0x9B70(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_118;                   // 0x9C78(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_117;                   // 0x9CA0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_116;                   // 0x9CC8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_4;            // 0x9CF0(0xD0)(Edit, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_115;                   // 0x9DC0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_3;            // 0x9DE8(0xD0)(Edit, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_38;                   // 0x9EB8(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_114;                   // 0x9FC0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_43;                  // 0x9FE8(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_37;                   // 0xA030(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_113;                   // 0xA138(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_112;                   // 0xA160(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_36;                   // 0xA188(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_111;                   // 0xA290(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_35;                   // 0xA2B8(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_42;                  // 0xA3C0(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_110;                   // 0xA408(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_34;                   // 0xA430(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_109;                   // 0xA538(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_29;                // 0xA560(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_41;                  // 0xA5A0(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_27;                 // 0xA5E8(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_108;                   // 0xA6C8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_40;                  // 0xA6F0(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_26;                 // 0xA738(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_107;                   // 0xA818(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_39;                  // 0xA840(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_33;                   // 0xA888(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_106;                   // 0xA990(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_105;                   // 0xA9B8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_32;                   // 0xA9E0(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_104;                   // 0xAAE8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_103;                   // 0xAB10(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_102;                   // 0xAB38(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, AutoWeak)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_3;                     // 0xAB60(0xC8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_28;                // 0xAC28(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_25;                 // 0xAC68(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_14;                   // 0xAD48(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_38;                  // 0xAD90(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_31;                   // 0xADD8(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_101;                   // 0xAEE0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, AutoWeak)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_24;                 // 0xAF08(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_13;                   // 0xAFE8(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_37;                  // 0xB030(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_23;                 // 0xB078(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_12;                   // 0xB158(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_36;                  // 0xB1A0(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_100;                   // 0xB1E8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_99;                    // 0xB210(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_11;                   // 0xB238(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_98;                    // 0xB280(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, AutoWeak)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_12;                             // 0xB2A8(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_35;                  // 0xB2F0(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_30;                   // 0xB338(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_29;                   // 0xB440(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_34;                  // 0xB548(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_97;                    // 0xB590(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_96;                    // 0xB5B8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_28;                   // 0xB5E0(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_95;                    // 0xB6E8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, AutoWeak)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_11;                      // 0xB710(0xC8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_94;                    // 0xB7D8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_10;                      // 0xB800(0xC8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_22;                 // 0xB8C8(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_93;                    // 0xB9A8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_21;                 // 0xB9D0(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_92;                    // 0xBAB0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_91;                    // 0xBAD8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_33;                  // 0xBB00(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_90;                    // 0xBB48(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_20;                 // 0xBB70(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_89;                    // 0xBC50(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_88;                    // 0xBC78(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_5;               // 0xBCA0(0x38)(BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_27;                   // 0xBCD8(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_87;                    // 0xBDE0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_86;                    // 0xBE08(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_4;               // 0xBE30(0x38)(BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_85;                    // 0xBE68(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_84;                    // 0xBE90(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_19;                 // 0xBEB8(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_18;                 // 0xBF98(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_2;            // 0xC078(0xD0)(Edit, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_9;                       // 0xC148(0xC8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_17;                 // 0xC210(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_1;                   // 0xC2F0(0x48)(ConstParm, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_26;                   // 0xC338(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_83;                    // 0xC440(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_82;                    // 0xC468(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_81;                    // 0xC490(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_80;                    // 0xC4B8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor, AutoWeak)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_8;                       // 0xC4E0(0xC8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_16;                 // 0xC5A8(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_7;                       // 0xC688(0xC8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_15;                 // 0xC750(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_6;                       // 0xC830(0xC8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_14;                 // 0xC8F8(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_5;                       // 0xC9D8(0xC8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_2;                     // 0xCAA0(0xC8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_13;                 // 0xCB68(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_4;                       // 0xCC48(0xC8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_1;                     // 0xCD10(0xC8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_12;                 // 0xCDD8(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0xCEB8(0xD0)(Edit, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive;              // 0xCF88(0xD0)(Edit, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_79;                    // 0xD058(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_32;                  // 0xD080(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_78;                    // 0xD0C8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_11;                             // 0xD0F0(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_31;                  // 0xD138(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_77;                    // 0xD180(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_25;                   // 0xD1A8(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_10;                             // 0xD2B0(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_76;                    // 0xD2F8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_75;                    // 0xD320(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_11;                 // 0xD348(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_30;                  // 0xD428(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_10;                 // 0xD470(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_29;                  // 0xD550(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_27;                // 0xD598(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive;                       // 0xD5D8(0xC8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_28;                  // 0xD6A0(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_26;                // 0xD6E8(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_27;                  // 0xD728(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_25;                // 0xD770(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_BlendSpaceEvaluator         AnimGraphNode_BlendSpaceEvaluator;                 // 0xD7B0(0x78)(ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_24;                   // 0xD828(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_74;                    // 0xD930(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_73;                    // 0xD958(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_26;                  // 0xD980(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace;            // 0xD9C8(0x118)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_25;                  // 0xDAE0(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_24;                  // 0xDB28(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_24;                // 0xDB70(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11;                 // 0xDBB0(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_10;                 // 0xDBD8(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9;                  // 0xDC00(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8;                  // 0xDC28(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_23;                // 0xDC50(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_22;                // 0xDC90(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_23;                  // 0xDCD0(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_11;                      // 0xDD18(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_21;                // 0xDD38(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_20;                // 0xDD78(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_22;                  // 0xDDB8(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_10;                      // 0xDE00(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_19;                // 0xDE20(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_18;                // 0xDE60(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_21;                  // 0xDEA0(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9;                       // 0xDEE8(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_17;                // 0xDF08(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_16;                // 0xDF48(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_15;                // 0xDF88(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_20;                  // 0xDFC8(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_19;                  // 0xE010(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8;                       // 0xE058(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_2;                      // 0xE078(0xC8)(ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_18;                  // 0xE140(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_14;                // 0xE188(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_23;                   // 0xE1C8(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_13;                // 0xE2D0(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_17;                  // 0xE310(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_12;                // 0xE358(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_22;                   // 0xE398(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_72;                    // 0xE4A0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_71;                    // 0xE4C8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_16;                  // 0xE4F0(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_15;                  // 0xE538(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_11;                // 0xE580(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_10;                // 0xE5C0(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_14;                  // 0xE600(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_9;                 // 0xE648(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_13;                  // 0xE688(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_8;                 // 0xE6D0(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_12;                  // 0xE710(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_7;                 // 0xE758(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_70;                    // 0xE798(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_69;                    // 0xE7C0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_68;                    // 0xE7E8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_67;                    // 0xE810(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_66;                    // 0xE838(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_65;                    // 0xE860(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_21;                   // 0xE888(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_20;                   // 0xE990(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_19;                   // 0xEA98(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_64;                    // 0xEBA0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_63;                    // 0xEBC8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_62;                    // 0xEBF0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_61;                    // 0xEC18(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_60;                    // 0xEC40(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_59;                    // 0xEC68(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_58;                    // 0xEC90(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_11;                  // 0xECB8(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_57;                    // 0xED00(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_18;                   // 0xED28(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_56;                    // 0xEE30(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_55;                    // 0xEE58(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_17;                   // 0xEE80(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_54;                    // 0xEF88(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_53;                    // 0xEFB0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_52;                    // 0xEFD8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_51;                    // 0xF000(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_50;                    // 0xF028(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_49;                    // 0xF050(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_48;                    // 0xF078(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_47;                    // 0xF0A0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_46;                    // 0xF0C8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_45;                    // 0xF0F0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_44;                    // 0xF118(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_43;                    // 0xF140(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_42;                    // 0xF168(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_41;                    // 0xF190(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_16;                   // 0xF1B8(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_15;                   // 0xF2C0(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_14;                   // 0xF3C8(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_13;                   // 0xF4D0(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_12;                   // 0xF5D8(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_11;                   // 0xF6E0(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_40;                    // 0xF7E8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_39;                    // 0xF810(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_38;                    // 0xF838(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_37;                    // 0xF860(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_36;                    // 0xF888(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_35;                    // 0xF8B0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_10;                   // 0xF8D8(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_34;                    // 0xF9E0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_33;                    // 0xFA08(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_32;                    // 0xFA30(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_31;                    // 0xFA58(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_9;                    // 0xFA80(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_30;                    // 0xFB88(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_29;                    // 0xFBB0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_28;                    // 0xFBD8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_27;                    // 0xFC00(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_3;               // 0xFC28(0x38)(BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_26;                    // 0xFC60(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_2;               // 0xFC88(0x38)(BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_25;                    // 0xFCC0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_24;                    // 0xFCE8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_23;                    // 0xFD10(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_1;               // 0xFD38(0x38)(BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_22;                    // 0xFD70(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_21;                    // 0xFD98(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_8;                    // 0xFDC0(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_20;                    // 0xFEC8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_19;                    // 0xFEF0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive;                 // 0xFF18(0x38)(BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_9;                  // 0xFF50(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_7;                    // 0x10030(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_18;                    // 0x10138(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_17;                    // 0x10160(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_10;                  // 0x10188(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_16;                    // 0x101D0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_11;                       // 0x101F8(0x470)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_9;                              // 0x10668(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_10;                   // 0x106B0(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_15;                    // 0x106F8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_10;                       // 0x10720(0x470)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_14;                    // 0x10B90(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_6;                    // 0x10BB8(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_3;                       // 0x10CC0(0xC8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_13;                    // 0x10D88(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_12;                    // 0x10DB0(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_6;                 // 0x10DD8(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_9;                   // 0x10E18(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_5;                    // 0x10E60(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_11;                    // 0x10F68(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_10;                    // 0x10F90(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_9;                        // 0x10FB8(0x470)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_8;                   // 0x11428(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_8;                              // 0x11470(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	uint8                                        Pad_3618[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone;                          // 0x114C0(0x1A0)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x11660(0x20)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x11680(0x20)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_7;                   // 0x116A0(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_9;                     // 0x116E8(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_7;                              // 0x11710(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_6;                              // 0x11758(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_6;                   // 0x117A0(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_5;                 // 0x117E8(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_4;                 // 0x11828(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5;                   // 0x11868(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_8;                  // 0x118B0(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_8;                     // 0x11990(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_FemaleBoneMods              AnimGraphNode_FemaleBoneMods;                      // 0x119B8(0xD0)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FAnimNode_ApplyBoneMods               AnimGraphNode_ApplyBoneMods;                       // 0x11A88(0xD0)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_8;                        // 0x11B58(0x470)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x11FC8(0x20)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x11FE8(0x20)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_4;                   // 0x12008(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_5;                              // 0x12050(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_4;                              // 0x12098(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_3;                              // 0x120E0(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_2;                              // 0x12128(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_4;                    // 0x12170(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_7;                     // 0x12278(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_7;                  // 0x122A0(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_6;                     // 0x12380(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9;                    // 0x123A8(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_3;                   // 0x123F0(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_StrideWarping               AnimGraphNode_StrideWarping;                       // 0x12438(0x248)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7;                  // 0x12680(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6;                  // 0x126A8(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5;                  // 0x126D0(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4;                  // 0x126F8(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_7;                        // 0x12720(0x470)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8;                    // 0x12B90(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7;                       // 0x12BD8(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_6;                        // 0x12BF8(0x470)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7;                    // 0x13068(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, EditorOnly)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6;                       // 0x130B0(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_5;                        // 0x130D0(0x470)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6;                    // 0x13540(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5;                       // 0x13588(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_4;                        // 0x135A8(0x470)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5;                    // 0x13A18(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4;                       // 0x13A60(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_1;                      // 0x13A80(0xC8)(ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x13B48(0x20)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x13B68(0x20)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3;                  // 0x13B88(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2;                  // 0x13BB0(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1;                  // 0x13BD8(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult;                    // 0x13C00(0x28)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_3;                        // 0x13C28(0x470)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4;                    // 0x14098(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3;                       // 0x140E0(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_2;                        // 0x14100(0x470)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3;                    // 0x14570(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2;                       // 0x145B8(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_1;                        // 0x145D8(0x470)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0x14A48(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1;                       // 0x14A90(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig;                          // 0x14AB0(0x470)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x14F20(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult;                         // 0x14F68(0x20)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine;                        // 0x14F88(0xC8)(ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_5;                     // 0x15050(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_2;                       // 0x15078(0xC8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_6;                  // 0x15140(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_1;                              // 0x15220(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_3;                 // 0x15268(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_2;                   // 0x152A8(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_2;                 // 0x152F0(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_3;                    // 0x15330(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum;                     // 0x15438(0x48)(ConstParm, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_2;                    // 0x15480(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x15588(0x48)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x155D0(0x20)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_1;                 // 0x155F0(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_5;                  // 0x15630(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_4;                     // 0x15710(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer;                    // 0x15738(0x70)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_1;                    // 0x157A8(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator;                   // 0x158B0(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x158F0(0x20)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1;                   // 0x15910(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_4;                  // 0x15958(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_3;                  // 0x15A38(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_3;                     // 0x15B18(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2;                     // 0x15B40(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose;                      // 0x15B68(0x108)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_2;                  // 0x15C70(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_1;                       // 0x15D50(0xC8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend;                         // 0x15E18(0xC8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_Slot                        AnimGraphNode_Slot;                                // 0x15EE0(0x48)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_1;                  // 0x15F28(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend;                    // 0x16008(0xE0)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool;                     // 0x160E8(0x48)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_1;                     // 0x16130(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose;                       // 0x16158(0x28)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               K2Node_PropertyAccess_102;                         // 0x16180(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, AutoWeak)
	struct FVector                               K2Node_PropertyAccess_101;                         // 0x16198(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, Interp, NonTransactional, AutoWeak)
	struct FRotator                              K2Node_PropertyAccess_100;                         // 0x161B0(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, AutoWeak)
	bool                                         K2Node_PropertyAccess_99;                          // 0x161C8(0x1)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, NonTransactional, AutoWeak)
	uint8                                        Pad_3627[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              K2Node_PropertyAccess_95;                          // 0x161D0(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, AutoWeak)
	struct FRotator                              K2Node_PropertyAccess_93;                          // 0x161E8(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FRotator                              K2Node_PropertyAccess_92;                          // 0x16200(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FVector                               K2Node_PropertyAccess_91;                          // 0x16218(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FVector                               K2Node_PropertyAccess_87;                          // 0x16230(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor, AutoWeak)
	float                                        K2Node_PropertyAccess_86;                          // 0x16248(0x4)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, AutoWeak)
	uint8                                        Pad_3629[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               K2Node_PropertyAccess_83;                          // 0x16250(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor, AutoWeak)
	float                                        K2Node_PropertyAccess_82;                          // 0x16268(0x4)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor, AutoWeak)
	uint8                                        Pad_362A[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               K2Node_PropertyAccess_81;                          // 0x16270(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, Interp, NoDestructor, AutoWeak)
	float                                        K2Node_PropertyAccess_78;                          // 0x16288(0x4)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, AutoWeak)
	float                                        K2Node_PropertyAccess_77;                          // 0x1628C(0x4)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, AutoWeak)
	float                                        K2Node_PropertyAccess_76;                          // 0x16290(0x4)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, AutoWeak)
	float                                        K2Node_PropertyAccess_75;                          // 0x16294(0x4)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, AutoWeak)
	bool                                         K2Node_PropertyAccess_74;                          // 0x16298(0x1)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, AutoWeak)
	uint8                                        Pad_362B[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               K2Node_PropertyAccess_73;                          // 0x162A0(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, Interp, EditorOnly, AutoWeak)
	struct FVector                               K2Node_PropertyAccess_70;                          // 0x162B8(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, AutoWeak)
	struct FRotator                              K2Node_PropertyAccess_66;                          // 0x162D0(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, Interp, AutoWeak)
	struct FVector                               K2Node_PropertyAccess_65;                          // 0x162E8(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, Interp, AutoWeak)
	struct FVector                               K2Node_PropertyAccess_56;                          // 0x16300(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FVector                               K2Node_PropertyAccess_55;                          // 0x16318(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor)
	struct FVector                               K2Node_PropertyAccess_49;                          // 0x16330(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, Interp, NoDestructor)
	struct FRotator                              K2Node_PropertyAccess_48;                          // 0x16348(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, NoDestructor)
	struct FVector                               K2Node_PropertyAccess_47;                          // 0x16360(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, NoDestructor)
	struct FRotator                              K2Node_PropertyAccess_46;                          // 0x16378(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	double                                       __CustomProperty_HipAngle_C4F6799A428B86C4183E2FBB04A6E8AC; // 0x16390(0x8)(BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, EditConst, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_C4F6799A428B86C4183E2FBB04A6E8AC; // 0x16398(0x8)(Edit, ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_HipAngle_0659CDFE474FD2CD14B4FD8BF1532DF0; // 0x163A0(0x8)(ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_0659CDFE474FD2CD14B4FD8BF1532DF0; // 0x163A8(0x8)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_HipAngle_775203BB416EF5C5238B0BAFEF3D3DCC; // 0x163B0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_775203BB416EF5C5238B0BAFEF3D3DCC; // 0x163B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_HipAngle_F3F0D3E847FBB0FDA81E8099FF828805; // 0x163C0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ReturnParm, EditConst, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_F3F0D3E847FBB0FDA81E8099FF828805; // 0x163C8(0x8)(Edit, ConstParm, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_HipAngle_B21456A04469CE6DECF1C48940607C9C; // 0x163D0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_B21456A04469CE6DECF1C48940607C9C; // 0x163D8(0x8)(Edit, BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_HipAngle_06E2E76548C765535F8C9589B6071D8F; // 0x163E0(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_06E2E76548C765535F8C9589B6071D8F; // 0x163E8(0x8)(ExportObject, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_HipAngle_4AB80AF84C324CF4BF3301B92F225991; // 0x163F0(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_4AB80AF84C324CF4BF3301B92F225991; // 0x163F8(0x8)(Edit, ConstParm, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_HipAngle_6E88A4124AE7142ECA6F7397331A880E; // 0x16400(0x8)(ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_6E88A4124AE7142ECA6F7397331A880E; // 0x16408(0x8)(BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_HipAngle_B69F6BB544A6806C3088E5BFB64F7A08; // 0x16410(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_B69F6BB544A6806C3088E5BFB64F7A08; // 0x16418(0x8)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, EditConst, SubobjectReference)
	double                                       __CustomProperty_HipAngle_AA444B68423B6FAF1AB55D9935BBFB55; // 0x16420(0x8)(Edit, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_AA444B68423B6FAF1AB55D9935BBFB55; // 0x16428(0x8)(Edit, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_HipAngle_B4400A394EF19973C454AEAF11CE8E03; // 0x16430(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_B4400A394EF19973C454AEAF11CE8E03; // 0x16438(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_HipAngle_9A6E719A4DA109EAF40589801BC190EB; // 0x16440(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_9A6E719A4DA109EAF40589801BC190EB; // 0x16448(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	double                                       __CustomProperty_HipAngle_C7E17EE541AAC42CCFCED4B04D22AE09; // 0x16450(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_C7E17EE541AAC42CCFCED4B04D22AE09; // 0x16458(0x8)(BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_BoneModifier_Shoulders_45D08A224EC0F34C3819F595C9C6E59E; // 0x16460(0x8)(BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_BoneModifier_TorsoSize_45D08A224EC0F34C3819F595C9C6E59E; // 0x16468(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	double                                       __CustomProperty_BoneModifier_ArmLength_45D08A224EC0F34C3819F595C9C6E59E; // 0x16470(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               __CustomProperty_WeaponPositionOffset_45D08A224EC0F34C3819F595C9C6E59E; // 0x16478(0x18)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_LeftHandIKAlpha_45D08A224EC0F34C3819F595C9C6E59E; // 0x16490(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         __CustomProperty_IsFemale_45D08A224EC0F34C3819F595C9C6E59E; // 0x16498(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_362E[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __CustomProperty_RightHandIKAlpha_45D08A224EC0F34C3819F595C9C6E59E; // 0x1649C(0x4)(Edit, EditFixedSize, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_HipAngle_739E073549A191D653087ABB9395AD2E; // 0x164A0(0x8)(Edit, ConstParm, Net, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_739E073549A191D653087ABB9395AD2E; // 0x164A8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         __CustomProperty_bUpdateInstantly_70F814824E1F2517DC3C5C9DBE08009C; // 0x164B0(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         __CustomProperty_bIsLocallyControlled_70F814824E1F2517DC3C5C9DBE08009C; // 0x164B1(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, EditConst, SubobjectReference)
	bool                                         __CustomProperty_bIsOnDino_70F814824E1F2517DC3C5C9DBE08009C; // 0x164B2(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3631[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       __CustomProperty_SpeedRemapped_70F814824E1F2517DC3C5C9DBE08009C; // 0x164B8(0x8)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         __CustomProperty_bProne_70F814824E1F2517DC3C5C9DBE08009C; // 0x164C0(0x1)(ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3632[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       __CustomProperty_Bone_Modifiers_Leg_Length_Percentage_70F814824E1F2517DC3C5C9DBE08009C; // 0x164C8(0x8)(ConstParm, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       __CustomProperty_TraceDistanceFactorBelow_70F814824E1F2517DC3C5C9DBE08009C; // 0x164D0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_TraceDistanceFactorAbove_70F814824E1F2517DC3C5C9DBE08009C; // 0x164D8(0x8)(Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_LegLengthHipZOffset_70F814824E1F2517DC3C5C9DBE08009C; // 0x164E0(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               __CustomProperty_SmoothedLocation_70F814824E1F2517DC3C5C9DBE08009C; // 0x164E8(0x18)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	struct FVector                               __CustomProperty_FPVShadowMeshOffset_70F814824E1F2517DC3C5C9DBE08009C; // 0x16500(0x18)(ConstParm, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         __CustomProperty_bCrouched_70F814824E1F2517DC3C5C9DBE08009C; // 0x16518(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3633[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               __CustomProperty_R_WeaponShift_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x16520(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               __CustomProperty_L_WeaponShift_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x16538(0x18)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_BoneModifier_Shoulders_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x16550(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_BoneModifier_TorsoSize_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x16558(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       __CustomProperty_BoneModifier_ArmLength_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x16560(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               __CustomProperty_WeaponPositionOffset_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x16568(0x18)(ConstParm, BlueprintReadOnly, Parm, Transient, Config, EditConst, SubobjectReference)
	double                                       __CustomProperty_LeftHandIKAlpha_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x16580(0x8)(ConstParm, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         __CustomProperty_IsFemale_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x16588(0x1)(ExportObject, Net, Parm, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	uint8                                        Pad_3635[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __CustomProperty_RightHandIKAlpha_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x1658C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class UAnimInstance*                         __CustomProperty_AnimInstance_7EA4D54440723237DAFC2E8D1560D608; // 0x16590(0x8)(ConstParm, ExportObject, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        PhysicsMode;                                       // 0x16598(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, Transient, Config, EditConst, SubobjectReference)
	bool                                         bSprinting;                                        // 0x16599(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         bPlaySprintingAnim;                                // 0x1659A(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         bMoving;                                           // 0x1659B(0x1)(Edit, BlueprintVisible, ExportObject, Net, Parm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         bWalking;                                          // 0x1659C(0x1)(Edit, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3636[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Direction;                                         // 0x165A0(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	double                                       AimPitch;                                          // 0x165A8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       AimYaw;                                            // 0x165B0(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       RightLeft;                                         // 0x165B8(0x8)(Edit, BlueprintReadOnly, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       ForwardBack;                                       // 0x165C0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FRotator                              RootRotOffset;                                     // 0x165C8(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	bool                                         bTurning;                                          // 0x165E0(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_3637[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       TurnSpeed;                                         // 0x165E8(0x8)(ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         bCrouched;                                         // 0x165F0(0x1)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         bProne;                                            // 0x165F1(0x1)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3638[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RootLocOffset;                                     // 0x165F8(0x18)(Edit, BlueprintVisible, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	double                                       MovementAnimRate;                                  // 0x16610(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsRiding;                                         // 0x16618(0x1)(Net, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_363B[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequence*                         RidingAnimSeq;                                     // 0x16620(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	class UAnimSequence*                         RidingMoveAnimSeq;                                 // 0x16628(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       RidingDinoSpeedRatio;                              // 0x16630(0x8)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         bRidingIsDinoMoving;                               // 0x16638(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         bBlinking;                                         // 0x16639(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_363C[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LastTimeSwimmingDouble;                            // 0x16640(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         bIsCarried;                                        // 0x16648(0x1)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseAlternateAimOffset;                            // 0x16649(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, InstancedReference, SubobjectReference)
	uint8                                        Pad_363D[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       AimOffsetYawSpeed;                                 // 0x16650(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         bIsClimbing;                                       // 0x16658(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, GlobalConfig, InstancedReference, SubobjectReference)
	uint8                                        Pad_363F[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        ClimbingInt;                                       // 0x1665C(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       MovementSpeedFastPower;                            // 0x16660(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       MovementSpeedFastStartPowerRatio;                  // 0x16668(0x8)(ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       CurrentAimPitchBlend;                              // 0x16670(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         bUseTargetingAnim;                                 // 0x16678(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         bIsTargeting;                                      // 0x16679(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, InstancedReference, SubobjectReference)
	bool                                         bDisableAimInProne;                                // 0x1667A(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         bUseBallistaAimOffset;                             // 0x1667B(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, GlobalConfig, InstancedReference, SubobjectReference)
	uint8                                        Pad_3641[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       BallistaYaw;                                       // 0x16680(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               LastLadderLocation;                                // 0x16688(0x18)(ConstParm, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	class UAnimSequence*                         AlternateStandingAnimSeq;                          // 0x166A0(0x8)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         bUseAlternateStandingAnim;                         // 0x166A8(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3644[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequence*                         AdditiveStandingAnimSeq;                           // 0x166B0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       AdditiveLoopAnimWeight;                            // 0x166B8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         bUseAdditiveStandingAnim;                          // 0x166C0(0x1)(Edit, ConstParm, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3645[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       AdditiveStandingBlendIn;                           // 0x166C8(0x8)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       AdditiveStandingBlendOut;                          // 0x166D0(0x8)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       AlternateStandingBlendIn;                          // 0x166D8(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       AlternateStandingBlendOut;                         // 0x166E0(0x8)(Edit, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         bIsCarriedAsPassenger;                             // 0x166E8(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_3647[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       AimOffsetAlpha;                                    // 0x166F0(0x8)(BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         bIsGliding;                                        // 0x166F8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3648[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequence*                         GlidingAnimSeq;                                    // 0x16700(0x8)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         bUsingMountedWeapon;                               // 0x16708(0x1)(BlueprintVisible, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         bCharacterAdditiveAnimationIsNonAdditive;          // 0x16709(0x1)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         bUseAltBlendSpace_Falling;                         // 0x1670A(0x1)(ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         bUseAltBlendSpace_Swimming;                        // 0x1670B(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, SubobjectReference)
	bool                                         bHasFistsEquipped;                                 // 0x1670C(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         HasValidClimbingTarget;                            // 0x1670D(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_364A[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       ClimbingFallingLeftRight;                          // 0x16710(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, Transient, Config, EditConst, SubobjectReference)
	double                                       ClimbingFallingForwardBack;                        // 0x16718(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	bool                                         bIsUsingGliderSuit;                                // 0x16720(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         bIsUsingGliderSuit_Diving;                         // 0x16721(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_364D[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GliderSuit_LeftRight;                              // 0x16728(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       GliderSuit_UpDown;                                 // 0x16730(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       RequiredGlidingRotaitonDeltaToPlayTurnAnims;       // 0x16738(0x8)(Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	double                                       GliderSuitTurnInterpSpeed;                         // 0x16740(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FRotator                              GliderSuit_RemoteClientDesiredRotation;            // 0x16748(0x18)(Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         bClimbingPickDefaultBackToFallingBlends;           // 0x16760(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, EditConst, SubobjectReference)
	uint8                                        Pad_364F[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            NewEventDispatcher;                                // 0x16768(0x10)(ConstParm, ExportObject, Parm, Transient, Config, EditConst, SubobjectReference)
	class UBlendSpace*                           OverrideBlendSpace;                                // 0x16778(0x8)(BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class APrimalCharacter*                      PrimalChar;                                        // 0x16780(0x8)(ConstParm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	int32                                        IdleAnimIndex;                                     // 0x16788(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        DirectionReverse;                                  // 0x1678C(0x4)(BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	float                                        DirectionAngle;                                    // 0x16790(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        DirectionJumpAngle;                                // 0x16794(0x4)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	float                                        DirectionJumpAngleHalf;                            // 0x16798(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         WasMovingLastUpdate;                               // 0x1679C(0x1)(Edit, ConstParm, BlueprintVisible, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3651[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Cardinal_Direction_Dead_Zone;                      // 0x167A0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, Transient, Config, EditConst, SubobjectReference)
	struct FRotator                              ActorWorldRotation;                                // 0x167A8(0x18)(ConstParm, ExportObject, Net, Parm, ReturnParm, EditConst, SubobjectReference)
	struct FVector                               ActorVelocity;                                     // 0x167C0(0x18)(ConstParm, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	enum class E_CardinalDirection4              CurrentCardinalDirectionNoOffset;                  // 0x167D8(0x1)(ConstParm, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3652[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnimStruct_CardinalDirection4        MoveCardinalAnims;                                 // 0x167E0(0x20)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       DirectionAngleWithCardinalOffset;                  // 0x16800(0x8)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               LocalVelocity;                                     // 0x16808(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, EditConst, SubobjectReference)
	struct FVector                               Direction2D;                                       // 0x16820(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       MovementStrideScale;                               // 0x16838(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       MovementWithStrideWarpPlayRate;                    // 0x16840(0x8)(Edit, ExportObject, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       StrideWarpingRatio;                                // 0x16848(0x8)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	struct FAnimStruct_CardinalDirection4        WalkCardinalAnims;                                 // 0x16850(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class UAnimSequence*                         SprintFwdAnim;                                     // 0x16870(0x8)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       MinSprintSpeed;                                    // 0x16878(0x8)(ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       LeftHandIKAlpha;                                   // 0x16880(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	double                                       LastAimYawOffset;                                  // 0x16888(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       ScreenRightSide_AimingLeft_AimYawOffset;           // 0x16890(0x8)(BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       ScreenRightSide_AimingRight_AimYawOffset;          // 0x16898(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       ScreenRightSide_AimingLeft_AimYawFactor;           // 0x168A0(0x8)(EditFixedSize, EditConst, SubobjectReference)
	double                                       ScreenRightSide_AimingRight_AimYawFactor;          // 0x168A8(0x8)(ConstParm, BlueprintReadOnly, Net, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       ScreenLeftSide_AimingLeft_AimYawFactor;            // 0x168B0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       ScreenLeftSide_AimingRight_AimYawFactor;           // 0x168B8(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       ScreenLeftSide_AimingRight_AimYawOffset;           // 0x168C0(0x8)(Edit, BlueprintVisible, ExportObject, Parm, ReturnParm, EditConst, SubobjectReference)
	double                                       ScreenLeftSide_AimingLeft_AimYawOffset;            // 0x168C8(0x8)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	float                                        RightHandIKAlpha;                                  // 0x168D0(0x4)(Net, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3654[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       MovementAnimRateCrouching;                         // 0x168D8(0x8)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       MovementAnimRateStanding;                          // 0x168E0(0x8)(BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               WorldAcceleration2D;                               // 0x168E8(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               LocalAcceleration2D;                               // 0x16900(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, EditConst, SubobjectReference)
	bool                                         HasAcceleration;                                   // 0x16918(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_3655[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnimStruct_CardinalDirection4        StopCardinalAnims;                                 // 0x16920(0x20)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	class FName                                  Locomotion_Distance_Curve_Name;                    // 0x16940(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class UAnimSequenceBase*                     WeaponIdleBase;                                    // 0x16948(0x8)(Edit, BlueprintReadOnly, EditFixedSize, ZeroConstructor, EditConst, SubobjectReference)
	float                                        StoppingState_RightHandLayerAlpha;                 // 0x16950(0x4)(ConstParm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         DisableLHandIK;                                    // 0x16954(0x1)(ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, SubobjectReference)
	bool                                         DisableRHandIK;                                    // 0x16955(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, SubobjectReference)
	bool                                         StrideWarpingAffectsArms;                          // 0x16956(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3656[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Layering_L_Arm_Add;                                // 0x16958(0x8)(Edit, BlueprintVisible, EditFixedSize, Parm, EditConst, SubobjectReference)
	double                                       Layering_L_Arm;                                    // 0x16960(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	double                                       Layering_R_Arm_Add;                                // 0x16968(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       Layering_R_Arm;                                    // 0x16970(0x8)(Edit, ConstParm, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class UAnimSequenceBase*                     WeaponSwimmingIdleBase;                            // 0x16978(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	enum class EMovementMode                     CurrentMovementMode;                               // 0x16980(0x1)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	bool                                         AltAimLayering;                                    // 0x16981(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3657[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Layering_Spine_Add;                                // 0x16988(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       Layering_Spine;                                    // 0x16990(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, EditConst, SubobjectReference)
	double                                       Layering_Head_Add;                                 // 0x16998(0x8)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       Layering_Head;                                     // 0x169A0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	float                                        StoppingState_LeftHandLayerAlpha;                  // 0x169A8(0x4)(Edit, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3658[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Layering_R_Hand_Add;                               // 0x169B0(0x8)(ConstParm, BlueprintVisible, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       Layering_R_Hand;                                   // 0x169B8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	double                                       Layering_L_Hand_Add;                               // 0x169C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       Layering_L_Hand;                                   // 0x169C8(0x8)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       Layering_Pelvis;                                   // 0x169D0(0x8)(Edit, BlueprintVisible, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       Layering_Legs;                                     // 0x169D8(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	class UAnimSequenceBase*                     CrouchIdleBase;                                    // 0x169E0(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         Layering_L_Hand_MeshSpaceRot;                      // 0x169E8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         Layering_R_Hand_MeshSpaceRot;                      // 0x169E9(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_365A[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     OverridePose;                                      // 0x169F0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, EditConst, SubobjectReference)
	class UAnimSequenceBase*                     RightFingerOverride;                               // 0x169F8(0x8)(ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         UseLeftFingerOverride;                             // 0x16A00(0x1)(Edit, ExportObject, Net, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         UseRightFingerOverride;                            // 0x16A01(0x1)(Edit, ExportObject, Net, Parm, ZeroConstructor, EditConst, SubobjectReference)
	uint8                                        Pad_365B[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     LeftFingerOverride;                                // 0x16A08(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	class UAnimSequenceBase*                     NormalIdle;                                        // 0x16A10(0x8)(Edit, ConstParm, Net, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         bEnableAnimationGroundConforming;                  // 0x16A18(0x1)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	bool                                         EnableInAirLayering;                               // 0x16A19(0x1)(ConstParm, BlueprintVisible, Net, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         UseOverridePoseLayering;                           // 0x16A1A(0x1)(Edit, ExportObject, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_365C[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector2D                             LeanAmountSmoothed;                                // 0x16A20(0x10)(Edit, ConstParm, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FVector                               LocalVelocityLastFrame;                            // 0x16A30(0x18)(ConstParm, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               LocalDerivedAcceleration;                          // 0x16A48(0x18)(Edit, ConstParm, EditFixedSize, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               LocationLastFrame;                                 // 0x16A60(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               CurrentLeaningSpringPosition;                      // 0x16A78(0x18)(EditConst, SubobjectReference)
	struct FRotator                              CurrentLeaningSpringRotation;                      // 0x16A90(0x18)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FVector                               SpringTarget;                                      // 0x16AA8(0x18)(Edit, ConstParm, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FVector2D                             Diff2D;                                            // 0x16AC0(0x10)(Edit, BlueprintVisible, Net, Parm, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       SpeedLeaningModifier;                              // 0x16AD0(0x8)(EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       VelocityY_Smoothed;                                // 0x16AD8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	struct FVector                               SpringDelta;                                       // 0x16AE0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               SpringDeltaAcceleration;                           // 0x16AF8(0x18)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       CurrentAccel;                                      // 0x16B10(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, Transient, Config, EditConst, SubobjectReference)
	bool                                         bActivatePoseLayering;                             // 0x16B18(0x1)(Edit, ConstParm, OutParm, EditConst, SubobjectReference)
	bool                                         PoseLayeringLeft;                                  // 0x16B19(0x1)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_365F[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpeedLastFrame;                                    // 0x16B20(0x8)(Edit, BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FFoot_Locking_IK>              FootLockingIKElements;                             // 0x16B28(0x10)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               Mesh_Location_Smoothed;                            // 0x16B38(0x18)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FTransform                            FootTransformL;                                    // 0x16B50(0x60)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FTransform                            FootTransformR;                                    // 0x16BB0(0x60)(ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       HipZOffset;                                        // 0x16C10(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               HipOffset;                                         // 0x16C18(0x18)(ConstParm, BlueprintVisible, Net, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FVector                               KneePV_L;                                          // 0x16C30(0x18)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               KneePV_R;                                          // 0x16C48(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TMap<enum class EMovementMode, double>       InterpSpeedForMovementMode;                        // 0x16C60(0x50)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	enum class EMovementMode                     CurrentMovementModeLastFrame;                      // 0x16CB0(0x1)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3663[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LandedTimer;                                       // 0x16CB8(0x8)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       FootIKAlpha;                                       // 0x16CC0(0x8)(ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         UseCrouchPoseLayering;                             // 0x16CC8(0x1)(Edit, ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3664[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        FootIKRotationAlpha;                               // 0x16CCC(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, EditConst, SubobjectReference)
	bool                                         UsePoseLayeringDuringTargeting;                    // 0x16CD0(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, EditConst, SubobjectReference)
	uint8                                        Pad_3666[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     OverridePoseAlt;                                   // 0x16CD8(0x8)(Edit, ConstParm, ExportObject, Net, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	bool                                         UseOverridePoseAlt;                                // 0x16CE0(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3668[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     CrouchOverridePoseAlt;                             // 0x16CE8(0x8)(ConstParm, BlueprintVisible, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class UAnimSequenceBase*                     CrouchOverridePose;                                // 0x16CF0(0x8)(ConstParm, ExportObject, Net, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	bool                                         ForceAltAimFromWeaponAnimBP;                       // 0x16CF8(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3669[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     SprintOverridePose;                                // 0x16D00(0x8)(Edit, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         EnableRidingLayering;                              // 0x16D08(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_366B[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       InterpLayeringSpineAdd;                            // 0x16D10(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditConst, SubobjectReference)
	double                                       InterpLayeringSpine;                               // 0x16D18(0x8)(Edit, ExportObject, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	double                                       InterpLayeringHeadAdd;                             // 0x16D20(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       InterpLayeringHead;                                // 0x16D28(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	double                                       InterpLayeringR_ArmAdd;                            // 0x16D30(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       InterpLayeringR_Arm;                               // 0x16D38(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       InterpLayeringR_HandAdd;                           // 0x16D40(0x8)(Edit, ConstParm, ExportObject, Net, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       InterpLayeringR_Hand;                              // 0x16D48(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, Transient, Config, EditConst, SubobjectReference)
	double                                       InterpLayeringL_HandAdd;                           // 0x16D50(0x8)(BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       InterpLayeringL_Hand;                              // 0x16D58(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       InterpLayeringL_ArmAdd;                            // 0x16D60(0x8)(Edit, ConstParm, BlueprintVisible, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       InterpLayeringL_Arm;                               // 0x16D68(0x8)(BlueprintVisible, Net, EditFixedSize, OutParm, ReturnParm, EditConst, SubobjectReference)
	double                                       LayeringInterpSpeed;                               // 0x16D70(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformLinked;                               // 0x16D78(0x1)(ConstParm, ExportObject, Net, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_366D[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                GroundConfromAnimationInstance;                    // 0x16D80(0x8)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        DirectionAngleHip;                                 // 0x16D88(0x4)(Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_366F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       DirectionAngleN;                                   // 0x16D90(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       DirectionAngleE;                                   // 0x16D98(0x8)(Edit, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       DirectionAngleS;                                   // 0x16DA0(0x8)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       DirectionAngleW;                                   // 0x16DA8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       DirectionAngleNHip;                                // 0x16DB0(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       DirectionAngleEHip;                                // 0x16DB8(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       DirectionAngleSHip;                                // 0x16DC0(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       DirectionAngleWHip;                                // 0x16DC8(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        HipRotationFactorN;                                // 0x16DD0(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	float                                        HipRotationFactorE;                                // 0x16DD4(0x4)(Edit, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	float                                        HipRotationFactorS;                                // 0x16DD8(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        HipRotationFactorW;                                // 0x16DDC(0x4)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       DirectionAngleInterpSpeed;                         // 0x16DE0(0x8)(ConstParm, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       DirectionAngleHipInterpSpeed;                      // 0x16DE8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         bIsSeated;                                         // 0x16DF0(0x1)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3671[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       CurrentIKTraceDistanceFactor;                      // 0x16DF8(0x8)(Edit, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       HipZOffsetLimit;                                   // 0x16E00(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       HipZOffsetLimit_Crouched;                          // 0x16E08(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Transient, Config, EditConst, SubobjectReference)
	double                                       CurrentZOffsetLimit;                               // 0x16E10(0x8)(ConstParm, BlueprintVisible, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         PlayFullBodyIdle;                                  // 0x16E18(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         PoseLayerCurveActive;                              // 0x16E19(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_3673[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FPVShadowMeshOffset_LastFrame;                     // 0x16E20(0x18)(ExportObject, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	class UAnimSequenceBase*                     FallingAnimBase;                                   // 0x16E38(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, EditConst, SubobjectReference)
	bool                                         bDebugLeaning;                                     // 0x16E40(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         PoseLayering_AltValue01;                           // 0x16E41(0x1)(ConstParm, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, SubobjectReference)
	bool                                         PoseLayering_AltValue02;                           // 0x16E42(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         PoseLayering_AltValue03;                           // 0x16E43(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         PoseLayering_Eat;                                  // 0x16E44(0x1)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, SubobjectReference)
	bool                                         PoseLayering_Harvest;                              // 0x16E45(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, SubobjectReference)
	uint8                                        Pad_3675[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        InterpOverrideLayeringSpineAdd;                    // 0x16E48(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	float                                        InterpOverrideL_Hand;                              // 0x16E4C(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, Config, EditConst, SubobjectReference)
	float                                        InterpOverrideL_Arm;                               // 0x16E50(0x4)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	float                                        InterpOverrideR_Hand;                              // 0x16E54(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        InterpOverrideL_ArmAdd;                            // 0x16E58(0x4)(ConstParm, ExportObject, EditFixedSize, OutParm, Transient, Config, EditConst, SubobjectReference)
	float                                        InterpOverrideL_HandAdd;                           // 0x16E5C(0x4)(Edit, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        InterpOverrideR_HandAdd;                           // 0x16E60(0x4)(ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	float                                        InterpOverrideSpine;                               // 0x16E64(0x4)(Edit, Parm, ZeroConstructor, EditConst, SubobjectReference)
	float                                        InterpOverrideHead;                                // 0x16E68(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	float                                        InterpOverrideHeadAdd;                             // 0x16E6C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        InterpOverrideR_Arm;                               // 0x16E70(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        InterpOverrideR_ArmAdd;                            // 0x16E74(0x4)(ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       OverrideSpineAdd;                                  // 0x16E78(0x8)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       OverrideSpine;                                     // 0x16E80(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       OverrideHeadAdd;                                   // 0x16E88(0x8)(ExportObject, Transient, Config, EditConst, SubobjectReference)
	double                                       OverrideHead;                                      // 0x16E90(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       OverrideR_ArmAdd;                                  // 0x16E98(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	double                                       OverrideR_Arm;                                     // 0x16EA0(0x8)(Edit, BlueprintReadOnly, Transient, Config, EditConst, SubobjectReference)
	double                                       OverrideR_HandAdd;                                 // 0x16EA8(0x8)(ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       OverrideR_Hand;                                    // 0x16EB0(0x8)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       OverrideL_HandAdd;                                 // 0x16EB8(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       OverrideL_Hand;                                    // 0x16EC0(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       OverrideL_ArmAdd;                                  // 0x16EC8(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       OverrideL_Arm;                                     // 0x16ED0(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         OverrideL_HandMeshSpaceRot;                        // 0x16ED8(0x1)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         OverrideR_HandMeshSpaceRot;                        // 0x16ED9(0x1)(BlueprintVisible, Parm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3679[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequence*                         DefaultShieldAnimation;                            // 0x16EE0(0x8)(ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Config, GlobalConfig, InstancedReference, SubobjectReference)
	bool                                         IsUsingShield;                                     // 0x16EE8(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, GlobalConfig)
	bool                                         PoseLayeringShield;                                // 0x16EE9(0x1)(ExportObject, Net, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         EnableFullBodyIdleLayering;                        // 0x16EEA(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_367B[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       TurnSpeedInterpolated;                             // 0x16EF0(0x8)(BlueprintReadOnly, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	bool                                         Is_Female;                                         // 0x16EF8(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_367C[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FPVShadowMeshOffset;                               // 0x16F00(0x18)(ConstParm, BlueprintVisible, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       LegLengthHipZOffset;                               // 0x16F18(0x8)(ConstParm, EditFixedSize, Transient, Config, EditConst, SubobjectReference)
	double                                       TraceDistanceFactorAbove;                          // 0x16F20(0x8)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	double                                       TraceDistanceFactorBelow;                          // 0x16F28(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	float                                        Bone_Modifiers_Leg_Length_Percentage;              // 0x16F30(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_367E[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpeedRemapped;                                     // 0x16F38(0x8)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         bIsOnDino;                                         // 0x16F40(0x1)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         bIsLocallyControlled;                              // 0x16F41(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_367F[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        Bone_Modifier_Arm_Length;                          // 0x16F44(0x4)(ExportObject, Parm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	float                                        Bone_Modifier_Shoulders;                           // 0x16F48(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, Transient, Config, EditConst, SubobjectReference)
	float                                        Bone_Modifier_Torso_Size;                          // 0x16F4C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        Bone_Modifier_Torso;                               // 0x16F50(0x4)(ConstParm, BlueprintVisible, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        Bone_Modifier_Chest;                               // 0x16F54(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               WeaponPositionOffset_ShortArms;                    // 0x16F58(0x18)(BlueprintVisible, EditFixedSize, ReturnParm, EditConst, SubobjectReference)
	float                                        CharacterCreator_OverallFat;                       // 0x16F70(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	float                                        CharacterCreator_Fat01Chest;                       // 0x16F74(0x4)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	class UAnimSequenceBase*                     RefPose_ProneIdle;                                 // 0x16F78(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class UAnimSequenceBase*                     RefPose_ProneFwd;                                  // 0x16F80(0x8)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	float                                        CharacterCreator_Fat01Belly;                       // 0x16F88(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         PoseLayeringThrowItem;                             // 0x16F8C(0x1)(EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         PoseLayering_Melee;                                // 0x16F8D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3682[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              RootRotOffset_Interpolated;                        // 0x16F90(0x18)(Edit, BlueprintReadOnly, Net, Parm, OutParm, EditConst, SubobjectReference)
	double                                       ItemBasedPhysicsFactor_Belly;                      // 0x16FA8(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       ItemBasedPhysicsFactor_Breast;                     // 0x16FB0(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         PoseLayering_Emote;                                // 0x16FB8(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	bool                                         IsSitting;                                         // 0x16FB9(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig)
	uint8                                        Pad_3684[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        PL_EmoteRightArm;                                  // 0x16FBC(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        PL_EmoteLeftArm;                                   // 0x16FC0(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        PL_EmoteSpine;                                     // 0x16FC4(0x4)(Net, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	bool                                         PoseLayering_DisableProne;                         // 0x16FC8(0x1)(Net, Parm, OutParm, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_3685[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               L_Weapon_Shift;                                    // 0x16FD0(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               R_Weapon_Shift;                                    // 0x16FE8(0x18)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class UAnimMontage*                          StepMontageToPlay;                                 // 0x17000(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         IsOnSeatingStructure;                              // 0x17008(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig)
	uint8                                        Pad_3687[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnimStruct_CardinalDirection4        CrouchCardinalAnims;                               // 0x17010(0x20)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         DisableBlink;                                      // 0x17030(0x1)(Edit, ConstParm, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_3688[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        DisableHandOverrides;                              // 0x17034(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         bWasFPV;                                           // 0x17038(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3689[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        UpdateIKInstantlyFrameCounter;                     // 0x1703C(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class UAnimMontage*                          StepBigMontageToPlay;                              // 0x17040(0x8)(BlueprintVisible, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        Bone_Modifier_Overall_Height;                      // 0x17048(0x4)(ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_368B[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       WasMovingTimer;                                    // 0x17050(0x8)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FRotator>                      BlinkRotation;                                     // 0x17058(0x10)(Edit, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        PoseLayerCurveValue;                               // 0x17068(0x4)(Edit, ConstParm, BlueprintVisible, Net, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_368C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     ProneOverridePoseAlt;                              // 0x17070(0x8)(BlueprintVisible, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	class UAnimSequenceBase*                     ProneOverrideIdlePose;                             // 0x17078(0x8)(Edit, Net, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         UsePronePoseLayering;                              // 0x17080(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_368E[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     ProneOverrideMovingPoseAlt;                        // 0x17088(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class UAnimSequenceBase*                     ProneOverrideMovingPose;                           // 0x17090(0x8)(BlueprintVisible, EditFixedSize, ZeroConstructor, EditConst, SubobjectReference)
	bool                                         ForcePronePoseLayering;                            // 0x17098(0x1)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
