#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x16D80 (0x170C8 - 0x348)
// AnimBlueprintGeneratedClass BaseHumanAnimBP.BaseHumanAnimBP_C
class UBaseHumanAnimBP_C : public UAnimInstance
{
public:
	uint8                                        Pad_462F[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x350(0x8)(Edit, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, SubobjectReference)
	struct FAnimBlueprintGeneratedMutableData    __AnimBlueprintMutables;                           // 0x358(0x349)(ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_4630[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnimSubsystemInstance                AnimBlueprintExtension_Tag;                        // 0x6A8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FAnimSubsystemInstance                AnimBlueprintExtension_PropertyAccess;             // 0x6B0(0x8)(ConstParm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FAnimSubsystemInstance_NodeRelevancy  AnimBlueprintExtension_NodeRelevancy;              // 0x6B8(0xA8)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FAnimSubsystemInstance                AnimBlueprintExtension_BlendSpaceGraph;            // 0x760(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FAnimSubsystemInstance                AnimBlueprintExtension_Base;                       // 0x768(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_104;                 // 0x770(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_103;                 // 0x7B8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, AutoWeak)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_9;                        // 0x800(0x1A0)(BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_102;                 // 0x9A0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_66;                   // 0x9E8(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, AutoWeak)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_8;                        // 0xAF0(0x1A0)(BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0xC90(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_7;                        // 0xCB0(0x1A0)(BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0xE50(0x20)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_6;                        // 0xE70(0x1A0)(BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_5;                        // 0x1010(0x1A0)(BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_45;                   // 0x11B0(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_44;                   // 0x11F8(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_30;                             // 0x1240(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_101;                 // 0x1288(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_100;                 // 0x12D0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_65;                   // 0x1318(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_213;                   // 0x1420(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_99;                  // 0x1448(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, AutoWeak)
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_3;          // 0x1490(0x118)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_212;                   // 0x15A8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_64;                   // 0x15D0(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_211;                   // 0x16D8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_98;                  // 0x1700(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, AutoWeak)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_1;                    // 0x1748(0x48)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_43;                   // 0x1790(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_42;                   // 0x17D8(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_41;                   // 0x1820(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	uint8                                        Pad_4635[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_4;                        // 0x1870(0x1A0)(BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x1A10(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x1A30(0x20)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_29;                             // 0x1A50(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_210;                   // 0x1A98(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_28;                             // 0x1AC0(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_9;                     // 0x1B08(0xC8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_97;                  // 0x1BD0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_63;                   // 0x1C18(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_40;                   // 0x1D20(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_209;                   // 0x1D68(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_208;                   // 0x1D90(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_96;                  // 0x1DB8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_207;                   // 0x1E00(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_47;                // 0x1E28(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_95;                  // 0x1E68(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_39;                   // 0x1EB0(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_2;          // 0x1EF8(0x118)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_38;                   // 0x2010(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_94;                  // 0x2058(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_93;                  // 0x20A0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_8;                     // 0x20E8(0xC8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_37;                   // 0x21B0(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_92;                  // 0x21F8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_62;                   // 0x2240(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_206;                   // 0x2348(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_205;                   // 0x2370(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_61;                   // 0x2398(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_204;                   // 0x24A0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_203;                   // 0x24C8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_27;                             // 0x24F0(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_58;                 // 0x2538(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_46;                // 0x2618(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_91;                  // 0x2658(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_36;                   // 0x26A0(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_90;                  // 0x26E8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_60;                   // 0x2730(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_202;                   // 0x2838(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_57;                 // 0x2860(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_201;                   // 0x2940(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_59;                   // 0x2968(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_200;                   // 0x2A70(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_199;                   // 0x2A98(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_89;                  // 0x2AC0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_56;                 // 0x2B08(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_198;                   // 0x2BE8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_35;                   // 0x2C10(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_88;                  // 0x2C58(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_87;                  // 0x2CA0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_86;                  // 0x2CE8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_197;                   // 0x2D30(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_196;                   // 0x2D58(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_195;                   // 0x2D80(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_55;                 // 0x2DA8(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_85;                  // 0x2E88(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_34;                   // 0x2ED0(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_58;                   // 0x2F18(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_194;                   // 0x3020(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_45;                // 0x3048(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_7;                     // 0x3088(0xC8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_84;                  // 0x3150(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_57;                   // 0x3198(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_4;                  // 0x32A0(0x70)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_3;                  // 0x3310(0x70)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_83;                  // 0x3380(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_82;                  // 0x33C8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_193;                   // 0x3410(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_192;                   // 0x3438(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_191;                   // 0x3460(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, AutoWeak, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_54;                 // 0x3488(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_81;                  // 0x3568(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_33;                   // 0x35B0(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_190;                   // 0x35F8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_26;                             // 0x3620(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_189;                   // 0x3668(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_53;                 // 0x3690(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_80;                  // 0x3770(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_188;                   // 0x37B8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_2;                  // 0x37E0(0x70)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_79;                  // 0x3850(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor, AutoWeak)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt;                      // 0x3898(0x48)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_32;                   // 0x38E0(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_31;                   // 0x3928(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_78;                  // 0x3970(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_187;                   // 0x39B8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_186;                   // 0x39E0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_185;                   // 0x3A08(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_52;                 // 0x3A30(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_77;                  // 0x3B10(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_30;                   // 0x3B58(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_51;                 // 0x3BA0(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_29;                   // 0x3C80(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_28;                   // 0x3CC8(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_Inertialization             AnimGraphNode_Inertialization;                     // 0x3D10(0x100)(ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_44;                // 0x3E10(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_76;                  // 0x3E50(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_75;                  // 0x3E98(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_74;                  // 0x3EE0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_27;                   // 0x3F28(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_184;                   // 0x3F70(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_23;                      // 0x3F98(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_20;                 // 0x4060(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_19;                 // 0x4088(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_18;                 // 0x40B0(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17;                 // 0x40D8(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_16;                 // 0x4100(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_183;                   // 0x4128(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_18;                      // 0x4150(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_7;            // 0x4170(0xD0)(ConstParm, Parm, ReturnParm, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_43;                // 0x4240(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_42;                // 0x4280(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_6;               // 0x42C0(0x38)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_182;                   // 0x42F8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_41;                // 0x4320(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_50;                 // 0x4360(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_181;                   // 0x4440(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_17;                      // 0x4468(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x4488(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	uint8                                        Pad_463F[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_3;                        // 0x44B0(0x1A0)(BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x4650(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_15;                 // 0x4670(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_14;                 // 0x4698(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_13;                 // 0x46C0(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12;                 // 0x46E8(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_10;                       // 0x4710(0x470)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_73;                  // 0x4B80(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_26;                   // 0x4BC8(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_25;                   // 0x4C10(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_16;                      // 0x4C58(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_9;                        // 0x4C78(0x470)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_72;                  // 0x50E8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_24;                   // 0x5130(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_23;                   // 0x5178(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_15;                      // 0x51C0(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_8;                        // 0x51E0(0x470)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_22;                   // 0x5650(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_71;                  // 0x5698(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_21;                   // 0x56E0(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_14;                      // 0x5728(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_7;                        // 0x5748(0x470)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_20;                   // 0x5BB8(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_70;                  // 0x5C00(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_19;                   // 0x5C48(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_69;                  // 0x5C90(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_18;                   // 0x5CD8(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_13;                      // 0x5D20(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_4;                      // 0x5D40(0xC8)(Edit, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_40;                // 0x5E08(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_4;            // 0x5E48(0x20)(Edit, ExportObject, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_39;                // 0x5E68(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_3;            // 0x5EA8(0x20)(Edit, ExportObject, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_38;                // 0x5EC8(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_2;            // 0x5F08(0x20)(Edit, ExportObject, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_37;                // 0x5F28(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_1;            // 0x5F68(0x20)(Edit, ExportObject, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_36;                // 0x5F88(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult;              // 0x5FC8(0x20)(Edit, ExportObject, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_BlendSpaceGraph             AnimGraphNode_BlendSpaceGraph;                     // 0x5FE8(0x68)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_6;            // 0x6050(0xD0)(ConstParm, Parm, ReturnParm, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_180;                   // 0x6120(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x6148(0x20)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_49;                 // 0x6168(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_StrideWarping               AnimGraphNode_StrideWarping_1;                     // 0x6248(0x248)(ConstParm, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x6490(0x20)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_2;                        // 0x64B0(0x1A0)(BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_12;                      // 0x6650(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_3;                      // 0x6670(0xC8)(Edit, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_179;                   // 0x6738(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_56;                   // 0x6760(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_55;                   // 0x6868(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_68;                  // 0x6970(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, AutoWeak)
	struct FAnimNode_LinkedAnimGraph             AnimGraphNode_LinkedAnimGraph;                     // 0x69B8(0xB8)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_67;                  // 0x6A70(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_54;                   // 0x6AB8(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_178;                   // 0x6BC0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_177;                   // 0x6BE8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_25;                             // 0x6C10(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_66;                  // 0x6C58(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, AutoWeak)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_24;                             // 0x6CA0(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_176;                   // 0x6CE8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_175;                   // 0x6D10(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x6D38(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_174;                   // 0x6D58(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_22;                      // 0x6D80(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	uint8                                        Pad_464A[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_1;                        // 0x6E50(0x1A0)(BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_21;                      // 0x6FF0(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_173;                   // 0x70B8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_53;                   // 0x70E0(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_1;                  // 0x71E8(0x70)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_17;                   // 0x7258(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_65;                  // 0x72A0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_172;                   // 0x72E8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_64;                  // 0x7310(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_16;                   // 0x7358(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_48;                 // 0x73A0(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_23;                             // 0x7480(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_63;                  // 0x74C8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, AutoWeak)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_22;                             // 0x7510(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_171;                   // 0x7558(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_170;                   // 0x7580(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_62;                  // 0x75A8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_169;                   // 0x75F0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_168;                   // 0x7618(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_61;                  // 0x7640(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_167;                   // 0x7688(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_1;          // 0x76B0(0x118)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_166;                   // 0x77C8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_60;                  // 0x77F0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_20;                      // 0x7838(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_21;                             // 0x7900(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_20;                             // 0x7948(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_52;                   // 0x7990(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_59;                  // 0x7A98(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_165;                   // 0x7AE0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_164;                   // 0x7B08(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, ContainsInstancedReference)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_19;                             // 0x7B30(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_163;                   // 0x7B78(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_58;                  // 0x7BA0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_51;                   // 0x7BE8(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_47;                 // 0x7CF0(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_46;                 // 0x7DD0(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_5;            // 0x7EB0(0xD0)(ConstParm, Parm, ReturnParm, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_162;                   // 0x7F80(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, ContainsInstancedReference)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_19;                      // 0x7FA8(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_50;                   // 0x8070(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_161;                   // 0x8178(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_45;                 // 0x81A0(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_49;                   // 0x8280(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_18;                             // 0x8388(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_18;                      // 0x83D0(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_160;                   // 0x8498(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_44;                 // 0x84C0(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_17;                      // 0x85A0(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_159;                   // 0x8668(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_43;                 // 0x8690(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_16;                      // 0x8770(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_158;                   // 0x8838(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_42;                 // 0x8860(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_15;                      // 0x8940(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_157;                   // 0x8A08(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_156;                   // 0x8A30(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_6;                     // 0x8A58(0xC8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_41;                 // 0x8B20(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_14;                      // 0x8C00(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_155;                   // 0x8CC8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_154;                   // 0x8CF0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_5;                     // 0x8D18(0xC8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_40;                 // 0x8DE0(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_48;                   // 0x8EC0(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_153;                   // 0x8FC8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_152;                   // 0x8FF0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_47;                   // 0x9018(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_151;                   // 0x9120(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_150;                   // 0x9148(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_149;                   // 0x9170(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_4;            // 0x9198(0xD0)(ConstParm, Parm, ReturnParm, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_148;                   // 0x9268(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_3;            // 0x9290(0xD0)(ConstParm, Parm, ReturnParm, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_46;                   // 0x9360(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_147;                   // 0x9468(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_45;                   // 0x9490(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_146;                   // 0x9598(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_145;                   // 0x95C0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_144;                   // 0x95E8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_44;                   // 0x9610(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_43;                   // 0x9718(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_143;                   // 0x9820(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_42;                   // 0x9848(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_15;                   // 0x9950(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_142;                   // 0x9998(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_41;                   // 0x99C0(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_141;                   // 0x9AC8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_57;                  // 0x9AF0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_4;                     // 0x9B38(0xC8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_140;                   // 0x9C00(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_56;                  // 0x9C28(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_39;                 // 0x9C70(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_139;                   // 0x9D50(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_55;                  // 0x9D78(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_38;                 // 0x9DC0(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_138;                   // 0x9EA0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_54;                  // 0x9EC8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_40;                   // 0x9F10(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_137;                   // 0xA018(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_136;                   // 0xA040(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_39;                   // 0xA068(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_135;                   // 0xA170(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_134;                   // 0xA198(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_133;                   // 0xA1C0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, ContainsInstancedReference)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_3;                     // 0xA1E8(0xC8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_37;                 // 0xA2B0(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_36;                 // 0xA390(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_14;                   // 0xA470(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_53;                  // 0xA4B8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_38;                   // 0xA500(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_132;                   // 0xA608(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_35;                 // 0xA630(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_13;                   // 0xA710(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_52;                  // 0xA758(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_34;                 // 0xA7A0(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_12;                   // 0xA880(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_51;                  // 0xA8C8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_131;                   // 0xA910(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_130;                   // 0xA938(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, ContainsInstancedReference)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_11;                   // 0xA960(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_129;                   // 0xA9A8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, ContainsInstancedReference)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_17;                             // 0xA9D0(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_50;                  // 0xAA18(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_37;                   // 0xAA60(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_36;                   // 0xAB68(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_49;                  // 0xAC70(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_128;                   // 0xACB8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, ContainsInstancedReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_127;                   // 0xACE0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_35;                   // 0xAD08(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_126;                   // 0xAE10(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_13;                      // 0xAE38(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_125;                   // 0xAF00(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_12;                      // 0xAF28(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_33;                 // 0xAFF0(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_124;                   // 0xB0D0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_32;                 // 0xB0F8(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_123;                   // 0xB1D8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_122;                   // 0xB200(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_10;                   // 0xB228(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_121;                   // 0xB270(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_31;                 // 0xB298(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_120;                   // 0xB378(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_48;                  // 0xB3A0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_47;                  // 0xB3E8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_5;               // 0xB430(0x38)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_34;                   // 0xB468(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_119;                   // 0xB570(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_118;                   // 0xB598(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_4;               // 0xB5C0(0x38)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_117;                   // 0xB5F8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_116;                   // 0xB620(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_30;                 // 0xB648(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_29;                 // 0xB728(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_2;            // 0xB808(0xD0)(ConstParm, Parm, ReturnParm, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_11;                      // 0xB8D8(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_28;                 // 0xB9A0(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_1;                   // 0xBA80(0x48)(Edit, ConstParm, Net, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_33;                   // 0xBAC8(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_115;                   // 0xBBD0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_114;                   // 0xBBF8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_113;                   // 0xBC20(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_112;                   // 0xBC48(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor, AutoWeak)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_10;                      // 0xBC70(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_27;                 // 0xBD38(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_9;                       // 0xBE18(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_26;                 // 0xBEE0(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_8;                       // 0xBFC0(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_25;                 // 0xC088(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_7;                       // 0xC168(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_2;                     // 0xC230(0xC8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_24;                 // 0xC2F8(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_6;                       // 0xC3D8(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_1;                     // 0xC4A0(0xC8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_23;                 // 0xC568(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0xC648(0xD0)(ConstParm, Parm, ReturnParm, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive;              // 0xC718(0xD0)(ConstParm, Parm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_111;                   // 0xC7E8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_46;                  // 0xC810(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_110;                   // 0xC858(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_109;                   // 0xC880(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_22;                 // 0xC8A8(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_108;                   // 0xC988(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_107;                   // 0xC9B0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_32;                   // 0xC9D8(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_31;                   // 0xCAE0(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_21;                 // 0xCBE8(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_45;                  // 0xCCC8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_20;                 // 0xCD10(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_44;                  // 0xCDF0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_35;                // 0xCE38(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive;                       // 0xCE78(0xC8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_43;                  // 0xCF40(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_34;                // 0xCF88(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_42;                  // 0xCFC8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_33;                // 0xD010(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_BlendSpaceEvaluator         AnimGraphNode_BlendSpaceEvaluator;                 // 0xD050(0x78)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_30;                   // 0xD0C8(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_106;                   // 0xD1D0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_105;                   // 0xD1F8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, AutoWeak)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_5;                       // 0xD220(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_41;                  // 0xD2E8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9;                    // 0xD330(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_104;                   // 0xD378(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_40;                  // 0xD3A0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_32;                // 0xD3E8(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11;                 // 0xD428(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_10;                 // 0xD450(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9;                  // 0xD478(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8;                  // 0xD4A0(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_31;                // 0xD4C8(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_30;                // 0xD508(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_39;                  // 0xD548(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_11;                      // 0xD590(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_29;                // 0xD5B0(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_28;                // 0xD5F0(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_38;                  // 0xD630(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_10;                      // 0xD678(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_27;                // 0xD698(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_26;                // 0xD6D8(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_37;                  // 0xD718(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9;                       // 0xD760(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_25;                // 0xD780(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_24;                // 0xD7C0(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_23;                // 0xD800(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_36;                  // 0xD840(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_35;                  // 0xD888(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8;                       // 0xD8D0(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_2;                      // 0xD8F0(0xC8)(Edit, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_34;                  // 0xD9B8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_22;                // 0xDA00(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_29;                   // 0xDA40(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_21;                // 0xDB48(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_33;                  // 0xDB88(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_20;                // 0xDBD0(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_28;                   // 0xDC10(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_103;                   // 0xDD18(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_102;                   // 0xDD40(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_32;                  // 0xDD68(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_31;                  // 0xDDB0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_19;                // 0xDDF8(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_18;                // 0xDE38(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_30;                  // 0xDE78(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_17;                // 0xDEC0(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_29;                  // 0xDF00(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_16;                // 0xDF48(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_28;                  // 0xDF88(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_15;                // 0xDFD0(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_101;                   // 0xE010(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_100;                   // 0xE038(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_99;                    // 0xE060(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_98;                    // 0xE088(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_97;                    // 0xE0B0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_96;                    // 0xE0D8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_27;                   // 0xE100(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_26;                   // 0xE208(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_25;                   // 0xE310(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_95;                    // 0xE418(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_94;                    // 0xE440(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_93;                    // 0xE468(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_92;                    // 0xE490(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_91;                    // 0xE4B8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_90;                    // 0xE4E0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_89;                    // 0xE508(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_27;                  // 0xE530(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_88;                    // 0xE578(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_24;                   // 0xE5A0(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_87;                    // 0xE6A8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_86;                    // 0xE6D0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_23;                   // 0xE6F8(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_85;                    // 0xE800(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_84;                    // 0xE828(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_83;                    // 0xE850(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_82;                    // 0xE878(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_81;                    // 0xE8A0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_80;                    // 0xE8C8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_79;                    // 0xE8F0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_78;                    // 0xE918(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_77;                    // 0xE940(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_76;                    // 0xE968(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_75;                    // 0xE990(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_74;                    // 0xE9B8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_73;                    // 0xE9E0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_72;                    // 0xEA08(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_22;                   // 0xEA30(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_21;                   // 0xEB38(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_20;                   // 0xEC40(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_19;                   // 0xED48(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_18;                   // 0xEE50(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_17;                   // 0xEF58(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_71;                    // 0xF060(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_70;                    // 0xF088(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_69;                    // 0xF0B0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_68;                    // 0xF0D8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_67;                    // 0xF100(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_66;                    // 0xF128(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, AutoWeak)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_16;                   // 0xF150(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_65;                    // 0xF258(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_64;                    // 0xF280(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_63;                    // 0xF2A8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, AutoWeak)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_62;                    // 0xF2D0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_15;                   // 0xF2F8(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_61;                    // 0xF400(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_60;                    // 0xF428(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_59;                    // 0xF450(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_58;                    // 0xF478(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_3;               // 0xF4A0(0x38)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_57;                    // 0xF4D8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_2;               // 0xF500(0x38)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_56;                    // 0xF538(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_55;                    // 0xF560(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_54;                    // 0xF588(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_1;               // 0xF5B0(0x38)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_53;                    // 0xF5E8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_52;                    // 0xF610(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_14;                   // 0xF638(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_51;                    // 0xF740(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_50;                    // 0xF768(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive;                 // 0xF790(0x38)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_4;                       // 0xF7C8(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_19;                 // 0xF890(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_13;                   // 0xF970(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_49;                    // 0xFA78(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_48;                    // 0xFAA0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_26;                  // 0xFAC8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_47;                    // 0xFB10(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_6;                        // 0xFB38(0x470)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_25;                  // 0xFFA8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8;                    // 0xFFF0(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_24;                  // 0x10038(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_5;                        // 0x10080(0x470)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_12;                   // 0x104F0(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_11;                   // 0x105F8(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_3;                       // 0x10700(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_46;                    // 0x107C8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_45;                    // 0x107F0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_23;                  // 0x10818(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_22;                  // 0x10860(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_10;                   // 0x108A8(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_44;                    // 0x109B0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_43;                    // 0x109D8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_4;                        // 0x10A00(0x470)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_21;                  // 0x10E70(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_16;                             // 0x10EB8(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone;                          // 0x10F00(0x1A0)(BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x110A0(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x110C0(0x20)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_20;                  // 0x110E0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_42;                    // 0x11128(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_15;                             // 0x11150(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_14;                             // 0x11198(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_19;                  // 0x111E0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_14;                // 0x11228(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_13;                // 0x11268(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_18;                  // 0x112A8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_18;                 // 0x112F0(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_41;                    // 0x113D0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace;            // 0x113F8(0x118)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_ApplyBoneMods               AnimGraphNode_ApplyBoneMods;                       // 0x11510(0xD0)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_13;                             // 0x115E0(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7;                    // 0x11628(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_40;                    // 0x11670(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_12;                             // 0x11698(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_11;                             // 0x116E0(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_39;                    // 0x11728(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_10;                             // 0x11750(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_9;                              // 0x11798(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_8;                              // 0x117E0(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_7;                              // 0x11828(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_6;                              // 0x11870(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_5;                              // 0x118B8(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_9;                    // 0x11900(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_38;                    // 0x11A08(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_17;                 // 0x11A30(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_37;                    // 0x11B10(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6;                    // 0x11B38(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_17;                  // 0x11B80(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_StrideWarping               AnimGraphNode_StrideWarping;                       // 0x11BC8(0x248)(ConstParm, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7;                  // 0x11E10(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6;                  // 0x11E38(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5;                  // 0x11E60(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4;                  // 0x11E88(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5;                    // 0x11EB0(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_3;                        // 0x11EF8(0x470)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7;                       // 0x12368(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4;                    // 0x12388(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_2;                        // 0x123D0(0x470)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6;                       // 0x12840(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3;                    // 0x12860(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_1;                        // 0x128A8(0x470)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5;                       // 0x12D18(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig;                          // 0x12D38(0x470)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0x131A8(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4;                       // 0x131F0(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_1;                      // 0x13210(0xC8)(Edit, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x132D8(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x132F8(0x20)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3;                  // 0x13318(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2;                  // 0x13340(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1;                  // 0x13368(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult;                    // 0x13390(0x28)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_12;                // 0x133B8(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3;                       // 0x133F8(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_11;                // 0x13418(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2;                       // 0x13458(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_10;                // 0x13478(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1;                       // 0x134B8(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_9;                 // 0x134D8(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult;                         // 0x13518(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine;                        // 0x13538(0xC8)(Edit, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_36;                    // 0x13600(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_2;                       // 0x13628(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_35;                    // 0x136F0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_4;                              // 0x13718(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_8;                 // 0x13760(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_16;                  // 0x137A0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_7;                 // 0x137E8(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_8;                    // 0x13828(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum;                     // 0x13930(0x48)(Edit, ConstParm, Net, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_7;                    // 0x13978(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x13A80(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x13AC8(0x20)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_34;                    // 0x13AE8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_16;                 // 0x13B10(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_33;                    // 0x13BF0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer;                    // 0x13C18(0x70)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_6;                    // 0x13C88(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_15;                  // 0x13D90(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x13DD8(0x20)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_32;                    // 0x13DF8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_14;                  // 0x13E20(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_31;                    // 0x13E68(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_15;                 // 0x13E90(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_14;                 // 0x13F70(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_30;                    // 0x14050(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_29;                    // 0x14078(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_5;                    // 0x140A0(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_13;                 // 0x141A8(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_1;                       // 0x14288(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend;                         // 0x14350(0xC8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_3;                              // 0x14418(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_12;                 // 0x14460(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_11;                 // 0x14540(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_13;                  // 0x14620(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_28;                    // 0x14668(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_27;                    // 0x14690(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_6;                 // 0x146B8(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_12;                  // 0x146F8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_5;                 // 0x14740(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_4;                 // 0x14780(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_11;                  // 0x147C0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_10;                  // 0x14808(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_9;                   // 0x14850(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_26;                    // 0x14898(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_25;                    // 0x148C0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_24;                    // 0x148E8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_2;                              // 0x14910(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_4;                    // 0x14958(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_23;                    // 0x14A60(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_8;                   // 0x14A88(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_1;                              // 0x14AD0(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_22;                    // 0x14B18(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_21;                    // 0x14B40(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_7;                   // 0x14B68(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_3;                 // 0x14BB0(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_2;                 // 0x14BF0(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_6;                   // 0x14C30(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_20;                    // 0x14C78(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5;                   // 0x14CA0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_1;                 // 0x14CE8(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_19;                    // 0x14D28(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_10;                 // 0x14D50(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_9;                  // 0x14E30(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_18;                    // 0x14F10(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_17;                    // 0x14F38(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor)
	struct FAnimNode_Slot                        AnimGraphNode_Slot;                                // 0x14F60(0x48)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_3;                    // 0x14FA8(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_16;                    // 0x150B0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_15;                    // 0x150D8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NoDestructor)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_2;                    // 0x15100(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_14;                    // 0x15208(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_8;                  // 0x15230(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_7;                  // 0x15310(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_6;                  // 0x153F0(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_5;                  // 0x154D0(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_13;                    // 0x155B0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_12;                    // 0x155D8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_11;                    // 0x15600(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_10;                    // 0x15628(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_4;                  // 0x15650(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_9;                     // 0x15730(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_4;                   // 0x15758(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_1;                    // 0x157A0(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_8;                     // 0x158A8(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_3;                   // 0x158D0(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_7;                     // 0x15918(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_6;                     // 0x15940(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_3;                  // 0x15968(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_2;                  // 0x15A48(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_1;                  // 0x15B28(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_5;                     // 0x15C08(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_4;                     // 0x15C30(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend;                    // 0x15C58(0xE0)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_3;                     // 0x15D38(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x15D60(0x48)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_2;                   // 0x15DA8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2;                     // 0x15DF0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose;                      // 0x15E18(0x108)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1;                   // 0x15F20(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator;                   // 0x15F68(0x40)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool;                     // 0x15FA8(0x48)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_1;                     // 0x15FF0(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose;                       // 0x16018(0x28)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               K2Node_PropertyAccess_97;                          // 0x16040(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, Interp, AutoWeak)
	struct FVector                               K2Node_PropertyAccess_96;                          // 0x16058(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, RepNotify, AutoWeak)
	struct FRotator                              K2Node_PropertyAccess_95;                          // 0x16070(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, AutoWeak)
	bool                                         K2Node_PropertyAccess_94;                          // 0x16088(0x1)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	uint8                                        Pad_46A9[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              K2Node_PropertyAccess_90;                          // 0x16090(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, AutoWeak)
	struct FRotator                              K2Node_PropertyAccess_88;                          // 0x160A8(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor, AutoWeak)
	struct FRotator                              K2Node_PropertyAccess_87;                          // 0x160C0(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor, AutoWeak)
	struct FVector                               K2Node_PropertyAccess_86;                          // 0x160D8(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, AutoWeak)
	struct FVector                               K2Node_PropertyAccess_82;                          // 0x160F0(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor, AutoWeak)
	float                                        K2Node_PropertyAccess_81;                          // 0x16108(0x4)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor, AutoWeak)
	uint8                                        Pad_46AD[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               K2Node_PropertyAccess_78;                          // 0x16110(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, AutoWeak)
	float                                        K2Node_PropertyAccess_77;                          // 0x16128(0x4)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, AutoWeak)
	uint8                                        Pad_46AF[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               K2Node_PropertyAccess_76;                          // 0x16130(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, AutoWeak)
	float                                        K2Node_PropertyAccess_73;                          // 0x16148(0x4)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, AutoWeak)
	float                                        K2Node_PropertyAccess_72;                          // 0x1614C(0x4)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, AutoWeak)
	float                                        K2Node_PropertyAccess_71;                          // 0x16150(0x4)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, EditorOnly, AutoWeak)
	float                                        K2Node_PropertyAccess_70;                          // 0x16154(0x4)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, AutoWeak)
	bool                                         K2Node_PropertyAccess_69;                          // 0x16158(0x1)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, AutoWeak)
	uint8                                        Pad_46B0[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               K2Node_PropertyAccess_68;                          // 0x16160(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, AutoWeak)
	struct FVector                               K2Node_PropertyAccess_65;                          // 0x16178(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, Interp, AutoWeak)
	struct FRotator                              K2Node_PropertyAccess_61;                          // 0x16190(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor)
	struct FVector                               K2Node_PropertyAccess_60;                          // 0x161A8(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor)
	struct FVector                               K2Node_PropertyAccess_50;                          // 0x161C0(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor)
	struct FVector                               K2Node_PropertyAccess_49;                          // 0x161D8(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor)
	struct FVector                               K2Node_PropertyAccess_43;                          // 0x161F0(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly)
	struct FRotator                              K2Node_PropertyAccess_42;                          // 0x16208(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly)
	struct FVector                               K2Node_PropertyAccess_41;                          // 0x16220(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly)
	struct FRotator                              K2Node_PropertyAccess_40;                          // 0x16238(0x18)(BlueprintVisible, Net, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly)
	double                                       __CustomProperty_HipAngle_C4F6799A428B86C4183E2FBB04A6E8AC; // 0x16250(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_C4F6799A428B86C4183E2FBB04A6E8AC; // 0x16258(0x8)(ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_HipAngle_0659CDFE474FD2CD14B4FD8BF1532DF0; // 0x16260(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_0659CDFE474FD2CD14B4FD8BF1532DF0; // 0x16268(0x8)(ConstParm, BlueprintVisible, ExportObject, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_HipAngle_775203BB416EF5C5238B0BAFEF3D3DCC; // 0x16270(0x8)(DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_775203BB416EF5C5238B0BAFEF3D3DCC; // 0x16278(0x8)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_HipAngle_F3F0D3E847FBB0FDA81E8099FF828805; // 0x16280(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_F3F0D3E847FBB0FDA81E8099FF828805; // 0x16288(0x8)(ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_HipAngle_B21456A04469CE6DECF1C48940607C9C; // 0x16290(0x8)(ConstParm, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_B21456A04469CE6DECF1C48940607C9C; // 0x16298(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_HipAngle_06E2E76548C765535F8C9589B6071D8F; // 0x162A0(0x8)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_06E2E76548C765535F8C9589B6071D8F; // 0x162A8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_HipAngle_4AB80AF84C324CF4BF3301B92F225991; // 0x162B0(0x8)(Edit, ConstParm, ExportObject, Net, OutParm, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_4AB80AF84C324CF4BF3301B92F225991; // 0x162B8(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_HipAngle_6E88A4124AE7142ECA6F7397331A880E; // 0x162C0(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_6E88A4124AE7142ECA6F7397331A880E; // 0x162C8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_HipAngle_B69F6BB544A6806C3088E5BFB64F7A08; // 0x162D0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_B69F6BB544A6806C3088E5BFB64F7A08; // 0x162D8(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_HipAngle_AA444B68423B6FAF1AB55D9935BBFB55; // 0x162E0(0x8)(BlueprintVisible, Parm, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_AA444B68423B6FAF1AB55D9935BBFB55; // 0x162E8(0x8)(Edit, ExportObject, EditFixedSize, OutParm, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_HipAngle_B4400A394EF19973C454AEAF11CE8E03; // 0x162F0(0x8)(Edit, ConstParm, EditFixedSize, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_B4400A394EF19973C454AEAF11CE8E03; // 0x162F8(0x8)(ConstParm, Net, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_HipAngle_9A6E719A4DA109EAF40589801BC190EB; // 0x16300(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_9A6E719A4DA109EAF40589801BC190EB; // 0x16308(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_HipAngle_C7E17EE541AAC42CCFCED4B04D22AE09; // 0x16310(0x8)(Edit, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_C7E17EE541AAC42CCFCED4B04D22AE09; // 0x16318(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_BoneModifier_Shoulders_45D08A224EC0F34C3819F595C9C6E59E; // 0x16320(0x8)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_BoneModifier_TorsoSize_45D08A224EC0F34C3819F595C9C6E59E; // 0x16328(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_BoneModifier_ArmLength_45D08A224EC0F34C3819F595C9C6E59E; // 0x16330(0x8)(ConstParm, BlueprintReadOnly, Parm, DisableEditOnInstance, SubobjectReference)
	bool                                         __CustomProperty_IsFemale_45D08A224EC0F34C3819F595C9C6E59E; // 0x16338(0x1)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46B9[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       __CustomProperty_HipAngle_739E073549A191D653087ABB9395AD2E; // 0x16340(0x8)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_RelativeAngle_739E073549A191D653087ABB9395AD2E; // 0x16348(0x8)(Edit, BlueprintVisible, Net, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         __CustomProperty_bUpdateInstantly_70F814824E1F2517DC3C5C9DBE08009C; // 0x16350(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         __CustomProperty_bIsLocallyControlled_70F814824E1F2517DC3C5C9DBE08009C; // 0x16351(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         __CustomProperty_bIsOnDino_70F814824E1F2517DC3C5C9DBE08009C; // 0x16352(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46BB[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       __CustomProperty_SpeedRemapped_70F814824E1F2517DC3C5C9DBE08009C; // 0x16358(0x8)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	bool                                         __CustomProperty_bProne_70F814824E1F2517DC3C5C9DBE08009C; // 0x16360(0x1)(Edit, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46BC[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       __CustomProperty_Bone_Modifiers_Leg_Length_Percentage_70F814824E1F2517DC3C5C9DBE08009C; // 0x16368(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_TraceDistanceFactorBelow_70F814824E1F2517DC3C5C9DBE08009C; // 0x16370(0x8)(EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_TraceDistanceFactorAbove_70F814824E1F2517DC3C5C9DBE08009C; // 0x16378(0x8)(BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_LegLengthHipZOffset_70F814824E1F2517DC3C5C9DBE08009C; // 0x16380(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FVector                               __CustomProperty_SmoothedLocation_70F814824E1F2517DC3C5C9DBE08009C; // 0x16388(0x18)(Edit, ConstParm, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               __CustomProperty_FPVShadowMeshOffset_70F814824E1F2517DC3C5C9DBE08009C; // 0x163A0(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	bool                                         __CustomProperty_bCrouched_70F814824E1F2517DC3C5C9DBE08009C; // 0x163B8(0x1)(ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         __CustomProperty_bFemale_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x163B9(0x1)(ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46BD[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               __CustomProperty_R_WeaponShift_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x163C0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FVector                               __CustomProperty_L_WeaponShift_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x163D8(0x18)(Edit, ConstParm, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_BoneModifier_Shoulders_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x163F0(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_BoneModifier_TorsoSize_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x163F8(0x8)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_BoneModifier_ArmLength_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x16400(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FVector                               __CustomProperty_WeaponPositionOffset_Female_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x16408(0x18)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               __CustomProperty_WeaponPositionOffset_ShortArms_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x16420(0x18)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       __CustomProperty_LeftHandIKAlpha_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x16438(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        __CustomProperty_RightHandIKAlpha_64FBF270473F88D767DBDAB5A3F1C6E0; // 0x16440(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46C0[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimInstance*                         __CustomProperty_AnimInstance_7EA4D54440723237DAFC2E8D1560D608; // 0x16448(0x8)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        PhysicsMode;                                       // 0x16450(0x1)(Edit, BlueprintReadOnly, Net, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         bSprinting;                                        // 0x16451(0x1)(ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	bool                                         bPlaySprintingAnim;                                // 0x16452(0x1)(BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         bMoving;                                           // 0x16453(0x1)(BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         bWalking;                                          // 0x16454(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46C2[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Direction;                                         // 0x16458(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       AimPitch;                                          // 0x16460(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       AimYaw;                                            // 0x16468(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       RightLeft;                                         // 0x16470(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       ForwardBack;                                       // 0x16478(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FRotator                              RootRotOffset;                                     // 0x16480(0x18)(Edit, Net, EditFixedSize, OutParm, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         bTurning;                                          // 0x16498(0x1)(Edit, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46C4[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       TurnSpeed;                                         // 0x164A0(0x8)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	bool                                         bCrouched;                                         // 0x164A8(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnInstance, SubobjectReference)
	bool                                         bProne;                                            // 0x164A9(0x1)(ExportObject, BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46C5[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RootLocOffset;                                     // 0x164B0(0x18)(ExportObject, EditFixedSize, OutParm, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	double                                       MovementAnimRate;                                  // 0x164C8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsRiding;                                         // 0x164D0(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_46C6[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequence*                         RidingAnimSeq;                                     // 0x164D8(0x8)(Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	class UAnimSequence*                         RidingMoveAnimSeq;                                 // 0x164E0(0x8)(ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       RidingDinoSpeedRatio;                              // 0x164E8(0x8)(ConstParm, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         bRidingIsDinoMoving;                               // 0x164F0(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         bBlinking;                                         // 0x164F1(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46C9[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LastTimeSwimmingDouble;                            // 0x164F8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	bool                                         bIsCarried;                                        // 0x16500(0x1)(Edit, ConstParm, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseAlternateAimOffset;                            // 0x16501(0x1)(ConstParm, Net, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_46CA[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       AimOffsetYawSpeed;                                 // 0x16508(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         bIsClimbing;                                       // 0x16510(0x1)(Edit, ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_46CB[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        ClimbingInt;                                       // 0x16514(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       MovementSpeedFastPower;                            // 0x16518(0x8)(ConstParm, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       MovementSpeedFastStartPowerRatio;                  // 0x16520(0x8)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnInstance, SubobjectReference)
	double                                       CurrentAimPitchBlend;                              // 0x16528(0x8)(Edit, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         bUseTargetingAnim;                                 // 0x16530(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         bIsTargeting;                                      // 0x16531(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableAimInProne;                                // 0x16532(0x1)(ConstParm, Net, Parm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	bool                                         bUseBallistaAimOffset;                             // 0x16533(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_46CC[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       BallistaYaw;                                       // 0x16538(0x8)(Edit, ConstParm, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	struct FVector                               LastLadderLocation;                                // 0x16540(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	class UAnimSequence*                         AlternateStandingAnimSeq;                          // 0x16558(0x8)(Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         bUseAlternateStandingAnim;                         // 0x16560(0x1)(Edit, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46CD[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequence*                         AdditiveStandingAnimSeq;                           // 0x16568(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       AdditiveLoopAnimWeight;                            // 0x16570(0x8)(ConstParm, BlueprintReadOnly, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         bUseAdditiveStandingAnim;                          // 0x16578(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46CF[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       AdditiveStandingBlendIn;                           // 0x16580(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       AdditiveStandingBlendOut;                          // 0x16588(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       AlternateStandingBlendIn;                          // 0x16590(0x8)(ConstParm, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       AlternateStandingBlendOut;                         // 0x16598(0x8)(Edit, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         bIsCarriedAsPassenger;                             // 0x165A0(0x1)(Edit, ConstParm, BlueprintVisible, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_46D0[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       AimOffsetAlpha;                                    // 0x165A8(0x8)(ExportObject, Parm, OutParm, DisableEditOnInstance, SubobjectReference)
	bool                                         bIsGliding;                                        // 0x165B0(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46D1[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequence*                         GlidingAnimSeq;                                    // 0x165B8(0x8)(Edit, ConstParm, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         bUsingMountedWeapon;                               // 0x165C0(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	bool                                         bCharacterAdditiveAnimationIsNonAdditive;          // 0x165C1(0x1)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         bUseAltBlendSpace_Falling;                         // 0x165C2(0x1)(BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	bool                                         bUseAltBlendSpace_Swimming;                        // 0x165C3(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         bHasFistsEquipped;                                 // 0x165C4(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         HasValidClimbingTarget;                            // 0x165C5(0x1)(Edit, ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46D3[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       ClimbingFallingLeftRight;                          // 0x165C8(0x8)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       ClimbingFallingForwardBack;                        // 0x165D0(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         bIsUsingGliderSuit;                                // 0x165D8(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         bIsUsingGliderSuit_Diving;                         // 0x165D9(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46D5[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GliderSuit_LeftRight;                              // 0x165E0(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	double                                       GliderSuit_UpDown;                                 // 0x165E8(0x8)(ConstParm, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       RequiredGlidingRotaitonDeltaToPlayTurnAnims;       // 0x165F0(0x8)(Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       GliderSuitTurnInterpSpeed;                         // 0x165F8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, SubobjectReference)
	struct FRotator                              GliderSuit_RemoteClientDesiredRotation;            // 0x16600(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnInstance, SubobjectReference)
	bool                                         bClimbingPickDefaultBackToFallingBlends;           // 0x16618(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46D6[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            NewEventDispatcher;                                // 0x16620(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	class UBlendSpace*                           OverrideBlendSpace;                                // 0x16630(0x8)(Edit, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class APrimalCharacter*                      PrimalChar;                                        // 0x16638(0x8)(Edit, BlueprintVisible, OutParm, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	int32                                        IdleAnimIndex;                                     // 0x16640(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        DirectionReverse;                                  // 0x16644(0x4)(Edit, ConstParm, ExportObject, Net, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        DirectionAngle;                                    // 0x16648(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        DirectionJumpAngle;                                // 0x1664C(0x4)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        DirectionJumpAngleHalf;                            // 0x16650(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	bool                                         WasMovingLastUpdate;                               // 0x16654(0x1)(Edit, ConstParm, BlueprintVisible, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46D8[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Cardinal_Direction_Dead_Zone;                      // 0x16658(0x8)(Edit, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FRotator                              ActorWorldRotation;                                // 0x16660(0x18)(EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               ActorVelocity;                                     // 0x16678(0x18)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	enum class E_CardinalDirection4              CurrentCardinalDirectionNoOffset;                  // 0x16690(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46D9[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnimStruct_CardinalDirection4        Current_MoveCardinalAnims;                         // 0x16698(0x20)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       DirectionAngleWithCardinalOffset;                  // 0x166B8(0x8)(Edit, BlueprintVisible, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FVector                               LocalVelocity;                                     // 0x166C0(0x18)(Edit, ConstParm, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               Direction2D;                                       // 0x166D8(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       MovementStrideScale;                               // 0x166F0(0x8)(Edit, EditFixedSize, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       MovementWithStrideWarpPlayRate;                    // 0x166F8(0x8)(ConstParm, ExportObject, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       StrideWarpingRatio;                                // 0x16700(0x8)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FAnimStruct_CardinalDirection4        MoveForwardsCardinalAnims;                         // 0x16708(0x20)(Edit, ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FAnimStruct_CardinalDirection4        MoveBackwardsCardinalAnims;                        // 0x16728(0x20)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FAnimStruct_CardinalDirection4        Current_WalkCardinalAnims;                         // 0x16748(0x20)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FAnimStruct_CardinalDirection4        WalkForwardsCardinalAnims;                         // 0x16768(0x20)(BlueprintVisible, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	struct FAnimStruct_CardinalDirection4        WalkBackwardsCardinalAnims;                        // 0x16788(0x20)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	struct FAnimStruct_CardinalDirection4        CrouchForwardsCardinalAnims;                       // 0x167A8(0x20)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FAnimStruct_CardinalDirection4        CrouchBackwardsCardinalAnims;                      // 0x167C8(0x20)(ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	class UAnimSequence*                         SprintFwdAnim;                                     // 0x167E8(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       MinSprintSpeed;                                    // 0x167F0(0x8)(BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnInstance, SubobjectReference)
	double                                       LeftHandIKAlpha;                                   // 0x167F8(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       LastAimYawOffset;                                  // 0x16800(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       ScreenRightSide_AimingLeft_AimYawOffset;           // 0x16808(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       ScreenRightSide_AimingRight_AimYawOffset;          // 0x16810(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	double                                       ScreenRightSide_AimingLeft_AimYawFactor;           // 0x16818(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       ScreenRightSide_AimingRight_AimYawFactor;          // 0x16820(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       ScreenLeftSide_AimingLeft_AimYawFactor;            // 0x16828(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	double                                       ScreenLeftSide_AimingRight_AimYawFactor;           // 0x16830(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       ScreenLeftSide_AimingRight_AimYawOffset;           // 0x16838(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       ScreenLeftSide_AimingLeft_AimYawOffset;            // 0x16840(0x8)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        RightHandIKAlpha;                                  // 0x16848(0x4)(Edit, Net, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46DC[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       MovementAnimRateCrouching;                         // 0x16850(0x8)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       MovementAnimRateStanding;                          // 0x16858(0x8)(Edit, Net, OutParm, DisableEditOnInstance, SubobjectReference)
	struct FVector                               WorldAcceleration2D;                               // 0x16860(0x18)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FVector                               LocalAcceleration2D;                               // 0x16878(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         HasAcceleration;                                   // 0x16890(0x1)(ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46DF[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnimStruct_CardinalDirection4        StopCardinalAnims;                                 // 0x16898(0x20)(ExportObject, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	class FName                                  Locomotion_Distance_Curve_Name;                    // 0x168B8(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	class UAnimSequenceBase*                     WeaponIdleBase;                                    // 0x168C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        StoppingState_RightHandLayerAlpha;                 // 0x168C8(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         DisableLHandIK;                                    // 0x168CC(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, SubobjectReference)
	bool                                         DisableRHandIK;                                    // 0x168CD(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, SubobjectReference)
	bool                                         StrideWarpingAffectsArms;                          // 0x168CE(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46E2[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Layering_L_Arm_Add;                                // 0x168D0(0x8)(Edit, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       Layering_L_Arm;                                    // 0x168D8(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       Layering_R_Arm_Add;                                // 0x168E0(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       Layering_R_Arm;                                    // 0x168E8(0x8)(ConstParm, Net, EditFixedSize, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	class UAnimSequenceBase*                     WeaponSwimmingIdleBase;                            // 0x168F0(0x8)(ExportObject, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	enum class EMovementMode                     CurrentMovementMode;                               // 0x168F8(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         AltAimLayering;                                    // 0x168F9(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46E4[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Layering_Spine_Add;                                // 0x16900(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	double                                       Layering_Spine;                                    // 0x16908(0x8)(Edit, ConstParm, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       Layering_Head_Add;                                 // 0x16910(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       Layering_Head;                                     // 0x16918(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        StoppingState_LeftHandLayerAlpha;                  // 0x16920(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46E8[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Layering_R_Hand_Add;                               // 0x16928(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       Layering_R_Hand;                                   // 0x16930(0x8)(BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       Layering_L_Hand_Add;                               // 0x16938(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnInstance, SubobjectReference)
	double                                       Layering_L_Hand;                                   // 0x16940(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       Layering_Pelvis;                                   // 0x16948(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       Layering_Legs;                                     // 0x16950(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	class UAnimSequenceBase*                     CrouchIdleBase;                                    // 0x16958(0x8)(ConstParm, Net, EditFixedSize, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         Layering_L_Hand_MeshSpaceRot;                      // 0x16960(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	bool                                         Layering_R_Hand_MeshSpaceRot;                      // 0x16961(0x1)(ExportObject, Parm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46EA[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     OverridePose;                                      // 0x16968(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	class UAnimSequenceBase*                     RightFingerOverride;                               // 0x16970(0x8)(BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnInstance, SubobjectReference)
	bool                                         UseLeftFingerOverride;                             // 0x16978(0x1)(ConstParm, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         UseRightFingerOverride;                            // 0x16979(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46ED[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     LeftFingerOverride;                                // 0x16980(0x8)(Edit, Net, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	class UAnimSequenceBase*                     NormalIdle;                                        // 0x16988(0x8)(ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         bEnableAnimationGroundConforming;                  // 0x16990(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         EnableInAirLayering;                               // 0x16991(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         UseOverridePoseLayering;                           // 0x16992(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46F1[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector2D                             LeanAmountSmoothed;                                // 0x16998(0x10)(ExportObject, Net, Parm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               LocalVelocityLastFrame;                            // 0x169A8(0x18)(BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FVector                               LocalDerivedAcceleration;                          // 0x169C0(0x18)(ConstParm, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FVector                               LocationLastFrame;                                 // 0x169D8(0x18)(ConstParm, Net, Parm, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               CurrentLeaningSpringPosition;                      // 0x169F0(0x18)(Edit, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FRotator                              CurrentLeaningSpringRotation;                      // 0x16A08(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               SpringTarget;                                      // 0x16A20(0x18)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector2D                             Diff2D;                                            // 0x16A38(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       SpeedLeaningModifier;                              // 0x16A48(0x8)(Edit, BlueprintReadOnly, EditFixedSize, DisableEditOnInstance, SubobjectReference)
	double                                       VelocityY_Smoothed;                                // 0x16A50(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               SpringDelta;                                       // 0x16A58(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FVector                               SpringDeltaAcceleration;                           // 0x16A70(0x18)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       CurrentAccel;                                      // 0x16A88(0x8)(Edit, ConstParm, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         bActivatePoseLayering;                             // 0x16A90(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         PoseLayeringLeft;                                  // 0x16A91(0x1)(Edit, ConstParm, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46F5[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpeedLastFrame;                                    // 0x16A98(0x8)(Edit, ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	TArray<struct FFoot_Locking_IK>              FootLockingIKElements;                             // 0x16AA0(0x10)(BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	struct FVector                               Mesh_Location_Smoothed;                            // 0x16AB0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46F6[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            FootTransformL;                                    // 0x16AD0(0x60)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FTransform                            FootTransformR;                                    // 0x16B30(0x60)(Net, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       HipZOffset;                                        // 0x16B90(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FVector                               HipOffset;                                         // 0x16B98(0x18)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               KneePV_L;                                          // 0x16BB0(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnInstance, SubobjectReference)
	struct FVector                               KneePV_R;                                          // 0x16BC8(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnInstance, SubobjectReference)
	TMap<enum class EMovementMode, double>       InterpSpeedForMovementMode;                        // 0x16BE0(0x50)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	enum class EMovementMode                     CurrentMovementModeLastFrame;                      // 0x16C30(0x1)(Edit, BlueprintReadOnly, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46FA[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LandedTimer;                                       // 0x16C38(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnInstance, SubobjectReference)
	double                                       FootIKAlpha;                                       // 0x16C40(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	bool                                         UseCrouchPoseLayering;                             // 0x16C48(0x1)(Edit, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46FC[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        FootIKRotationAlpha;                               // 0x16C4C(0x4)(Edit, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         UsePoseLayeringDuringTargeting;                    // 0x16C50(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46FD[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     OverridePoseAlt;                                   // 0x16C58(0x8)(Edit, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         UseOverridePoseAlt;                                // 0x16C60(0x1)(Edit, Net, OutParm, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_46FE[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     CrouchOverridePoseAlt;                             // 0x16C68(0x8)(Edit, ConstParm, BlueprintVisible, Net, ReturnParm, DisableEditOnInstance, SubobjectReference)
	class UAnimSequenceBase*                     CrouchOverridePose;                                // 0x16C70(0x8)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         ForceAltAimFromWeaponAnimBP;                       // 0x16C78(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_4700[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequenceBase*                     SprintOverridePose;                                // 0x16C80(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         EnableRidingLayering;                              // 0x16C88(0x1)(ConstParm, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_4701[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       InterpLayeringSpineAdd;                            // 0x16C90(0x8)(Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       InterpLayeringSpine;                               // 0x16C98(0x8)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       InterpLayeringHeadAdd;                             // 0x16CA0(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       InterpLayeringHead;                                // 0x16CA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       InterpLayeringR_ArmAdd;                            // 0x16CB0(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       InterpLayeringR_Arm;                               // 0x16CB8(0x8)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       InterpLayeringR_HandAdd;                           // 0x16CC0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       InterpLayeringR_Hand;                              // 0x16CC8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       InterpLayeringL_HandAdd;                           // 0x16CD0(0x8)(Edit, ConstParm, ExportObject, Parm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	double                                       InterpLayeringL_Hand;                              // 0x16CD8(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       InterpLayeringL_ArmAdd;                            // 0x16CE0(0x8)(ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       InterpLayeringL_Arm;                               // 0x16CE8(0x8)(ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       LayeringInterpSpeed;                               // 0x16CF0(0x8)(ConstParm, BlueprintVisible, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConformLinked;                               // 0x16CF8(0x1)(ConstParm, BlueprintVisible, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_4705[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                GroundConfromAnimationInstance;                    // 0x16D00(0x8)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	float                                        DirectionAngleHip;                                 // 0x16D08(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_4706[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       DirectionAngleN;                                   // 0x16D10(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       DirectionAngleE;                                   // 0x16D18(0x8)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       DirectionAngleS;                                   // 0x16D20(0x8)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       DirectionAngleW;                                   // 0x16D28(0x8)(BlueprintVisible, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       DirectionAngleNHip;                                // 0x16D30(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnInstance, SubobjectReference)
	double                                       DirectionAngleEHip;                                // 0x16D38(0x8)(ConstParm, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       DirectionAngleSHip;                                // 0x16D40(0x8)(ConstParm, BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       DirectionAngleWHip;                                // 0x16D48(0x8)(Edit, ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	float                                        HipRotationFactorN;                                // 0x16D50(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        HipRotationFactorE;                                // 0x16D54(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	float                                        HipRotationFactorS;                                // 0x16D58(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	float                                        HipRotationFactorW;                                // 0x16D5C(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	double                                       DirectionAngleInterpSpeed;                         // 0x16D60(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnInstance, SubobjectReference)
	double                                       DirectionAngleHipInterpSpeed;                      // 0x16D68(0x8)(ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	bool                                         bIsSeated;                                         // 0x16D70(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_4707[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       CurrentIKTraceDistanceFactor;                      // 0x16D78(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       HipZOffsetLimit;                                   // 0x16D80(0x8)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	double                                       HipZOffsetLimit_Crouched;                          // 0x16D88(0x8)(ConstParm, ExportObject, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       CurrentZOffsetLimit;                               // 0x16D90(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         PlayFullBodyIdle;                                  // 0x16D98(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, DisableEditOnInstance, SubobjectReference)
	bool                                         PoseLayerCurveActive;                              // 0x16D99(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_470A[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FPVShadowMeshOffset_LastFrame;                     // 0x16DA0(0x18)(ConstParm, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	class UAnimSequenceBase*                     FallingAnimBase;                                   // 0x16DB8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         bDebugLeaning;                                     // 0x16DC0(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         PoseLayering_AltValue01;                           // 0x16DC1(0x1)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         PoseLayering_AltValue02;                           // 0x16DC2(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         PoseLayering_AltValue03;                           // 0x16DC3(0x1)(ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         PoseLayering_Eat;                                  // 0x16DC4(0x1)(BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         PoseLayering_Harvest;                              // 0x16DC5(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_470B[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        InterpOverrideLayeringSpineAdd;                    // 0x16DC8(0x4)(Edit, BlueprintVisible, EditFixedSize, Parm, DisableEditOnInstance, SubobjectReference)
	float                                        InterpOverrideL_Hand;                              // 0x16DCC(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        InterpOverrideL_Arm;                               // 0x16DD0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        InterpOverrideR_Hand;                              // 0x16DD4(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	float                                        InterpOverrideL_ArmAdd;                            // 0x16DD8(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        InterpOverrideL_HandAdd;                           // 0x16DDC(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        InterpOverrideR_HandAdd;                           // 0x16DE0(0x4)(Edit, ConstParm, ExportObject, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        InterpOverrideSpine;                               // 0x16DE4(0x4)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        InterpOverrideHead;                                // 0x16DE8(0x4)(ConstParm, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        InterpOverrideHeadAdd;                             // 0x16DEC(0x4)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, DisableEditOnInstance, SubobjectReference)
	float                                        InterpOverrideR_Arm;                               // 0x16DF0(0x4)(ExportObject, Net, OutParm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	float                                        InterpOverrideR_ArmAdd;                            // 0x16DF4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       OverrideSpineAdd;                                  // 0x16DF8(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       OverrideSpine;                                     // 0x16E00(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       OverrideHeadAdd;                                   // 0x16E08(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       OverrideHead;                                      // 0x16E10(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       OverrideR_ArmAdd;                                  // 0x16E18(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       OverrideR_Arm;                                     // 0x16E20(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       OverrideR_HandAdd;                                 // 0x16E28(0x8)(Edit, BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       OverrideR_Hand;                                    // 0x16E30(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	double                                       OverrideL_HandAdd;                                 // 0x16E38(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnInstance, SubobjectReference)
	double                                       OverrideL_Hand;                                    // 0x16E40(0x8)(ConstParm, BlueprintVisible, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       OverrideL_ArmAdd;                                  // 0x16E48(0x8)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       OverrideL_Arm;                                     // 0x16E50(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         OverrideL_HandMeshSpaceRot;                        // 0x16E58(0x1)(BlueprintVisible, EditFixedSize, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         OverrideR_HandMeshSpaceRot;                        // 0x16E59(0x1)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_470C[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimSequence*                         DefaultShieldAnimation;                            // 0x16E60(0x8)(ConstParm, ExportObject, Net, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	bool                                         IsUsingShield;                                     // 0x16E68(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig)
	bool                                         PoseLayeringShield;                                // 0x16E69(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         EnableFullBodyIdleLayering;                        // 0x16E6A(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_470D[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       TurnSpeedInterpolated;                             // 0x16E70(0x8)(Edit, BlueprintReadOnly, EditFixedSize, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         Is_Female;                                         // 0x16E78(0x1)(ConstParm, Net, Parm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_470E[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FPVShadowMeshOffset;                               // 0x16E80(0x18)(Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       LegLengthHipZOffset;                               // 0x16E98(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       TraceDistanceFactorAbove;                          // 0x16EA0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       TraceDistanceFactorBelow;                          // 0x16EA8(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnInstance, SubobjectReference)
	float                                        Bone_Modifiers_Leg_Length_Percentage;              // 0x16EB0(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_4710[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpeedRemapped;                                     // 0x16EB8(0x8)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         bIsOnDino;                                         // 0x16EC0(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnInstance, SubobjectReference)
	bool                                         bIsLocallyControlled;                              // 0x16EC1(0x1)(Edit, ConstParm, BlueprintVisible, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_4711[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        Bone_Modifier_Arm_Length;                          // 0x16EC4(0x4)(Edit, ExportObject, EditFixedSize, Parm, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        Bone_Modifier_Shoulders;                           // 0x16EC8(0x4)(BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        Bone_Modifier_Torso_Size;                          // 0x16ECC(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        Bone_Modifier_Torso;                               // 0x16ED0(0x4)(ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	float                                        Bone_Modifier_Chest;                               // 0x16ED4(0x4)(ExportObject, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FVector                               WeaponPositionOffset_ShortArms;                    // 0x16ED8(0x18)(Edit, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        CharacterCreator_OverallFat;                       // 0x16EF0(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        CharacterCreator_Fat01Chest;                       // 0x16EF4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	class UAnimSequenceBase*                     RefPose_ProneIdle;                                 // 0x16EF8(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class UAnimSequenceBase*                     RefPose_ProneFwd;                                  // 0x16F00(0x8)(Edit, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        CharacterCreator_Fat01Belly;                       // 0x16F08(0x4)(ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	bool                                         PoseLayeringThrowItem;                             // 0x16F0C(0x1)(BlueprintVisible, OutParm, DisableEditOnInstance, SubobjectReference)
	bool                                         PoseLayering_Melee;                                // 0x16F0D(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_4715[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              RootRotOffset_Interpolated;                        // 0x16F10(0x18)(ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       ItemBasedPhysicsFactor_Belly;                      // 0x16F28(0x8)(ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	double                                       ItemBasedPhysicsFactor_Breast;                     // 0x16F30(0x8)(ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         PoseLayering_Emote;                                // 0x16F38(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         IsSitting;                                         // 0x16F39(0x1)(BlueprintVisible, Parm, OutParm, Transient, Config, GlobalConfig)
	uint8                                        Pad_4717[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        PL_EmoteRightArm;                                  // 0x16F3C(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	float                                        PL_EmoteLeftArm;                                   // 0x16F40(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        PL_EmoteSpine;                                     // 0x16F44(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         PoseLayering_DisableProne;                         // 0x16F48(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_4718[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               L_Weapon_Shift;                                    // 0x16F50(0x18)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FVector                               R_Weapon_Shift;                                    // 0x16F68(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnInstance, SubobjectReference)
	class UAnimMontage*                          StepMontageToPlay;                                 // 0x16F80(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         IsOnSeatingStructure;                              // 0x16F88(0x1)(Net, OutParm, Transient, Config, GlobalConfig)
	uint8                                        Pad_471A[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnimStruct_CardinalDirection4        Current_CrouchCardinalAnims;                       // 0x16F90(0x20)(ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         DisableBlink;                                      // 0x16FB0(0x1)(BlueprintVisible, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_471C[0x3];                                     // Fixing Size After Last Property  > TateDumper <
