#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x80 (0x80 - 0x0)
// UserDefinedStruct CharacterStatusReplicatedBinoculars.CharacterStatusReplicatedBinoculars
struct FCharacterStatusReplicatedBinoculars
{
public:
	double                                       CurrentFood_2_DC19EC034FDA37A721EED0B6ABB3E033;    // 0x0(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	double                                       MaxFood_4_A5F4CBDF4439E8A0FBD88A97887CC0E7;        // 0x8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Config, InstancedReference, SubobjectReference)
	double                                       CurrentOxygen_6_ED78AD80404584553795B181953A9E24;  // 0x10(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	double                                       MaxOxygen_8_8C5113464079DCCEBBF150B3B3508FA9;      // 0x18(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Config, InstancedReference, SubobjectReference)
	double                                       CurrentStamina_10_8264A562485F6EE7FA3AA4967FA66581; // 0x20(0x8)(Edit, ConstParm, ExportObject, Config, InstancedReference, SubobjectReference)
	double                                       MaxStamina_12_809881BE4D89FF2D364288BF107D01CE;    // 0x28(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, Config, InstancedReference, SubobjectReference)
	double                                       CurrentWeight_14_DACD05BF45974965209F818EE88F10B7; // 0x30(0x8)(Edit, BlueprintVisible, Net, Config, InstancedReference, SubobjectReference)
	double                                       MaxWeight_16_0FA5802B4EF85950C2E8C5A90B56BE38;     // 0x38(0x8)(BlueprintVisible, Parm, Config, InstancedReference, SubobjectReference)
	double                                       MeleeDamage_18_EE908D7D4D1C2F664DE9FAB35B83616B;   // 0x40(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, Config, InstancedReference, SubobjectReference)
	double                                       MovementSpeed_20_E8405D474EDF76F279B1AAAB93A7BC7C; // 0x48(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, Config, InstancedReference, SubobjectReference)
	TArray<int32>                                StatPoints_24_F8D836C54208A73A1339E2BC104314D2;    // 0x50(0x10)(Edit, ExportObject, Net, EditFixedSize, Parm, Config, InstancedReference, SubobjectReference)
	TArray<int32>                                MutationPoints_28_EB803ADA4F695A6105C3398CF58EA668; // 0x60(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, Config, InstancedReference, SubobjectReference)
	TArray<int32>                                TamedPoints_30_37BF8933471D08E002A8E9BDFA7EB52C;   // 0x70(0x10)(Edit, OutParm, Config, InstancedReference, SubobjectReference)
};

}


