#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x28 (0x28 - 0x0)
// UserDefinedStruct CheatMenuCharacterLevelPreset.CheatMenuCharacterLevelPreset
struct FCheatMenuCharacterLevelPreset
{
public:
	int32                                        Health_26_40BA064949D04009F4EDE6B691429244;        // 0x0(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        Stamina_27_43095B7C4594FAE14282FD9C5F803BE8;       // 0x4(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        Oxygen_28_361A7B8D4B2C5644AF9B86810AC7CBE5;        // 0x8(0x4)(BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        Food_29_95E111A0466750571A4BFCAA1AD55452;          // 0xC(0x4)(ConstParm, ExportObject, Net, Parm, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        Water_30_A2FDE21F4D5328FE13F053BA81B6886B;         // 0x10(0x4)(ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        Weight_32_6A2632EF407DC497E90E1BB13F706D6D;        // 0x14(0x4)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        MeleeDamage_34_0154D54F4AF987F3E0DD4A904F748D84;   // 0x18(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        SpeedMultiplier_37_8759B7E8486AB1486B2BDAAA9AB0105F; // 0x1C(0x4)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        Fortitude_38_0AECC841420431E3310D30851E829F60;     // 0x20(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        CraftingSpeed_40_0C115CE04B84E83C9439B680D40FCB12; // 0x24(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
};

}


