#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x431 (0xEA9 - 0xA78)
// WidgetBlueprintGeneratedClass CheatMenu.CheatMenu_C
class UCheatMenu_C : public UUI_DebugSpawnMenu
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xA78(0x8)(BlueprintVisible, ExportObject, EditFixedSize, DisableEditOnInstance, SubobjectReference)
	class UCheckBox*                             BabyCheck;                                         // 0xA80(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, EditConst, SubobjectReference)
	class UCheckBox*                             BlueprintCheckBox;                                 // 0xA88(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, Transient, EditConst, SubobjectReference)
	class UCanvasPanel*                          CharacterPresetOptions;                            // 0xA90(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class UCanvasPanel*                          CheatOptions;                                      // 0xA98(0x8)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class UEditableTextBox*                      CheatStringAddition;                               // 0xAA0(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	class UButton*                               ClearFilterButton;                                 // 0xAA8(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	class UButton*                               CloseButton;                                       // 0xAB0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, Config, GlobalConfig, InstancedReference, SubobjectReference)
	class UCheckBox*                             DebugTouchCheck;                                   // 0xAB8(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class UCanvasPanel*                          DebugView;                                         // 0xAC0(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	class UDataListPanel*                        DinoList;                                          // 0xAC8(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class UCanvasPanel*                          DinoOptions;                                       // 0xAD0(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class UEditableTextBox*                      DinoSpawnLevelBox;                                 // 0xAD8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	class UCanvasPanel*                          EggOptions;                                        // 0xAE0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	class UCheckBox*                             EngramCheckBox;                                    // 0xAE8(0x8)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	class UCheckBox*                             FemaleCheck;                                       // 0xAF0(0x8)(Edit, EditFixedSize, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	class UCheckBox*                             FertilizedCheckBox;                                // 0xAF8(0x8)(ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	class UCanvasPanel*                          FilterPanel;                                       // 0xB00(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class UImage*                                Image;                                             // 0xB08(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance)
	class UImage*                                Image_4;                                           // 0xB10(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, RepNotify, NonTransactional)
	class UImage*                                Image_48;                                          // 0xB18(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, RepNotify, NoDestructor)
	class UImage*                                Image_97;                                          // 0xB20(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, Interp, AutoWeak)
	class UCheckBox*                             IncludeItemsCheck;                                 // 0xB28(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, Transient, EditConst, SubobjectReference)
	class UCanvasPanel*                          ItemOptions;                                       // 0xB30(0x8)(Edit, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	class UCheckBox*                             MaleCheck;                                         // 0xB38(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	class UEditableTextBox*                      NamesFilterInputField;                             // 0xB40(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class UEditableTextBox*                      NumberEggsToSpawn;                                 // 0xB48(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	class UEditableTextBox*                      NumToSpawnTextBox;                                 // 0xB50(0x8)(ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	class UEditableTextBox*                      QualityToSpawnTextBox;                             // 0xB58(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	class UTextBlock*                            ReferenceText;                                     // 0xB60(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class UCheckBox*                             SaddleCheck;                                       // 0xB68(0x8)(Edit, Net, Parm, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	class UCheckBox*                             TameCheck;                                         // 0xB70(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	class UButton*                               ToDinosButton;                                     // 0xB78(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, Config, EditConst, SubobjectReference)
	int32                                        ScreenTracker;                                     // 0xB80(0x4)(ExportObject, Net, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_3BCF[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class FText>                          FolderNames;                                       // 0xB88(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class UUI_DebugSpawnMenuEntry*>       DebugEntries;                                      // 0xB98(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<class FString>                        DinoNames;                                         // 0xBA8(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<class FString>                        DinoEggNames;                                      // 0xBB8(0x10)(BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class FString>                        CheatNames;                                        // 0xBC8(0x10)(BlueprintVisible, Net, Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	TArray<class FString>                        CheatStrings;                                      // 0xBD8(0x10)(ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class FString>                        CharacterPresetStrings;                            // 0xBE8(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<struct FCheatMenuCharacterLevelPreset> CharacterPresetLevel;                              // 0xBF8(0x10)(ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<class FString>                        ScorchedEarthDinoNames;                            // 0xC08(0x10)(ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<enum class ECheatMenuOptionTypes>     OptionTypes;                                       // 0xC18(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	TArray<class FString>                        ScorchedEarthEggNames;                             // 0xC28(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	TArray<struct FCheatMapJumpInfo>             IslandMapJumpInfos;                                // 0xC38(0x10)(Edit, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class FString>                        MapOpenCheats;                                     // 0xC48(0x10)(Edit, BlueprintVisible, ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class FString>                        OpenMapNames;                                      // 0xC58(0x10)(Net, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<struct FCheatMapJumpInfo>             SE_MapJumpInfos;                                   // 0xC68(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<class FString>                        ReferenceTexts;                                    // 0xC78(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FCheatMapJumpInfo>             CenterMapJumpInfos;                                // 0xC88(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FCheatMapJumpInfo>             AberrationMapJumpInfos;                            // 0xC98(0x10)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	TArray<struct FCheatMapJumpInfo>             RagnarokMapJumpInfos;                              // 0xCA8(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	TArray<struct FCheatMapJumpInfo>             ExtinctionMapJumpInfos;                            // 0xCB8(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FCheatMapJumpInfo>             ValgueroMapJumpInfos;                              // 0xCC8(0x10)(ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FCheatMapJumpInfo>             CrystalIslesMapJumpInfos;                          // 0xCD8(0x10)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	TArray<struct FCheatMapJumpInfo>             GenesisMapJumpInfos;                               // 0xCE8(0x10)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FCheatMapJumpInfo>             Gen2MapJumpInfos;                                  // 0xCF8(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	TArray<struct FCheatMapJumpInfo>             LostIslandMapJumpInfos;                            // 0xD08(0x10)(ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	TArray<bool>                                 CheatConfirmation;                                 // 0xD18(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class FString>                        IslandBossStrings;                                 // 0xD28(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class FString>                        IslandBossCheats;                                  // 0xD38(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<class FString>                        SEBossCheats;                                      // 0xD48(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class FString>                        SEBossStrings;                                     // 0xD58(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<class FString>                        AberrationBossStrings;                             // 0xD68(0x10)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Config, EditConst, SubobjectReference)
	TArray<class FString>                        AberrationBossCheats;                              // 0xD78(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class FString>                        ExtinctionBossCheats;                              // 0xD88(0x10)(Edit, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class FString>                        ExtinctionBossStrings;                             // 0xD98(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class FString>                        CenterBossCheats;                                  // 0xDA8(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	TArray<class FString>                        CenterBossStrings;                                 // 0xDB8(0x10)(ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<class FString>                        RagnarokBossCheats;                                // 0xDC8(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class FString>                        RagnarokBossStrings;                               // 0xDD8(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class FString>                        ValgueroBossCheats;                                // 0xDE8(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	TArray<class FString>                        ValgueroBossStrings;                               // 0xDF8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class FString>                        AberrationUniqueDinoNames;                         // 0xE08(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<class FString>                        AberrantDinoNames;                                 // 0xE18(0x10)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	TArray<class FString>                        Community_Dino_Names;                              // 0xE28(0x10)(Edit, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<class FString>                        ExtinctionDinoNames;                               // 0xE38(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class FString>                        ExtinctionCorruptDinoNames;                        // 0xE48(0x10)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	TArray<bool>                                 OptionsIsEngram;                                   // 0xE58(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<int32>                                OptionsQuantity;                                   // 0xE68(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class FString>                        ExtionctionEggNames;                               // 0xE78(0x10)(ConstParm, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<class FString>                        EventDinoNames;                                    // 0xE88(0x10)(Edit, ConstParm, BlueprintVisible, Net, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FString                                FilterName;                                        // 0xE98(0x10)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         IgnoreFilterChange;                                // 0xEA8(0x1)(ExportObject, EditFixedSize, DisableEditOnTemplate, Config, EditConst, SubobjectReference)

	static class UClass* StaticClass();
	static class UCheatMenu_C* GetDefaultObj();

	bool BPEscapeClosed(class AShooterHUD** CallFunc_GetShooterHUD_ReturnValue, bool CallFunc_CloseSpawnMenu_ReturnValue);
	void ClearFilter(bool* ShouldRefresh);
	bool GetBossSpawnArray(const TArray<class FString>& BossNames, const TArray<class FString>& BossCheats, class UWorld** CallFunc_GetGameWorld_ReturnValue);
	void CloseMenu(class AShooterHUD** CallFunc_GetShooterHUD_ReturnValue, bool CallFunc_CloseSpawnMenu_ReturnValue);
	bool GetMapOpenListsForEntry(const TArray<class FString>& CheatStrings, bool Success);
	class UCheatMenuMapOpenButton_C* CreateMapOpenButton(class FString* Name, class FText CallFunc_Conv_StringToText_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue);
