#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x28 - 0x28)
// Class Engine.PrimalReplicationDriver
class UPrimalReplicationDriver : public UObject
{
public:

	static class UClass* StaticClass();
	static class UPrimalReplicationDriver* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.ReplicationDriver
class UReplicationDriver : public UPrimalReplicationDriver
{
public:

	static class UClass* StaticClass();
	static class UReplicationDriver* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.ReplicationConnectionDriver
class UReplicationConnectionDriver : public UObject
{
public:

	static class UClass* StaticClass();
	static class UReplicationConnectionDriver* GetDefaultObj();

};

// 0x208 (0x230 - 0x28)
// Class Engine.PrimalActor
class UPrimalActor : public UObject
{
public:
	uint8                                        Pad_1A4[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        BitPad_3 : 7;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bPreventSaving : 1;                                // Mask: 0x80, PropSize: 0x10x30(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bEnableMultiUse : 1;                               // Mask: 0x1, PropSize: 0x10x31(0x1)(ConstParm, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bBlueprintMultiUseEntries : 1;                     // Mask: 0x2, PropSize: 0x10x31(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_5 : 6;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1A8[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bUseCanMoveThroughActor : 1;                       // Mask: 0x1, PropSize: 0x10x34(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBPFilterMultiUseEntries : 1;                   // Mask: 0x2, PropSize: 0x10x34(0x1)(OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_6 : 6;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1AA[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bUseBPGetMultiUseCenterText : 1;                   // Mask: 0x1, PropSize: 0x10x38(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bMultiUseCenterHUD : 1;                            // Mask: 0x2, PropSize: 0x10x38(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseNetworkSpatialization : 1;                     // Mask: 0x4, PropSize: 0x10x38(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bNetworkSpatializationForceRelevancyCheck : 1;     // Mask: 0x8, PropSize: 0x10x38(0x1)(Edit, ConstParm, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bNetUseClientRelevancy : 1;                        // Mask: 0x10, PropSize: 0x10x38(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAttachmentReplicationUseNetworkParent : 1;        // Mask: 0x20, PropSize: 0x10x38(0x1)(Edit, ConstParm, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBPChangedActorTeam : 1;                        // Mask: 0x40, PropSize: 0x10x38(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bForceNetworkSpatialization : 1;                   // Mask: 0x80, PropSize: 0x10x38(0x1)(ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bForcedHudDrawingRequiresSameTeam : 1;             // Mask: 0x1, PropSize: 0x10x39(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsMapActor : 1;                                   // Mask: 0x2, PropSize: 0x10x39(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseOnlyPointForLevelBounds : 1;                   // Mask: 0x4, PropSize: 0x10x39(0x1)(Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBPCheckForErrors : 1;                          // Mask: 0x8, PropSize: 0x10x39(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bHasHighVolumeRPCs : 1;                            // Mask: 0x10, PropSize: 0x10x39(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAutoStasis : 1;                                   // Mask: 0x20, PropSize: 0x10x39(0x1)(BlueprintVisible, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bClimbable : 1;                                    // Mask: 0x40, PropSize: 0x10x39(0x1)(Net, EditFixedSize, Parm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_7 : 1;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1BF[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bUseBPDrawEntry : 1;                               // Mask: 0x1, PropSize: 0x10x3C(0x1)(ConstParm, ExportObject, Net, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_8 : 7;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1C0[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bPreventCliffPlatforms : 1;                        // Mask: 0x1, PropSize: 0x10x40(0x1)(ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBPOverrideUILocation : 1;                      // Mask: 0x2, PropSize: 0x10x40(0x1)(Edit, ConstParm, ExportObject, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bStasised : 1;                                     // Mask: 0x4, PropSize: 0x10x40(0x1)(Edit, BlueprintVisible, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventActorStasis : 1;                           // Mask: 0x8, PropSize: 0x10x40(0x1)(ConstParm, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBPGetBonesToHideOnAllocation : 1;              // Mask: 0x10, PropSize: 0x10x40(0x1)(Edit, ExportObject, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bReplicateHidden : 1;                              // Mask: 0x20, PropSize: 0x10x40(0x1)(ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_9 : 1;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bHibernateChange : 1;                              // Mask: 0x80, PropSize: 0x10x40(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bSavedWhenStasised : 1;                            // Mask: 0x1, PropSize: 0x10x41(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bLoadedFromSaveGame : 1;                           // Mask: 0x2, PropSize: 0x10x41(0x1)(ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventCharacterBasing : 1;                       // Mask: 0x4, PropSize: 0x10x41(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bPreventCharacterBasingAllowSteppingUp : 1;        // Mask: 0x8, PropSize: 0x10x41(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIgnoreNetworkRangeScaling : 1;                    // Mask: 0x10, PropSize: 0x10x41(0x1)(EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_A : 3;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1C5[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bForceReplicateDormantChildrenWithoutSpatialRelevancy : 1; // Mask: 0x1, PropSize: 0x10x44(0x1)(BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_B : 7;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1C7[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bForcePreventSeamlessTravel : 1;                   // Mask: 0x1, PropSize: 0x10x48(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventLevelBoundsRelevant : 1;                   // Mask: 0x2, PropSize: 0x10x48(0x1)(ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBPInventoryItemUsed : 1;                       // Mask: 0x4, PropSize: 0x10x48(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBPInventoryItemDropped : 1;                    // Mask: 0x8, PropSize: 0x10x48(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBPOverrideTargetingLocation : 1;               // Mask: 0x10, PropSize: 0x10x48(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bForceAllowNetMulticast : 1;                       // Mask: 0x20, PropSize: 0x10x48(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bBPInventoryItemUsedHandlesDurability : 1;         // Mask: 0x40, PropSize: 0x10x48(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBPForceAllowsInventoryUse : 1;                 // Mask: 0x80, PropSize: 0x10x48(0x1)(Edit, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAlwaysRelevantPrimalStructure : 1;                // Mask: 0x1, PropSize: 0x10x49(0x1)(Edit, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventNPCSpawnFloor : 1;                         // Mask: 0x2, PropSize: 0x10x49(0x1)(Edit, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bForceHiddenReplication : 1;                       // Mask: 0x4, PropSize: 0x10x49(0x1)(OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bNetCritical : 1;                                  // Mask: 0x8, PropSize: 0x10x49(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOnlyReplicateOnNetForcedUpdate : 1;               // Mask: 0x10, PropSize: 0x10x49(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventRegularForceNetUpdate : 1;                 // Mask: 0x20, PropSize: 0x10x49(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOnlyInitialReplication : 1;                       // Mask: 0x40, PropSize: 0x10x49(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bPreventOnDedicatedServer : 1;                     // Mask: 0x80, PropSize: 0x10x49(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bUseAttachmentReplication : 1;                     // Mask: 0x1, PropSize: 0x10x4A(0x1)(Edit, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bStasisComponentRadiusForceDistanceCheck : 1;      // Mask: 0x2, PropSize: 0x10x4A(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIgnoredByCharacterEncroachment : 1;               // Mask: 0x4, PropSize: 0x10x4A(0x1)(BlueprintReadOnly, Parm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_C : 5;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bUseBPGetHUDDrawLocationOffset : 1;                // Mask: 0x1, PropSize: 0x10x4B(0x1)(BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBPPreventAttachments : 1;                      // Mask: 0x2, PropSize: 0x10x4B(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBPGetShowDebugAnimationComponents : 1;         // Mask: 0x4, PropSize: 0x10x4B(0x1)(Edit, ConstParm, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUnstreamComponentsUseEndOverlap : 1;              // Mask: 0x8, PropSize: 0x10x4B(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bWantsPerformanceThrottledTick : 1;                // Mask: 0x10, PropSize: 0x10x4B(0x1)(ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_D : 2;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bWantsServerThrottledTick : 1;                     // Mask: 0x80, PropSize: 0x10x4B(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_E : 1;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bBPPreInitializeComponents : 1;                    // Mask: 0x2, PropSize: 0x10x4C(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bBPPostInitializeComponents : 1;                   // Mask: 0x4, PropSize: 0x10x4C(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBPCustomIsRelevantForClient : 1;               // Mask: 0x8, PropSize: 0x10x4C(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseStasisGrid : 1;                                // Mask: 0x10, PropSize: 0x10x4C(0x1)(ConstParm, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAlwaysCreatePhysicsState : 1;                     // Mask: 0x20, PropSize: 0x10x4C(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bForceInfiniteDrawDistance : 1;                    // Mask: 0x40, PropSize: 0x10x4C(0x1)(ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsFromChildActorComponent : 1;                    // Mask: 0x80, PropSize: 0x10x4C(0x1)(ConstParm, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsDestroyedFromChildActorComponent : 1;           // Mask: 0x1, PropSize: 0x10x4D(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsValidUnstasisCaster : 1;                        // Mask: 0x2, PropSize: 0x10x4D(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBPAllowActorSpawn : 1;                         // Mask: 0x4, PropSize: 0x10x4D(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_10 : 5;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1D5[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnTargetingTeamChanged;                            // 0x50(0x10)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1D6[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        TargetingTeam;                                     // 0x78(0x4)(Edit, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	int32                                        CustomActorFlags;                                  // 0x7C(0x4)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1D9[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	class AActor*                                ActorUsingQuickAction;                             // 0x88(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FName                                  CustomTag;                                         // 0x90(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	int32                                        CustomData;                                        // 0x98(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1DA[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnActorCustomEvent;                                // 0xA0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	double                                       LastThrottledTickTime;                             // 0xB0(0x8)(ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bWantsRealtimeThrottledTick : 1;                   // Mask: 0x1, PropSize: 0x10xB8(0x1)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_11 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bRealtimeThrottledTickUseNativeTick : 1;           // Mask: 0x4, PropSize: 0x10xB8(0x1)(ConstParm, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseActorNotifyCustomEventBP : 1;                  // Mask: 0x8, PropSize: 0x10xB8(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_12 : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1DB[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnMatineeUpdated;                                  // 0xC0(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1DC[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	enum class EReplicationGraphBehavior         RepGraphBehavior;                                  // 0xE8(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	enum class EReplicationGraphBehavior         DesiredRepGraphBehavior;                           // 0xE9(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bDesiredRepGraphBehaviorHasBeenSet;                // 0xEA(0x1)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1DD[0x5];                                      // Fixing Size After Last Property  > TateDumper <
	double                                       ForceMaximumReplicationRateUntilTime;              // 0xF0(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	double                                       LastActorForceReplicationTime;                     // 0xF8(0x8)(Edit, ConstParm, Net, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1DE[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        NetworkAndStasisRangeMultiplier;                   // 0x104(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        NetworkRangeMultiplier;                            // 0x108(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        NetCullDistanceSquaredDormant;                     // 0x10C(0x4)(Edit, ConstParm, BlueprintVisible, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1DF[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class AActor*>                        NetworkSpatializationChildren;                     // 0x120(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<class AActor*>                        NetworkSpatializationChildrenDormant;              // 0x130(0x10)(BlueprintVisible, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class AActor*                                NetworkSpatializationParent;                       // 0x140(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        DefaultStasisComponentOctreeFlags;                 // 0x148(0x4)(Edit, ConstParm, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        DefaultStasisedOctreeFlags;                        // 0x14C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        DefaultUnstasisedOctreeFlags;                      // 0x150(0x4)(ConstParm, BlueprintVisible, Net, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        OverrideStasisComponentRadius;                     // 0x154(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UPrimitiveComponent*                   StasisCheckComponent;                              // 0x158(0x8)(Edit, ConstParm, ExportObject, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	double                                       UnstasisLastInRangeTime;                           // 0x160(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	double                                       LastPreReplicationTime;                            // 0x168(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	double                                       LastEnterStasisTime;                               // 0x170(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	double                                       LastExitStasisTime;                                // 0x178(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                LastSelectedWindSourceComponentName;               // 0x180(0x10)(ConstParm, ExportObject, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1E0[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<TWeakObjectPtr<class UActorComponent>> StasisUnRegisteredComponents;                      // 0x1A8(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        ReplicationIntervalMultiplier;                     // 0x1B8(0x4)(Edit, ConstParm, ExportObject, Net, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        ClientReplicationSendNowThreshold;                 // 0x1BC(0x4)(Edit, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1E1[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	TWeakObjectPtr<class USoundBase>             LastPostProcessVolumeSound;                        // 0x1C4(0x8)(Edit, ConstParm, ExportObject, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1E2[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnSemaphoreTaken;                                  // 0x1D0(0x10)(ConstParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bForceNonBlockingHits;                             // 0x1E0(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1E3[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	double                                       OriginalCreationTime;                              // 0x1E8(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	uint8                                        Pad_1E4[0x20];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class AMatineeActor*>                 ControllingMatineeActors;                          // 0x210(0x10)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        NetCriticalPriorityAdjustment;                     // 0x220(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1E5[0xC];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UPrimalActor* GetDefaultObj();

	void Unstasis();
	int32 TryMultiUse(int32* HitBodyIndex, bool ReturnValue);
	void ThrottledTick();
	void TargetingTeamChanged();
	bool SetTickFunctionEnabled();
	enum class EReplicationGraphBehavior SetDesiredRepGraphBehavior();
	void RecieveMatineeUpdated();
	double RealtimeThrottledTick();
	class USoundBase* PreventNotifySound(bool ReturnValue);
	class USoundCue* PlaySoundOnActor(float* VolumeMultiplier, float* PitchMultiplier);
	void PerformanceThrottledTick();
	void OnInventoryItemGrind();
	class AHUD* OffsetHUDFromCenterScreenY(float ReturnValue);
	class AHUD* OffsetHUDFromBottomScreenY(float ReturnValue);
	bool MulticastPropertyToPlayer(class FName PropertyName);
	bool MulticastProperty(class FName PropertyName);
	class APlayerController* ModifyHudMultiUseLoc(int32* Index);
	void MatineeUpdated();
	void K2_GetWorld(class UWorld* ReturnValue);
	class APawn* IsValidLockOnTarget(bool ReturnValue);
	void IsTargetable(bool ReturnValue);
	void IsShooterWeapon(bool ReturnValue);
	void IsShooterPlayerController(bool ReturnValue);
	void IsShooterCharacter(bool ReturnValue);
	void IsPrimalStructureTurret(bool ReturnValue);
	void IsPrimalStructureItemContainer(bool ReturnValue);
	void IsPrimalStructureExplosive(bool ReturnValue);
	void IsPrimalStructure(bool ReturnValue);
	void IsPrimalDino(bool ReturnValue);
	void IsPrimalCharacterOrStructure(bool ReturnValue);
	void IsPrimalCharacter(bool ReturnValue);
	void IsNetworkStressTestClientMode(bool ReturnValue);
	void IsLocallyControlledByPlayer(bool ReturnValue);
	void IsInstancedFoliage(bool ReturnValue);
	void IsFirstPersonMeshVisible(bool ReturnValue);
	void IsFirstPersonCamera(bool ReturnValue);
	void IsDead(bool ReturnValue);
	void IsARaft(bool ReturnValue);
	class APlayerController* InputDismissPOI_BP(int32* Index);
	class APlayerController* InputDismissPOI(int32* Index);
	int32 GetWheelOptionInfoBP(const struct FMultiUseWheelOption& ReturnValue);
	int32 GetWheelOptionInfo(const struct FMultiUseWheelOption& ReturnValue);
	class APlayerController* GetWheelOptionByUseIndex(int32* Index, const struct FMultiUseWheelOption& ReturnValue);
	void GetUsablePriority(float ReturnValue);
	class AActor* GetTargetingLocation(const struct FVector& ReturnValue);
	void GetSecondaryMountedActor(class AActor* ReturnValue);
	class APlayerController* GetMultiUseIconBP(struct FMultiUseEntry* MultiUseEntry, class UTexture2D* ReturnValue);
	class APlayerController* GetMultiUseIcon(struct FMultiUseEntry* MultiUseEntry, class UTexture2D* ReturnValue);
	TArray<struct FMultiUseEntry> GetMultiUseEntries(int32* HitBodyIndex);
	void GetInterpolatedVelocity(const struct FVector& ReturnValue);
	void GetInterpolatedRotation(const struct FRotator& ReturnValue);
	void GetInterpolatedLocation(const struct FVector& ReturnValue);
	int32 GetEditTextString(const class FString& ReturnValue);
	void GetCharacterController(class AController* ReturnValue);
	void GetAttachedSoundVolumeMultiplier(float ReturnValue);
	void GetAttachedSoundPitchMultiplier(float ReturnValue);
	TArray<class USceneComponent*> GetAllSceneComponents();
	void GetAimedTutorialHintString(const class FString& ReturnValue);
	void GetActorViewDirection(const struct FVector& ReturnValue);
	void ForceReplicateNowIfNoChannel();
	bool ForceReplicateNow();
	class AHUD* DrawBasicFloatingHUD();
	class AHUD* DrawActorFloatingHUD();
	void CurrentlyHasRider(bool ReturnValue);
	int32 ClientMultiUse(int32* HitBodyIndex);
	void CheckRegisterCharacterMesh();
	class APawn* CheckBPAllowActorSpawn(class UWorld* World, bool ReturnValue);
	int32 ChangeActorTeam();
	void CanMoveThroughActor(class AActor** Actor, bool ReturnValue);
	int32 BPTryMultiUse(bool ReturnValue);
	void BPSetNetworkAndStasisRangeMultiplier(float* Value);
	class UObject* BPPreventAttachments(bool ReturnValue);
	void BPPreInitializeComponents();
	void BPPostInitializeComponents();
	class APlayerController* BPOverrideUILocation(const struct FVector& ReturnValue);
	void BPOverrideServerMultiUseAcceptRange(float ReturnValue);
	void BPIsMarkedForSeamlessTravel(bool ReturnValue);
	class UObject* BPInventoryItemUsed();
	class UObject* BPInventoryItemDropped();
	TArray<class USkeletalMeshComponent*> BPGetShowDebugAnimationComponents();
	class APlayerController* BPGetQuickActionUseEntry(const struct FQuickActionOption& ReturnValue);
	TArray<struct FMultiUseEntry> BPGetMultiUseEntries(const TArray<struct FMultiUseEntry>& ReturnValue);
	struct FLinearColor BPGetMultiUseCenterText(bool ReturnValue);
	int32 BPGetExtraSpecialBlueprintInt(int32 ReturnValue);
	struct FBPNetExecParams BPGetCustomBlueprintData(class FName DataName, bool ReturnValue);
	void BPGetBonesToHideOnAllocation(const TArray<class FName>& ReturnValue);
	void BPGetActorEyesViewPoint(struct FVector* Location, struct FRotator* Rotation);
	class UObject* BPForceAllowsInventoryUse(bool ReturnValue);
	TArray<struct FMultiUseEntry> BPFilterMultiUseEntries(const TArray<struct FMultiUseEntry>& ReturnValue);
	struct FVector2D BPDrawMultiUseEntry();
	struct FVector2D BPDrawMultiUseCustomEntry(int32* Index, class FName* Text);
	class APlayerController* BPCustomIsRelevantForClient(bool ReturnValue);
	struct FVector BPControlRigNotify(class FName NotifyName, const struct FHitResult& WorldSpaceHitResult);
	bool BPConsumeUsePinCode(bool ReturnValue);
	int32 BPConsumeSetPinCode(bool ReturnValue);
	int32 BPClientDoMultiUse();
	void BPCheckForErrors(const TArray<struct FBPMapCheckEntry>& ReturnValue);
	void BPChangedActorTeam();
	void BPAttachedRootComponent();
	class APawn* BPAllowActorSpawn(bool ReturnValue);
	class AActor* BP_OverrideTargetingLocation(const struct FVector& ReturnValue);
	class FName BP_GetHUDWorldDrawLocation(const struct FVector& ReturnValue);
	class APlayerController* AllowManualMultiUseActivation(bool ReturnValue);
	class AActor* AllowIgnoreCharacterEncroachment(bool ReturnValue);
	void AllowGrappling(bool ReturnValue);
	void AllowEmulatedMovement(bool ReturnValue);
	class UAnimNotifyState* ActorAnimNotifyCustomState_TickBP();
	class UAnimNotifyState* ActorAnimNotifyCustomState_EndBP();
	class UAnimNotifyState* ActorAnimNotifyCustomState_BeginBP();
	class UAnimNotify* ActorAnimNotifyCustomEventBP();
};

// 0x298 (0x4C8 - 0x230)
// Class Engine.Actor
class AActor : public UPrimalActor
{
public:
	struct FActorTickFunction                    PrimaryActorTick;                                  // 0x230(0x38)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bNetTemporary : 1;                                 // Mask: 0x1, PropSize: 0x10x268(0x1)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_27 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bOnlyRelevantToOwner : 1;                          // Mask: 0x4, PropSize: 0x10x268(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bAlwaysRelevant : 1;                               // Mask: 0x8, PropSize: 0x10x268(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bReplicateMovement : 1;                            // Mask: 0x10, PropSize: 0x10x268(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCallPreReplication : 1;                           // Mask: 0x20, PropSize: 0x10x268(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCallPreReplicationForReplay : 1;                  // Mask: 0x40, PropSize: 0x10x268(0x1)(Edit, ConstParm, Net, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bHidden : 1;                                       // Mask: 0x80, PropSize: 0x10x268(0x1)(BlueprintVisible, EditFixedSize, ZeroConstructor, Config)
	uint8                                        bTearOff : 1;                                      // Mask: 0x1, PropSize: 0x10x269(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bForceNetAddressable : 1;                          // Mask: 0x2, PropSize: 0x10x269(0x1)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bExchangedRoles : 1;                               // Mask: 0x4, PropSize: 0x10x269(0x1)(ConstParm, ExportObject, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bNetLoadOnClient : 1;                              // Mask: 0x8, PropSize: 0x10x269(0x1)(Edit, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bNetUseOwnerRelevancy : 1;                         // Mask: 0x10, PropSize: 0x10x269(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bRelevantForNetworkReplays : 1;                    // Mask: 0x20, PropSize: 0x10x269(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bRelevantForLevelBounds : 1;                       // Mask: 0x40, PropSize: 0x10x269(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bReplayRewindable : 1;                             // Mask: 0x80, PropSize: 0x10x269(0x1)(BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAllowTickBeforeBeginPlay : 1;                     // Mask: 0x1, PropSize: 0x10x26A(0x1)(ConstParm, EditFixedSize, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bForceHighQualityViewerReplication : 1;            // Mask: 0x2, PropSize: 0x10x26A(0x1)(BlueprintReadOnly, Net, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bActorPreventPhysicsSceneRegistration : 1;         // Mask: 0x4, PropSize: 0x10x26A(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAutoDestroyWhenFinished : 1;                      // Mask: 0x8, PropSize: 0x10x26A(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCanBeDamaged : 1;                                 // Mask: 0x10, PropSize: 0x10x26A(0x1)(Edit, ConstParm, BlueprintVisible, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bBlockInput : 1;                                   // Mask: 0x20, PropSize: 0x10x26A(0x1)(OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCollideWhenPlacing : 1;                           // Mask: 0x40, PropSize: 0x10x26A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bFindCameraComponentWhenViewTarget : 1;            // Mask: 0x80, PropSize: 0x10x26A(0x1)(Edit, ConstParm, Net, EditFixedSize, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bGenerateOverlapEventsDuringLevelStreaming : 1;    // Mask: 0x1, PropSize: 0x10x26B(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIgnoresOriginShifting : 1;                        // Mask: 0x2, PropSize: 0x10x26B(0x1)(Edit, EditFixedSize, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bEnableAutoLODGeneration : 1;                      // Mask: 0x4, PropSize: 0x10x26B(0x1)(ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIsEditorOnlyActor : 1;                            // Mask: 0x8, PropSize: 0x10x26B(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        bActorSeamlessTraveled : 1;                        // Mask: 0x10, PropSize: 0x10x26B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bDisableRigidBodyAnimNodes : 1;                    // Mask: 0x20, PropSize: 0x10x26B(0x1)(Edit, ConstParm, BlueprintVisible, Net, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bReplicates : 1;                                   // Mask: 0x40, PropSize: 0x10x26B(0x1)(Edit, ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bCanBeInCluster : 1;                               // Mask: 0x80, PropSize: 0x10x26B(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAllowReceiveTickEventOnDedicatedServer : 1;       // Mask: 0x1, PropSize: 0x10x26C(0x1)(Edit, ExportObject, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_28 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bReplicateUsingRegisteredSubObjectList : 1;        // Mask: 0x4, PropSize: 0x10x26C(0x1)(Edit, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        BitPad_29 : 5;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        BitPad_2A : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bActorEnableCollision : 1;                         // Mask: 0x10, PropSize: 0x10x26D(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bActorIsBeingDestroyed : 1;                        // Mask: 0x20, PropSize: 0x10x26D(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_2B : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        BitPad_2C : 3;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bAsyncPhysicsTickEnabled : 1;                      // Mask: 0x8, PropSize: 0x10x26E(0x1)(BlueprintVisible, Net, EditFixedSize, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_2D : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	enum class EActorUpdateOverlapsMethod        UpdateOverlapsMethodDuringLevelStreaming;          // 0x26F(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	enum class EActorUpdateOverlapsMethod        DefaultUpdateOverlapsMethodDuringLevelStreaming;   // 0x270(0x1)(Edit, ConstParm, ReturnParm, DisableEditOnTemplate, Config, SubobjectReference)
	uint8                                        Pad_47A[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        InitialLifeSpan;                                   // 0x278(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        CustomTimeDilation;                                // 0x27C(0x4)(Edit, BlueprintVisible, EditFixedSize, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	enum class ENetRole                          RemoteRole;                                        // 0x280(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor)
	uint8                                        Pad_47B[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        RayTracingGroupId;                                 // 0x284(0x4)(BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	struct FRepAttachment                        AttachmentReplication;                             // 0x288(0x60)(Edit, ExportObject, BlueprintReadOnly, Net, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FRepMovement                          ReplicatedMovement;                                // 0x2E8(0x70)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class AActor*                                Owner;                                             // 0x358(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor)
	class FName                                  NetDriverName;                                     // 0x360(0x8)(ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	enum class ENetRole                          Role;                                              // 0x368(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor)
	enum class ENetDormancy                      NetDormancy;                                       // 0x369(0x1)(Edit, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod;                      // 0x36A(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	enum class EAutoReceiveInput                 AutoReceiveInput;                                  // 0x36B(0x1)(Edit, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        InputPriority;                                     // 0x36C(0x4)(Edit, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	double                                       CreationTime;                                      // 0x370(0x8)(Edit, Net, ReturnParm, Config, GlobalConfig, SubobjectReference)
	class UInputComponent*                       InputComponent;                                    // 0x378(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, EditConst, DuplicateTransient)
	float                                        NetCullDistanceSquared;                            // 0x380(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        NetTag;                                            // 0x384(0x4)(Edit, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        NetUpdateFrequency;                                // 0x388(0x4)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MinNetUpdateFrequency;                             // 0x38C(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        NetPriority;                                       // 0x390(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_47E[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	double                                       LastRenderTime;                                    // 0x398(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	double                                       LastRenderTimeOnScreen;                            // 0x3A0(0x8)(Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	double                                       LastRenderTimeIgnoreShadow;                        // 0x3A8(0x8)(BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	class APawn*                                 Instigator;                                        // 0x3B0(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	TArray<class AActor*>                        Children;                                          // 0x3B8(0x10)(Edit, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance)
	class USceneComponent*                       RootComponent;                                     // 0x3C8(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_480[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<class FName>                          Layers;                                            // 0x3D8(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TWeakObjectPtr<class UChildActorComponent>   ParentComponent;                                   // 0x3E8(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<class FName>                          Tags;                                              // 0x3F0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, Config)
	uint8                                        Pad_481[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastSparseDelegateProperty_            OnTakeAnyDamage;                                   // 0x404(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnTakePointDamage;                                 // 0x405(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnTakeRadialDamage;                                // 0x406(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnActorBeginOverlap;                               // 0x407(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnActorEndOverlap;                                 // 0x408(0x1)(Edit, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnBeginCursorOver;                                 // 0x409(0x1)(Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnEndCursorOver;                                   // 0x40A(0x1)(ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnClicked;                                         // 0x40B(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnReleased;                                        // 0x40C(0x1)(Edit, ExportObject, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchBegin;                                 // 0x40D(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchEnd;                                   // 0x40E(0x1)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchEnter;                                 // 0x40F(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchLeave;                                 // 0x410(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnActorHit;                                        // 0x411(0x1)(ConstParm, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnDestroyed;                                       // 0x412(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnEndPlay;                                         // 0x413(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_483[0x84];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class UActorComponent*>               InstanceComponents;                                // 0x498(0x10)(Edit, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<class UActorComponent*>               BlueprintCreatedComponents;                        // 0x4A8(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_484[0x10];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class AActor* GetDefaultObj();

	float WasRecentlyRendered(bool ReturnValue);
	void UserConstructionScript();
	void TearOff();
	float StopActorSound();
	enum class ETickingGroup SetTickGroup();
	bool SetTickableWhenPaused();
	bool SetReplicates();
	bool SetReplicateMovement();
	int32 SetRayTracingGroupId();
	class AActor* SetOwner();
	enum class ENetDormancy SetNetDormancy();
	float SetLifeSpan();
	bool SetAutoDestroyWhenFinished();
	float SetActorTickInterval();
	bool SetActorTickEnabled();
	struct FVector SetActorScale3D();
	struct FVector SetActorRelativeScale3D();
	bool SetActorHiddenInGame();
	bool SetActorEnableCollision();
	bool ServerSendSimpleExecCommandToEveryone();
	bool ServerSendExecCommandToPlayer();
	bool ServerSendExecCommandToEveryone();
	void ReregisterAllComponents();
	class UActorComponent* RemoveTickPrerequisiteComponent();
	class AActor* RemoveTickPrerequisiteActor();
	float ReceiveTick();
	class AActor* ReceiveRadialDamage();
	struct FHitResult ReceivePointDamage(float Damage, struct FVector* HitNormal, class FName* BoneName);
	struct FHitResult ReceiveHit(struct FVector* HitNormal, struct FVector* NormalImpulse);
	enum class EEndPlayReason ReceiveEndPlay();
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	float ReceiveAsyncPhysicsTick();
	class AActor* ReceiveAnyDamage(float Damage);
	struct FKey ReceiveActorOnReleased();
	enum class ETouchIndex ReceiveActorOnInputTouchLeave();
	enum class ETouchIndex ReceiveActorOnInputTouchEnter();
	enum class ETouchIndex ReceiveActorOnInputTouchEnd();
	enum class ETouchIndex ReceiveActorOnInputTouchBegin();
	void ReceiveActorOnClicked(struct FKey* ButtonPressed);
	void ReceiveActorEndOverlap(class AActor** OtherActor);
	void ReceiveActorEndCursorOver();
	void ReceiveActorBeginOverlap(class AActor** OtherActor);
	void ReceiveActorBeginCursorOver();
	bool PrestreamTextures(int32 CinematicTextureGroups);
	void OnRep_ReplicateMovement();
	void OnRep_ReplicatedMovement();
	void OnRep_Owner();
	void OnRep_Instigator();
	void OnRep_AttachmentReplication();
	void NetSpawnedActor(class AActor* SpawnedActor);
	class AActor* NetActorSpawnActorUnreliable(class FName* BoneName);
	class AActor* NetActorSpawnActor(class FName* BoneName);
	bool MulticastDrawDebugString(const struct FVector& TextLocation, class FString* Text, class AActor* TestBaseActor, const struct FLinearColor& TextColor);
	bool MulticastDrawDebugSphere(struct FVector* Center, float* Radius);
	bool MulticastDrawDebugPoint(struct FVector* Position, const struct FLinearColor& PointColor);
	bool MulticastDrawDebugPlane(struct FVector* Location, const struct FLinearColor& PlaneColor);
	bool MulticastDrawDebugLineTraceHitResult();
	bool MulticastDrawDebugLine();
	bool MulticastDrawDebugCylinder(float* Radius);
	bool MulticastDrawDebugCoordinateSystem(float* Scale);
	bool MulticastDrawDebugCapsuleWithExtents(const struct FVector& Top, const struct FVector& Bottom, float* Radius);
	bool MulticastDrawDebugCapsule(struct FVector* Center, float* HalfHeight, float* Radius, struct FRotator* Rotation);
	bool MulticastDrawDebugCamera();
	bool MulticastDrawDebugBox(struct FVector* Center, struct FRotator* Rotation);
	bool MulticastDrawDebugArrow();
	class FName MakeNoise(float* Loudness, float MaxRange);
	bool K2_TeleportTo(bool ReturnValue);
	bool K2_SetActorTransform(struct FTransform* NewTransform, const struct FHitResult& SweepHitResult, bool ReturnValue);
	bool K2_SetActorRotation(bool ReturnValue);
	bool K2_SetActorRelativeTransform(const struct FHitResult& SweepHitResult);
	bool K2_SetActorRelativeRotation(const struct FHitResult& SweepHitResult);
	bool K2_SetActorRelativeLocation(const struct FVector& NewRelativeLocation, const struct FHitResult& SweepHitResult);
	bool K2_SetActorLocationAndRotation(struct FVector* NewLocation, const struct FHitResult& SweepHitResult, bool ReturnValue);
	bool K2_SetActorLocation(struct FVector* NewLocation, const struct FHitResult& SweepHitResult, bool ReturnValue);
	void K2_OnReset();
	class APlayerController* K2_OnEndViewTarget();
	class APlayerController* K2_OnBecomeViewTarget();
	void K2_GetRootComponent(class USceneComponent* ReturnValue);
	void K2_GetComponentsByClass(class UClass* ComponentClass, const TArray<class UActorComponent*>& ReturnValue);
	void K2_GetActorRotation(const struct FRotator& ReturnValue);
	void K2_GetActorLocation(const struct FVector& ReturnValue);
	void K2_DetachFromActor(enum class EDetachmentRule* LocationRule, enum class EDetachmentRule* RotationRule, enum class EDetachmentRule* ScaleRule);
	void K2_DestroyActor();
	void K2_AttachToComponent(class USceneComponent** Parent, class FName* SocketName, enum class EAttachmentRule* LocationRule, enum class EAttachmentRule* RotationRule, enum class EAttachmentRule* ScaleRule, bool bWeldSimulatedBodies, bool ReturnValue);
	class AActor* K2_AttachToActor(class FName* SocketName, enum class EAttachmentRule* LocationRule, enum class EAttachmentRule* RotationRule, enum class EAttachmentRule* ScaleRule, bool bWeldSimulatedBodies, bool ReturnValue);
	enum class EAttachLocation K2_AttachRootComponentToActor(class FName InSocketName, bool bWeldSimulatedBodies);
	enum class EAttachLocation K2_AttachRootComponentTo(class USceneComponent** InParent, class FName InSocketName, bool bWeldSimulatedBodies);
	bool K2_AddActorWorldTransformKeepScale(const struct FTransform& DeltaTransform, const struct FHitResult& SweepHitResult);
	bool K2_AddActorWorldTransform(const struct FTransform& DeltaTransform, const struct FHitResult& SweepHitResult);
	bool K2_AddActorWorldRotation(const struct FRotator& DeltaRotation, const struct FHitResult& SweepHitResult);
	bool K2_AddActorWorldOffset(const struct FHitResult& SweepHitResult);
	bool K2_AddActorLocalTransform(struct FTransform* NewTransform, const struct FHitResult& SweepHitResult);
	bool K2_AddActorLocalRotation(const struct FRotator& DeltaRotation, const struct FHitResult& SweepHitResult);
	bool K2_AddActorLocalOffset(const struct FHitResult& SweepHitResult);
	class AActor* IsOwnedOrControlledBy(bool ReturnValue);
	class AActor* IsOverlappingActor(bool ReturnValue);
	void IsChildActor(bool ReturnValue);
	void IsActorTickEnabled(bool ReturnValue);
	void IsActorBeingDestroyed(bool ReturnValue);
	void HasAuthority(bool ReturnValue);
	void GetVisibleUnhiddenComponentByClass(class UClass* ComponentClass, class UPrimitiveComponent* ReturnValue);
	void GetVisibleComponentByClass(class UClass* ComponentClass, class UPrimitiveComponent* ReturnValue);
	void GetVerticalDistanceTo(class AActor** OtherActor, float ReturnValue);
	bool GetVelocity(const struct FVector& ReturnValue);
	void GetTransform(const struct FTransform& ReturnValue);
	void GetTickableWhenPaused(bool ReturnValue);
	void GetSquaredHorizontalDistanceTo(class AActor** OtherActor, float ReturnValue);
	void GetSquaredDistanceTo(class AActor** OtherActor, float ReturnValue);
	void GetRemoteRole(enum class ENetRole ReturnValue);
	void GetRayTracingGroupId(int32 ReturnValue);
	void GetParentComponent(class UChildActorComponent* ReturnValue);
	void GetParentActor(class AActor* ReturnValue);
	void GetOwnerController(class APlayerController* ReturnValue);
	void GetOwner(class AActor* ReturnValue);
	void GetOverlappingComponents(TArray<class UPrimitiveComponent*>* OverlappingComponents);
	void GetOverlappingActors(TArray<class AActor*>* OverlappingActors, class UClass* ClassFilter);
	void GetLocalRole(enum class ENetRole ReturnValue);
	void GetLifeSpan(float ReturnValue);
	void GetLevelTransform(const struct FTransform& ReturnValue);
	void GetLevel(class ULevel* ReturnValue);
	void GetInstigatorController(class AController* ReturnValue);
	void GetInstigator(class APawn* ReturnValue);
	struct FKey GetInputVectorAxisValue(const struct FVector& ReturnValue);
	class FName GetInputAxisValue(float ReturnValue);
	struct FKey GetInputAxisKeyValue(float ReturnValue);
	void GetHorizontalDotProductTo(class AActor** OtherActor, float ReturnValue);
	void GetHorizontalDistanceTo(class AActor** OtherActor, float ReturnValue);
	void GetGameTimeSinceCreation(float ReturnValue);
	void GetDotProductTo(class AActor** OtherActor, float ReturnValue);
	void GetDistanceTo(class AActor** OtherActor, float ReturnValue);
	class FName GetComponentsByTag(class UClass* ComponentClass, const TArray<class UActorComponent*>& ReturnValue);
	void GetComponentsByInterface(class UClass* Interface, const TArray<class UActorComponent*>& ReturnValue);
	class FName GetComponentsByCustomTag(const TArray<class UActorComponent*>& ReturnValue);
	class FName GetComponentByCustomTag(class UActorComponent* ReturnValue);
	void GetComponentByClass(class UClass* ComponentClass, class UActorComponent* ReturnValue);
	void GetAttachParentSocketName(class FName ReturnValue);
	void GetAttachParentActor(class AActor* ReturnValue);
	bool GetAttachedActors();
	bool GetAllChildActors();
	void GetActorUpVector(const struct FVector& ReturnValue);
	void GetActorTimeDilation(float ReturnValue);
	void GetActorTickInterval(float ReturnValue);
	void GetActorScale3D(const struct FVector& ReturnValue);
	void GetActorRightVector(const struct FVector& ReturnValue);
	void GetActorRelativeScale3D(const struct FVector& ReturnValue);
	void GetActorForwardVector(const struct FVector& ReturnValue);
	struct FRotator GetActorEyesViewPoint();
	void GetActorEnableCollision(bool ReturnValue);
	bool GetActorBounds(const struct FVector& BoxExtent);
	bool ForceNetUpdate();
	void ForceDestroy();
	void FlushNetDormancy();
	struct FTransform FinishAddComponent(class UActorComponent* Component);
	void EnableInput(class APlayerController** PlayerController);
	void DisableInput(class APlayerController** PlayerController);
	void DetachRootComponentFromParent(bool bMaintainWorldPosition);
	class UClass* CreateInputComponent();
	bool CalculateComponentsBoundingBoxInLocalSpace(const struct FBox& ReturnValue);
	struct FBPNetExecParams BPServerHandleNetExecCommand(bool ReturnValue);
	class UClass* BPIsA(bool ReturnValue);
	class APlayerController* BPClientHandleNetExecCommand(bool ReturnValue);
	class UActorComponent* AddTickPrerequisiteComponent();
	class AActor* AddTickPrerequisiteActor();
	bool AddComponentByClass(class UClass* Class, class UActorComponent* ReturnValue);
	bool AddComponent(class UActorComponent* ReturnValue);
	struct FVector ActorPlaySoundUnreliable(class FName* BoneName);
	struct FVector ActorPlaySound(class FName* BoneName);
	class FName ActorHasTag(bool ReturnValue);
};

// 0x0 (0x28 - 0x28)
// Class Engine.BlueprintFunctionLibrary
class UBlueprintFunctionLibrary : public UObject
{
public:

	static class UClass* StaticClass();
	static class UBlueprintFunctionLibrary* GetDefaultObj();

};

// 0xA0 (0xC8 - 0x28)
// Class Engine.StreamableRenderAsset
class UStreamableRenderAsset : public UObject
{
public:
	uint8                                        Pad_4A1[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       ForceMipLevelsToBeResidentTimestamp;               // 0x40(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	int32                                        NumCinematicMipLevels;                             // 0x48(0x4)(Edit, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	uint8                                        Pad_4A2[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FPerQualityLevelInt                   NoRefStreamingLODBias;                             // 0x50(0x68)(Edit, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	int32                                        StreamingIndex;                                    // 0xB8(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	uint8                                        NeverStream : 1;                                   // Mask: 0x1, PropSize: 0x10xBC(0x1)(Edit, EditFixedSize, Parm, DisableEditOnTemplate, EditConst, GlobalConfig, InstancedReference)
	uint8                                        bGlobalForceMipLevelsToBeResident : 1;             // Mask: 0x2, PropSize: 0x10xBC(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	uint8                                        bHasStreamingUpdatePending : 1;                    // Mask: 0x4, PropSize: 0x10xBC(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	uint8                                        bForceMiplevelsToBeResident : 1;                   // Mask: 0x8, PropSize: 0x10xBC(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	uint8                                        bIgnoreStreamingMipBias : 1;                       // Mask: 0x10, PropSize: 0x10xBC(0x1)(Edit, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	uint8                                        bUseCinematicMipLevels : 1;                        // Mask: 0x20, PropSize: 0x10xBC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	uint8                                        Pad_4A5[0xB];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UStreamableRenderAsset* GetDefaultObj();

	int32 SetForceMipLevelsToBeResident();
};

// 0x110 (0x1D8 - 0xC8)
// Class Engine.Texture
class UTexture : public UStreamableRenderAsset
{
public:
	uint8                                        Pad_4AF[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	struct FGuid                                 LightingGuid;                                      // 0xD8(0x10)(Edit, BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	int32                                        LevelIndex;                                        // 0xE8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	struct FPerPlatformInt                       LODBias;                                           // 0xEC(0x4)(Edit, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Config, EditConst, GlobalConfig, InstancedReference)
	enum class ETextureCompressionSettings       CompressionSettings;                               // 0xF0(0x1)(Edit, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, GlobalConfig, InstancedReference)
	enum class ETextureFilter                    Filter;                                            // 0xF1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config)
	enum class ETextureMipLoadOptions            MipLoadOptions;                                    // 0xF2(0x1)(Edit, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, Config, GlobalConfig, InstancedReference, DuplicateTransient)
	enum class ETextureCookPlatformTilingSettings CookPlatformTilingSettings;                        // 0xF3(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	enum class ETextureGroup                     LODGroup;                                          // 0xF4(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, EditConst, InstancedReference)
	uint8                                        Pad_4B1[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	struct FPerPlatformFloat                     Downscale;                                         // 0xF8(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	enum class ETextureDownscaleOptions          DownscaleOptions;                                  // 0xFC(0x1)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        SRGB : 1;                                          // Mask: 0x1, PropSize: 0x10xFD(0x1)(Edit, ConstParm, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, InstancedReference)
	uint8                                        bNoTiling : 1;                                     // Mask: 0x2, PropSize: 0x10xFD(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	uint8                                        VirtualTextureStreaming : 1;                       // Mask: 0x4, PropSize: 0x10xFD(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient)
	uint8                                        CompressionYCoCg : 1;                              // Mask: 0x8, PropSize: 0x10xFD(0x1)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bNotOfflineProcessed : 1;                          // Mask: 0x10, PropSize: 0x10xFD(0x1)(Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	uint8                                        bAsyncResourceReleaseHasBeenStarted : 1;           // Mask: 0x20, PropSize: 0x10xFD(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	uint8                                        BitPad_2E : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_4B3[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<class UAssetUserData*>                AssetUserData;                                     // 0x100(0x10)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	uint8                                        Pad_4B4[0xC8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UTexture* GetDefaultObj();

	struct FLinearColor ComputeTextureSourceChannelMinMax(bool ReturnValue);
	int64 Blueprint_GetTextureSourceDiskAndMemorySize();
	void Blueprint_GetMemorySize(int64 ReturnValue);
};

// 0x90 (0xB8 - 0x28)
// Class Engine.ActorComponent
class UActorComponent : public UObject
{
public:
	uint8                                        Pad_4F6[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FActorComponentTickFunction           PrimaryComponentTick;                              // 0x30(0x38)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, Config, EditConst, SubobjectReference)
	TArray<class FName>                          ComponentTags;                                     // 0x68(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class UAssetUserData*>                AssetUserData;                                     // 0x78(0x10)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	uint8                                        Pad_4F7[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        UCSSerializationIndex;                             // 0x8C(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        BitPad_32 : 3;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bNetAddressable : 1;                               // Mask: 0x8, PropSize: 0x10x90(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bReplicateUsingRegisteredSubObjectList : 1;        // Mask: 0x10, PropSize: 0x10x90(0x1)(Edit, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bReplicates : 1;                                   // Mask: 0x20, PropSize: 0x10x90(0x1)(Edit, ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        BitPad_33 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_4F9[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        BitPad_34 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bAutoActivate : 1;                                 // Mask: 0x2, PropSize: 0x10x92(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bIsActive : 1;                                     // Mask: 0x4, PropSize: 0x10x92(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bEditableWhenInherited : 1;                        // Mask: 0x8, PropSize: 0x10x92(0x1)(Edit, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bOnlyRelevantToOwner : 1;                          // Mask: 0x10, PropSize: 0x10x92(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        BitPad_35 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bCanEverAffectNavigation : 1;                      // Mask: 0x40, PropSize: 0x10x92(0x1)(Edit, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        BitPad_36 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bIsEditorOnly : 1;                                 // Mask: 0x1, PropSize: 0x10x93(0x1)(Edit, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        BitPad_37 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_4FA[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	enum class EComponentCreationMethod          CreationMethod;                                    // 0x95(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnComponentActivated;                              // 0x96(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnComponentDeactivated;                            // 0x97(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_4FB[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        bStasisPreventUnregister : 1;                      // Mask: 0x1, PropSize: 0x10xA8(0x1)(Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bOnlyInitialReplication : 1;                       // Mask: 0x2, PropSize: 0x10xA8(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bPreventOnDedicatedServer : 1;                     // Mask: 0x4, PropSize: 0x10xA8(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bPreventOnConsoles : 1;                            // Mask: 0x8, PropSize: 0x10xA8(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bPreventOnClient : 1;                              // Mask: 0x10, PropSize: 0x10xA8(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bPreventOnNonDedicatedHost : 1;                    // Mask: 0x20, PropSize: 0x10xA8(0x1)(BlueprintVisible, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bDedicatedForceTickingEveryFrame : 1;              // Mask: 0x40, PropSize: 0x10xA8(0x1)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bAlwaysReplicatePropertyConditional : 1;           // Mask: 0x80, PropSize: 0x10xA8(0x1)(Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bUseBPOnComponentTick : 1;                         // Mask: 0x1, PropSize: 0x10xA9(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bUseBPOnComponentDestroyed : 1;                    // Mask: 0x2, PropSize: 0x10xA9(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        bUseBPOnComponentCreated : 1;                      // Mask: 0x4, PropSize: 0x10xA9(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        BitPad_38 : 5;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_501[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	class FName                                  CustomTag;                                         // 0xAC(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	int32                                        CustomData;                                        // 0xB4(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)

	static class UClass* StaticClass();
	static class UActorComponent* GetDefaultObj();

	void ToggleActive();
	enum class ETickingGroup SetTickGroup();
	bool SetTickableWhenPaused();
	class AActor* SetOwner();
	bool SetIsReplicated();
	float SetComponentTickIntervalAndCooldown();
	float SetComponentTickInterval();
	bool SetComponentTickEnabled();
	bool SetAutoActivate();
	bool SetActive();
	void ReregisterComponent();
	class UActorComponent* RemoveTickPrerequisiteComponent();
	class AActor* RemoveTickPrerequisiteActor();
	float ReceiveTick();
	enum class EEndPlayReason ReceiveEndPlay();
	void ReceiveBeginPlay();
	float ReceiveAsyncPhysicsTick();
	void OnRep_IsActive();
	void K2_DestroyComponent(class UObject** Object);
	void IsComponentTickEnabled(bool ReturnValue);
	void IsBeingDestroyed(bool ReturnValue);
	void IsActive(bool ReturnValue);
	void GetOwner(class AActor* ReturnValue);
	void GetComponentTickInterval(float ReturnValue);
	void Deactivate();
	class FName ComponentHasTag(bool ReturnValue);
	float BPTickComponent();
	float BPOnComponentTick();
	void BPOnComponentDestroyed();
	void BPOnComponentCreated();
	class UActorComponent* AddTickPrerequisiteComponent();
	class AActor* AddTickPrerequisiteActor();
	void AddedAsPrimalItemAttachment();
	bool Activate();
};

// 0x210 (0x2C8 - 0xB8)
// Class Engine.SceneComponent
class USceneComponent : public UActorComponent
{
public:
	uint8                                        Pad_661[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	TWeakObjectPtr<class APhysicsVolume>         PhysicsVolume;                                     // 0xC0(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, DuplicateTransient)
	class USceneComponent*                       AttachParent;                                      // 0xC8(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	class FName                                  AttachSocketName;                                  // 0xD0(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	TArray<class USceneComponent*>               AttachChildren;                                    // 0xD8(0x10)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	TArray<class USceneComponent*>               ClientAttachedChildren;                            // 0xE8(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_667[0x48];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RelativeLocation;                                  // 0x140(0x18)(ConstParm, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	struct FRotator                              RelativeRotation;                                  // 0x158(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               RelativeScale3D;                                   // 0x170(0x18)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               ComponentVelocity;                                 // 0x188(0x18)(ConstParm, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        bClientSyncAlwaysUpdatePhysicsCollision : 1;       // Mask: 0x1, PropSize: 0x10x1A0(0x1)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_49 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_670[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bComponentToWorldUpdated : 1;                      // Mask: 0x1, PropSize: 0x10x1A4(0x1)(Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_4A : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bAbsoluteLocation : 1;                             // Mask: 0x4, PropSize: 0x10x1A4(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        bAbsoluteRotation : 1;                             // Mask: 0x8, PropSize: 0x10x1A4(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        bAbsoluteScale : 1;                                // Mask: 0x10, PropSize: 0x10x1A4(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        bVisible : 1;                                      // Mask: 0x20, PropSize: 0x10x1A4(0x1)(Edit, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        bShouldBeAttached : 1;                             // Mask: 0x40, PropSize: 0x10x1A4(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        bShouldSnapLocationWhenAttached : 1;               // Mask: 0x80, PropSize: 0x10x1A4(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        bShouldSnapRotationWhenAttached : 1;               // Mask: 0x1, PropSize: 0x10x1A5(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        bShouldSnapScaleWhenAttached : 1;                  // Mask: 0x2, PropSize: 0x10x1A5(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        bShouldUpdatePhysicsVolume : 1;                    // Mask: 0x4, PropSize: 0x10x1A5(0x1)(EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        bHiddenInGame : 1;                                 // Mask: 0x8, PropSize: 0x10x1A5(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, Config)
	uint8                                        BitPad_4B : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_676[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bAttachedSoundsForceHighPriority : 1;              // Mask: 0x1, PropSize: 0x10x1A8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_4C : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_678[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bBoundsChangeTriggersStreamingDataRebuild : 1;     // Mask: 0x1, PropSize: 0x10x1AC(0x1)(Edit, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        bUseAttachParentBound : 1;                         // Mask: 0x2, PropSize: 0x10x1AC(0x1)(Edit, BlueprintVisible, ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        bComputeFastLocalBounds : 1;                       // Mask: 0x4, PropSize: 0x10x1AC(0x1)(OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        bComputeBoundsOnceForGame : 1;                     // Mask: 0x8, PropSize: 0x10x1AC(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        bComputedBoundsOnceForGame : 1;                    // Mask: 0x10, PropSize: 0x10x1AC(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        bIsNotRenderAttachmentRoot : 1;                    // Mask: 0x20, PropSize: 0x10x1AC(0x1)(BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_4D : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_67B[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	enum class EComponentMobility                Mobility;                                          // 0x1AE(0x1)(Edit, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst)
	enum class EDetailMode                       DetailMode;                                        // 0x1AF(0x1)(BlueprintVisible, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	FMulticastSparseDelegateProperty_            PhysicsVolumeChangedDelegate;                      // 0x1B0(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_67C[0x10F];                                    // Fixing Size After Last Property  > TateDumper <
	uint8                                        bIgnoreParentTransformUpdate : 1;                  // Mask: 0x1, PropSize: 0x10x2C0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        bUpdateChildOverlaps : 1;                          // Mask: 0x2, PropSize: 0x10x2C0(0x1)(ConstParm, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_4E : 6;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_67D[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        AttachmentChangedIncrementer;                      // 0x2C4(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)

	static class UClass* StaticClass();
	static class USceneComponent* GetDefaultObj();

	bool ToggleVisibility();
	float StopSound();
	struct FVector SetWorldScale3D();
	bool SetVisibility(bool* bSetChildrenRenderState);
	bool SetShouldUpdatePhysicsVolume();
	struct FVector SetRelativeScale3D();
	enum class EComponentMobility SetMobility();
	bool SetHiddenInGame(bool* bSetChildrenRenderState);
	void SetAbsolute(bool* bNewAbsoluteLocation, bool* bNewAbsoluteRotation, bool* bNewAbsoluteScale);
	void ResetRelativeTransform();
	void OnRep_Visibility(bool* OldValue);
	void OnRep_Transform();
	void OnRep_AttachSocketName();
	void OnRep_AttachParent();
	void OnRep_AttachChildren();
	bool K2_SetWorldTransform(struct FTransform* NewTransform, const struct FHitResult& SweepHitResult);
	bool K2_SetWorldRotation(const struct FHitResult& SweepHitResult);
	bool K2_SetWorldLocationAndRotation(struct FVector* NewLocation, const struct FHitResult& SweepHitResult);
	bool K2_SetWorldLocation(struct FVector* NewLocation, const struct FHitResult& SweepHitResult);
	bool K2_SetRelativeTransform(struct FTransform* NewTransform, const struct FHitResult& SweepHitResult);
	bool K2_SetRelativeRotation(const struct FHitResult& SweepHitResult);
	bool K2_SetRelativeLocationAndRotation(struct FVector* NewLocation, const struct FHitResult& SweepHitResult);
	bool K2_SetRelativeLocation(struct FVector* NewLocation, const struct FHitResult& SweepHitResult);
	void K2_GetComponentToWorld(const struct FTransform& ReturnValue);
	void K2_GetComponentScale(const struct FVector& ReturnValue);
	void K2_GetComponentRotation(const struct FRotator& ReturnValue);
	void K2_GetComponentLocation(const struct FVector& ReturnValue);
	void K2_DetachFromComponent(enum class EDetachmentRule* LocationRule, enum class EDetachmentRule* RotationRule, enum class EDetachmentRule* ScaleRule, bool bCallModify);
	void K2_AttachToComponent(class USceneComponent** Parent, class FName* SocketName, enum class EAttachmentRule* LocationRule, enum class EAttachmentRule* RotationRule, enum class EAttachmentRule* ScaleRule, bool bWeldSimulatedBodies, bool ReturnValue);
	void K2_AttachTo(class USceneComponent** InParent, class FName InSocketName, enum class EAttachLocation AttachType, bool bWeldSimulatedBodies, bool ReturnValue);
	bool K2_AddWorldTransformKeepScale(const struct FTransform& DeltaTransform, const struct FHitResult& SweepHitResult);
	bool K2_AddWorldTransform(const struct FTransform& DeltaTransform, const struct FHitResult& SweepHitResult);
	bool K2_AddWorldRotation(const struct FRotator& DeltaRotation, const struct FHitResult& SweepHitResult);
	bool K2_AddWorldOffset(const struct FHitResult& SweepHitResult);
	bool K2_AddRelativeRotation(const struct FRotator& DeltaRotation, const struct FHitResult& SweepHitResult);
	bool K2_AddRelativeLocation(const struct FHitResult& SweepHitResult);
	bool K2_AddLocalTransform(const struct FTransform& DeltaTransform, const struct FHitResult& SweepHitResult);
	bool K2_AddLocalRotation(const struct FRotator& DeltaRotation, const struct FHitResult& SweepHitResult);
	bool K2_AddLocalOffset(const struct FHitResult& SweepHitResult);
	void IsVisible(bool ReturnValue);
	void IsSimulatingPhysics(class FName* BoneName, bool ReturnValue);
	void IsAnySimulatingPhysics(bool ReturnValue);
	void GetUpVector(const struct FVector& ReturnValue);
	void GetSocketTransform(class FName InSocketName, enum class ERelativeTransformSpace TransformSpace, const struct FTransform& ReturnValue);
	void GetSocketRotation(class FName InSocketName, const struct FRotator& ReturnValue);
	void GetSocketQuaternion(class FName InSocketName, const struct FQuat& ReturnValue);
	void GetSocketLocation(class FName InSocketName, const struct FVector& ReturnValue);
	void GetShouldUpdatePhysicsVolume(bool ReturnValue);
	void GetRightVector(const struct FVector& ReturnValue);
	void GetRelativeTransform(const struct FTransform& ReturnValue);
	void GetPhysicsVolume(class APhysicsVolume* ReturnValue);
	void GetParentComponents(const TArray<class USceneComponent*>& Parents);
	void GetNumChildrenComponents(int32 ReturnValue);
	void GetForwardVector(const struct FVector& ReturnValue);
	void GetComponentVelocity(const struct FVector& ReturnValue);
	TArray<class USceneComponent*> GetChildrenComponents(bool bIncludeAllDescendants);
	void GetChildComponent(int32 ChildIndex, class USceneComponent* ReturnValue);
	void GetAttachSocketName(class FName ReturnValue);
	void GetAttachParent(class USceneComponent* ReturnValue);
	void GetAllSocketNames(const TArray<class FName>& ReturnValue);
	void DoesSocketExist(class FName InSocketName, bool ReturnValue);
	void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify);
};

// 0x3D0 (0x698 - 0x2C8)
// Class Engine.PrimitiveComponent
class UPrimitiveComponent : public USceneComponent
{
public:
	uint8                                        Pad_941[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MinDrawDistance;                                   // 0x2E0(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	float                                        LDMaxDrawDistance;                                 // 0x2E4(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	float                                        CachedMaxDrawDistance;                             // 0x2E8(0x4)(Edit, Net, EditFixedSize, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	enum class ESceneDepthPriorityGroup          DepthPriorityGroup;                                // 0x2EC(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	enum class ESceneDepthPriorityGroup          ViewOwnerDepthPriorityGroup;                       // 0x2ED(0x1)(Edit, ConstParm, BlueprintVisible, Net, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	enum class EIndirectLightingCacheQuality     IndirectLightingCacheQuality;                      // 0x2EE(0x1)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	enum class ELightmapType                     LightmapType;                                      // 0x2EF(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	enum class EHLODBatchingPolicy               HLODBatchingPolicy;                                // 0x2F0(0x1)(Edit, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bEnableAutoLODGeneration : 1;                      // Mask: 0x1, PropSize: 0x10x2F1(0x1)(ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIsActorTextureStreamingBuiltData : 1;             // Mask: 0x2, PropSize: 0x10x2F1(0x1)(ConstParm, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIsValidTextureStreamingBuiltData : 1;             // Mask: 0x4, PropSize: 0x10x2F1(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bNeverDistanceCull : 1;                            // Mask: 0x8, PropSize: 0x10x2F1(0x1)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_5D : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        BitPad_5E : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bAlwaysCreatePhysicsState : 1;                     // Mask: 0x2, PropSize: 0x10x2F2(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bGenerateOverlapEvents : 1;                        // Mask: 0x4, PropSize: 0x10x2F2(0x1)(BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bMultiBodyOverlap : 1;                             // Mask: 0x8, PropSize: 0x10x2F2(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bTraceComplexOnMove : 1;                           // Mask: 0x10, PropSize: 0x10x2F2(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bReturnMaterialOnMove : 1;                         // Mask: 0x20, PropSize: 0x10x2F2(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bUseViewOwnerDepthPriorityGroup : 1;               // Mask: 0x40, PropSize: 0x10x2F2(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bAllowCullDistanceVolume : 1;                      // Mask: 0x80, PropSize: 0x10x2F2(0x1)(Edit, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bVisibleInReflectionCaptures : 1;                  // Mask: 0x1, PropSize: 0x10x2F3(0x1)(ConstParm, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bVisibleInRealTimeSkyCaptures : 1;                 // Mask: 0x2, PropSize: 0x10x2F3(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bVisibleInRayTracing : 1;                          // Mask: 0x4, PropSize: 0x10x2F3(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bRenderInMainPass : 1;                             // Mask: 0x8, PropSize: 0x10x2F3(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bRenderInDepthPass : 1;                            // Mask: 0x10, PropSize: 0x10x2F3(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bReceivesDecals : 1;                               // Mask: 0x20, PropSize: 0x10x2F3(0x1)(ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bHoldout : 1;                                      // Mask: 0x40, PropSize: 0x10x2F3(0x1)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bOwnerNoSee : 1;                                   // Mask: 0x80, PropSize: 0x10x2F3(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bOnlyOwnerSee : 1;                                 // Mask: 0x1, PropSize: 0x10x2F4(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bTreatAsBackgroundForOcclusion : 1;                // Mask: 0x2, PropSize: 0x10x2F4(0x1)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bUseAsOccluder : 1;                                // Mask: 0x4, PropSize: 0x10x2F4(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bSelectable : 1;                                   // Mask: 0x8, PropSize: 0x10x2F4(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bForceMipStreaming : 1;                            // Mask: 0x10, PropSize: 0x10x2F4(0x1)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bHasPerInstanceHitProxies : 1;                     // Mask: 0x20, PropSize: 0x10x2F4(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        CastShadow : 1;                                    // Mask: 0x40, PropSize: 0x10x2F4(0x1)(BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst)
	uint8                                        bEmissiveLightSource : 1;                          // Mask: 0x80, PropSize: 0x10x2F4(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bAffectDynamicIndirectLighting : 1;                // Mask: 0x1, PropSize: 0x10x2F5(0x1)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bAffectIndirectLightingWhileHidden : 1;            // Mask: 0x2, PropSize: 0x10x2F5(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bAffectDistanceFieldLighting : 1;                  // Mask: 0x4, PropSize: 0x10x2F5(0x1)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bCastDynamicShadow : 1;                            // Mask: 0x8, PropSize: 0x10x2F5(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bCastStaticShadow : 1;                             // Mask: 0x10, PropSize: 0x10x2F5(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_5F : 3;                                     // Fixing Bit-Field Size  > TateDumper <
	enum class EShadowCacheInvalidationBehavior  ShadowCacheInvalidationBehavior;                   // 0x2F6(0x1)(ConstParm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bCastVolumetricTranslucentShadow : 1;              // Mask: 0x1, PropSize: 0x10x2F7(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bCastContactShadow : 1;                            // Mask: 0x2, PropSize: 0x10x2F7(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bSelfShadowOnly : 1;                               // Mask: 0x4, PropSize: 0x10x2F7(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bCastFarShadow : 1;                                // Mask: 0x8, PropSize: 0x10x2F7(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bCastInsetShadow : 1;                              // Mask: 0x10, PropSize: 0x10x2F7(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bCastCinematicShadow : 1;                          // Mask: 0x20, PropSize: 0x10x2F7(0x1)(ConstParm, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bCastHiddenShadow : 1;                             // Mask: 0x40, PropSize: 0x10x2F7(0x1)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bCastShadowAsTwoSided : 1;                         // Mask: 0x80, PropSize: 0x10x2F7(0x1)(BlueprintVisible, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bLightAsIfStatic : 1;                              // Mask: 0x1, PropSize: 0x10x2F8(0x1)(Edit, ConstParm, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bLightAttachmentsAsGroup : 1;                      // Mask: 0x2, PropSize: 0x10x2F8(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bExcludeFromLightAttachmentGroup : 1;              // Mask: 0x4, PropSize: 0x10x2F8(0x1)(Edit, BlueprintVisible, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bReceiveMobileCSMShadows : 1;                      // Mask: 0x8, PropSize: 0x10x2F8(0x1)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bSingleSampleShadowFromStationaryLights : 1;       // Mask: 0x10, PropSize: 0x10x2F8(0x1)(Edit, ConstParm, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIgnoreRadialImpulse : 1;                          // Mask: 0x20, PropSize: 0x10x2F8(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIgnoreRadialForce : 1;                            // Mask: 0x40, PropSize: 0x10x2F8(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bApplyImpulseOnDamage : 1;                         // Mask: 0x80, PropSize: 0x10x2F8(0x1)(ConstParm, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bReplicatePhysicsToAutonomousProxy : 1;            // Mask: 0x1, PropSize: 0x10x2F9(0x1)(BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bFillCollisionUnderneathForNavmesh : 1;            // Mask: 0x2, PropSize: 0x10x2F9(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        AlwaysLoadOnClient : 1;                            // Mask: 0x4, PropSize: 0x10x2F9(0x1)(BlueprintVisible, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        AlwaysLoadOnServer : 1;                            // Mask: 0x8, PropSize: 0x10x2F9(0x1)(ConstParm, ExportObject, ReturnParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bUseEditorCompositing : 1;                         // Mask: 0x10, PropSize: 0x10x2F9(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIsBeingMovedByEditor : 1;                         // Mask: 0x20, PropSize: 0x10x2F9(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bRenderCustomDepth : 1;                            // Mask: 0x40, PropSize: 0x10x2F9(0x1)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bVisibleInSceneCaptureOnly : 1;                    // Mask: 0x80, PropSize: 0x10x2F9(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bHiddenInSceneCapture : 1;                         // Mask: 0x1, PropSize: 0x10x2FA(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bRayTracingFarField : 1;                           // Mask: 0x2, PropSize: 0x10x2FA(0x1)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_60 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bHasNoStreamableTextures : 1;                      // Mask: 0x8, PropSize: 0x10x2FA(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bStaticWhenNotMoveable : 1;                        // Mask: 0x10, PropSize: 0x10x2FA(0x1)(ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_61 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bIgnoreUpdatingOwnersLastRenderTime : 1;           // Mask: 0x80, PropSize: 0x10x2FA(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_96A[0x1D];                                     // Fixing Size After Last Property  > TateDumper <
	enum class EHasCustomNavigableGeometry       bHasCustomNavigableGeometry;                       // 0x318(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_96B[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	enum class ECanBeCharacterBase               CanCharacterStepUpOn;                              // 0x31A(0x1)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FLightingChannels                     LightingChannels;                                  // 0x31B(0x1)(Net, Parm, ZeroConstructor, ReturnParm, EditConst)
	int32                                        RayTracingGroupId;                                 // 0x31C(0x4)(BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	int32                                        VisibilityId;                                      // 0x320(0x4)(Edit, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	int32                                        CustomDepthStencilValue;                           // 0x324(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	struct FCustomPrimitiveData                  CustomPrimitiveData;                               // 0x328(0x10)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst)
	struct FCustomPrimitiveData                  CustomPrimitiveDataInternal;                       // 0x338(0x10)(Edit, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_96D[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        TranslucencySortPriority;                          // 0x350(0x4)(Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	float                                        TranslucencySortDistanceOffset;                    // 0x354(0x4)(BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	TArray<class URuntimeVirtualTexture*>        RuntimeVirtualTextures;                            // 0x358(0x10)(BlueprintVisible, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	int8                                         VirtualTextureLodBias;                             // 0x368(0x1)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	int8                                         VirtualTextureCullMips;                            // 0x369(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	int8                                         VirtualTextureMinCoverage;                         // 0x36A(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	enum class ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType;                      // 0x36B(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_96F[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoundsScale;                                       // 0x37C(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_970[0x20];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class AActor*>                        MoveIgnoreActors;                                  // 0x3A0(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	TArray<class UPrimitiveComponent*>           MoveIgnoreComponents;                              // 0x3B0(0x10)(Edit, ConstParm, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_973[0x60];                                     // Fixing Size After Last Property  > TateDumper <
	struct FBodyInstance                         BodyInstance;                                      // 0x420(0x150)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst)
	FMulticastSparseDelegateProperty_            OnComponentHit;                                    // 0x570(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnComponentBeginOverlap;                           // 0x571(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnComponentEndOverlap;                             // 0x572(0x1)(BlueprintVisible, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnComponentWake;                                   // 0x573(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnComponentSleep;                                  // 0x574(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_976[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastSparseDelegateProperty_            OnComponentPhysicsStateChanged;                    // 0x576(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnBeginCursorOver;                                 // 0x577(0x1)(Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnEndCursorOver;                                   // 0x578(0x1)(ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnClicked;                                         // 0x579(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnReleased;                                        // 0x57A(0x1)(Edit, ExportObject, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchBegin;                                 // 0x57B(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchEnd;                                   // 0x57C(0x1)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchEnter;                                 // 0x57D(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchLeave;                                 // 0x57E(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	enum class ERayTracingGroupCullingPriority   RayTracingGroupCullingPriority;                    // 0x57F(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	enum class ERendererStencilMask              CustomDepthStencilWriteMask;                       // 0x580(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_97D[0x1F];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        ExcludeFromHLODLevels;                             // 0x5A0(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_97F[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	class UPrimitiveComponent*                   LODParentPrimitive;                                // 0x5A8(0x8)(Edit, ExportObject, EditFixedSize, OutParm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bForcePreventBlockingProjectiles : 1;              // Mask: 0x1, PropSize: 0x10x5B0(0x1)(ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bForceOverlapEvents : 1;                           // Mask: 0x2, PropSize: 0x10x5B0(0x1)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIsInForeground : 1;                               // Mask: 0x4, PropSize: 0x10x5B0(0x1)(BlueprintVisible, Net, OutParm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bUseInternalOctree : 1;                            // Mask: 0x8, PropSize: 0x10x5B0(0x1)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bUseInternalOctreeOnClient : 1;                    // Mask: 0x10, PropSize: 0x10x5B0(0x1)(BlueprintVisible, ExportObject, OutParm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_62 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bForceDynamicPhysics : 1;                          // Mask: 0x40, PropSize: 0x10x5B0(0x1)(Edit, OutParm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bPreventCharacterBasing : 1;                       // Mask: 0x80, PropSize: 0x10x5B0(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_63 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bIsAbstractBasingComponent : 1;                    // Mask: 0x2, PropSize: 0x10x5B1(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bClimbable : 1;                                    // Mask: 0x4, PropSize: 0x10x5B1(0x1)(Net, EditFixedSize, Parm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bUseAbsoluteMaxDrawDisatance : 1;                  // Mask: 0x8, PropSize: 0x10x5B1(0x1)(Edit, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bMovableUseDynamicDrawDistance : 1;                // Mask: 0x10, PropSize: 0x10x5B1(0x1)(Edit, EditFixedSize, Parm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIncludeBoundsRadiusInDrawDistances : 1;           // Mask: 0x20, PropSize: 0x10x5B1(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bExcludeFromLevelBounds : 1;                       // Mask: 0x40, PropSize: 0x10x5B1(0x1)(Edit, Net, Parm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIgnoredByCharacterEncroachment : 1;               // Mask: 0x80, PropSize: 0x10x5B1(0x1)(BlueprintReadOnly, Parm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        bPreventDamage : 1;                                // Mask: 0x1, PropSize: 0x10x5B2(0x1)(ExportObject, Parm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_64 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_982[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        ObjectLayer;                                       // 0x5B4(0x4)(Edit, Parm, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	float                                        OverrideStepHeight;                                // 0x5B8(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_984[0x98];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        InternalOctreeMask;                                // 0x654(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_985[0x1C];                                     // Fixing Size After Last Property  > TateDumper <
	uint32                                       ProxyMeshID;                                       // 0x674(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	bool                                         bIsProxyMeshParent;                                // 0x678(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_988[0x1F];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UPrimitiveComponent* GetDefaultObj();

	void WasRecentlyVisible(bool ReturnValue);
	float WasRecentlyRendered(bool ReturnValue);
	void WakeRigidBody(class FName* BoneName);
	void WakeAllRigidBodies();
	struct FWalkableSlopeOverride SetWalkableSlopeOverride();
	void SetVisibleInSceneCaptureOnly(bool* bValue);
	bool SetVisibleInRayTracing();
	void SetVectorParameterForDefaultCustomPrimitiveData(class FName ParameterName, struct FVector4* Value);
	void SetVectorParameterForCustomPrimitiveData(class FName ParameterName, struct FVector4* Value);
	void SetUseCCD(bool InUseCCD, class FName* BoneName);
	int32 SetTranslucentSortPriority();
	float SetTranslucencySortDistanceOffset();
	bool SetStaticWhenNotMoveable();
	void SetSingleSampleShadowFromStationaryLights(bool* bNewSingleSampleShadowFromStationaryLights);
	void SetSimulatePhysics(bool* bSimulate);
	void SetScalarParameterForDefaultCustomPrimitiveData(class FName ParameterName, float* Value);
	void SetScalarParameterForCustomPrimitiveData(class FName ParameterName, float* Value);
	void SetRenderInMainPass(bool* bValue);
	void SetRenderInDepthPass(bool* bValue);
	void SetRenderCustomDepth(bool* bValue);
	void SetReceivesDecals(bool* bNewReceivesDecals);
	void SetPhysMaterialOverride(class UPhysicalMaterial** NewPhysMaterial);
	void SetPhysicsMaxAngularVelocityInRadians(float* NewMaxAngVel, bool* bAddToCurrent, class FName* BoneName);
	void SetPhysicsMaxAngularVelocityInDegrees(float* NewMaxAngVel, bool* bAddToCurrent, class FName* BoneName);
	void SetPhysicsLinearVelocity(struct FVector* NewVel, bool* bAddToCurrent, class FName* BoneName);
	void SetPhysicsAngularVelocityInRadians(struct FVector* NewAngVel, bool* bAddToCurrent, class FName* BoneName);
	void SetPhysicsAngularVelocityInDegrees(struct FVector* NewAngVel, bool* bAddToCurrent, class FName* BoneName);
	void SetOwnerNoSee(bool* bNewOwnerNoSee);
	void SetOnlyOwnerSee(bool* bNewOnlyOwnerSee);
	void SetNotifyRigidBodyCollision(bool* bNewNotifyRigidBodyCollision);
	void SetMaterialByName(class FName* MaterialSlotName, class UMaterialInterface* Material);
	void SetMaterial(int32 ElementIndex, class UMaterialInterface* Material);
	void SetMassScale(class FName* BoneName, float* InMassScale);
	float SetMassOverrideInKg(class FName* BoneName, bool* bOverrideMass);
	void SetLinearDamping(float InDamping);
	void SetLightingChannels(bool* bChannel0, bool* bChannel1, bool* bChannel2);
	void SetLightAttachmentsAsGroup(bool* bInLightAttachmentsAsGroup);
	void SetInternalOctreeMask(int32* InOctreeMask, bool* bReregisterWithTree);
	void SetHoldout(bool* bNewHoldout);
	void SetHiddenInSceneCapture(bool* bValue);
	void SetGenerateOverlapEvents(bool* bInGenerateOverlapEvents);
	void SetExcludeFromLightAttachmentGroup(bool* bInExcludeFromLightAttachmentGroup);
	void SetExcludeForSpecificHLODLevels(TArray<int32>* InExcludeForSpecificHLODLevels);
	void SetExcludedFromHLODLevel(enum class EHLODLevelExclusion HLODLevel, bool* bExcluded);
	void SetEnableGravity(bool* bGravityEnabled);
	void SetEmissiveLightSource(bool* NewEmissiveLightSource);
	void SetDefaultCustomPrimitiveDataVector4(int32* DataIndex, struct FVector4* Value);
	void SetDefaultCustomPrimitiveDataVector3(int32* DataIndex, struct FVector* Value);
	void SetDefaultCustomPrimitiveDataVector2(int32* DataIndex, struct FVector2D* Value);
	void SetDefaultCustomPrimitiveDataFloat(int32* DataIndex, float* Value);
	void SetCustomPrimitiveDataVector4(int32* DataIndex, struct FVector4* Value);
	void SetCustomPrimitiveDataVector3(int32* DataIndex, struct FVector* Value);
	void SetCustomPrimitiveDataVector2(int32* DataIndex, struct FVector2D* Value);
	void SetCustomPrimitiveDataFloat(int32* DataIndex, float* Value);
	void SetCustomDepthStencilWriteMask(enum class ERendererStencilMask WriteMaskBit);
	void SetCustomDepthStencilValue(int32* Value);
	void SetCullDistance(float NewCullDistance);
	void SetConstraintMode(enum class EDOFMode ConstraintMode);
	enum class ECollisionChannel SetCollisionResponseToChannel(enum class ECollisionResponse NewResponse);
	void SetCollisionResponseToAllChannels(enum class ECollisionResponse NewResponse);
	void SetCollisionResponseSet(const struct FCollisionResponseSet& Responses);
	void SetCollisionProfileName(class FName InCollisionProfileName, bool bUpdateOverlaps);
	enum class ECollisionChannel SetCollisionObjectType();
	void SetCollisionEnabled(enum class ECollisionEnabled NewType);
	void SetCenterOfMass(const struct FVector& CenterOfMassOffset, class FName* BoneName);
	void SetCastShadow(bool NewCastShadow);
	void SetCastInsetShadow(bool bInCastInsetShadow);
	void SetCastHiddenShadow(bool NewCastHiddenShadow);
	void SetCastContactShadow(bool bInCastContactShadow);
	void SetBoundsScale(float NewBoundsScale);
	void SetAngularDamping(float InDamping);
	void SetAllUseCCD(bool InUseCCD);
	void SetAllPhysicsLinearVelocity(struct FVector* NewVel, bool* bAddToCurrent);
	void SetAllPhysicsAngularVelocityInRadians(struct FVector* NewAngVel, bool* bAddToCurrent);
	void SetAllPhysicsAngularVelocityInDegrees(struct FVector* NewAngVel, bool* bAddToCurrent);
	void SetAllMassScale(float* InMassScale);
	void SetAffectIndirectLightingWhileHidden(bool* bNewAffectIndirectLightingWhileHidden);
	void SetAffectDynamicIndirectLighting(bool* bNewAffectDynamicIndirectLighting);
	void SetAffectDistanceFieldLighting(bool* NewAffectDistanceFieldLighting);
	void ScaleByMomentOfInertia(struct FVector* InputVector, class FName* BoneName, const struct FVector& ReturnValue);
	void PutRigidBodyToSleep(class FName* BoneName);
	struct FHitResult K2_SphereTraceComponent(float SphereRadius, bool bTraceComplex, bool* bShowTrace, bool* bPersistentShowTrace, struct FVector* HitNormal, class FName* BoneName, bool ReturnValue);
	struct FHitResult K2_SphereOverlapComponent(struct FVector* InSphereCentre, float* InSphereRadius, bool bTraceComplex, bool* bShowTrace, bool* bPersistentShowTrace, struct FVector* HitNormal, class FName* BoneName, bool ReturnValue);
	struct FHitResult K2_LineTraceComponent(bool bTraceComplex, bool* bShowTrace, bool* bPersistentShowTrace, struct FVector* HitNormal, class FName* BoneName, bool ReturnValue);
	void K2_IsQueryCollisionEnabled(bool ReturnValue);
	void K2_IsPhysicsCollisionEnabled(bool ReturnValue);
	void K2_IsCollisionEnabled(bool ReturnValue);
	struct FHitResult K2_BoxOverlapComponent(struct FVector* InBoxCentre, struct FBox* InBox, bool bTraceComplex, bool* bShowTrace, bool* bPersistentShowTrace, struct FVector* HitNormal, class FName* BoneName, bool ReturnValue);
	class UPrimitiveComponent* IsOverlappingComponent(bool ReturnValue);
	class AActor* IsOverlappingActor(bool ReturnValue);
	void IsGravityEnabled(bool ReturnValue);
	void IsExcludedFromHLODLevel(enum class EHLODLevelExclusion HLODLevel, bool ReturnValue);
	void IsAnyRigidBodyAwake(bool ReturnValue);
	void InvalidateLumenSurfaceCache();
	void IgnoreComponentWhenMoving(class UPrimitiveComponent* Component, bool bShouldIgnore);
	void IgnoreActorWhenMoving(class AActor** Actor, bool bShouldIgnore);
	void GetWalkableSlopeOverride(const struct FWalkableSlopeOverride& ReturnValue);
	void GetStaticWhenNotMoveable(bool ReturnValue);
	struct FVector GetPhysicsLinearVelocityAtPoint(class FName* BoneName, const struct FVector& ReturnValue);
	void GetPhysicsLinearVelocity(class FName* BoneName, const struct FVector& ReturnValue);
	void GetPhysicsAngularVelocityInRadians(class FName* BoneName, const struct FVector& ReturnValue);
	void GetPhysicsAngularVelocityInDegrees(class FName* BoneName, const struct FVector& ReturnValue);
	void GetOverlappingComponents(const TArray<class UPrimitiveComponent*>& OutOverlappingComponents);
	void GetOverlappingActors(TArray<class AActor*>* OverlappingActors, class UClass* ClassFilter);
	void GetNumMaterials(int32 ReturnValue);
	int32 GetMaterialFromCollisionFaceIndex(int32 SectionIndex, class UMaterialInterface* ReturnValue);
	void GetMaterial(int32 ElementIndex, class UMaterialInterface* ReturnValue);
	void GetMassScale(class FName* BoneName, float ReturnValue);
	void GetMass(float ReturnValue);
	void GetLinearDamping(float ReturnValue);
	void GetInertiaTensor(class FName* BoneName, const struct FVector& ReturnValue);
	void GetGenerateOverlapEvents(bool ReturnValue);
	void GetExcludeForSpecificHLODLevels(const TArray<int32>& ReturnValue);
	void GetCustomPrimitiveDataIndexForVectorParameter(class FName ParameterName, int32 ReturnValue);
	void GetCustomPrimitiveDataIndexForScalarParameter(class FName ParameterName, int32 ReturnValue);
	enum class ECollisionChannel GetCollisionResponseToChannel(enum class ECollisionResponse ReturnValue);
	void GetCollisionResponseSet(const struct FCollisionResponseSet& OutResponses);
	void GetCollisionProfileName(class FName ReturnValue);
	void GetCollisionObjectType(enum class ECollisionChannel ReturnValue);
	void GetCollisionEnabled(enum class ECollisionEnabled ReturnValue);
	struct FVector GetClosestPointOnCollision(class FName* BoneName, float ReturnValue);
	void GetCenterOfMass(class FName* BoneName, const struct FVector& ReturnValue);
	bool GetBodyInstanceAsyncPhysicsTickHandle(class FName* BoneName, int32* Index, const struct FBodyInstanceAsyncPhysicsTickHandle& ReturnValue);
	void GetAngularDamping(float ReturnValue);
	class FName CreateDynamicMaterialInstance(int32 ElementIndex, class UMaterialInstanceDynamic* ReturnValue);
	void CreateAndSetMaterialInstanceDynamicFromMaterial(int32 ElementIndex, class UMaterialInterface** Parent, class UMaterialInstanceDynamic* ReturnValue);
	void CreateAndSetMaterialInstanceDynamic(int32 ElementIndex, class UMaterialInstanceDynamic* ReturnValue);
	void CopyArrayOfMoveIgnoreComponents(const TArray<class UPrimitiveComponent*>& ReturnValue);
	void CopyArrayOfMoveIgnoreActors(const TArray<class AActor*>& ReturnValue);
	void ClearMoveIgnoreComponents();
	void ClearMoveIgnoreActors();
	void CanCharacterStepUp(class APawn* Pawn, bool ReturnValue);
	struct FVector AddVelocityChangeImpulseAtLocation(struct FVector* Location, class FName* BoneName);
	bool AddTorqueInRadians(class FName* BoneName);
	bool AddTorqueInDegrees(class FName* BoneName);
	bool AddRadialImpulse(float* Radius);
	bool AddRadialForce(float* Radius);
	struct FVector AddImpulseAtLocation(struct FVector* Location, class FName* BoneName);
	bool AddImpulse(class FName* BoneName);
	struct FVector AddForceAtLocationLocal(struct FVector* Location, class FName* BoneName);
	struct FVector AddForceAtLocation(struct FVector* Location, class FName* BoneName);
	bool AddForce(class FName* BoneName);
	bool AddAngularImpulseInRadians(class FName* BoneName);
	bool AddAngularImpulseInDegrees(class FName* BoneName);
};

// 0x0 (0x698 - 0x698)
// Class Engine.FXSystemComponent
class UFXSystemComponent : public UPrimitiveComponent
{
public:

	static class UClass* StaticClass();
	static class UFXSystemComponent* GetDefaultObj();

	struct FVector SetVectorParameter(class FName ParameterName);
	bool SetUseAutoManageAttachment();
	int32 SetIntParameter(class FName ParameterName);
	float SetFloatParameter(class FName ParameterName);
	bool SetEmitterEnable(class FName EmitterName);
	struct FLinearColor SetColorParameter(class FName ParameterName);
	bool SetBoolParameter(class FName ParameterName);
	void SetAutoAttachmentParameters(class USceneComponent** Parent, class FName* SocketName, enum class EAttachmentRule* LocationRule, enum class EAttachmentRule* RotationRule, enum class EAttachmentRule* ScaleRule);
	class AActor* SetActorParameter(class FName ParameterName);
	void ReleaseToPool();
	void GetFXSystemAsset(class UFXSystemAsset* ReturnValue);
};

// 0x8 (0x30 - 0x28)
// Class Engine.BlueprintAsyncActionBase
class UBlueprintAsyncActionBase : public UObject
{
public:
	uint8                                        Pad_9F3[0x8];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UBlueprintAsyncActionBase* GetDefaultObj();

	void Activate();
};

// 0x48 (0x70 - 0x28)
// Class Engine.FXSystemAsset
class UFXSystemAsset : public UObject
{
public:
	uint32                                       MaxPoolSize;                                       // 0x28(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, Config, InstancedReference, SubobjectReference)
	uint32                                       PoolPrimeSize;                                     // 0x2C(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_9F9[0x40];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UFXSystemAsset* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class Engine.AnimNotifyState
class UAnimNotifyState : public UObject
{
public:
	uint8                                        Pad_A1E[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	bool                                         bIgnoreOnDediServer;                               // 0x29(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bCanClobberEventReference;                         // 0x2A(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_A1F[0x5];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimNotifyState* GetDefaultObj();

	float Received_NotifyTick(struct FAnimNotifyEventReference* EventReference, bool ReturnValue);
	class UAnimSequenceBase* Received_NotifyEnd(struct FAnimNotifyEventReference* EventReference, bool ReturnValue);
	float Received_NotifyBegin(struct FAnimNotifyEventReference* EventReference, bool ReturnValue);
	void GetNotifyName(const class FString& ReturnValue);
	void GetDefaultTriggerWeightThreshold(float ReturnValue);
};

// 0x18 (0x40 - 0x28)
// Class Engine.AnimNotify
class UAnimNotify : public UObject
{
public:
	uint8                                        Pad_A36[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bIgnoreOnDediServer;                               // 0x38(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bCanClobberEventReference;                         // 0x39(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_A38[0x6];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimNotify* GetDefaultObj();

	class UAnimSequenceBase* Received_Notify(struct FAnimNotifyEventReference* EventReference, bool ReturnValue);
	void GetNotifyName(const class FString& ReturnValue);
	void GetDefaultTriggerWeightThreshold(float ReturnValue);
};

// 0x0 (0x4C8 - 0x4C8)
// Class Engine.TrueSkyActorParent
class ATrueSkyActorParent : public AActor
{
public:

	static class UClass* StaticClass();
	static class ATrueSkyActorParent* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class Engine.Subsystem
class USubsystem : public UObject
{
public:
	uint8                                        Pad_A3D[0x8];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class USubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.DynamicSubsystem
class UDynamicSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass();
	static class UDynamicSubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.EngineSubsystem
class UEngineSubsystem : public UDynamicSubsystem
{
public:

	static class UClass* StaticClass();
	static class UEngineSubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.OnlineBlueprintCallProxyBase
class UOnlineBlueprintCallProxyBase : public UBlueprintAsyncActionBase
{
public:

	static class UClass* StaticClass();
	static class UOnlineBlueprintCallProxyBase* GetDefaultObj();

};

// 0x28 (0x50 - 0x28)
// Class Engine.Player
class UPlayer : public UObject
{
public:
	uint8                                        Pad_A45[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	class APlayerController*                     PlayerController;                                  // 0x30(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, Config, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	int32                                        CurrentNetSpeed;                                   // 0x38(0x4)(Edit, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	int32                                        ConfiguredInternetSpeed;                           // 0x3C(0x4)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, SubobjectReference)
	int32                                        ConfiguredLanSpeed;                                // 0x40(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, SubobjectReference)
	uint8                                        Pad_A48[0xC];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UPlayer* GetDefaultObj();

};

// 0x1D98 (0x1DE8 - 0x50)
// Class Engine.NetConnection
class UNetConnection : public UPlayer
{
public:
	TArray<class UChildConnection*>              Children;                                          // 0x50(0x10)(Edit, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance)
	class UNetDriver*                            Driver;                                            // 0x60(0x8)(Edit, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	class UClass*                                PackageMapClass;                                   // 0x68(0x8)(Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	class UPackageMap*                           PackageMap;                                        // 0x70(0x8)(Edit, ConstParm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	TArray<class UChannel*>                      OpenChannels;                                      // 0x78(0x10)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<class AActor*>                        SentTemporaries;                                   // 0x88(0x10)(BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	class AActor*                                ViewTarget;                                        // 0x98(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	class AActor*                                OwningActor;                                       // 0xA0(0x8)(Edit, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	int32                                        MaxPacket;                                         // 0xA8(0x4)(Edit, ConstParm, EditFixedSize, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        InternalAck : 1;                                   // Mask: 0x1, PropSize: 0x10xAC(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_6F : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_A4B[0xBB];                                     // Fixing Size After Last Property  > TateDumper <
	struct FUniqueNetIdRepl                      PlayerID;                                          // 0x168(0x30)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_A4C[0x48];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LastReceiveTime;                                   // 0x1E0(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_A4D[0x11E0];                                   // Fixing Size After Last Property  > TateDumper <
	int32                                        DefaultMaxChannelSize;                             // 0x13C8(0x4)(Edit, ConstParm, BlueprintVisible, Net, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_A4E[0x304];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<class UChannel*>                      ChannelsToTick;                                    // 0x16D0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_A51[0x700];                                    // Fixing Size After Last Property  > TateDumper <
	uint8                                        bHasArkLoginLock : 1;                              // Mask: 0x1, PropSize: 0x10x1DE0(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_A52[0x7];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UNetConnection* GetDefaultObj();

};

// 0x768 (0x790 - 0x28)
// Class Engine.NetDriver
class UNetDriver : public UObject
{
public:
	uint8                                        Pad_A57[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	class FString                                NetConnectionClassName;                            // 0x30(0x10)(Edit, ConstParm, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, SubobjectReference)
	class FString                                ReplicationDriverClassName;                        // 0x40(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	class FString                                ReplicationBridgeClassName;                        // 0x50(0x10)(Edit, ExportObject, Parm, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	int32                                        MaxDownloadSize;                                   // 0x60(0x4)(Parm, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        bClampListenServerTickRate : 1;                    // Mask: 0x1, PropSize: 0x10x64(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_71 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_A5A[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        NetServerMaxTickRate;                              // 0x68(0x4)(ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, SubobjectReference)
	int32                                        MaxNetTickRate;                                    // 0x6C(0x4)(Edit, ConstParm, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, SubobjectReference)
	int32                                        MaxInternetClientRate;                             // 0x70(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, SubobjectReference)
	int32                                        MaxClientRate;                                     // 0x74(0x4)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, SubobjectReference)
	float                                        ServerTravelPause;                                 // 0x78(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, SubobjectReference)
	float                                        SpawnPrioritySeconds;                              // 0x7C(0x4)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, SubobjectReference)
	float                                        RelevantTimeout;                                   // 0x80(0x4)(ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, SubobjectReference)
	float                                        KeepAliveTime;                                     // 0x84(0x4)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, SubobjectReference)
	float                                        InitialConnectTimeout;                             // 0x88(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, SubobjectReference)
	float                                        ConnectionTimeout;                                 // 0x8C(0x4)(Edit, ConstParm, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, SubobjectReference)
	float                                        TimeoutMultiplierForUnoptimizedBuilds;             // 0x90(0x4)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, SubobjectReference)
	uint8                                        Pad_A5E[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	class UNetConnection*                        ServerConnection;                                  // 0x98(0x8)(Edit, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<class UNetConnection*>                ClientConnections;                                 // 0xA0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_A60[0x60];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        RecentlyDisconnectedTrackingTime;                  // 0x110(0x4)(Edit, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, SubobjectReference)
	uint8                                        Pad_A61[0x3C];                                     // Fixing Size After Last Property  > TateDumper <
	class UWorld*                                World;                                             // 0x150(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, Transient, DisableEditOnInstance)
	class UPackage*                              WorldPackage;                                      // 0x158(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_A63[0x20];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                NetConnectionClass;                                // 0x180(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	class UClass*                                ReplicationDriverClass;                            // 0x188(0x8)(ConstParm, EditFixedSize, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	class UClass*                                ReplicationBridgeClass;                            // 0x190(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_A65[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  NetDriverName;                                     // 0x1A8(0x8)(ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FChannelDefinition>            ChannelDefinitions;                                // 0x1B0(0x10)(BlueprintVisible, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, SubobjectReference)
	TMap<class FName, struct FChannelDefinition> ChannelDefinitionMap;                              // 0x1C0(0x50)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<class UChannel*>                      ActorChannelPool;                                  // 0x210(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_A68[0x21];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        BitPad_73 : 6;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bNoTimeouts : 1;                                   // Mask: 0x40, PropSize: 0x10x241(0x1)(ConstParm, BlueprintVisible, ExportObject, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        bNeverApplyNetworkEmulationSettings : 1;           // Mask: 0x80, PropSize: 0x10x241(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_A6B[0x4DE];                                    // Fixing Size After Last Property  > TateDumper <
	class UReplicationDriver*                    ReplicationDriver;                                 // 0x720(0x8)(ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst)
	uint8                                        Pad_A6C[0x68];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UNetDriver* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.OnlineEngineInterface
class UOnlineEngineInterface : public UObject
{
public:

	static class UClass* StaticClass();
	static class UOnlineEngineInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.OnlineSession
class UOnlineSession : public UObject
{
public:

	static class UClass* StaticClass();
	static class UOnlineSession* GetDefaultObj();

};

// 0x40 (0x6D8 - 0x698)
// Class Engine.MeshComponent
class UMeshComponent : public UPrimitiveComponent
{
public:
	TArray<class UMaterialInterface*>            OverrideMaterials;                                 // 0x698(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class UMaterialInterface*                    OverlayMaterial;                                   // 0x6A8(0x8)(ConstParm, BlueprintVisible, OutParm, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	float                                        OverlayMaterialMaxDrawDistance;                    // 0x6B0(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	uint8                                        Pad_ABD[0x14];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        bEnableMaterialParameterCaching : 1;               // Mask: 0x1, PropSize: 0x10x6C8(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_77 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_AC0[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	class UClass*                                DamageFXActorToSpawn;                              // 0x6D0(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnInstance, GlobalConfig, SubobjectReference)

	static class UClass* StaticClass();
	static class UMeshComponent* GetDefaultObj();

	void SetVectorParameterValueOnMaterials(class FName ParameterName, const struct FVector& ParameterValue);
	void SetScalarParameterValueOnMaterials(class FName ParameterName, float ParameterValue);
	void SetOverlayMaterialMaxDrawDistance(float InMaxDrawDistance);
	void SetOverlayMaterial(class UMaterialInterface* NewOverlayMaterial);
	float PrestreamTextures(bool bPrioritizeCharacterTextures, int32 CinematicTextureGroups);
	void MulticastShowInstance(int32 OriginalIndex);
	void MulticastHideInstance(int32 OriginalIndex, const struct FVector& HitDirection, float Damage, float TotalHealth, bool bCheckHideAttachedDecals);
	void IsMaterialSlotNameValid(class FName* MaterialSlotName, bool ReturnValue);
	void GetOverlayMaterial(class UMaterialInterface* ReturnValue);
	void GetMaterialSlotNames(const TArray<class FName>& ReturnValue);
	void GetMaterials(const TArray<class UMaterialInterface*>& ReturnValue);
	void GetMaterialIndex(class FName* MaterialSlotName, int32 ReturnValue);
};

// 0x88 (0xB0 - 0x28)
// Class Engine.MaterialExpression
class UMaterialExpression : public UObject
{
public:
	int32                                        MaterialExpressionEditorX;                         // 0x28(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        MaterialExpressionEditorY;                         // 0x2C(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	class UEdGraphNode*                          GraphNode;                                         // 0x30(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	class UMaterialExpression*                   SubgraphExpression;                                // 0x38(0x8)(ExportObject, EditFixedSize, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_AD4[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	struct FGuid                                 MaterialExpressionGuid;                            // 0x50(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	class UMaterial*                             Material;                                          // 0x60(0x8)(Edit, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance)
	class UMaterialFunction*                     Function;                                          // 0x68(0x8)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor)
	class FString                                Desc;                                              // 0x70(0x10)(Edit, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_AD6[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bRealtimePreview : 1;                              // Mask: 0x1, PropSize: 0x10x84(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bNeedToUpdatePreview : 1;                          // Mask: 0x2, PropSize: 0x10x84(0x1)(ExportObject, Net, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_78 : 6;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_AD9[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bIsParameterExpression : 1;                        // Mask: 0x1, PropSize: 0x10x88(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_79 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_ADC[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bCommentBubbleVisible : 1;                         // Mask: 0x1, PropSize: 0x10x8C(0x1)(BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bShowOutputNameOnPin : 1;                          // Mask: 0x2, PropSize: 0x10x8C(0x1)(Edit, BlueprintVisible, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bShowMaskColorsOnPin : 1;                          // Mask: 0x4, PropSize: 0x10x8C(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bHidePreviewWindow : 1;                            // Mask: 0x8, PropSize: 0x10x8C(0x1)(BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bCollapsed : 1;                                    // Mask: 0x10, PropSize: 0x10x8C(0x1)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bShaderInputData : 1;                              // Mask: 0x20, PropSize: 0x10x8C(0x1)(Edit, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bShowInputs : 1;                                   // Mask: 0x40, PropSize: 0x10x8C(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bShowOutputs : 1;                                  // Mask: 0x80, PropSize: 0x10x8C(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_AE3[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<class FText>                          MenuCategories;                                    // 0x90(0x10)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	TArray<struct FExpressionOutput>             Outputs;                                           // 0xA0(0x10)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)

	static class UClass* StaticClass();
	static class UMaterialExpression* GetDefaultObj();

};

// 0x48 (0x70 - 0x28)
// Class Engine.Channel
class UChannel : public UObject
{
public:
	class UNetConnection*                        Connection;                                        // 0x28(0x8)(Edit, ConstParm, Net, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_AE6[0x40];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UChannel* GetDefaultObj();

};

// 0x18 (0x88 - 0x70)
// Class Engine.ControlChannel
class UControlChannel : public UChannel
{
public:
	uint8                                        Pad_AE7[0x18];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UControlChannel* GetDefaultObj();

};

// 0x198 (0x1C0 - 0x28)
// Class Engine.GameInstance
class UGameInstance : public UObject
{
public:
	uint8                                        Pad_B03[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class ULocalPlayer*>                  LocalPlayers;                                      // 0x38(0x10)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class UOnlineSession*                        OnlineSession;                                     // 0x48(0x8)(Edit, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst)
	TArray<class UObject*>                       ReferencedObjects;                                 // 0x50(0x10)(Edit, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_B07[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnPawnControllerChangedDelegates;                  // 0x78(0x10)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_B08[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnInputDeviceConnectionChange;                     // 0xA0(0x10)(Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnUserInputDevicePairingChange;                    // 0xB0(0x10)(BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_B0A[0x100];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UGameInstance* GetDefaultObj();

	void ReceiveShutdown();
	void ReceiveInit();
	void HandleTravelError(enum class ETravelFailure* FailureType);
	void HandleNetworkError(enum class ENetworkFailure* FailureType, bool* bIsServer);
	void DebugRemovePlayer(int32 ControllerId);
	void DebugCreatePlayer(int32 ControllerId);
};

// 0x0 (0x30 - 0x30)
// Class Engine.GameInstanceSubsystem
class UGameInstanceSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass();
	static class UGameInstanceSubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.WorldSubsystem
class UWorldSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass();
	static class UWorldSubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.RecentPlayersWorldSubsystemBase
class URecentPlayersWorldSubsystemBase : public UWorldSubsystem
{
public:

	static class UClass* StaticClass();
	static class URecentPlayersWorldSubsystemBase* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.AssetImportData
class UAssetImportData : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAssetImportData* GetDefaultObj();

};

// 0x368 (0xA40 - 0x6D8)
// Class Engine.SkinnedMeshComponent
class USkinnedMeshComponent : public UMeshComponent
{
public:
	uint8                                        Pad_C0D[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	class USkeletalMesh*                         SkeletalMesh;                                      // 0x6E0(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig)
	class USkinnedAsset*                         SkinnedAsset;                                      // 0x6E8(0x8)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, SubobjectReference)
	TWeakObjectPtr<class USkinnedMeshComponent>  LeaderPoseComponent;                               // 0x6F0(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	TArray<enum class ESkinCacheUsage>           SkinCacheUsage;                                    // 0x6F8(0x10)(BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bSetMeshDeformer;                                  // 0x708(0x1)(EditFixedSize, Parm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        Pad_C10[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	class UMeshDeformer*                         MeshDeformer;                                      // 0x710(0x8)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst)
	class UMeshDeformerInstanceSettings*         MeshDeformerInstanceSettings;                      // 0x718(0x8)(BlueprintVisible, BlueprintReadOnly, Net, Transient, DisableEditOnInstance, EditConst)
	class UMeshDeformerInstance*                 MeshDeformerInstance;                              // 0x720(0x8)(BlueprintReadOnly, EditFixedSize, Transient, DisableEditOnInstance, EditConst)
	uint8                                        Pad_C12[0x178];                                    // Fixing Size After Last Property  > TateDumper <
	class UPhysicsAsset*                         PhysicsAssetOverride;                              // 0x8A0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	int32                                        ForcedLodModel;                                    // 0x8A8(0x4)(Edit, BlueprintVisible, ExportObject, Net, Parm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	int32                                        MinLodModel;                                       // 0x8AC(0x4)(ConstParm, BlueprintVisible, Net, Parm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        Pad_C13[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        StreamingDistanceMultiplier;                       // 0x8B8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, SubobjectReference)
	uint8                                        Pad_C14[0xC];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<struct FSkelMeshComponentLODInfo>     LODInfo;                                           // 0x8C8(0x10)(Edit, Net, Parm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        Pad_C15[0x24];                                     // Fixing Size After Last Property  > TateDumper <
	enum class EVisibilityBasedAnimTickOption    VisibilityBasedAnimTickOption;                     // 0x8FC(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_C16[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        BitPad_87 : 3;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bOverrideMinLod : 1;                               // Mask: 0x8, PropSize: 0x10x8FE(0x1)(ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bUseBoundsFromLeaderPoseComponent : 1;             // Mask: 0x10, PropSize: 0x10x8FE(0x1)(BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        bForceWireframe : 1;                               // Mask: 0x20, PropSize: 0x10x8FE(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bDisableMorphTarget : 1;                           // Mask: 0x40, PropSize: 0x10x8FE(0x1)(BlueprintVisible, Parm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bHideSkin : 1;                                     // Mask: 0x80, PropSize: 0x10x8FE(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bPerBoneMotionBlur : 1;                            // Mask: 0x1, PropSize: 0x10x8FF(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bComponentUseFixedSkelBounds : 1;                  // Mask: 0x2, PropSize: 0x10x8FF(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bConsiderAllBodiesForBounds : 1;                   // Mask: 0x4, PropSize: 0x10x8FF(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bSyncAttachParentLOD : 1;                          // Mask: 0x8, PropSize: 0x10x8FF(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bCanHighlightSelectedSections : 1;                 // Mask: 0x10, PropSize: 0x10x8FF(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bRecentlyRendered : 1;                             // Mask: 0x20, PropSize: 0x10x8FF(0x1)(Edit, BlueprintReadOnly, Net, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bCastCapsuleDirectShadow : 1;                      // Mask: 0x40, PropSize: 0x10x8FF(0x1)(BlueprintVisible, Net, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bCastCapsuleIndirectShadow : 1;                    // Mask: 0x80, PropSize: 0x10x8FF(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bCPUSkinning : 1;                                  // Mask: 0x1, PropSize: 0x10x900(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bEnableUpdateRateOptimizations : 1;                // Mask: 0x2, PropSize: 0x10x900(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        bDisplayDebugUpdateRateOptimizations : 1;          // Mask: 0x4, PropSize: 0x10x900(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        bRenderStatic : 1;                                 // Mask: 0x8, PropSize: 0x10x900(0x1)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        bIgnoreLeaderPoseComponentLOD : 1;                 // Mask: 0x10, PropSize: 0x10x900(0x1)(ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        BitPad_88 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bCachedLocalBoundsUpToDate : 1;                    // Mask: 0x80, PropSize: 0x10x900(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        bCachedWorldSpaceBoundsUpToDate : 1;               // Mask: 0x1, PropSize: 0x10x901(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        BitPad_89 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bForceMeshObjectUpdate : 1;                        // Mask: 0x4, PropSize: 0x10x901(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        bForceUpdateDynamicDataImmediately : 1;            // Mask: 0x8, PropSize: 0x10x901(0x1)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        BitPad_8A : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        BitPad_8B : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bFollowerShouldTickPose : 1;                       // Mask: 0x2, PropSize: 0x10x902(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        BitPad_8C : 6;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_C18[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        CapsuleIndirectShadowMinVisibility;                // 0x904(0x4)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        Pad_C19[0x38];                                     // Fixing Size After Last Property  > TateDumper <
	struct FBoxSphereBounds                      CachedWorldOrLocalSpaceBounds;                     // 0x940(0x38)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        Pad_C1A[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FMatrix                               CachedWorldToLocalTransform;                       // 0x980(0x80)(Edit, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        Pad_C1B[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        bForceUpdateKinematic : 1;                         // Mask: 0x1, PropSize: 0x10xA18(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        bChartDistanceFactor : 1;                          // Mask: 0x2, PropSize: 0x10xA18(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        bFreeSpaceBasesOnUnregister : 1;                   // Mask: 0x4, PropSize: 0x10xA18(0x1)(Edit, ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        bForceTickPoseWithinRange : 1;                     // Mask: 0x8, PropSize: 0x10xA18(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        bAlwaysUpdateMeshForShadowRendering : 1;           // Mask: 0x10, PropSize: 0x10xA18(0x1)(ConstParm, Net, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        bAddAttachedParentBounds : 1;                      // Mask: 0x20, PropSize: 0x10xA18(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        bBasedPawnsTriggerChildTick : 1;                   // Mask: 0x40, PropSize: 0x10xA18(0x1)(ConstParm, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        BitPad_8D : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_C21[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        ForceTickPoseWithinRangeSquared;                   // 0xA1C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	class USkinnedMeshComponent*                 OverrideTickingVisiblityMesh;                      // 0xA20(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	float                                        ShadowedRecentlyRenderedBoundsScaleMultiplier;     // 0xA28(0x4)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        Pad_C22[0x14];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class USkinnedMeshComponent* GetDefaultObj();

	void UnsetMeshDeformer();
	class FName UnloadSkinWeightProfile();
	void UnHideBoneByName(class FName* BoneName);
	struct FRotator TransformToBoneSpace(class FName* BoneName, struct FVector* InPosition);
	struct FRotator TransformFromBoneSpace(class FName* BoneName, struct FVector* InPosition);
	int32 ShowMaterialSection(int32 MaterialID, int32 SectionIndex, bool bShow);
	int32 ShowAllMaterialSections();
	void ShouldTickPose(bool ReturnValue);
	int32 SetVertexOffsetUsage(int32* Usage);
	int32 SetVertexColorOverride_LinearColor(TArray<struct FLinearColor>* VertexColors);
	class FName SetSkinWeightProfile(bool ReturnValue);
	int32 SetSkinWeightOverride(TArray<struct FSkelMeshSkinWeightInfo>* SkinWeights);
	bool SetSkinnedAssetAndUpdate(class USkinnedAsset** NewMesh);
	void SetRenderStatic(bool* bNewValue);
	int32 SetPreSkinningOffsets(const TArray<struct FVector>& Offsets);
	int32 SetPostSkinningOffsets(const TArray<struct FVector>& Offsets);
	bool SetPhysicsAsset();
	int32 SetMinLOD();
	void SetMeshDeformer(class UMeshDeformer* InMeshDeformer);
	bool SetLeaderPoseComponent(class USkinnedMeshComponent* NewLeaderBoneComponent);
	int32 SetForcedLOD();
	void SetCastCapsuleIndirectShadow(bool* bNewValue);
	void SetCastCapsuleDirectShadow(bool* bNewValue);
	void SetCapsuleIndirectShadowMinVisibility(float* NewValue);
	void IsUsingSkinWeightProfile(bool ReturnValue);
	int32 IsMaterialSectionShown(int32 MaterialID, bool ReturnValue);
	void IsBoneHiddenByName(class FName* BoneName, bool ReturnValue);
	enum class EPhysBodyOp HideBoneByName(class FName* BoneName);
	int32 GetVertexOffsetUsage(int32 ReturnValue);
	float GetTwistAndSwingAngleOfDeltaRotationFromRefPose(class FName* BoneName, bool ReturnValue);
	void GetSocketBoneName(class FName InSocketName, class FName ReturnValue);
	void GetSkinnedAsset(class USkinnedAsset* ReturnValue);
	void GetSkeletalMesh_DEPRECATED(class USkeletalMesh* ReturnValue);
	void GetRefPoseTransform(int32* BoneIndex, const struct FTransform& ReturnValue);
	void GetRefPosePosition(int32* BoneIndex, const struct FVector& ReturnValue);
	void GetPredictedLODLevel(int32 ReturnValue);
	void GetParentBone(class FName* BoneName, class FName ReturnValue);
	void GetNumLODs(int32 ReturnValue);
	void GetNumBones(int32 ReturnValue);
	void GetMeshDeformerInstance(class UMeshDeformerInstance* ReturnValue);
	void GetForcedLOD(int32 ReturnValue);
	void GetDeltaTransformFromRefPose(class FName* BoneName, class FName* BaseName, const struct FTransform& ReturnValue);
	void GetCurrentSkinWeightProfileName(class FName ReturnValue);
	void GetBoneName(int32* BoneIndex, class FName ReturnValue);
	void GetBoneIndex(class FName* BoneName, int32 ReturnValue);
	bool FindClosestBone_K2(class FName ReturnValue);
	int32 ClearVertexColorOverride();
	void ClearSkinWeightProfile();
	int32 ClearSkinWeightOverride();
	class FName BoneIsChildOf(class FName* BoneName, bool ReturnValue);
};

// 0x9C8 (0x1408 - 0xA40)
// Class Engine.SkeletalMeshComponent
class USkeletalMeshComponent : public USkinnedMeshComponent
{
public:
	uint8                                        Pad_10EA[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	class USkeletalMesh*                         SkeletalMeshAsset;                                 // 0xA48(0x8)(Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UClass*                                AnimBlueprintGeneratedClass;                       // 0xA50(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	class UClass*                                AnimClass;                                         // 0xA58(0x8)(Edit, BlueprintVisible, Parm, OutParm, Transient, InstancedReference, SubobjectReference)
	class UAnimInstance*                         AnimScriptInstance;                                // 0xA60(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, InstancedReference, SubobjectReference)
	class UAnimInstance*                         PostProcessAnimInstance;                           // 0xA68(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, Transient, InstancedReference, SubobjectReference)
	struct FSingleAnimationPlayData              AnimationData;                                     // 0xA70(0x18)(ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Transient, SubobjectReference)
	uint8                                        Pad_10EF[0x10];                                    // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RootBoneTranslation;                               // 0xA98(0x18)(Edit, ConstParm, Net, EditFixedSize, OutParm, Transient, InstancedReference, SubobjectReference)
	struct FVector                               LineCheckBoundsScale;                              // 0xAB0(0x18)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, Transient, InstancedReference, SubobjectReference)
	uint8                                        Pad_10F0[0x30];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<class UAnimInstance*>                 LinkedInstances;                                   // 0xAF8(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, Transient, InstancedReference, SubobjectReference)
	TArray<struct FTransform>                    CachedBoneSpaceTransforms;                         // 0xB08(0x10)(Edit, EditFixedSize, OutParm, Transient, InstancedReference, SubobjectReference)
	TArray<struct FTransform>                    CachedComponentSpaceTransforms;                    // 0xB18(0x10)(Edit, BlueprintReadOnly, Net, OutParm, Transient, InstancedReference, SubobjectReference)
	uint8                                        Pad_10F2[0xB0];                                    // Fixing Size After Last Property  > TateDumper <
	float                                        GlobalAnimRateScale;                               // 0xBD8(0x4)(ConstParm, BlueprintVisible, Net, OutParm, Transient, InstancedReference, SubobjectReference)
	uint8                                        bAllowKinematicUpdateStaggering : 1;               // Mask: 0x1, PropSize: 0x10xBDC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, OutParm, Transient, InstancedReference, SubobjectReference)
	uint8                                        BitPad_99 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_10F3[0xB];                                     // Fixing Size After Last Property  > TateDumper <
	enum class EKinematicBonesUpdateToPhysics    KinematicBonesUpdateType;                          // 0xBE8(0x1)(ExportObject, OutParm, Transient, InstancedReference, SubobjectReference)
	enum class EPhysicsTransformUpdateMode       PhysicsTransformUpdateMode;                        // 0xBE9(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, Transient, InstancedReference, SubobjectReference)
	uint8                                        Pad_10F5[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	enum class ECollisionEnabled                 PreSleepingKinematicsCollisionType;                // 0xBEB(0x1)(ExportObject, Net, EditFixedSize, Parm, Transient, InstancedReference, SubobjectReference)
	enum class EAnimationMode                    AnimationMode;                                     // 0xBEC(0x1)(Net, EditFixedSize, Parm, Transient, InstancedReference, SubobjectReference)
	uint8                                        Pad_10F6[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        bDisablePostProcessBlueprint : 1;                  // Mask: 0x1, PropSize: 0x10xBEE(0x1)(Edit, BlueprintReadOnly, EditFixedSize, Parm, Transient, InstancedReference, SubobjectReference)
	uint8                                        BitPad_9A : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bUpdateOverlapsOnAnimationFinalize : 1;            // Mask: 0x4, PropSize: 0x10xBEE(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, Transient, InstancedReference, SubobjectReference)
	uint8                                        BitPad_9B : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bHasValidBodies : 1;                               // Mask: 0x10, PropSize: 0x10xBEE(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, Transient, InstancedReference, SubobjectReference)
	uint8                                        bBlendPhysics : 1;                                 // Mask: 0x20, PropSize: 0x10xBEE(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, Transient, InstancedReference, SubobjectReference)
	uint8                                        bEnablePhysicsOnDedicatedServer : 1;               // Mask: 0x40, PropSize: 0x10xBEE(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, Transient, InstancedReference, SubobjectReference)
	uint8                                        bUpdateMeshWhenKinematic : 1;                      // Mask: 0x80, PropSize: 0x10xBEE(0x1)(BlueprintReadOnly, Parm, Transient, InstancedReference, SubobjectReference)
	uint8                                        bUpdateJointsFromAnimation : 1;                    // Mask: 0x1, PropSize: 0x10xBEF(0x1)(ConstParm, Parm, Transient, InstancedReference, SubobjectReference)
	uint8                                        bAllowClothActors : 1;                             // Mask: 0x2, PropSize: 0x10xBEF(0x1)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Transient, InstancedReference, SubobjectReference)
	uint8                                        bDisableClothSimulation : 1;                       // Mask: 0x4, PropSize: 0x10xBEF(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Transient, InstancedReference, SubobjectReference)
	uint8                                        BitPad_9C : 5;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_10FC[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        bDisableRigidBodyAnimNode : 1;                     // Mask: 0x1, PropSize: 0x10xBF4(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Transient, InstancedReference, SubobjectReference)
	uint8                                        bAllowAnimCurveEvaluation : 1;                     // Mask: 0x2, PropSize: 0x10xBF4(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Transient, InstancedReference, SubobjectReference)
	uint8                                        BitPad_9D : 3;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bCollideWithEnvironment : 1;                       // Mask: 0x20, PropSize: 0x10xBF4(0x1)(ConstParm, EditFixedSize, Transient, InstancedReference, SubobjectReference)
	uint8                                        bCollideWithAttachedChildren : 1;                  // Mask: 0x40, PropSize: 0x10xBF4(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, Transient, InstancedReference, SubobjectReference)
	uint8                                        bForceCollisionUpdate : 1;                         // Mask: 0x80, PropSize: 0x10xBF4(0x1)(Edit, ConstParm, BlueprintVisible, Net, Transient, InstancedReference, SubobjectReference)
	uint8                                        bLocalSpaceSimulation : 1;                         // Mask: 0x1, PropSize: 0x10xBF5(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Transient, InstancedReference, SubobjectReference)
	uint8                                        bResetAfterTeleport : 1;                           // Mask: 0x2, PropSize: 0x10xBF5(0x1)(BlueprintReadOnly, Transient, InstancedReference, SubobjectReference)
	uint8                                        BitPad_9E : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bDeferKinematicBoneUpdate : 1;                     // Mask: 0x8, PropSize: 0x10xBF5(0x1)(ConstParm, Transient, InstancedReference, SubobjectReference)
	uint8                                        bNoSkeletonUpdate : 1;                             // Mask: 0x10, PropSize: 0x10xBF5(0x1)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bPauseAnims : 1;                                   // Mask: 0x20, PropSize: 0x10xBF5(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bUseRefPoseOnInitAnim : 1;                         // Mask: 0x40, PropSize: 0x10xBF5(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bEnablePerPolyCollision : 1;                       // Mask: 0x80, PropSize: 0x10xBF5(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bForceRefpose : 1;                                 // Mask: 0x1, PropSize: 0x10xBF6(0x1)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bOnlyAllowAutonomousTickPose : 1;                  // Mask: 0x2, PropSize: 0x10xBF6(0x1)(Edit, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bIsAutonomousTickPose : 1;                         // Mask: 0x4, PropSize: 0x10xBF6(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bOldForceRefPose : 1;                              // Mask: 0x8, PropSize: 0x10xBF6(0x1)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bShowPrePhysBones : 1;                             // Mask: 0x10, PropSize: 0x10xBF6(0x1)(ConstParm, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bRequiredBonesUpToDate : 1;                        // Mask: 0x20, PropSize: 0x10xBF6(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bAnimTreeInitialised : 1;                          // Mask: 0x40, PropSize: 0x10xBF6(0x1)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bIncludeComponentLocationIntoBounds : 1;           // Mask: 0x80, PropSize: 0x10xBF6(0x1)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bEnableLineCheckWithBounds : 1;                    // Mask: 0x1, PropSize: 0x10xBF7(0x1)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bPropagateCurvesToFollowers : 1;                   // Mask: 0x2, PropSize: 0x10xBF7(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        bSkipKinematicUpdateWhenInterpolating : 1;         // Mask: 0x4, PropSize: 0x10xBF7(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bSkipBoundsUpdateWhenInterpolating : 1;            // Mask: 0x8, PropSize: 0x10xBF7(0x1)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bPreventDediServerAutoUnregistration : 1;          // Mask: 0x10, PropSize: 0x10xBF7(0x1)(Edit, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        BitPad_9F : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bNeedsQueuedAnimEventsDispatched : 1;              // Mask: 0x80, PropSize: 0x10xBF7(0x1)(Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        Pad_110E[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	uint16                                       CachedAnimCurveUidVersion;                         // 0xBFA(0x2)(ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        ClothBlendWeight;                                  // 0xBFC(0x4)(Edit, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	bool                                         bWaitForParallelClothTask;                         // 0xC00(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        Pad_1111[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class FName>                          DisallowedAnimCurves;                              // 0xC08(0x10)(BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	class UBodySetup*                            BodySetup;                                         // 0xC18(0x8)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, SubobjectReference)
	uint8                                        Pad_1113[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        ClothMaxDistanceScale;                             // 0xC24(0x4)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnConstraintBroken;                                // 0xC28(0x10)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnPlasticDeformation;                              // 0xC38(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	class UClass*                                ClothingSimulationFactory;                         // 0xC48(0x8)(ConstParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	uint8                                        Pad_1118[0xF8];                                    // Fixing Size After Last Property  > TateDumper <
	float                                        TeleportDistanceThreshold;                         // 0xD48(0x4)(Edit, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        TeleportRotationThreshold;                         // 0xD4C(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        Pad_1119[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	uint32                                       LastPoseTickFrame;                                 // 0xD58(0x4)(Edit, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        Pad_111A[0x94];                                    // Fixing Size After Last Property  > TateDumper <
	class UClothingSimulationInteractor*         ClothingInteractor;                                // 0xDF0(0x8)(BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	uint8                                        Pad_111C[0xC8];                                    // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnAnimInitialized;                                 // 0xEC0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        Pad_111D[0x1B0];                                   // Fixing Size After Last Property  > TateDumper <
	double                                       PreventSoundCuesTime;                              // 0x1080(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        Pad_111E[0x14C];                                   // Fixing Size After Last Property  > TateDumper <
	float                                        DinoIKAnimationLegZOffsetingMultiplier;            // 0x11D4(0x4)(Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        DinoIKDelayedTraceFreezeDurationMultiplier;        // 0x11D8(0x4)(ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        DinoIKSlopeMatchingRootHeightOffset;               // 0x11DC(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        DistanceFromGroundToStartIK;                       // 0x11E0(0x4)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        DistanceFromGroundToStartIKBias;                   // 0x11E4(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        FeetAlignmentLimit;                                // 0x11E8(0x4)(Edit, BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        ForceUpdateValuesTimeLimit;                        // 0x11EC(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        IkFabrikInterpSpeed;                               // 0x11F0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        IkFeetAlignmentInterpSpeed;                        // 0x11F4(0x4)(ConstParm, BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        IkGroundPlaneInterpSpeed;                          // 0x11F8(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        IkInterpSpeed;                                     // 0x11FC(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        IkInterpSpeedUp;                                   // 0x1200(0x4)(ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        Pad_1124[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               IkRootLocationOffset;                              // 0x1208(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	struct FRotator                              IkRootRotationOffset;                              // 0x1220(0x18)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        IkRootOffsetInterpSpeed;                           // 0x1238(0x4)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        IkRootOffsetInterpSpeedUp;                         // 0x123C(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        IkRootWorldOffsetInterpSpeed;                      // 0x1240(0x4)(ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        IkRootWorldOffsetInterpSpeedUp;                    // 0x1244(0x4)(ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        LegLimitRatioFromCylinderHeight;                   // 0x1248(0x4)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        MatchSlopeRotationSpeed;                           // 0x124C(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        RootPitchRotationLimit;                            // 0x1250(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        RootRollRotationLimit;                             // 0x1254(0x4)(ConstParm, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	int32                                        MaxIterations;                                     // 0x1258(0x4)(Edit, BlueprintVisible, ExportObject, Net, Parm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_112C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               TwoLegVirtualHitLocationWS;                        // 0x1260(0x18)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	struct FVector                               TwoLegVirtualHitLocationWSTarget;                  // 0x1278(0x18)(Edit, ConstParm, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	struct FVector                               TwoLegVirtualHitLocationCS;                        // 0x1290(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        RootOffset;                                        // 0x12A8(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1130[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              RootRotationOffset;                                // 0x12B0(0x18)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bForceTickDisabled : 1;                            // Mask: 0x1, PropSize: 0x10x12C8(0x1)(Edit, ConstParm, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bFreezeGroundPlaneIK : 1;                          // Mask: 0x2, PropSize: 0x10x12C8(0x1)(Net, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bSuppressAnimNotifies : 1;                         // Mask: 0x4, PropSize: 0x10x12C8(0x1)(BlueprintVisible, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        UseWorldSpaceFeetAlignment : 1;                    // Mask: 0x8, PropSize: 0x10x12C8(0x1)(ConstParm, BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bRotateFeetToAlignWithGround : 1;                  // Mask: 0x10, PropSize: 0x10x12C8(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bEnableMultiFabrik : 1;                            // Mask: 0x20, PropSize: 0x10x12C8(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKUseExperimentalInvalidTraceZeroing : 1;     // Mask: 0x40, PropSize: 0x10x12C8(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bAlignRootOnlyToGround : 1;                        // Mask: 0x80, PropSize: 0x10x12C8(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKAnimationLegZOffseting : 1;                 // Mask: 0x1, PropSize: 0x10x12C9(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bIKRotationEnabled : 1;                            // Mask: 0x2, PropSize: 0x10x12C9(0x1)(Edit, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bMovedLastFrame : 1;                               // Mask: 0x4, PropSize: 0x10x12C9(0x1)(ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKLerpFeet : 1;                               // Mask: 0x8, PropSize: 0x10x12C9(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKLerpLegs : 1;                               // Mask: 0x10, PropSize: 0x10x12C9(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKRootWorldSpaceLerpZ : 1;                    // Mask: 0x20, PropSize: 0x10x12C9(0x1)(ExportObject, Parm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKSmoothGroundPlaneLerping : 1;               // Mask: 0x40, PropSize: 0x10x12C9(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKSlopeMatchingRootHeightOffsetMultiplier : 1; // Mask: 0x80, PropSize: 0x10x12C9(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKUseLegLimits : 1;                           // Mask: 0x1, PropSize: 0x10x12CA(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bEnableIkOnlyWhenIdle : 1;                         // Mask: 0x2, PropSize: 0x10x12CA(0x1)(ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bEnableSimpleIK : 1;                               // Mask: 0x4, PropSize: 0x10x12CA(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bForceSimpleIK : 1;                                // Mask: 0x8, PropSize: 0x10x12CA(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bSetAttachmentMasterPoseComponent : 1;             // Mask: 0x10, PropSize: 0x10x12CA(0x1)(Edit, BlueprintVisible, Net, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bInterpolateRootPhys : 1;                          // Mask: 0x20, PropSize: 0x10x12CA(0x1)(ConstParm, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        BitPad_A0 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1140[0x35];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                OriginalBonesOffsets;                              // 0x1300(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	TArray<struct FIKLegInfo>                    IkLegs;                                            // 0x1310(0x10)(Edit, ConstParm, ExportObject, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	TArray<struct FIKGroundPlaneOverrideInfo>    IkGroundPlaneOverrides;                            // 0x1320(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	TArray<struct FIKRootAdjustmentInfo>         IkRootAdjustmentPoints;                            // 0x1330(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        MinHitNormalZForFeetAlignment;                     // 0x1340(0x4)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        ComponentMassScale;                                // 0x1344(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        GroundBoneInstantSyncTillTime;                     // 0x1348(0x4)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        MinLinearDamping;                                  // 0x134C(0x4)(EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        MinAngularDamping;                                 // 0x1350(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	float                                        CachedFootZDiff;                                   // 0x1354(0x4)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bOnlyTickWhenRenderedDontDisableOnDedicatedServer : 1; // Mask: 0x1, PropSize: 0x10x1358(0x1)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bSkipUpdateTransformIfBlendedPhysics : 1;          // Mask: 0x2, PropSize: 0x10x1358(0x1)(Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        AnimationFrozen : 1;                               // Mask: 0x4, PropSize: 0x10x1358(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bInitOffset : 1;                                   // Mask: 0x8, PropSize: 0x10x1358(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUpdatedKinematics : 1;                            // Mask: 0x10, PropSize: 0x10x1358(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bUpdatedKinematicsOnce : 1;                        // Mask: 0x20, PropSize: 0x10x1358(0x1)(Edit, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bSetKinematicsSleeping : 1;                        // Mask: 0x40, PropSize: 0x10x1358(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bNeverTickOnDediServer : 1;                        // Mask: 0x80, PropSize: 0x10x1358(0x1)(Edit, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bAlwaysTeleportKinematic : 1;                      // Mask: 0x1, PropSize: 0x10x1359(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bForceDisablePhysicsOnDediServer : 1;              // Mask: 0x2, PropSize: 0x10x1359(0x1)(Edit, ConstParm, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bForceDisablePhysicsOnDediServerAllowRagdoll : 1;  // Mask: 0x4, PropSize: 0x10x1359(0x1)(BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bSleepKinematicsWhenNotRefreshingBones : 1;        // Mask: 0x8, PropSize: 0x10x1359(0x1)(OutParm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bPhysicsRequiredOnDediServer : 1;                  // Mask: 0x10, PropSize: 0x10x1359(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bAlwaysForceUpdateKinematicsOnDedicatedServer : 1; // Mask: 0x20, PropSize: 0x10x1359(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bRotateToMatchWalkingSlope : 1;                    // Mask: 0x40, PropSize: 0x10x1359(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bFootZDiffIsCached : 1;                            // Mask: 0x80, PropSize: 0x10x1359(0x1)(Edit, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bShouldCacheFootZDiff : 1;                         // Mask: 0x1, PropSize: 0x10x135A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bEnableIKTraceFreezing : 1;                        // Mask: 0x2, PropSize: 0x10x135A(0x1)(Edit, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        BitPad_A1 : 6;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1155[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        bModifyBoneAnimNodeUseCurrentBoneModifiers : 1;    // Mask: 0x1, PropSize: 0x10x1360(0x1)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        BitPad_A2 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bHumanIKUseBoneModiferLegScalars : 1;              // Mask: 0x4, PropSize: 0x10x1360(0x1)(ConstParm, Parm, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bApplyGroundBoneModifiers : 1;                     // Mask: 0x8, PropSize: 0x10x1360(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        BitPad_A3 : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1157[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        bEnableIKCartGroundConforming : 1;                 // Mask: 0x1, PropSize: 0x10x1364(0x1)(BlueprintVisible, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        BitPad_A4 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1158[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              RotOffset;                                         // 0x1368(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bUseRotOffset : 1;                                 // Mask: 0x1, PropSize: 0x10x1380(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bUseItemSlotAttachmentTranformOffsets : 1;         // Mask: 0x2, PropSize: 0x10x1380(0x1)(ConstParm, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bInitializedArticulated : 1;                       // Mask: 0x4, PropSize: 0x10x1380(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        BitPad_A5 : 5;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_115A[0xF];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoneModifiersLegLengthPercentage;                  // 0x1390(0x4)(BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        Pad_115C[0x24];                                    // Fixing Size After Last Property  > TateDumper <
	double                                       LastStartedRenderingTime;                          // 0x13B8(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        Pad_115D[0x48];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class USkeletalMeshComponent* GetDefaultObj();

	class UClass* UnlinkAnimClassLayers();
	void UnbindClothFromLeaderPoseComponent(bool bRestoreSimulationSpace);
	void ToggleDisablePostProcessBlueprint();
	class FName TermBodiesBelow();
	void SuspendClothingSimulation();
	void Stop();
	void SnapshotPose(const struct FPoseSnapshot& Snapshot);
	void SetUpdateClothInEditor(bool NewUpdateState);
	void SetUpdateAnimationInEditor(bool NewUpdateState);
	void SetupBetweenAnimationBlueprintBlending();
	float SetTeleportRotationThreshold();
	float SetTeleportDistanceThreshold();
	void SetSkeletalMeshAsset(class USkeletalMesh** NewMesh);
	float SetPosition(bool* bFireNotifies);
	float SetPlayRate();
	float SetPhysicsBlendWeight();
	void SetNotifyRigidBodyCollisionBelow(bool* bNewNotifyRigidBodyCollision, class FName* BoneName, bool bIncludeSelf);
	class FName SetMorphTarget(float* Value, bool* bRemoveZeroWeight);
	void SetEnablePhysicsBlending(bool* bNewBlendPhysics);
	bool SetEnableGravityOnAllBodiesBelow(class FName* BoneName, bool bIncludeSelf);
	bool SetEnableBodyGravity(class FName* BoneName);
	void SetDisablePostProcessBlueprint(bool* bInDisablePostProcess);
	void SetDisableAnimCurves(bool* bInDisableAnimCurves);
	void SetConstraintProfileForAll(class FName ProfileName, bool* bDefaultIfNotFound);
	void SetConstraintProfile(class FName* JointName, class FName ProfileName, bool* bDefaultIfNotFound);
	void SetClothMaxDistanceScale(float* Scale);
	void SetBodyNotifyRigidBodyCollision(bool* bNewNotifyRigidBodyCollision, class FName* BoneName);
	class UClass* SetAnimClass();
	void SetAnimationMode(enum class EAnimationMode* InAnimationMode);
	void SetAnimation(class UAnimationAsset** NewAnimToPlay);
	void SetAngularLimits(class FName InBoneName, float* Swing1LimitAngle, float* TwistLimitAngle, float* Swing2LimitAngle);
	void SetAllowRigidBodyAnimNode(bool* bInAllow, bool* bReinitAnim);
	bool SetAllowedAnimCurvesEvaluation(TArray<class FName>* List);
	void SetAllowClothActors(bool* bInAllow);
	void SetAllowAnimCurveEvaluation(bool* bInAllow);
	void SetAllMotorsAngularVelocityDrive(bool* bEnableSwingDrive, bool* bEnableTwistDrive, bool bSkipCustomPhysicsType);
	void SetAllMotorsAngularPositionDrive(bool* bEnableSwingDrive, bool* bEnableTwistDrive, bool bSkipCustomPhysicsType);
	void SetAllMotorsAngularDriveParams(float* InSpring, float InDamping, float* InForceLimit, bool bSkipCustomPhysicsType);
	void SetAllBodiesSimulatePhysics(bool* bNewSimulate);
	float SetAllBodiesPhysicsBlendWeight(bool bSkipCustomPhysicsType);
	void SetAllBodiesBelowSimulatePhysics(class FName InBoneName, bool* bNewSimulate, bool bIncludeSelf);
	void SetAllBodiesBelowPhysicsDisabled(class FName InBoneName, bool* bDisabled, bool bIncludeSelf);
	float SetAllBodiesBelowPhysicsBlendWeight(class FName InBoneName, bool bSkipCustomPhysicsType, bool bIncludeSelf);
	struct FVector SetAllBodiesBelowLinearVelocity(class FName InBoneName, bool bIncludeSelf);
	void ResumeClothingSimulation();
	void ResetClothTeleportMode();
	enum class ETeleportType ResetAnimInstanceDynamics();
	void ResetAllowedAnimCurveEvaluation();
	void ResetAllBodiesSimulatePhysics();
	void PlayAnimation(class UAnimationAsset** NewAnimToPlay, bool bLooping);
	void Play(bool bLooping);
	bool OverrideAnimationData(class UAnimationAsset** InAnimToPlay, bool* bIsPlaying, float* Position, float* PlayRate);
	class UClass* LinkAnimGraphByTag(class FName* InTag);
	class UClass* LinkAnimClassLayers();
	float K2_GetClosestPointOnPhysicsAsset(struct FVector* ClosestWorldPosition, struct FVector* Normal, class FName* BoneName, bool ReturnValue);
	float IsPlayingMontage(class UAnimMontage** Montage, bool ReturnValue);
	class FName IsPlayingAnimationMontagesOnSlotName(bool ReturnValue);
	void IsPlaying(bool ReturnValue);
	void IsClothingSimulationSuspended(bool ReturnValue);
	void IsBodyGravityEnabled(class FName* BoneName, bool ReturnValue);
	void IncrementIKLegMute(int32 LegIndex);
	void HasValidAnimationInstance(bool ReturnValue);
	void GetTrueBasedPawns(const TArray<class APawn*>& ReturnValue);
	class FName GetTransformAttribute_Ref(class FName* BoneName, struct FTransform* OutValue, enum class ECustomBoneAttributeLookup* LookupType, bool ReturnValue);
	class FName GetTransformAttribute(class FName* BoneName, struct FTransform* DefaultValue, struct FTransform* OutValue, enum class ECustomBoneAttributeLookup* LookupType, bool ReturnValue);
	void GetTeleportRotationThreshold(float ReturnValue);
	void GetTeleportDistanceThreshold(float ReturnValue);
	class FName GetStringAttribute_Ref(class FName* BoneName, class FString* OutValue, enum class ECustomBoneAttributeLookup* LookupType, bool ReturnValue);
	class FName GetStringAttribute(class FName* BoneName, class FString* DefaultValue, class FString* OutValue, enum class ECustomBoneAttributeLookup* LookupType, bool ReturnValue);
	void GetSkeletalMeshAsset(class USkeletalMesh* ReturnValue);
	void GetSkeletalCenterOfMass(const struct FVector& ReturnValue);
	void GetPostProcessInstance(class UAnimInstance* ReturnValue);
	void GetPosition(float ReturnValue);
	void GetPlayRate(float ReturnValue);
	class FName GetMorphTarget(float ReturnValue);
	class FName GetLinkedAnimLayerInstanceByGroup(class UAnimInstance* ReturnValue);
	class UClass* GetLinkedAnimLayerInstanceByClass(class UAnimInstance* ReturnValue);
	void GetLinkedAnimGraphInstancesByTag(class FName* InTag, TArray<class UAnimInstance*>* OutLinkedInstances);
	void GetLinkedAnimGraphInstanceByTag(class FName* InTag, class UAnimInstance* ReturnValue);
	class FName GetIntegerAttribute_Ref(class FName* BoneName, int32* OutValue, enum class ECustomBoneAttributeLookup* LookupType, bool ReturnValue);
	class FName GetIntegerAttribute(class FName* BoneName, int32* DefaultValue, int32* OutValue, enum class ECustomBoneAttributeLookup* LookupType, bool ReturnValue);
	class FName GetFloatAttribute_Ref(class FName* BoneName, float* OutValue, enum class ECustomBoneAttributeLookup* LookupType, bool ReturnValue);
	class FName GetFloatAttribute(class FName* BoneName, float* DefaultValue, float* OutValue, enum class ECustomBoneAttributeLookup* LookupType, bool ReturnValue);
	void GetFirstBoneWithChildren(class FName ReturnValue);
	void GetDisablePostProcessBlueprint(bool ReturnValue);
	void GetDisableAnimCurves(bool ReturnValue);
	void GetCurrentJointAngles(class FName InBoneName, float* Swing1Angle, float TwistAngle, float* Swing2Angle);
	class FName GetConstraintsFromBody(bool* bParentConstraints, bool* bChildConstraints, bool* bIncludesTerminated, TArray<struct FConstraintInstanceAccessor>* OutConstraints);
	void GetConstraints(bool* bIncludesTerminated, TArray<struct FConstraintInstanceAccessor>* OutConstraints);
	void GetConstraintByName(class FName* ConstraintName, bool* bIncludesTerminated, const struct FConstraintInstanceAccessor& ReturnValue);
	void GetClothMaxDistanceScale(float ReturnValue);
	void GetClothingSimulationInteractor(class UClothingSimulationInteractor* ReturnValue);
	void GetBoneMass(class FName* BoneName, bool* bScaleMass, float ReturnValue);
	void GetBoneLinearVelocity(class FName InBoneName, const struct FVector& ReturnValue);
	void GetAnimInstance(class UAnimInstance* ReturnValue);
	void GetAnimClass(class UClass* ReturnValue);
	void GetAnimationMode(enum class EAnimationMode ReturnValue);
	void GetAllowRigidBodyAnimNode(bool ReturnValue);
	void GetAllowedAnimCurveEvaluate(bool ReturnValue);
	void GetAllowClothActors(bool ReturnValue);
	void ForceClothNextUpdateTeleportAndReset();
	void ForceClothNextUpdateTeleport();
	int32 FindConstraintBoneName(class FName ReturnValue);
	void EnableRagdoll(struct FVector* WithVelocity);
	void DecrementIKLegMute(int32 LegIndex);
	void ClearMorphTargets();
	struct FVector BreakConstraint(class FName InBoneName);
	void BPValidBoneToUnhide(int32* BoneIndex, bool ReturnValue);
	float BPTickPose();
	void BPSetBoneModifiers(const TArray<struct FBoneModifierNamed>& NamedBoneModifiers);
	void BPRefreshBoneTransforms();
	void BindClothToLeaderPoseComponent();
	bool AllowAnimCurveEvaluation(class FName NameOfCurve);
	bool AddImpulseToAllBodiesBelow(class FName* BoneName, bool bIncludeSelf);
	bool AddForceToAllBodiesBelow(class FName* BoneName, bool bIncludeSelf);
	void AccumulateAllBodiesBelowPhysicsBlendWeight(class FName InBoneName, float AddPhysicsBlendWeight, bool bSkipCustomPhysicsType);
};

// 0x320 (0x348 - 0x28)
// Class Engine.AnimInstance
class UAnimInstance : public UObject
{
public:
	class USkeleton*                             CurrentSkeleton;                                   // 0x28(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	enum class ERootMotionMode                   RootMotionMode;                                    // 0x30(0x1)(ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseMultiThreadedAnimationUpdate : 1;              // Mask: 0x1, PropSize: 0x10x31(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUsingCopyPoseFromMesh : 1;                        // Mask: 0x2, PropSize: 0x10x31(0x1)(Edit, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_AE : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bReceiveNotifiesFromLinkedInstances : 1;           // Mask: 0x10, PropSize: 0x10x31(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPropagateNotifiesToLinkedInstances : 1;           // Mask: 0x20, PropSize: 0x10x31(0x1)(Edit, ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseMainInstanceMontageEvaluationData : 1;         // Mask: 0x40, PropSize: 0x10x31(0x1)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bQueueMontageEvents : 1;                           // Mask: 0x80, PropSize: 0x10x31(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_139C[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnMontageBlendingOut;                              // 0x38(0x10)(Edit, ConstParm, Config, DisableEditOnInstance, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	FMulticastInlineDelegateProperty_            OnMontageStarted;                                  // 0x48(0x10)(Edit, BlueprintVisible, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnMontageEnded;                                    // 0x58(0x10)(ConstParm, BlueprintVisible, ExportObject, Config, DisableEditOnInstance, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	FMulticastInlineDelegateProperty_            OnAllMontageInstancesEnded;                        // 0x68(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_139F[0xD8];                                    // Fixing Size After Last Property  > TateDumper <
	struct FAnimNotifyQueue                      NotifyQueue;                                       // 0x150(0x70)(BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<struct FAnimNotifyEvent>              ActiveAnimNotifyState;                             // 0x1C0(0x10)(BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<struct FAnimNotifyEventReference>     ActiveAnimNotifyEventReference;                    // 0x1D0(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_13A0[0x168];                                   // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimInstance* GetDefaultObj();

	class UClass* WasAnimNotifyTriggeredInStateMachine(bool ReturnValue);
	class UClass* WasAnimNotifyTriggeredInSourceState(bool ReturnValue);
	class UClass* WasAnimNotifyTriggeredInAnyState(bool ReturnValue);
	class UClass* WasAnimNotifyStateActiveInStateMachine(bool ReturnValue);
	class UClass* WasAnimNotifyStateActiveInSourceState(bool ReturnValue);
	class UClass* WasAnimNotifyStateActiveInAnyState(bool ReturnValue);
	int32 WasAnimNotifyNameTriggeredInStateMachine(class FName NotifyName, bool ReturnValue);
	int32 WasAnimNotifyNameTriggeredInSourceState(class FName NotifyName, bool ReturnValue);
	void WasAnimNotifyNameTriggeredInAnyState(class FName NotifyName, bool ReturnValue);
	bool UnlockAIResources();
	class UClass* UnlinkAnimClassLayers();
	void TryGetPawnOwner(class APawn* ReturnValue);
	class FName StopSlotAnimation();
	void SnapshotPose(const struct FPoseSnapshot& Snapshot);
	bool SetUseMainInstanceMontageEvaluationData();
	void SetRootMotionMode(enum class ERootMotionMode* Value);
	bool SetReceiveNotifiesFromLinkedInstances();
	bool SetPropagateNotifiesToLinkedInstances();
	class FName SetMorphTarget(float* Value);
	void SavePoseSnapshot(class FName SnapshotName);
	enum class ETeleportType ResetDynamics();
	enum class ETransitionRequestOverwriteMode RequestTransitionEvent(class FName* EventName, bool ReturnValue);
	float RequestSlotGroupInertialization(class UBlendProfile* BlendProfile);
	void RemovePoseSnapshot(class FName SnapshotName);
	int32 QueryTransitionEvent(int32 TransitionIndex, class FName* EventName, bool ReturnValue);
	int32 QueryAndMarkTransitionEvent(int32 TransitionIndex, class FName* EventName, bool ReturnValue);
	float PlaySlotAnimationAsDynamicMontage_WithBlendSettings(class UAnimSequenceBase* Asset, int32* LoopCount, class UAnimMontage* ReturnValue);
	float PlaySlotAnimationAsDynamicMontage_WithBlendArgs(class UAnimSequenceBase* Asset, const struct FAlphaBlendArgs& BlendIn, int32* LoopCount, class UAnimMontage* ReturnValue);
	float PlaySlotAnimationAsDynamicMontage(class UAnimSequenceBase* Asset, float BlendInTime, float BlendOutTime, int32* LoopCount, class UAnimMontage* ReturnValue);
	struct FVector OnCharacterStepped(struct FVector* NewLocation);
	class UAnimMontage* MontageSync_StopFollowing();
	class UAnimMontage* MontageSync_Follow();
	struct FMontageBlendSettings Montage_StopWithBlendSettings(class UAnimMontage** Montage);
	struct FAlphaBlendArgs Montage_StopWithBlendOut(class UAnimMontage** Montage);
	class FName Montage_StopGroupByName();
	float Montage_Stop(class UAnimMontage** Montage);
	void Montage_SetPosition(class UAnimMontage** Montage, float NewPosition);
	float Montage_SetPlayRate(class UAnimMontage** Montage);
	class FName Montage_SetNextSection(class UAnimMontage** Montage);
	void Montage_Resume(class UAnimMontage** Montage);
	bool Montage_PlayWithBlendSettings(float ReturnValue);
	bool Montage_PlayWithBlendIn(const struct FAlphaBlendArgs& BlendIn, float ReturnValue);
	bool Montage_Play_WithBlending(float BlendInTime, float BlendOutTime, float ReturnValue);
	bool Montage_Play(float ReturnValue);
	void Montage_Pause(class UAnimMontage** Montage);
	class FName Montage_JumpToSectionsEnd(class UAnimMontage** Montage);
	class FName Montage_JumpToSection(class UAnimMontage** Montage);
	float Montage_IsPlaying(class UAnimMontage** Montage, bool ReturnValue);
	void Montage_IsActive(class UAnimMontage** Montage, bool ReturnValue);
	void Montage_GetPosition(class UAnimMontage** Montage, float ReturnValue);
	void Montage_GetPlayRate(class UAnimMontage** Montage, float ReturnValue);
	void Montage_GetIsStopped(class UAnimMontage** Montage, bool ReturnValue);
	void Montage_GetEffectivePlayRate(class UAnimMontage** Montage, float ReturnValue);
	float Montage_GetCurrentTime(class UAnimMontage** Montage, bool ReturnValue);
	void Montage_GetCurrentSection(class UAnimMontage** Montage, class FName ReturnValue);
	void Montage_GetBlendTime(class UAnimMontage** Montage, float ReturnValue);
	bool LockAIResources();
	class UClass* LinkAnimGraphByTag(class FName* InTag);
	class UClass* LinkAnimClassLayers();
	void IsUsingRootTransform(bool ReturnValue);
	void IsUsingMainInstanceMontageEvaluationData(bool ReturnValue);
	bool IsSyncGroupBetweenMarkers(bool ReturnValue);
	class FName IsPlayingSlotAnimation(class UAnimSequenceBase* Asset, bool ReturnValue);
	void IsAnyMontagePlaying(bool ReturnValue);
	class FName HasMarkerBeenHitThisFrame(bool ReturnValue);
	float GetTimeToClosestMarker(bool ReturnValue);
	class FName GetSyncGroupPosition(const struct FMarkerSyncAnimPosition& ReturnValue);
	int32 GetRelevantAnimTimeRemainingFraction(float ReturnValue);
	int32 GetRelevantAnimTimeRemaining(float ReturnValue);
	int32 GetRelevantAnimTimeFraction(float ReturnValue);
	int32 GetRelevantAnimTime(float ReturnValue);
	int32 GetRelevantAnimLength(float ReturnValue);
	void GetReceiveNotifiesFromLinkedInstances(bool ReturnValue);
	void GetPropagateNotifiesToLinkedInstances(bool ReturnValue);
	void GetOwningComponent(class USkeletalMeshComponent* ReturnValue);
	void GetOwningActor(class AActor* ReturnValue);
	class FName GetLinkedAnimLayerInstancesByGroup(TArray<class UAnimInstance*>* OutLinkedInstances);
	class UClass* GetLinkedAnimLayerInstanceByGroupAndClass(class UAnimInstance* ReturnValue);
	class FName GetLinkedAnimLayerInstanceByGroup(class UAnimInstance* ReturnValue);
	class UClass* GetLinkedAnimLayerInstanceByClass(class UAnimInstance* ReturnValue);
	void GetLinkedAnimGraphInstancesByTag(class FName* InTag, TArray<class UAnimInstance*>* OutLinkedInstances);
	void GetLinkedAnimGraphInstanceByTag(class FName* InTag, class UAnimInstance* ReturnValue);
	int32 GetInstanceTransitionTimeElapsedFraction(int32 TransitionIndex, float ReturnValue);
	int32 GetInstanceTransitionTimeElapsed(int32 TransitionIndex, float ReturnValue);
	int32 GetInstanceTransitionCrossfadeDuration(int32 TransitionIndex, float ReturnValue);
	int32 GetInstanceStateWeight(float ReturnValue);
	int32 GetInstanceMachineWeight(float ReturnValue);
	int32 GetInstanceCurrentStateElapsedTime(float ReturnValue);
	int32 GetInstanceAssetPlayerTimeFromEndFraction(float ReturnValue);
	int32 GetInstanceAssetPlayerTimeFromEnd(float ReturnValue);
	int32 GetInstanceAssetPlayerTimeFraction(float ReturnValue);
	int32 GetInstanceAssetPlayerTime(float ReturnValue);
	int32 GetInstanceAssetPlayerLength(float ReturnValue);
	void GetDeltaSeconds(float ReturnValue);
	class FName GetCurveValueWithDefault(float* DefaultValue, float* OutValue, bool ReturnValue);
	class FName GetCurveValue(float ReturnValue);
	int32 GetCurrentStateName(class FName ReturnValue);
	void GetCurrentActiveMontage(class UAnimMontage* ReturnValue);
	TArray<class FName> GetAllCurveNames();
	TArray<class FName> GetActiveCurveNames(enum class EAnimCurveType CurveType);
	struct FVector ControlRigNotify(class FName NotifyName, const struct FHitResult& WorldSpaceHitResult);
	void ClearTransitionEvents(class FName* EventName);
	void ClearMorphTargets();
	void ClearAllTransitionEvents();
	struct FRotator CalculateDirection(float ReturnValue);
	float BlueprintUpdateAnimation();
	float BlueprintTriggerAnimationEvent();
	float BlueprintThreadSafeUpdateAnimation();
	void BlueprintPostEvaluateAnimation();
	float BlueprintPlayAnimationEvent(float* PlayRate);
	void BlueprintLinkedAnimationLayersInitialized();
	void BlueprintInitializeAnimation();
	void BlueprintBeginPlay();
};

// 0x150 (0x370 - 0x220)
// Class Engine.BlueprintGeneratedClass
class UBlueprintGeneratedClass : public UClass
{
public:
	uint8                                        Pad_13BA[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        NumReplicatedProperties;                           // 0x228(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	uint8                                        bHasNativizedParent : 1;                           // Mask: 0x1, PropSize: 0x10x22C(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bHasCookedComponentInstancingData : 1;             // Mask: 0x2, PropSize: 0x10x22C(0x1)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_AF : 6;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_13BB[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class UDynamicBlueprintBinding*>      DynamicBindingObjects;                             // 0x230(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<class UActorComponent*>               ComponentTemplates;                                // 0x240(0x10)(ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<class UTimelineTemplate*>             Timelines;                                         // 0x250(0x10)(BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<struct FBPComponentClassOverride>     ComponentClassOverrides;                           // 0x260(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class USimpleConstructionScript*             SimpleConstructionScript;                          // 0x270(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, SubobjectReference)
	class UInheritableComponentHandler*          InheritableComponentHandler;                       // 0x278(0x8)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, SubobjectReference)
	class UStructProperty*                       UberGraphFramePointerProperty;                     // 0x280(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_13BE[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	class UFunction*                             UberGraphFunction;                                 // 0x290(0x8)(Edit, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TMap<class FName, struct FGuid>              CookedPropertyGuids;                               // 0x298(0x50)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TMap<class FName, struct FBlueprintCookedComponentInstancingData> CookedComponentInstancingData;                     // 0x2E8(0x50)(ConstParm, BlueprintVisible, Net, EditFixedSize, ReturnParm, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_13BF[0x38];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UBlueprintGeneratedClass* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class Engine.TimecodeProvider
class UTimecodeProvider : public UObject
{
public:
	float                                        FrameDelay;                                        // 0x28(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst)
	uint8                                        Pad_13D9[0x4];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UTimecodeProvider* GetDefaultObj();

	void GetTimecode(const struct FTimecode& ReturnValue);
	void GetSynchronizationState(enum class ETimecodeProviderSynchronizationState ReturnValue);
	void GetQualifiedFrameTime(const struct FQualifiedFrameTime& ReturnValue);
	void GetFrameRate(const struct FFrameRate& ReturnValue);
	void GetDelayedTimecode(const struct FTimecode& ReturnValue);
	void GetDelayedQualifiedFrameTime(const struct FQualifiedFrameTime& ReturnValue);
	struct FQualifiedFrameTime FetchTimecode(bool ReturnValue);
	void FetchAndUpdate();
};

// 0x0 (0x28 - 0x28)
// Class Engine.MeshDeformer
class UMeshDeformer : public UObject
{
public:

	static class UClass* StaticClass();
	static class UMeshDeformer* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.MeshDeformerInstanceSettings
class UMeshDeformerInstanceSettings : public UObject
{
public:

	static class UClass* StaticClass();
	static class UMeshDeformerInstanceSettings* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.MeshDeformerInstance
class UMeshDeformerInstance : public UObject
{
public:

	static class UClass* StaticClass();
	static class UMeshDeformerInstance* GetDefaultObj();

};

// 0x0 (0x4C8 - 0x4C8)
// Class Engine.Info
class AInfo : public AActor
{
public:

	static class UClass* StaticClass();
	static class AInfo* GetDefaultObj();

};

// 0xA0 (0x568 - 0x4C8)
// Class Engine.GameModeBase
class AGameModeBase : public AInfo
{
public:
	class FString                                OptionsString;                                     // 0x4C8(0x10)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	class UClass*                                GameSessionClass;                                  // 0x4D8(0x8)(ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	class UClass*                                GameStateClass;                                    // 0x4E0(0x8)(ExportObject, EditFixedSize, Transient, DisableEditOnInstance, SubobjectReference)
	class UClass*                                PlayerControllerClass;                             // 0x4E8(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	class UClass*                                PlayerStateClass;                                  // 0x4F0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Transient, DisableEditOnInstance, SubobjectReference)
	class UClass*                                HUDClass;                                          // 0x4F8(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	class UClass*                                DefaultPawnClass;                                  // 0x500(0x8)(BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	class UClass*                                SpectatorClass;                                    // 0x508(0x8)(ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	class UClass*                                ReplaySpectatorPlayerControllerClass;              // 0x510(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	class UClass*                                ServerStatReplicatorClass;                         // 0x518(0x8)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	class AGameSession*                          GameSession;                                       // 0x520(0x8)(BlueprintVisible, EditFixedSize, ReturnParm)
	class AGameStateBase*                        GameState;                                         // 0x528(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	class AServerStatReplicator*                 ServerStatReplicator;                              // 0x530(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, SubobjectReference)
	class FText                                  DefaultPlayerName;                                 // 0x538(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bUseSeamlessTravel : 1;                            // Mask: 0x1, PropSize: 0x10x550(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bStartPlayersAsSpectators : 1;                     // Mask: 0x2, PropSize: 0x10x550(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        bPauseable : 1;                                    // Mask: 0x4, PropSize: 0x10x550(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        Pad_146A[0x17];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class AGameModeBase* GetDefaultObj();

	void StartPlay();
	class AActor* SpawnDefaultPawnFor(class APawn* ReturnValue);
	struct FTransform SpawnDefaultPawnAtTransform(class APawn* ReturnValue);
	class AActor* ShouldReset(bool ReturnValue);
	void ReturnToMainMenuHost();
	struct FTransform RestartPlayerAtTransform();
	class AActor* RestartPlayerAtPlayerStart();
	class AController* RestartPlayer();
	void ResetLevel();
	void PlayerCanRestart(class APlayerController** Player, bool ReturnValue);
	class APlayerController* MustSpectate(bool ReturnValue);
	class APlayerController* K2_PostLogin();
	class APlayerController* K2_OnSwapPlayerControllers();
	class AController* K2_OnRestartPlayer();
	class AController* K2_OnLogout();
	bool K2_OnChangeName(class FString* NewName);
	class FString K2_FindPlayerStart(class AController** Player, class AActor* ReturnValue);
	class AController* InitStartSpot();
	class APlayerController* InitializeHUDForPlayer();
	void HasMatchStarted(bool ReturnValue);
	void HasMatchEnded(bool ReturnValue);
	class APlayerController* HandleStartingNewPlayer();
	void GetNumSpectators(int32 ReturnValue);
	void GetNumPlayers(int32 ReturnValue);
	class AController* GetDefaultPawnClassForController(class UClass* ReturnValue);
	struct FRotator FinishRestartPlayer();
	class FString FindPlayerStart(class AController** Player, class AActor* ReturnValue);
	void ChoosePlayerStart(class AController** Player, class AActor* ReturnValue);
	bool ChangeName(class AController** Controller, class FString* NewName);
	class APlayerController* CanSpectate(class APlayerState** ViewTarget, bool ReturnValue);
};

// 0x0 (0x28 - 0x28)
// Class Engine.EngineCustomTimeStep
class UEngineCustomTimeStep : public UObject
{
public:

	static class UClass* StaticClass();
	static class UEngineCustomTimeStep* GetDefaultObj();

};

// 0x0 (0x4C8 - 0x4C8)
// Class Engine.PartitionActor
class APartitionActor : public AActor
{
public:

	static class UClass* StaticClass();
	static class APartitionActor* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class Engine.TickableWorldSubsystem
class UTickableWorldSubsystem : public UWorldSubsystem
{
public:
	uint8                                        Pad_1474[0x10];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UTickableWorldSubsystem* GetDefaultObj();

};

// 0x38 (0x500 - 0x4C8)
// Class Engine.Brush
class ABrush : public AActor
{
public:
	enum class EBrushType                        BrushType;                                         // 0x4C8(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	uint8                                        Pad_1479[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FColor                                BrushColor;                                        // 0x4CC(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	int32                                        PolyFlags;                                         // 0x4D0(0x4)(EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bColored : 1;                                      // Mask: 0x1, PropSize: 0x10x4D4(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	uint8                                        bSolidWhenSelected : 1;                            // Mask: 0x2, PropSize: 0x10x4D4(0x1)(Edit, ConstParm, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	uint8                                        bPlaceableFromClassBrowser : 1;                    // Mask: 0x4, PropSize: 0x10x4D4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	uint8                                        bNotForClientOrServer : 1;                         // Mask: 0x8, PropSize: 0x10x4D4(0x1)(Edit, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	uint8                                        BitPad_B0 : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_147D[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class UModel*                                Brush;                                             // 0x4D8(0x8)(ConstParm, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, EditConst)
	class UBrushComponent*                       BrushComponent;                                    // 0x4E0(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, Transient, SubobjectReference)
	uint8                                        bInManipulation : 1;                               // Mask: 0x1, PropSize: 0x10x4E8(0x1)(Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	uint8                                        BitPad_B1 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_147E[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FGeomSelection>                SavedSelections;                                   // 0x4F0(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class ABrush* GetDefaultObj();

};

// 0x18 (0x518 - 0x500)
// Class Engine.Volume
class AVolume : public ABrush
{
public:
	TArray<struct FBoxOptimization>              BoxOptimization;                                   // 0x500(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst)
	bool                                         bAllowCollisionComponentWithZeroRadius;            // 0x510(0x1)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	uint8                                        Pad_148B[0x7];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class AVolume* GetDefaultObj();

	struct FVector BPEncompassesPoint(float* OutDistanceToPoint, float SphereRadius, bool ReturnValue);
};

// 0x3558 (0x3A20 - 0x4C8)
// Class Engine.PlayerCameraManager
class APlayerCameraManager : public AActor
{
public:
	class APlayerController*                     PCOwner;                                           // 0x4C8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	class USceneComponent*                       TransformComponent;                                // 0x4D0(0x8)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1530[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        DefaultFOV;                                        // 0x4E0(0x4)(ConstParm, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
