#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x28 - 0x28)
// Class Engine.PrimalReplicationDriver
class UPrimalReplicationDriver : public UObject
{
public:

	static class UClass* StaticClass();
	static class UPrimalReplicationDriver* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.ReplicationDriver
class UReplicationDriver : public UPrimalReplicationDriver
{
public:

	static class UClass* StaticClass();
	static class UReplicationDriver* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.ReplicationConnectionDriver
class UReplicationConnectionDriver : public UObject
{
public:

	static class UClass* StaticClass();
	static class UReplicationConnectionDriver* GetDefaultObj();

};

// 0x208 (0x230 - 0x28)
// Class Engine.PrimalActor
class UPrimalActor : public UObject
{
public:
	uint8                                        Pad_13D[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        BitPad_1 : 7;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bPreventSaving : 1;                                // Mask: 0x80, PropSize: 0x10x30(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bEnableMultiUse : 1;                               // Mask: 0x1, PropSize: 0x10x31(0x1)(ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bBlueprintMultiUseEntries : 1;                     // Mask: 0x2, PropSize: 0x10x31(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_2 : 6;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_13E[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bUseCanMoveThroughActor : 1;                       // Mask: 0x1, PropSize: 0x10x34(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseBPFilterMultiUseEntries : 1;                   // Mask: 0x2, PropSize: 0x10x34(0x1)(Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_3 : 6;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_13F[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bUseBPGetMultiUseCenterText : 1;                   // Mask: 0x1, PropSize: 0x10x38(0x1)(Edit, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bMultiUseCenterHUD : 1;                            // Mask: 0x2, PropSize: 0x10x38(0x1)(Edit, ConstParm, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseNetworkSpatialization : 1;                     // Mask: 0x4, PropSize: 0x10x38(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bNetworkSpatializationForceRelevancyCheck : 1;     // Mask: 0x8, PropSize: 0x10x38(0x1)(Edit, ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bNetUseClientRelevancy : 1;                        // Mask: 0x10, PropSize: 0x10x38(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bAttachmentReplicationUseNetworkParent : 1;        // Mask: 0x20, PropSize: 0x10x38(0x1)(Edit, ConstParm, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseBPChangedActorTeam : 1;                        // Mask: 0x40, PropSize: 0x10x38(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bForceNetworkSpatialization : 1;                   // Mask: 0x80, PropSize: 0x10x38(0x1)(ExportObject, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bForcedHudDrawingRequiresSameTeam : 1;             // Mask: 0x1, PropSize: 0x10x39(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bIsMapActor : 1;                                   // Mask: 0x2, PropSize: 0x10x39(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseOnlyPointForLevelBounds : 1;                   // Mask: 0x4, PropSize: 0x10x39(0x1)(Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseBPCheckForErrors : 1;                          // Mask: 0x8, PropSize: 0x10x39(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bHasHighVolumeRPCs : 1;                            // Mask: 0x10, PropSize: 0x10x39(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bAutoStasis : 1;                                   // Mask: 0x20, PropSize: 0x10x39(0x1)(BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bClimbable : 1;                                    // Mask: 0x40, PropSize: 0x10x39(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_4 : 1;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_143[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bUseBPDrawEntry : 1;                               // Mask: 0x1, PropSize: 0x10x3C(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_5 : 7;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_144[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bPreventCliffPlatforms : 1;                        // Mask: 0x1, PropSize: 0x10x40(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseBPOverrideUILocation : 1;                      // Mask: 0x2, PropSize: 0x10x40(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bStasised : 1;                                     // Mask: 0x4, PropSize: 0x10x40(0x1)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bPreventActorStasis : 1;                           // Mask: 0x8, PropSize: 0x10x40(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseBPGetBonesToHideOnAllocation : 1;              // Mask: 0x10, PropSize: 0x10x40(0x1)(Edit, ExportObject, Net, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bReplicateHidden : 1;                              // Mask: 0x20, PropSize: 0x10x40(0x1)(Net, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_6 : 1;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bHibernateChange : 1;                              // Mask: 0x80, PropSize: 0x10x40(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bSavedWhenStasised : 1;                            // Mask: 0x1, PropSize: 0x10x41(0x1)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bLoadedFromSaveGame : 1;                           // Mask: 0x2, PropSize: 0x10x41(0x1)(ConstParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bPreventCharacterBasing : 1;                       // Mask: 0x4, PropSize: 0x10x41(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventCharacterBasingAllowSteppingUp : 1;        // Mask: 0x8, PropSize: 0x10x41(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bIgnoreNetworkRangeScaling : 1;                    // Mask: 0x10, PropSize: 0x10x41(0x1)(Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_7 : 3;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_148[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bForceReplicateDormantChildrenWithoutSpatialRelevancy : 1; // Mask: 0x1, PropSize: 0x10x44(0x1)(BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_8 : 7;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_149[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bForcePreventSeamlessTravel : 1;                   // Mask: 0x1, PropSize: 0x10x48(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bPreventLevelBoundsRelevant : 1;                   // Mask: 0x2, PropSize: 0x10x48(0x1)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseBPInventoryItemUsed : 1;                       // Mask: 0x4, PropSize: 0x10x48(0x1)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseBPInventoryItemDropped : 1;                    // Mask: 0x8, PropSize: 0x10x48(0x1)(Edit, ConstParm, ExportObject, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseBPOverrideTargetingLocation : 1;               // Mask: 0x10, PropSize: 0x10x48(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bForceAllowNetMulticast : 1;                       // Mask: 0x20, PropSize: 0x10x48(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bBPInventoryItemUsedHandlesDurability : 1;         // Mask: 0x40, PropSize: 0x10x48(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseBPForceAllowsInventoryUse : 1;                 // Mask: 0x80, PropSize: 0x10x48(0x1)(Edit, ExportObject, EditFixedSize, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bAlwaysRelevantPrimalStructure : 1;                // Mask: 0x1, PropSize: 0x10x49(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bPreventNPCSpawnFloor : 1;                         // Mask: 0x2, PropSize: 0x10x49(0x1)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bForceHiddenReplication : 1;                       // Mask: 0x4, PropSize: 0x10x49(0x1)(Net, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bNetCritical : 1;                                  // Mask: 0x8, PropSize: 0x10x49(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOnlyReplicateOnNetForcedUpdate : 1;               // Mask: 0x10, PropSize: 0x10x49(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bPreventRegularForceNetUpdate : 1;                 // Mask: 0x20, PropSize: 0x10x49(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bOnlyInitialReplication : 1;                       // Mask: 0x40, PropSize: 0x10x49(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bPreventOnDedicatedServer : 1;                     // Mask: 0x80, PropSize: 0x10x49(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bUseAttachmentReplication : 1;                     // Mask: 0x1, PropSize: 0x10x4A(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bStasisComponentRadiusForceDistanceCheck : 1;      // Mask: 0x2, PropSize: 0x10x4A(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bIgnoredByCharacterEncroachment : 1;               // Mask: 0x4, PropSize: 0x10x4A(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_9 : 5;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bUseBPGetHUDDrawLocationOffset : 1;                // Mask: 0x1, PropSize: 0x10x4B(0x1)(BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseBPPreventAttachments : 1;                      // Mask: 0x2, PropSize: 0x10x4B(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseBPGetShowDebugAnimationComponents : 1;         // Mask: 0x4, PropSize: 0x10x4B(0x1)(Edit, ConstParm, ExportObject, Net, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUnstreamComponentsUseEndOverlap : 1;              // Mask: 0x8, PropSize: 0x10x4B(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bWantsPerformanceThrottledTick : 1;                // Mask: 0x10, PropSize: 0x10x4B(0x1)(ConstParm, ExportObject, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_A : 2;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bWantsServerThrottledTick : 1;                     // Mask: 0x80, PropSize: 0x10x4B(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_B : 1;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bBPPreInitializeComponents : 1;                    // Mask: 0x2, PropSize: 0x10x4C(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bBPPostInitializeComponents : 1;                   // Mask: 0x4, PropSize: 0x10x4C(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseBPCustomIsRelevantForClient : 1;               // Mask: 0x8, PropSize: 0x10x4C(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseStasisGrid : 1;                                // Mask: 0x10, PropSize: 0x10x4C(0x1)(ConstParm, BlueprintVisible, EditFixedSize, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bAlwaysCreatePhysicsState : 1;                     // Mask: 0x20, PropSize: 0x10x4C(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bForceInfiniteDrawDistance : 1;                    // Mask: 0x40, PropSize: 0x10x4C(0x1)(ExportObject, BlueprintReadOnly, Net, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bIsFromChildActorComponent : 1;                    // Mask: 0x80, PropSize: 0x10x4C(0x1)(ConstParm, ExportObject, Net, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bIsDestroyedFromChildActorComponent : 1;           // Mask: 0x1, PropSize: 0x10x4D(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bIsValidUnstasisCaster : 1;                        // Mask: 0x2, PropSize: 0x10x4D(0x1)(Edit, ConstParm, ExportObject, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseBPAllowActorSpawn : 1;                         // Mask: 0x4, PropSize: 0x10x4D(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_C : 5;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_14F[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnTargetingTeamChanged;                            // 0x50(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_150[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        TargetingTeam;                                     // 0x78(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	int32                                        CustomActorFlags;                                  // 0x7C(0x4)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_152[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	class AActor*                                ActorUsingQuickAction;                             // 0x88(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	class FName                                  CustomTag;                                         // 0x90(0x8)(Edit, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	int32                                        CustomData;                                        // 0x98(0x4)(Edit, ConstParm, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_153[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnActorCustomEvent;                                // 0xA0(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	double                                       LastThrottledTickTime;                             // 0xB0(0x8)(ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bWantsRealtimeThrottledTick : 1;                   // Mask: 0x1, PropSize: 0x10xB8(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_D : 1;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bRealtimeThrottledTickUseNativeTick : 1;           // Mask: 0x4, PropSize: 0x10xB8(0x1)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_E : 5;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_155[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnMatineeUpdated;                                  // 0xC0(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_156[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	enum class EReplicationGraphBehavior         RepGraphBehavior;                                  // 0xE8(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	enum class EReplicationGraphBehavior         DesiredRepGraphBehavior;                           // 0xE9(0x1)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDesiredRepGraphBehaviorHasBeenSet;                // 0xEA(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_157[0x5];                                      // Fixing Size After Last Property  > TateDumper <
	double                                       ForceMaximumReplicationRateUntilTime;              // 0xF0(0x8)(ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	double                                       LastActorForceReplicationTime;                     // 0xF8(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_159[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        NetworkAndStasisRangeMultiplier;                   // 0x104(0x4)(BlueprintVisible, Parm, OutParm, ReturnParm, InstancedReference, SubobjectReference)
	float                                        NetworkRangeMultiplier;                            // 0x108(0x4)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	float                                        NetCullDistanceSquaredDormant;                     // 0x10C(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_15A[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class AActor*>                        NetworkSpatializationChildren;                     // 0x120(0x10)(ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	TArray<class AActor*>                        NetworkSpatializationChildrenDormant;              // 0x130(0x10)(Edit, ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	class AActor*                                NetworkSpatializationParent;                       // 0x140(0x8)(BlueprintVisible, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        DefaultStasisComponentOctreeFlags;                 // 0x148(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        DefaultStasisedOctreeFlags;                        // 0x14C(0x4)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        DefaultUnstasisedOctreeFlags;                      // 0x150(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	float                                        OverrideStasisComponentRadius;                     // 0x154(0x4)(Edit, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	class UPrimitiveComponent*                   StasisCheckComponent;                              // 0x158(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	double                                       UnstasisLastInRangeTime;                           // 0x160(0x8)(Edit, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	double                                       LastPreReplicationTime;                            // 0x168(0x8)(Edit, Net, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	double                                       LastEnterStasisTime;                               // 0x170(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	double                                       LastExitStasisTime;                                // 0x178(0x8)(BlueprintVisible, ExportObject, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	class FString                                LastSelectedWindSourceComponentName;               // 0x180(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_15D[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<TWeakObjectPtr<class UActorComponent>> StasisUnRegisteredComponents;                      // 0x1A8(0x10)(ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	float                                        ReplicationIntervalMultiplier;                     // 0x1B8(0x4)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	float                                        ClientReplicationSendNowThreshold;                 // 0x1BC(0x4)(ExportObject, EditFixedSize, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_15E[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	TWeakObjectPtr<class USoundBase>             LastPostProcessVolumeSound;                        // 0x1C4(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_15F[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnSemaphoreTaken;                                  // 0x1D0(0x10)(Edit, BlueprintReadOnly, Net, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bForceNonBlockingHits;                             // 0x1E0(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_160[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	double                                       OriginalCreationTime;                              // 0x1E8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	uint8                                        Pad_162[0x20];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class AMatineeActor*>                 ControllingMatineeActors;                          // 0x210(0x10)(ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        NetCriticalPriorityAdjustment;                     // 0x220(0x4)(ExportObject, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_163[0xC];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UPrimalActor* GetDefaultObj();

	void Unstasis();
	bool TryMultiUse(int32 UseIndex);
	void ThrottledTick();
	void TargetingTeamChanged();
	void SetTickFunctionEnabled(bool bEnableTick);
	void SetDesiredRepGraphBehavior(enum class EReplicationGraphBehavior* NewBehavior);
	void RecieveMatineeUpdated();
	void RealtimeThrottledTick(double* DeltaTime);
	bool PreventNotifySound(class USoundBase** SoundIn);
	void PlaySoundOnActor(class USoundCue** InSoundCue, float VolumeMultiplier, float PitchMultiplier);
	void PerformanceThrottledTick();
	void OnInventoryItemGrind();
	float OffsetHUDFromCenterScreenY(class AHUD** ForHUD);
	float OffsetHUDFromBottomScreenY(class AHUD** ForHUD);
	class FName MulticastPropertyToPlayer(class APlayerController** PC, bool* bUnreliable);
	class FName MulticastProperty(bool* bUnreliable);
	int32 ModifyHudMultiUseLoc(struct FVector2D* TheVec, class APlayerController** PC);
	void MatineeUpdated();
	class UWorld* K2_GetWorld();
	bool IsValidLockOnTarget(class APawn** AttackerPawn);
	bool IsTargetable();
	bool IsShooterWeapon();
	bool IsShooterPlayerController();
	bool IsShooterCharacter();
	bool IsPrimalStructureTurret();
	bool IsPrimalStructureItemContainer();
	bool IsPrimalStructureExplosive();
	bool IsPrimalStructure();
	bool IsPrimalDino();
	bool IsPrimalCharacterOrStructure();
	bool IsPrimalCharacter();
	bool IsNetworkStressTestClientMode();
	bool IsLocallyControlledByPlayer();
	bool IsInstancedFoliage();
	bool IsFirstPersonMeshVisible();
	bool IsFirstPersonCamera();
	bool IsDead();
	bool IsARaft();
	int32 InputDismissPOI_BP();
	int32 InputDismissPOI();
	struct FMultiUseWheelOption GetWheelOptionInfoBP(int32 WheelCategory);
	struct FMultiUseWheelOption GetWheelOptionInfo(int32 WheelCategory);
	struct FMultiUseWheelOption GetWheelOptionByUseIndex();
	float GetUsablePriority();
	struct FVector GetTargetingLocation();
	class AActor* GetSecondaryMountedActor();
	class UTexture2D* GetMultiUseIconBP();
	class UTexture2D* GetMultiUseIcon();
	int32 GetMultiUseEntries(const TArray<struct FMultiUseEntry>& MultiUseEntries);
	struct FVector GetInterpolatedVelocity();
	struct FRotator GetInterpolatedRotation();
	struct FVector GetInterpolatedLocation();
	class FString GetEditTextString(class UObject** AssociatedObject1, int32* ExtraID1, int32* ExtraID2);
	class AController* GetCharacterController();
	float GetAttachedSoundVolumeMultiplier();
	float GetAttachedSoundPitchMultiplier();
	TArray<class USceneComponent*> GetAllSceneComponents();
	class FString GetAimedTutorialHintString();
	struct FVector GetActorViewDirection();
	void ForceReplicateNowIfNoChannel();
	void ForceReplicateNow(bool* bForceCreateChannel, bool* bForceCreateChannelIfRelevant, bool* bOnlyIfNoChannel);
	void DrawBasicFloatingHUD(class AHUD** ForHUD);
	void DrawActorFloatingHUD(class AHUD** ForHUD);
	bool CurrentlyHasRider();
	int32 ClientMultiUse(int32 UseIndex);
	void CheckRegisterCharacterMesh();
	bool CheckBPAllowActorSpawn(const struct FVector& AtLocation);
	void ChangeActorTeam(int32* NewTeam);
	bool CanMoveThroughActor(class AActor** Actor);
	bool BPTryMultiUse(int32 UseIndex);
	void BPSetNetworkAndStasisRangeMultiplier(float Value);
	bool BPPreventAttachments(class UObject** ForItem);
	void BPPreInitializeComponents();
	void BPPostInitializeComponents();
	struct FVector BPOverrideUILocation();
	float BPOverrideServerMultiUseAcceptRange();
	bool BPIsMarkedForSeamlessTravel();
	void BPInventoryItemUsed(class UObject** InventoryItemObject);
	void BPInventoryItemDropped(class UObject** InventoryItemObject);
	void BPGetShowDebugAnimationComponents(TArray<class USkeletalMeshComponent*>* SkelMeshComponents);
	struct FQuickActionOption BPGetQuickActionUseEntry();
	TArray<struct FMultiUseEntry> BPGetMultiUseEntries(const TArray<struct FMultiUseEntry>& MultiUseEntries);
	bool BPGetMultiUseCenterText(int32 UseIndex, class FString* OutCenterText, struct FLinearColor* OutCenterTextColor);
	int32 BPGetExtraSpecialBlueprintInt(int32* ToCheck);
	bool BPGetCustomBlueprintData(class FName DataName, struct FBPNetExecParams* InData, struct FBPNetExecParams* OutData);
	TArray<class FName> BPGetBonesToHideOnAllocation();
	void BPGetActorEyesViewPoint(struct FVector* Location, struct FRotator* Rotation);
	bool BPForceAllowsInventoryUse(class UObject** InventoryItemObject);
	TArray<struct FMultiUseEntry> BPFilterMultiUseEntries(const TArray<struct FMultiUseEntry>& MultiUseEntries);
	struct FVector2D BPDrawMultiUseEntry(const struct FMultiUseEntry& Entry);
	struct FVector2D BPDrawMultiUseCustomEntry();
	bool BPCustomIsRelevantForClient();
	struct FVector BPControlRigNotify(class FName NotifyName, struct FHitResult* WorldSpaceHitResult);
	bool BPConsumeUsePinCode();
	bool BPConsumeSetPinCode();
	int32 BPClientDoMultiUse();
	TArray<struct FBPMapCheckEntry> BPCheckForErrors();
	void BPChangedActorTeam();
	void BPAttachedRootComponent();
	bool BPAllowActorSpawn(const struct FVector& AtLocation);
	struct FVector BP_OverrideTargetingLocation();
	struct FVector BP_GetHUDWorldDrawLocation();
	bool AllowManualMultiUseActivation();
	bool AllowIgnoreCharacterEncroachment();
	bool AllowGrappling();
	bool AllowEmulatedMovement();
};

// 0x298 (0x4C8 - 0x230)
// Class Engine.Actor
class AActor : public UPrimalActor
{
public:
	struct FActorTickFunction                    PrimaryActorTick;                                  // 0x230(0x38)(Edit, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bNetTemporary : 1;                                 // Mask: 0x1, PropSize: 0x10x268(0x1)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_F : 1;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bOnlyRelevantToOwner : 1;                          // Mask: 0x4, PropSize: 0x10x268(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bAlwaysRelevant : 1;                               // Mask: 0x8, PropSize: 0x10x268(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bReplicateMovement : 1;                            // Mask: 0x10, PropSize: 0x10x268(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bCallPreReplication : 1;                           // Mask: 0x20, PropSize: 0x10x268(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bCallPreReplicationForReplay : 1;                  // Mask: 0x40, PropSize: 0x10x268(0x1)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bHidden : 1;                                       // Mask: 0x80, PropSize: 0x10x268(0x1)(ConstParm, ExportObject, OutParm, Config)
	uint8                                        bTearOff : 1;                                      // Mask: 0x1, PropSize: 0x10x269(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bForceNetAddressable : 1;                          // Mask: 0x2, PropSize: 0x10x269(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bExchangedRoles : 1;                               // Mask: 0x4, PropSize: 0x10x269(0x1)(ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bNetLoadOnClient : 1;                              // Mask: 0x8, PropSize: 0x10x269(0x1)(Edit, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bNetUseOwnerRelevancy : 1;                         // Mask: 0x10, PropSize: 0x10x269(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bRelevantForNetworkReplays : 1;                    // Mask: 0x20, PropSize: 0x10x269(0x1)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bRelevantForLevelBounds : 1;                       // Mask: 0x40, PropSize: 0x10x269(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bReplayRewindable : 1;                             // Mask: 0x80, PropSize: 0x10x269(0x1)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bAllowTickBeforeBeginPlay : 1;                     // Mask: 0x1, PropSize: 0x10x26A(0x1)(ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bForceHighQualityViewerReplication : 1;            // Mask: 0x2, PropSize: 0x10x26A(0x1)(BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bActorPreventPhysicsSceneRegistration : 1;         // Mask: 0x4, PropSize: 0x10x26A(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bAutoDestroyWhenFinished : 1;                      // Mask: 0x8, PropSize: 0x10x26A(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bCanBeDamaged : 1;                                 // Mask: 0x10, PropSize: 0x10x26A(0x1)(Edit, ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bBlockInput : 1;                                   // Mask: 0x20, PropSize: 0x10x26A(0x1)(Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bCollideWhenPlacing : 1;                           // Mask: 0x40, PropSize: 0x10x26A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bFindCameraComponentWhenViewTarget : 1;            // Mask: 0x80, PropSize: 0x10x26A(0x1)(Edit, ConstParm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bGenerateOverlapEventsDuringLevelStreaming : 1;    // Mask: 0x1, PropSize: 0x10x26B(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bIgnoresOriginShifting : 1;                        // Mask: 0x2, PropSize: 0x10x26B(0x1)(Edit, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bEnableAutoLODGeneration : 1;                      // Mask: 0x4, PropSize: 0x10x26B(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsEditorOnlyActor : 1;                            // Mask: 0x8, PropSize: 0x10x26B(0x1)(ConstParm, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bActorSeamlessTraveled : 1;                        // Mask: 0x10, PropSize: 0x10x26B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bDisableRigidBodyAnimNodes : 1;                    // Mask: 0x20, PropSize: 0x10x26B(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bReplicates : 1;                                   // Mask: 0x40, PropSize: 0x10x26B(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bCanBeInCluster : 1;                               // Mask: 0x80, PropSize: 0x10x26B(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bAllowReceiveTickEventOnDedicatedServer : 1;       // Mask: 0x1, PropSize: 0x10x26C(0x1)(Edit, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_10 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bReplicateUsingRegisteredSubObjectList : 1;        // Mask: 0x4, PropSize: 0x10x26C(0x1)(ConstParm, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        BitPad_11 : 5;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        BitPad_12 : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bActorEnableCollision : 1;                         // Mask: 0x10, PropSize: 0x10x26D(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bActorIsBeingDestroyed : 1;                        // Mask: 0x20, PropSize: 0x10x26D(0x1)(Edit, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_13 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        BitPad_14 : 3;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bAsyncPhysicsTickEnabled : 1;                      // Mask: 0x8, PropSize: 0x10x26E(0x1)(BlueprintVisible, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_15 : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	enum class EActorUpdateOverlapsMethod        UpdateOverlapsMethodDuringLevelStreaming;          // 0x26F(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	enum class EActorUpdateOverlapsMethod        DefaultUpdateOverlapsMethodDuringLevelStreaming;   // 0x270(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	uint8                                        Pad_1F4[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        InitialLifeSpan;                                   // 0x278(0x4)(ConstParm, BlueprintVisible, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        CustomTimeDilation;                                // 0x27C(0x4)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	enum class ENetRole                          RemoteRole;                                        // 0x280(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor)
	uint8                                        Pad_1F5[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        RayTracingGroupId;                                 // 0x284(0x4)(Edit, ConstParm, ExportObject, Parm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	struct FRepAttachment                        AttachmentReplication;                             // 0x288(0x60)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	struct FRepMovement                          ReplicatedMovement;                                // 0x2E8(0x70)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class AActor*                                Owner;                                             // 0x358(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor)
	class FName                                  NetDriverName;                                     // 0x360(0x8)(ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	enum class ENetRole                          Role;                                              // 0x368(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor)
	enum class ENetDormancy                      NetDormancy;                                       // 0x369(0x1)(Edit, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod;                      // 0x36A(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	enum class EAutoReceiveInput                 AutoReceiveInput;                                  // 0x36B(0x1)(Edit, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        InputPriority;                                     // 0x36C(0x4)(Edit, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	double                                       CreationTime;                                      // 0x370(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	class UInputComponent*                       InputComponent;                                    // 0x378(0x8)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst)
	float                                        NetCullDistanceSquared;                            // 0x380(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        NetTag;                                            // 0x384(0x4)(Edit, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        NetUpdateFrequency;                                // 0x388(0x4)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MinNetUpdateFrequency;                             // 0x38C(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        NetPriority;                                       // 0x390(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F6[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	double                                       LastRenderTime;                                    // 0x398(0x8)(BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	double                                       LastRenderTimeOnScreen;                            // 0x3A0(0x8)(Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	double                                       LastRenderTimeIgnoreShadow;                        // 0x3A8(0x8)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	class APawn*                                 Instigator;                                        // 0x3B0(0x8)(Edit, ConstParm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<class AActor*>                        Children;                                          // 0x3B8(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance)
	class USceneComponent*                       RootComponent;                                     // 0x3C8(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F7[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<class FName>                          Layers;                                            // 0x3D8(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TWeakObjectPtr<class UChildActorComponent>   ParentComponent;                                   // 0x3E8(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<class FName>                          Tags;                                              // 0x3F0(0x10)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, Config)
	uint8                                        Pad_1F8[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastSparseDelegateProperty_            OnTakeAnyDamage;                                   // 0x404(0x1)(Edit, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnTakePointDamage;                                 // 0x405(0x1)(BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnTakeRadialDamage;                                // 0x406(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnActorBeginOverlap;                               // 0x407(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnActorEndOverlap;                                 // 0x408(0x1)(Edit, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnBeginCursorOver;                                 // 0x409(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnEndCursorOver;                                   // 0x40A(0x1)(Edit, ConstParm, Net, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnClicked;                                         // 0x40B(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnReleased;                                        // 0x40C(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchBegin;                                 // 0x40D(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchEnd;                                   // 0x40E(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchEnter;                                 // 0x40F(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchLeave;                                 // 0x410(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnActorHit;                                        // 0x411(0x1)(Edit, ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnDestroyed;                                       // 0x412(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnEndPlay;                                         // 0x413(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1F9[0x84];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class UActorComponent*>               InstanceComponents;                                // 0x498(0x10)(Edit, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<class UActorComponent*>               BlueprintCreatedComponents;                        // 0x4A8(0x10)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1FA[0x10];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class AActor* GetDefaultObj();

	bool WasRecentlyRendered(float Tolerance);
	void UserConstructionScript();
	void TearOff();
	class USoundBase* StopActorSound(float FadeOutTime);
	enum class ETickingGroup SetTickGroup();
	void SetTickableWhenPaused(bool* bTickableWhenPaused);
	void SetReplicates(bool* bInReplicates);
	void SetReplicateMovement(bool* bInReplicateMovement);
	void SetRayTracingGroupId(int32* InRaytracingGroupId);
	void SetOwner(class AActor** NewOwner);
	void SetNetDormancy(enum class ENetDormancy* NewDormancy);
	void SetLifeSpan(float* InLifespan);
	void SetAutoDestroyWhenFinished(bool* bVal);
	void SetActorTickInterval(float* TickInterval);
	void SetActorTickEnabled(bool* bEnabled);
	void SetActorScale3D(const struct FVector& NewScale3D);
	void SetActorRelativeScale3D(struct FVector* NewRelativeScale);
	void SetActorHiddenInGame(bool* bNewHidden);
	void SetActorEnableCollision(bool* bNewActorEnableCollision);
	void ServerSendSimpleExecCommandToEveryone(class FName CommandName, bool bIsReliable, bool bForceSendToLocalPlayer, bool bIgnoreRelevancy);
	void ServerSendExecCommandToPlayer(class APrimalPlayerController** ToPC, class FName CommandName, const struct FBPNetExecParams& ExecParams, bool bIsReliable, bool bForceSendToLocalPlayer, bool bIgnoreRelevancy);
	void ServerSendExecCommandToEveryone(class FName CommandName, const struct FBPNetExecParams& ExecParams, bool bIsReliable, bool bForceSendToLocalPlayer, bool bIgnoreRelevancy);
	void ReregisterAllComponents();
	void RemoveTickPrerequisiteComponent(class UActorComponent** PrerequisiteComponent);
	void RemoveTickPrerequisiteActor(class AActor** PrerequisiteActor);
	void ReceiveTick(float DeltaSeconds);
	class AController* ReceiveRadialDamage(float DamageReceived, class UDamageType** DamageType, struct FVector* Origin, class AActor* DamageCauser);
	struct FHitResult ReceivePointDamage(class UDamageType** DamageType, class FName BoneName, class AActor* DamageCauser);
	struct FHitResult ReceiveHit(class UPrimitiveComponent* MyComp, class AActor** Other, bool bSelfMoved);
	void ReceiveEndPlay(enum class EEndPlayReason* EndPlayReason);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void ReceiveAsyncPhysicsTick(float DeltaSeconds, float* SimSeconds);
	class AController* ReceiveAnyDamage(class UDamageType** DamageType, class AActor* DamageCauser);
	void ReceiveActorOnReleased(struct FKey* ButtonReleased);
	enum class ETouchIndex ReceiveActorOnInputTouchLeave();
	enum class ETouchIndex ReceiveActorOnInputTouchEnter();
	enum class ETouchIndex ReceiveActorOnInputTouchEnd();
	enum class ETouchIndex ReceiveActorOnInputTouchBegin();
	void ReceiveActorOnClicked(struct FKey* ButtonPressed);
	class AActor* ReceiveActorEndOverlap();
	void ReceiveActorEndCursorOver();
	class AActor* ReceiveActorBeginOverlap();
	void ReceiveActorBeginCursorOver();
	int32 PrestreamTextures(float* Seconds, bool bEnableStreaming);
	void OnRep_ReplicateMovement();
	void OnRep_ReplicatedMovement();
	void OnRep_Owner();
	void OnRep_Instigator();
	void OnRep_AttachmentReplication();
	class AActor* NetSpawnedActor();
	void NetActorSpawnActorUnreliable(class UClass* ActorClass, const struct FVector& AtLoc, const struct FRotator& AtRot, bool* bIgnoreOnDedicatedServer, class USceneComponent* AttachToComponent, class FName BoneName, class AActor* SpawnOwner);
	void NetActorSpawnActor(class UClass* ActorClass, const struct FVector& AtLoc, const struct FRotator& AtRot, bool* bIgnoreOnDedicatedServer, class USceneComponent* AttachToComponent, class FName BoneName, class AActor* SpawnOwner);
	float MulticastDrawDebugString(bool EnableInShipping);
	float MulticastDrawDebugSphere(bool EnableInShipping);
	float MulticastDrawDebugPoint(const struct FVector& Position, bool EnableInShipping);
	float MulticastDrawDebugPlane(const struct FPlane& PlaneCoordinates, struct FVector* Location, bool EnableInShipping);
	float MulticastDrawDebugLineTraceHitResult(bool EnableInShipping);
	float MulticastDrawDebugLine(bool EnableInShipping);
	float MulticastDrawDebugCylinder(struct FVector* Start, const struct FVector& End, bool EnableInShipping);
	float MulticastDrawDebugCoordinateSystem(float Scale, bool EnableInShipping);
	bool MulticastDrawDebugCapsuleWithExtents(bool EnableInShipping);
	float MulticastDrawDebugCapsule(float HalfHeight, struct FRotator* Rotation, bool EnableInShipping);
	float MulticastDrawDebugCamera(class ACameraActor** CameraActor, bool EnableInShipping);
	float MulticastDrawDebugBox(struct FRotator* Rotation, bool EnableInShipping);
	float MulticastDrawDebugArrow(bool EnableInShipping);
	float MakeNoise(class APawn* NoiseInstigator, const struct FVector& NoiseLocation, class FName* Tag);
	bool K2_TeleportTo(const struct FVector& DestLocation, const struct FRotator& DestRotation, bool bSimpleTeleport);
	bool K2_SetActorTransform(struct FTransform* NewTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	bool K2_SetActorRotation(const struct FRotator& NewRotation, bool bTeleportPhysics);
	void K2_SetActorRelativeTransform(const struct FTransform& NewRelativeTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_SetActorRelativeRotation(const struct FRotator& NewRelativeRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_SetActorRelativeLocation(struct FVector* NewRelativeLocation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	bool K2_SetActorLocationAndRotation(const struct FRotator& NewRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	bool K2_SetActorLocation(bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_OnReset();
	void K2_OnEndViewTarget(class APlayerController** PC);
	void K2_OnBecomeViewTarget(class APlayerController** PC);
	class USceneComponent* K2_GetRootComponent();
	TArray<class UActorComponent*> K2_GetComponentsByClass();
	struct FRotator K2_GetActorRotation();
	struct FVector K2_GetActorLocation();
	void K2_DetachFromActor(enum class EDetachmentRule* LocationRule, enum class EDetachmentRule* RotationRule, enum class EDetachmentRule ScaleRule);
	void K2_DestroyActor();
	bool K2_AttachToComponent(class USceneComponent* Parent, class FName* SocketName, enum class EAttachmentRule* LocationRule, enum class EAttachmentRule* RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	bool K2_AttachToActor(class AActor* ParentActor, class FName* SocketName, enum class EAttachmentRule* LocationRule, enum class EAttachmentRule* RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	class FName K2_AttachRootComponentToActor(class AActor* InParentActor, enum class EAttachLocation AttachLocationType, bool bWeldSimulatedBodies);
	class FName K2_AttachRootComponentTo(class USceneComponent* InParent, enum class EAttachLocation AttachLocationType, bool bWeldSimulatedBodies);
	void K2_AddActorWorldTransformKeepScale(const struct FTransform& DeltaTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddActorWorldTransform(const struct FTransform& DeltaTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddActorWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddActorWorldOffset(struct FVector* DeltaLocation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddActorLocalTransform(struct FTransform* NewTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddActorLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddActorLocalOffset(struct FVector* DeltaLocation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	bool IsOwnedOrControlledBy(class AActor* TestOwner);
	bool IsOverlappingActor(class AActor** Other);
	bool IsChildActor();
	bool IsActorTickEnabled();
	bool IsActorBeingDestroyed();
	bool HasAuthority();
	class UPrimitiveComponent* GetVisibleUnhiddenComponentByClass();
	class UPrimitiveComponent* GetVisibleComponentByClass();
	float GetVerticalDistanceTo();
	struct FVector GetVelocity(bool bIsForRagdoll);
	struct FTransform GetTransform();
	bool GetTickableWhenPaused();
	float GetSquaredHorizontalDistanceTo();
	float GetSquaredDistanceTo();
	enum class ENetRole GetRemoteRole();
	int32 GetRayTracingGroupId();
	class UChildActorComponent* GetParentComponent();
	class AActor* GetParentActor();
	class APlayerController* GetOwnerController();
	class AActor* GetOwner();
	TArray<class UPrimitiveComponent*> GetOverlappingComponents();
	class UClass* GetOverlappingActors();
	enum class ENetRole GetLocalRole();
	float GetLifeSpan();
	struct FTransform GetLevelTransform();
	class ULevel* GetLevel();
	class AController* GetInstigatorController();
	class APawn* GetInstigator();
	struct FVector GetInputVectorAxisValue(const struct FKey& InputAxisKey);
	float GetInputAxisValue(class FName InputAxisName);
	float GetInputAxisKeyValue(const struct FKey& InputAxisKey);
	float GetHorizontalDotProductTo();
	float GetHorizontalDistanceTo();
	float GetGameTimeSinceCreation();
	float GetDotProductTo();
	float GetDistanceTo();
	TArray<class UActorComponent*> GetComponentsByTag(class FName* Tag);
	TArray<class UActorComponent*> GetComponentsByInterface(class UClass* Interface);
	TArray<class UActorComponent*> GetComponentsByCustomTag(class FName TheTag);
	class UActorComponent* GetComponentByCustomTag(class FName TheTag);
	class UActorComponent* GetComponentByClass();
	class FName GetAttachParentSocketName();
	class AActor* GetAttachParentActor();
	TArray<class AActor*> GetAttachedActors(bool bResetArray, bool bRecursivelyIncludeAttachedActors);
	bool GetAllChildActors(const TArray<class AActor*>& ChildActors);
	struct FVector GetActorUpVector();
	float GetActorTimeDilation();
	float GetActorTickInterval();
	struct FVector GetActorScale3D();
	struct FVector GetActorRightVector();
	struct FVector GetActorRelativeScale3D();
	struct FVector GetActorForwardVector();
	struct FRotator GetActorEyesViewPoint();
	bool GetActorEnableCollision();
	bool GetActorBounds(struct FVector* Origin, struct FVector* BoxExtent);
	bool ForceNetUpdate();
	void ForceDestroy();
	void FlushNetDormancy();
	struct FTransform FinishAddComponent();
	void EnableInput(class APlayerController** PlayerController);
	void DisableInput(class APlayerController** PlayerController);
	bool DetachRootComponentFromParent();
	class UClass* CreateInputComponent();
	struct FBox CalculateComponentsBoundingBoxInLocalSpace();
	bool BPServerHandleNetExecCommand(class FName CommandName, const struct FBPNetExecParams& ExecParams);
	bool BPIsA();
	bool BPClientHandleNetExecCommand(class FName CommandName, const struct FBPNetExecParams& ExecParams);
	void AddTickPrerequisiteComponent(class UActorComponent** PrerequisiteComponent);
	void AddTickPrerequisiteActor(class AActor** PrerequisiteActor);
	class UActorComponent* AddComponentByClass(class UClass* Class);
	class UActorComponent* AddComponent(class FName TemplateName);
	struct FVector ActorPlaySoundUnreliable(class FName BoneName);
	struct FVector ActorPlaySound(class FName BoneName);
	bool ActorHasTag(class FName* Tag);
};

// 0x0 (0x28 - 0x28)
// Class Engine.BlueprintFunctionLibrary
class UBlueprintFunctionLibrary : public UObject
{
public:

	static class UClass* StaticClass();
	static class UBlueprintFunctionLibrary* GetDefaultObj();

};

// 0xA0 (0xC8 - 0x28)
// Class Engine.StreamableRenderAsset
class UStreamableRenderAsset : public UObject
{
public:
	uint8                                        Pad_1FB[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       ForceMipLevelsToBeResidentTimestamp;               // 0x40(0x8)(Edit, ConstParm, BlueprintVisible, Net, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NumCinematicMipLevels;                             // 0x48(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1FC[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FPerQualityLevelInt                   NoRefStreamingLODBias;                             // 0x50(0x68)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        StreamingIndex;                                    // 0xB8(0x4)(Edit, ConstParm, BlueprintVisible, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        NeverStream : 1;                                   // Mask: 0x1, PropSize: 0x10xBC(0x1)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config)
	uint8                                        bGlobalForceMipLevelsToBeResident : 1;             // Mask: 0x2, PropSize: 0x10xBC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bHasStreamingUpdatePending : 1;                    // Mask: 0x4, PropSize: 0x10xBC(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bForceMiplevelsToBeResident : 1;                   // Mask: 0x8, PropSize: 0x10xBC(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bIgnoreStreamingMipBias : 1;                       // Mask: 0x10, PropSize: 0x10xBC(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseCinematicMipLevels : 1;                        // Mask: 0x20, PropSize: 0x10xBC(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1FD[0xB];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UStreamableRenderAsset* GetDefaultObj();

	void SetForceMipLevelsToBeResident(float* Seconds, int32 CinematicLODGroupMask);
};

// 0x110 (0x1D8 - 0xC8)
// Class Engine.Texture
class UTexture : public UStreamableRenderAsset
{
public:
	uint8                                        Pad_1FF[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	struct FGuid                                 LightingGuid;                                      // 0xD8(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        LevelIndex;                                        // 0xE8(0x4)(Edit, ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FPerPlatformInt                       LODBias;                                           // 0xEC(0x4)(Edit, BlueprintVisible, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, DuplicateTransient)
	enum class ETextureCompressionSettings       CompressionSettings;                               // 0xF0(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance)
	enum class ETextureFilter                    Filter;                                            // 0xF1(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, Config)
	enum class ETextureMipLoadOptions            MipLoadOptions;                                    // 0xF2(0x1)(Parm, ZeroConstructor, DisableEditOnTemplate, Config, DuplicateTransient)
	enum class ETextureCookPlatformTilingSettings CookPlatformTilingSettings;                        // 0xF3(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	enum class ETextureGroup                     LODGroup;                                          // 0xF4(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, Config, GlobalConfig, InstancedReference)
	uint8                                        Pad_200[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	struct FPerPlatformFloat                     Downscale;                                         // 0xF8(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	enum class ETextureDownscaleOptions          DownscaleOptions;                                  // 0xFC(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        SRGB : 1;                                          // Mask: 0x1, PropSize: 0x10xFD(0x1)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, InstancedReference)
	uint8                                        bNoTiling : 1;                                     // Mask: 0x2, PropSize: 0x10xFD(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        VirtualTextureStreaming : 1;                       // Mask: 0x4, PropSize: 0x10xFD(0x1)(Edit, BlueprintVisible, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, GlobalConfig, InstancedReference, DuplicateTransient)
	uint8                                        CompressionYCoCg : 1;                              // Mask: 0x8, PropSize: 0x10xFD(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bNotOfflineProcessed : 1;                          // Mask: 0x10, PropSize: 0x10xFD(0x1)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bAsyncResourceReleaseHasBeenStarted : 1;           // Mask: 0x20, PropSize: 0x10xFD(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_16 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_201[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<class UAssetUserData*>                AssetUserData;                                     // 0x100(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst)
	uint8                                        Pad_202[0xC8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UTexture* GetDefaultObj();

	bool ComputeTextureSourceChannelMinMax(struct FLinearColor* OutColorMin, struct FLinearColor* OutColorMax);
	void Blueprint_GetTextureSourceDiskAndMemorySize(int64* OutDiskSize, int64* OutMemorySize);
	int64 Blueprint_GetMemorySize();
};

// 0x90 (0xB8 - 0x28)
// Class Engine.ActorComponent
class UActorComponent : public UObject
{
public:
	uint8                                        Pad_209[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FActorComponentTickFunction           PrimaryComponentTick;                              // 0x30(0x38)(Edit, ConstParm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<class FName>                          ComponentTags;                                     // 0x68(0x10)(Edit, ConstParm, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<class UAssetUserData*>                AssetUserData;                                     // 0x78(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst)
	uint8                                        Pad_20A[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        UCSSerializationIndex;                             // 0x8C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        BitPad_17 : 3;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bNetAddressable : 1;                               // Mask: 0x8, PropSize: 0x10x90(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bReplicateUsingRegisteredSubObjectList : 1;        // Mask: 0x10, PropSize: 0x10x90(0x1)(ConstParm, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bReplicates : 1;                                   // Mask: 0x20, PropSize: 0x10x90(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        BitPad_18 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_20B[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        BitPad_19 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bAutoActivate : 1;                                 // Mask: 0x2, PropSize: 0x10x92(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bIsActive : 1;                                     // Mask: 0x4, PropSize: 0x10x92(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bEditableWhenInherited : 1;                        // Mask: 0x8, PropSize: 0x10x92(0x1)(Edit, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bOnlyRelevantToOwner : 1;                          // Mask: 0x10, PropSize: 0x10x92(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        BitPad_1A : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bCanEverAffectNavigation : 1;                      // Mask: 0x40, PropSize: 0x10x92(0x1)(Edit, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        BitPad_1B : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bIsEditorOnly : 1;                                 // Mask: 0x1, PropSize: 0x10x93(0x1)(Edit, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        BitPad_1C : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_20C[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	enum class EComponentCreationMethod          CreationMethod;                                    // 0x95(0x1)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnComponentActivated;                              // 0x96(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnComponentDeactivated;                            // 0x97(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_20D[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        bStasisPreventUnregister : 1;                      // Mask: 0x1, PropSize: 0x10xA8(0x1)(BlueprintVisible, ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bOnlyInitialReplication : 1;                       // Mask: 0x2, PropSize: 0x10xA8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bPreventOnDedicatedServer : 1;                     // Mask: 0x4, PropSize: 0x10xA8(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bPreventOnConsoles : 1;                            // Mask: 0x8, PropSize: 0x10xA8(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bPreventOnClient : 1;                              // Mask: 0x10, PropSize: 0x10xA8(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bPreventOnNonDedicatedHost : 1;                    // Mask: 0x20, PropSize: 0x10xA8(0x1)(BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bDedicatedForceTickingEveryFrame : 1;              // Mask: 0x40, PropSize: 0x10xA8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bAlwaysReplicatePropertyConditional : 1;           // Mask: 0x80, PropSize: 0x10xA8(0x1)(BlueprintVisible, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bUseBPOnComponentTick : 1;                         // Mask: 0x1, PropSize: 0x10xA9(0x1)(Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bUseBPOnComponentDestroyed : 1;                    // Mask: 0x2, PropSize: 0x10xA9(0x1)(ConstParm, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bUseBPOnComponentCreated : 1;                      // Mask: 0x4, PropSize: 0x10xA9(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        BitPad_1D : 5;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_20F[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	class FName                                  CustomTag;                                         // 0xAC(0x8)(Edit, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	int32                                        CustomData;                                        // 0xB4(0x4)(Edit, ConstParm, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)

	static class UClass* StaticClass();
	static class UActorComponent* GetDefaultObj();

	void ToggleActive();
	enum class ETickingGroup SetTickGroup();
	void SetTickableWhenPaused(bool* bTickableWhenPaused);
	void SetOwner(class AActor** NewOwner);
	void SetIsReplicated(bool* ShouldReplicate);
	void SetComponentTickIntervalAndCooldown(float* TickInterval);
	void SetComponentTickInterval(float* TickInterval);
	void SetComponentTickEnabled(bool* bEnabled);
	void SetAutoActivate(bool* bNewAutoActivate);
	void SetActive(bool* bNewActive, bool* bReset);
	void ReregisterComponent();
	void RemoveTickPrerequisiteComponent(class UActorComponent** PrerequisiteComponent);
	void RemoveTickPrerequisiteActor(class AActor** PrerequisiteActor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(enum class EEndPlayReason* EndPlayReason);
	void ReceiveBeginPlay();
	void ReceiveAsyncPhysicsTick(float DeltaSeconds, float* SimSeconds);
	void OnRep_IsActive();
	void K2_DestroyComponent(class UObject** Object);
	bool IsComponentTickEnabled();
	bool IsBeingDestroyed();
	bool IsActive();
	class AActor* GetOwner();
	float GetComponentTickInterval();
	void Deactivate();
	bool ComponentHasTag(class FName* Tag);
	void BPTickComponent(float* DeltaTime);
	void BPOnComponentTick(float* DeltaTime);
	void BPOnComponentDestroyed();
	void BPOnComponentCreated();
	void AddTickPrerequisiteComponent(class UActorComponent** PrerequisiteComponent);
	void AddTickPrerequisiteActor(class AActor** PrerequisiteActor);
	void AddedAsPrimalItemAttachment();
	void Activate(bool* bReset);
};

// 0x210 (0x2C8 - 0xB8)
// Class Engine.SceneComponent
class USceneComponent : public UActorComponent
{
public:
	uint8                                        Pad_26D[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	TWeakObjectPtr<class APhysicsVolume>         PhysicsVolume;                                     // 0xC0(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, Transient, Config, GlobalConfig)
	class USceneComponent*                       AttachParent;                                      // 0xC8(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class FName                                  AttachSocketName;                                  // 0xD0(0x8)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	TArray<class USceneComponent*>               AttachChildren;                                    // 0xD8(0x10)(Edit, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	TArray<class USceneComponent*>               ClientAttachedChildren;                            // 0xE8(0x10)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_26E[0x48];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RelativeLocation;                                  // 0x140(0x18)(ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	struct FRotator                              RelativeRotation;                                  // 0x158(0x18)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               RelativeScale3D;                                   // 0x170(0x18)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               ComponentVelocity;                                 // 0x188(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bClientSyncAlwaysUpdatePhysicsCollision : 1;       // Mask: 0x1, PropSize: 0x10x1A0(0x1)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_1F : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_26F[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bComponentToWorldUpdated : 1;                      // Mask: 0x1, PropSize: 0x10x1A4(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_20 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bAbsoluteLocation : 1;                             // Mask: 0x4, PropSize: 0x10x1A4(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        bAbsoluteRotation : 1;                             // Mask: 0x8, PropSize: 0x10x1A4(0x1)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAbsoluteScale : 1;                                // Mask: 0x10, PropSize: 0x10x1A4(0x1)(Edit, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bVisible : 1;                                      // Mask: 0x20, PropSize: 0x10x1A4(0x1)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bShouldBeAttached : 1;                             // Mask: 0x40, PropSize: 0x10x1A4(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bShouldSnapLocationWhenAttached : 1;               // Mask: 0x80, PropSize: 0x10x1A4(0x1)(Edit, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bShouldSnapRotationWhenAttached : 1;               // Mask: 0x1, PropSize: 0x10x1A5(0x1)(ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bShouldSnapScaleWhenAttached : 1;                  // Mask: 0x2, PropSize: 0x10x1A5(0x1)(Edit, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bShouldUpdatePhysicsVolume : 1;                    // Mask: 0x4, PropSize: 0x10x1A5(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bHiddenInGame : 1;                                 // Mask: 0x8, PropSize: 0x10x1A5(0x1)(ConstParm, OutParm, Config)
	uint8                                        BitPad_21 : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_273[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bAttachedSoundsForceHighPriority : 1;              // Mask: 0x1, PropSize: 0x10x1A8(0x1)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_23 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_275[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bBoundsChangeTriggersStreamingDataRebuild : 1;     // Mask: 0x1, PropSize: 0x10x1AC(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseAttachParentBound : 1;                         // Mask: 0x2, PropSize: 0x10x1AC(0x1)(ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bComputeFastLocalBounds : 1;                       // Mask: 0x4, PropSize: 0x10x1AC(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bComputeBoundsOnceForGame : 1;                     // Mask: 0x8, PropSize: 0x10x1AC(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        bComputedBoundsOnceForGame : 1;                    // Mask: 0x10, PropSize: 0x10x1AC(0x1)(Edit, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsNotRenderAttachmentRoot : 1;                    // Mask: 0x20, PropSize: 0x10x1AC(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_24 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_279[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	enum class EComponentMobility                Mobility;                                          // 0x1AE(0x1)(Parm, OutParm, ZeroConstructor, Transient, EditConst)
	enum class EDetailMode                       DetailMode;                                        // 0x1AF(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	FMulticastSparseDelegateProperty_            PhysicsVolumeChangedDelegate;                      // 0x1B0(0x1)(Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_27A[0x10F];                                    // Fixing Size After Last Property  > TateDumper <
	uint8                                        bIgnoreParentTransformUpdate : 1;                  // Mask: 0x1, PropSize: 0x10x2C0(0x1)(BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUpdateChildOverlaps : 1;                          // Mask: 0x2, PropSize: 0x10x2C0(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_25 : 6;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_27B[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        AttachmentChangedIncrementer;                      // 0x2C4(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)

	static class UClass* StaticClass();
	static class USceneComponent* GetDefaultObj();

	void ToggleVisibility(bool* bPropagateToChildren);
	void StopSound(class USoundBase* SoundToStop, float FadeOutTime);
	void SetWorldScale3D(const struct FVector& NewScale);
	void SetVisibility(bool bNewVisibility, bool* bPropagateToChildren, bool* bSetChildrenRenderState);
	void SetShouldUpdatePhysicsVolume(bool bInShouldUpdatePhysicsVolume);
	void SetRelativeScale3D(const struct FVector& NewScale3D);
	void SetMobility(enum class EComponentMobility* NewMobility);
	void SetHiddenInGame(bool* NewHidden, bool* bPropagateToChildren, bool* bSetChildrenRenderState);
	void SetAbsolute(bool* bNewAbsoluteLocation, bool* bNewAbsoluteRotation, bool* bNewAbsoluteScale);
	void ResetRelativeTransform();
	void OnRep_Visibility(bool* OldValue);
	void OnRep_Transform();
	void OnRep_AttachSocketName();
	void OnRep_AttachParent();
	void OnRep_AttachChildren();
	void K2_SetWorldTransform(struct FTransform* NewTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_SetWorldRotation(const struct FRotator& NewRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	struct FVector K2_SetWorldLocationAndRotation(const struct FRotator& NewRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	struct FVector K2_SetWorldLocation(bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_SetRelativeTransform(struct FTransform* NewTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_SetRelativeRotation(const struct FRotator& NewRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	struct FVector K2_SetRelativeLocationAndRotation(const struct FRotator& NewRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	struct FVector K2_SetRelativeLocation(bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	struct FTransform K2_GetComponentToWorld();
	struct FVector K2_GetComponentScale();
	struct FRotator K2_GetComponentRotation();
	struct FVector K2_GetComponentLocation();
	bool K2_DetachFromComponent(enum class EDetachmentRule* LocationRule, enum class EDetachmentRule* RotationRule, enum class EDetachmentRule ScaleRule);
	bool K2_AttachToComponent(class USceneComponent* Parent, class FName* SocketName, enum class EAttachmentRule* LocationRule, enum class EAttachmentRule* RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	bool K2_AttachTo(class USceneComponent* InParent, enum class EAttachLocation AttachType, bool bWeldSimulatedBodies);
	void K2_AddWorldTransformKeepScale(const struct FTransform& DeltaTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddWorldTransform(const struct FTransform& DeltaTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddWorldOffset(struct FVector* DeltaLocation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddRelativeRotation(const struct FRotator& DeltaRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddRelativeLocation(struct FVector* DeltaLocation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddLocalTransform(const struct FTransform& DeltaTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddLocalOffset(struct FVector* DeltaLocation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	bool IsVisible();
	bool IsSimulatingPhysics(class FName BoneName);
	bool IsAnySimulatingPhysics();
	struct FVector GetUpVector();
	struct FTransform GetSocketTransform();
	struct FRotator GetSocketRotation();
	struct FQuat GetSocketQuaternion();
	struct FVector GetSocketLocation();
	bool GetShouldUpdatePhysicsVolume();
	struct FVector GetRightVector();
	struct FTransform GetRelativeTransform();
	class APhysicsVolume* GetPhysicsVolume();
	TArray<class USceneComponent*> GetParentComponents();
	int32 GetNumChildrenComponents();
	struct FVector GetForwardVector();
	struct FVector GetComponentVelocity();
	bool GetChildrenComponents(TArray<class USceneComponent*>* Children);
	class USceneComponent* GetChildComponent();
	class FName GetAttachSocketName();
	class USceneComponent* GetAttachParent();
	TArray<class FName> GetAllSocketNames();
	bool DoesSocketExist();
	bool DetachFromParent();
};

// 0x3D0 (0x698 - 0x2C8)
// Class Engine.PrimitiveComponent
class UPrimitiveComponent : public USceneComponent
{
public:
	uint8                                        Pad_370[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MinDrawDistance;                                   // 0x2E0(0x4)(BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	float                                        LDMaxDrawDistance;                                 // 0x2E4(0x4)(ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	float                                        CachedMaxDrawDistance;                             // 0x2E8(0x4)(ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	enum class ESceneDepthPriorityGroup          DepthPriorityGroup;                                // 0x2EC(0x1)(BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	enum class ESceneDepthPriorityGroup          ViewOwnerDepthPriorityGroup;                       // 0x2ED(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	enum class EIndirectLightingCacheQuality     IndirectLightingCacheQuality;                      // 0x2EE(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	enum class ELightmapType                     LightmapType;                                      // 0x2EF(0x1)(Edit, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	enum class EHLODBatchingPolicy               HLODBatchingPolicy;                                // 0x2F0(0x1)(Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bEnableAutoLODGeneration : 1;                      // Mask: 0x1, PropSize: 0x10x2F1(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsActorTextureStreamingBuiltData : 1;             // Mask: 0x2, PropSize: 0x10x2F1(0x1)(Edit, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsValidTextureStreamingBuiltData : 1;             // Mask: 0x4, PropSize: 0x10x2F1(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bNeverDistanceCull : 1;                            // Mask: 0x8, PropSize: 0x10x2F1(0x1)(Edit, BlueprintVisible, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_29 : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        BitPad_2A : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bAlwaysCreatePhysicsState : 1;                     // Mask: 0x2, PropSize: 0x10x2F2(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bGenerateOverlapEvents : 1;                        // Mask: 0x4, PropSize: 0x10x2F2(0x1)(Edit, ConstParm, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bMultiBodyOverlap : 1;                             // Mask: 0x8, PropSize: 0x10x2F2(0x1)(Edit, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bTraceComplexOnMove : 1;                           // Mask: 0x10, PropSize: 0x10x2F2(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bReturnMaterialOnMove : 1;                         // Mask: 0x20, PropSize: 0x10x2F2(0x1)(ConstParm, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseViewOwnerDepthPriorityGroup : 1;               // Mask: 0x40, PropSize: 0x10x2F2(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAllowCullDistanceVolume : 1;                      // Mask: 0x80, PropSize: 0x10x2F2(0x1)(BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bVisibleInReflectionCaptures : 1;                  // Mask: 0x1, PropSize: 0x10x2F3(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bVisibleInRealTimeSkyCaptures : 1;                 // Mask: 0x2, PropSize: 0x10x2F3(0x1)(Edit, BlueprintVisible, ExportObject, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bVisibleInRayTracing : 1;                          // Mask: 0x4, PropSize: 0x10x2F3(0x1)(ConstParm, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bRenderInMainPass : 1;                             // Mask: 0x8, PropSize: 0x10x2F3(0x1)(ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bRenderInDepthPass : 1;                            // Mask: 0x10, PropSize: 0x10x2F3(0x1)(ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bReceivesDecals : 1;                               // Mask: 0x20, PropSize: 0x10x2F3(0x1)(Edit, BlueprintVisible, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bHoldout : 1;                                      // Mask: 0x40, PropSize: 0x10x2F3(0x1)(ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOwnerNoSee : 1;                                   // Mask: 0x80, PropSize: 0x10x2F3(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOnlyOwnerSee : 1;                                 // Mask: 0x1, PropSize: 0x10x2F4(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bTreatAsBackgroundForOcclusion : 1;                // Mask: 0x2, PropSize: 0x10x2F4(0x1)(Edit, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseAsOccluder : 1;                                // Mask: 0x4, PropSize: 0x10x2F4(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bSelectable : 1;                                   // Mask: 0x8, PropSize: 0x10x2F4(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bForceMipStreaming : 1;                            // Mask: 0x10, PropSize: 0x10x2F4(0x1)(ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bHasPerInstanceHitProxies : 1;                     // Mask: 0x20, PropSize: 0x10x2F4(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        CastShadow : 1;                                    // Mask: 0x40, PropSize: 0x10x2F4(0x1)(Edit, ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, Transient, Config, EditConst)
	uint8                                        bEmissiveLightSource : 1;                          // Mask: 0x80, PropSize: 0x10x2F4(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAffectDynamicIndirectLighting : 1;                // Mask: 0x1, PropSize: 0x10x2F5(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAffectIndirectLightingWhileHidden : 1;            // Mask: 0x2, PropSize: 0x10x2F5(0x1)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAffectDistanceFieldLighting : 1;                  // Mask: 0x4, PropSize: 0x10x2F5(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCastDynamicShadow : 1;                            // Mask: 0x8, PropSize: 0x10x2F5(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCastStaticShadow : 1;                             // Mask: 0x10, PropSize: 0x10x2F5(0x1)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_2B : 3;                                     // Fixing Bit-Field Size  > TateDumper <
	enum class EShadowCacheInvalidationBehavior  ShadowCacheInvalidationBehavior;                   // 0x2F6(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCastVolumetricTranslucentShadow : 1;              // Mask: 0x1, PropSize: 0x10x2F7(0x1)(BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCastContactShadow : 1;                            // Mask: 0x2, PropSize: 0x10x2F7(0x1)(ConstParm, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bSelfShadowOnly : 1;                               // Mask: 0x4, PropSize: 0x10x2F7(0x1)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCastFarShadow : 1;                                // Mask: 0x8, PropSize: 0x10x2F7(0x1)(Edit, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCastInsetShadow : 1;                              // Mask: 0x10, PropSize: 0x10x2F7(0x1)(ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCastCinematicShadow : 1;                          // Mask: 0x20, PropSize: 0x10x2F7(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCastHiddenShadow : 1;                             // Mask: 0x40, PropSize: 0x10x2F7(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCastShadowAsTwoSided : 1;                         // Mask: 0x80, PropSize: 0x10x2F7(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bLightAsIfStatic : 1;                              // Mask: 0x1, PropSize: 0x10x2F8(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bLightAttachmentsAsGroup : 1;                      // Mask: 0x2, PropSize: 0x10x2F8(0x1)(Edit, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bExcludeFromLightAttachmentGroup : 1;              // Mask: 0x4, PropSize: 0x10x2F8(0x1)(EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bReceiveMobileCSMShadows : 1;                      // Mask: 0x8, PropSize: 0x10x2F8(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bSingleSampleShadowFromStationaryLights : 1;       // Mask: 0x10, PropSize: 0x10x2F8(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIgnoreRadialImpulse : 1;                          // Mask: 0x20, PropSize: 0x10x2F8(0x1)(Edit, ConstParm, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIgnoreRadialForce : 1;                            // Mask: 0x40, PropSize: 0x10x2F8(0x1)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bApplyImpulseOnDamage : 1;                         // Mask: 0x80, PropSize: 0x10x2F8(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bReplicatePhysicsToAutonomousProxy : 1;            // Mask: 0x1, PropSize: 0x10x2F9(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bFillCollisionUnderneathForNavmesh : 1;            // Mask: 0x2, PropSize: 0x10x2F9(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        AlwaysLoadOnClient : 1;                            // Mask: 0x4, PropSize: 0x10x2F9(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        AlwaysLoadOnServer : 1;                            // Mask: 0x8, PropSize: 0x10x2F9(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseEditorCompositing : 1;                         // Mask: 0x10, PropSize: 0x10x2F9(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsBeingMovedByEditor : 1;                         // Mask: 0x20, PropSize: 0x10x2F9(0x1)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bRenderCustomDepth : 1;                            // Mask: 0x40, PropSize: 0x10x2F9(0x1)(Edit, ConstParm, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bVisibleInSceneCaptureOnly : 1;                    // Mask: 0x80, PropSize: 0x10x2F9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bHiddenInSceneCapture : 1;                         // Mask: 0x1, PropSize: 0x10x2FA(0x1)(Edit, ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bRayTracingFarField : 1;                           // Mask: 0x2, PropSize: 0x10x2FA(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_2D : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bHasNoStreamableTextures : 1;                      // Mask: 0x8, PropSize: 0x10x2FA(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bStaticWhenNotMoveable : 1;                        // Mask: 0x10, PropSize: 0x10x2FA(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_2E : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bIgnoreUpdatingOwnersLastRenderTime : 1;           // Mask: 0x80, PropSize: 0x10x2FA(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_37C[0x1D];                                     // Fixing Size After Last Property  > TateDumper <
	enum class EHasCustomNavigableGeometry       bHasCustomNavigableGeometry;                       // 0x318(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_37D[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	enum class ECanBeCharacterBase               CanCharacterStepUpOn;                              // 0x31A(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FLightingChannels                     LightingChannels;                                  // 0x31B(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, EditConst)
	int32                                        RayTracingGroupId;                                 // 0x31C(0x4)(Edit, ConstParm, ExportObject, Parm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	int32                                        VisibilityId;                                      // 0x320(0x4)(BlueprintVisible, Parm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	int32                                        CustomDepthStencilValue;                           // 0x324(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	struct FCustomPrimitiveData                  CustomPrimitiveData;                               // 0x328(0x10)(Edit, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst)
	struct FCustomPrimitiveData                  CustomPrimitiveDataInternal;                       // 0x338(0x10)(ExportObject, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_37E[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        TranslucencySortPriority;                          // 0x350(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	float                                        TranslucencySortDistanceOffset;                    // 0x354(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	TArray<class URuntimeVirtualTexture*>        RuntimeVirtualTextures;                            // 0x358(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	int8                                         VirtualTextureLodBias;                             // 0x368(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	int8                                         VirtualTextureCullMips;                            // 0x369(0x1)(Edit, ConstParm, BlueprintVisible, Net, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	int8                                         VirtualTextureMinCoverage;                         // 0x36A(0x1)(Edit, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	enum class ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType;                      // 0x36B(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_381[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoundsScale;                                       // 0x37C(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_382[0x20];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class AActor*>                        MoveIgnoreActors;                                  // 0x3A0(0x10)(Edit, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	TArray<class UPrimitiveComponent*>           MoveIgnoreComponents;                              // 0x3B0(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_383[0x60];                                     // Fixing Size After Last Property  > TateDumper <
	struct FBodyInstance                         BodyInstance;                                      // 0x420(0x150)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, EditConst)
	FMulticastSparseDelegateProperty_            OnComponentHit;                                    // 0x570(0x1)(Net, EditFixedSize, Parm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnComponentBeginOverlap;                           // 0x571(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnComponentEndOverlap;                             // 0x572(0x1)(Edit, BlueprintVisible, Net, Parm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnComponentWake;                                   // 0x573(0x1)(BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnComponentSleep;                                  // 0x574(0x1)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_384[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastSparseDelegateProperty_            OnComponentPhysicsStateChanged;                    // 0x576(0x1)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnBeginCursorOver;                                 // 0x577(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnEndCursorOver;                                   // 0x578(0x1)(Edit, ConstParm, Net, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnClicked;                                         // 0x579(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnReleased;                                        // 0x57A(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchBegin;                                 // 0x57B(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchEnd;                                   // 0x57C(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchEnter;                                 // 0x57D(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchLeave;                                 // 0x57E(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERayTracingGroupCullingPriority   RayTracingGroupCullingPriority;                    // 0x57F(0x1)(Edit, ExportObject, Net, OutParm, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	enum class ERendererStencilMask              CustomDepthStencilWriteMask;                       // 0x580(0x1)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_388[0x1F];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        ExcludeFromHLODLevels;                             // 0x5A0(0x1)(ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_389[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	class UPrimitiveComponent*                   LODParentPrimitive;                                // 0x5A8(0x8)(BlueprintVisible, OutParm, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bForcePreventBlockingProjectiles : 1;              // Mask: 0x1, PropSize: 0x10x5B0(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bForceOverlapEvents : 1;                           // Mask: 0x2, PropSize: 0x10x5B0(0x1)(ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsInForeground : 1;                               // Mask: 0x4, PropSize: 0x10x5B0(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseInternalOctree : 1;                            // Mask: 0x8, PropSize: 0x10x5B0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseInternalOctreeOnClient : 1;                    // Mask: 0x10, PropSize: 0x10x5B0(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_2F : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bForceDynamicPhysics : 1;                          // Mask: 0x40, PropSize: 0x10x5B0(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventCharacterBasing : 1;                       // Mask: 0x80, PropSize: 0x10x5B0(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_30 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bIsAbstractBasingComponent : 1;                    // Mask: 0x2, PropSize: 0x10x5B1(0x1)(Edit, Net, Parm, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bClimbable : 1;                                    // Mask: 0x4, PropSize: 0x10x5B1(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseAbsoluteMaxDrawDisatance : 1;                  // Mask: 0x8, PropSize: 0x10x5B1(0x1)(BlueprintVisible, ExportObject, Parm, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bMovableUseDynamicDrawDistance : 1;                // Mask: 0x10, PropSize: 0x10x5B1(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIncludeBoundsRadiusInDrawDistances : 1;           // Mask: 0x20, PropSize: 0x10x5B1(0x1)(Edit, ExportObject, Net, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bExcludeFromLevelBounds : 1;                       // Mask: 0x40, PropSize: 0x10x5B1(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIgnoredByCharacterEncroachment : 1;               // Mask: 0x80, PropSize: 0x10x5B1(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventDamage : 1;                                // Mask: 0x1, PropSize: 0x10x5B2(0x1)(Edit, ConstParm, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_31 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_38B[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        ObjectLayer;                                       // 0x5B4(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	float                                        OverrideStepHeight;                                // 0x5B8(0x4)(ConstParm, BlueprintReadOnly, Net, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_38C[0x98];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        InternalOctreeMask;                                // 0x654(0x4)(ExportObject, Net, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_38D[0x1C];                                     // Fixing Size After Last Property  > TateDumper <
	uint32                                       ProxyMeshID;                                       // 0x674(0x4)(Edit, Net, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bIsProxyMeshParent;                                // 0x678(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_38E[0x1F];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UPrimitiveComponent* GetDefaultObj();

	bool WasRecentlyVisible();
	bool WasRecentlyRendered(float Tolerance);
	void WakeRigidBody(class FName BoneName);
	void WakeAllRigidBodies();
	void SetWalkableSlopeOverride(const struct FWalkableSlopeOverride& NewOverride);
	void SetVisibleInSceneCaptureOnly(bool* bValue);
	void SetVisibleInRayTracing(bool* bNewVisibleInRayTracing);
	void SetVectorParameterForDefaultCustomPrimitiveData(class FName* ParameterName, const struct FVector4& Value);
	void SetVectorParameterForCustomPrimitiveData(class FName* ParameterName, const struct FVector4& Value);
	bool SetUseCCD(class FName BoneName);
	void SetTranslucentSortPriority(int32* NewTranslucentSortPriority);
	void SetTranslucencySortDistanceOffset(float* NewTranslucencySortDistanceOffset);
	void SetStaticWhenNotMoveable(bool* bInStaticWhenNotMoveable);
	void SetSingleSampleShadowFromStationaryLights(bool* bNewSingleSampleShadowFromStationaryLights);
	void SetSimulatePhysics(bool* bSimulate);
	void SetScalarParameterForDefaultCustomPrimitiveData(class FName* ParameterName, float Value);
	void SetScalarParameterForCustomPrimitiveData(class FName* ParameterName, float Value);
	void SetRenderInMainPass(bool* bValue);
	void SetRenderInDepthPass(bool* bValue);
	void SetRenderCustomDepth(bool* bValue);
	void SetReceivesDecals(bool* bNewReceivesDecals);
	void SetPhysMaterialOverride(class UPhysicalMaterial** NewPhysMaterial);
	bool SetPhysicsMaxAngularVelocityInRadians(float* NewMaxAngVel, class FName BoneName);
	bool SetPhysicsMaxAngularVelocityInDegrees(float* NewMaxAngVel, class FName BoneName);
	bool SetPhysicsLinearVelocity(class FName BoneName);
	bool SetPhysicsAngularVelocityInRadians(class FName BoneName);
	bool SetPhysicsAngularVelocityInDegrees(class FName BoneName);
	void SetOwnerNoSee(bool* bNewOwnerNoSee);
	void SetOnlyOwnerSee(bool* bNewOnlyOwnerSee);
	void SetNotifyRigidBodyCollision(bool* bNewNotifyRigidBodyCollision);
	class UMaterialInterface* SetMaterialByName(class FName* MaterialSlotName);
	class UMaterialInterface* SetMaterial();
	float SetMassScale(class FName BoneName);
	float SetMassOverrideInKg(class FName BoneName, bool* bOverrideMass);
	float SetLinearDamping();
	void SetLightingChannels(bool* bChannel0, bool* bChannel1, bool* bChannel2);
	void SetLightAttachmentsAsGroup(bool* bInLightAttachmentsAsGroup);
	void SetInternalOctreeMask(int32* InOctreeMask, bool* bReregisterWithTree);
	void SetHoldout(bool* bNewHoldout);
	void SetHiddenInSceneCapture(bool* bValue);
	void SetGenerateOverlapEvents(bool* bInGenerateOverlapEvents);
	void SetExcludeFromLightAttachmentGroup(bool* bInExcludeFromLightAttachmentGroup);
	void SetExcludeForSpecificHLODLevels(const TArray<int32>& InExcludeForSpecificHLODLevels);
	enum class EHLODLevelExclusion SetExcludedFromHLODLevel(bool bExcluded);
	void SetEnableGravity(bool bGravityEnabled);
	void SetEmissiveLightSource(bool NewEmissiveLightSource);
	void SetDefaultCustomPrimitiveDataVector4(int32 DataIndex, const struct FVector4& Value);
	void SetDefaultCustomPrimitiveDataVector3(int32 DataIndex, const struct FVector& Value);
	void SetDefaultCustomPrimitiveDataVector2(int32 DataIndex, const struct FVector2D& Value);
	void SetDefaultCustomPrimitiveDataFloat(int32 DataIndex, float Value);
	void SetCustomPrimitiveDataVector4(int32 DataIndex, const struct FVector4& Value);
	void SetCustomPrimitiveDataVector3(int32 DataIndex, const struct FVector& Value);
	void SetCustomPrimitiveDataVector2(int32 DataIndex, const struct FVector2D& Value);
	void SetCustomPrimitiveDataFloat(int32 DataIndex, float Value);
	void SetCustomDepthStencilWriteMask(enum class ERendererStencilMask WriteMaskBit);
	void SetCustomDepthStencilValue(int32 Value);
	void SetCullDistance(float NewCullDistance);
	void SetConstraintMode(enum class EDOFMode ConstraintMode);
	enum class ECollisionChannel SetCollisionResponseToChannel(enum class ECollisionResponse NewResponse);
	void SetCollisionResponseToAllChannels(enum class ECollisionResponse NewResponse);
	struct FCollisionResponseSet SetCollisionResponseSet();
	void SetCollisionProfileName(class FName InCollisionProfileName, bool bUpdateOverlaps);
	enum class ECollisionChannel SetCollisionObjectType();
	void SetCollisionEnabled(enum class ECollisionEnabled NewType);
	struct FVector SetCenterOfMass(class FName BoneName);
	bool SetCastShadow();
	bool SetCastInsetShadow();
	bool SetCastHiddenShadow();
	bool SetCastContactShadow();
	float SetBoundsScale();
	float SetAngularDamping();
	bool SetAllUseCCD();
	bool SetAllPhysicsLinearVelocity();
	bool SetAllPhysicsAngularVelocityInRadians();
	bool SetAllPhysicsAngularVelocityInDegrees();
	float SetAllMassScale();
	bool SetAffectIndirectLightingWhileHidden();
	bool SetAffectDynamicIndirectLighting();
	bool SetAffectDistanceFieldLighting();
	struct FVector ScaleByMomentOfInertia(class FName BoneName);
	void PutRigidBodyToSleep(class FName BoneName);
	bool K2_SphereTraceComponent(class FName BoneName, const struct FHitResult& OutHit);
	bool K2_SphereOverlapComponent(class FName BoneName, const struct FHitResult& OutHit);
	bool K2_LineTraceComponent(class FName BoneName, const struct FHitResult& OutHit);
	bool K2_IsQueryCollisionEnabled();
	bool K2_IsPhysicsCollisionEnabled();
	bool K2_IsCollisionEnabled();
	bool K2_BoxOverlapComponent(class FName BoneName, const struct FHitResult& OutHit);
	bool IsOverlappingComponent();
	bool IsOverlappingActor(class AActor** Other);
	bool IsGravityEnabled();
	bool IsExcludedFromHLODLevel();
	bool IsAnyRigidBodyAwake();
	void InvalidateLumenSurfaceCache();
	bool IgnoreComponentWhenMoving();
	bool IgnoreActorWhenMoving(class AActor** Actor);
	struct FWalkableSlopeOverride GetWalkableSlopeOverride();
	bool GetStaticWhenNotMoveable();
	struct FVector GetPhysicsLinearVelocityAtPoint(class FName BoneName);
	struct FVector GetPhysicsLinearVelocity(class FName BoneName);
	struct FVector GetPhysicsAngularVelocityInRadians(class FName BoneName);
	struct FVector GetPhysicsAngularVelocityInDegrees(class FName BoneName);
	void GetOverlappingComponents(TArray<class UPrimitiveComponent*>* OutOverlappingComponents);
	class UClass* GetOverlappingActors();
	int32 GetNumMaterials();
	class UMaterialInterface* GetMaterialFromCollisionFaceIndex();
	class UMaterialInterface* GetMaterial();
	float GetMassScale(class FName BoneName);
	float GetMass();
	float GetLinearDamping();
	struct FVector GetInertiaTensor(class FName BoneName);
	bool GetGenerateOverlapEvents();
	TArray<int32> GetExcludeForSpecificHLODLevels();
	int32 GetCustomPrimitiveDataIndexForVectorParameter(class FName* ParameterName);
	int32 GetCustomPrimitiveDataIndexForScalarParameter(class FName* ParameterName);
	enum class ECollisionResponse GetCollisionResponseToChannel();
	struct FCollisionResponseSet GetCollisionResponseSet();
	class FName GetCollisionProfileName();
	enum class ECollisionChannel GetCollisionObjectType();
	enum class ECollisionEnabled GetCollisionEnabled();
	float GetClosestPointOnCollision(struct FVector* OutPointOnBody, class FName BoneName);
	struct FVector GetCenterOfMass(class FName BoneName);
	struct FBodyInstanceAsyncPhysicsTickHandle GetBodyInstanceAsyncPhysicsTickHandle(class FName BoneName, bool* bGetWelded);
	float GetAngularDamping();
	class UMaterialInstanceDynamic* CreateDynamicMaterialInstance(class UMaterialInterface** SourceMaterial, class FName* OptionalName);
	class UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamicFromMaterial(class UMaterialInterface* Parent);
	class UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamic();
	TArray<class UPrimitiveComponent*> CopyArrayOfMoveIgnoreComponents();
	TArray<class AActor*> CopyArrayOfMoveIgnoreActors();
	void ClearMoveIgnoreComponents();
	void ClearMoveIgnoreActors();
	bool CanCharacterStepUp(class APawn* Pawn);
	void AddVelocityChangeImpulseAtLocation(const struct FVector& Impulse, struct FVector* Location, class FName BoneName);
	void AddTorqueInRadians(struct FVector* Torque, class FName BoneName, bool* bAccelChange);
	void AddTorqueInDegrees(struct FVector* Torque, class FName BoneName, bool* bAccelChange);
	float AddRadialImpulse(struct FVector* Origin, float* Strength, enum class ERadialImpulseFalloff* Falloff, bool* bVelChange);
	float AddRadialForce(struct FVector* Origin, float* Strength, enum class ERadialImpulseFalloff* Falloff, bool* bAccelChange);
	void AddImpulseAtLocation(const struct FVector& Impulse, struct FVector* Location, class FName BoneName);
	void AddImpulse(const struct FVector& Impulse, class FName BoneName, bool* bVelChange);
	void AddForceAtLocationLocal(struct FVector* Force, struct FVector* Location, class FName BoneName);
	void AddForceAtLocation(struct FVector* Force, struct FVector* Location, class FName BoneName);
	void AddForce(struct FVector* Force, class FName BoneName, bool* bAccelChange);
	void AddAngularImpulseInRadians(const struct FVector& Impulse, class FName BoneName, bool* bVelChange);
	void AddAngularImpulseInDegrees(const struct FVector& Impulse, class FName BoneName, bool* bVelChange);
};

// 0x0 (0x698 - 0x698)
// Class Engine.FXSystemComponent
class UFXSystemComponent : public UPrimitiveComponent
{
public:

	static class UClass* StaticClass();
	static class UFXSystemComponent* GetDefaultObj();

	struct FVector SetVectorParameter(class FName* ParameterName);
	bool SetUseAutoManageAttachment();
	int32 SetIntParameter(class FName* ParameterName);
	float SetFloatParameter(class FName* ParameterName);
	bool SetEmitterEnable(class FName EmitterName);
	struct FLinearColor SetColorParameter(class FName* ParameterName);
	bool SetBoolParameter(class FName* ParameterName);
	void SetAutoAttachmentParameters(class USceneComponent* Parent, class FName* SocketName, enum class EAttachmentRule* LocationRule, enum class EAttachmentRule* RotationRule, enum class EAttachmentRule ScaleRule);
	class AActor* SetActorParameter(class FName* ParameterName);
	void ReleaseToPool();
	class UFXSystemAsset* GetFXSystemAsset();
};

// 0x8 (0x30 - 0x28)
// Class Engine.BlueprintAsyncActionBase
class UBlueprintAsyncActionBase : public UObject
{
public:
	uint8                                        Pad_3C2[0x8];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UBlueprintAsyncActionBase* GetDefaultObj();

	void Activate();
};

// 0x48 (0x70 - 0x28)
// Class Engine.FXSystemAsset
class UFXSystemAsset : public UObject
{
public:
	uint32                                       MaxPoolSize;                                       // 0x28(0x4)(ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint32                                       PoolPrimeSize;                                     // 0x2C(0x4)(Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_40F[0x40];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UFXSystemAsset* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class Engine.AnimNotifyState
class UAnimNotifyState : public UObject
{
public:
	uint8                                        Pad_435[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	bool                                         bIgnoreOnDediServer;                               // 0x29(0x1)(Edit, BlueprintReadOnly, Net, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bCanClobberEventReference;                         // 0x2A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_436[0x5];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimNotifyState* GetDefaultObj();

	bool Received_NotifyTick(class UAnimSequenceBase* Animation);
	bool Received_NotifyEnd(class UAnimSequenceBase* Animation);
	bool Received_NotifyBegin(class UAnimSequenceBase* Animation);
	class FString GetNotifyName();
	float GetDefaultTriggerWeightThreshold();
};

// 0x18 (0x40 - 0x28)
// Class Engine.AnimNotify
class UAnimNotify : public UObject
{
public:
	uint8                                        Pad_441[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bIgnoreOnDediServer;                               // 0x38(0x1)(Edit, BlueprintReadOnly, Net, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bCanClobberEventReference;                         // 0x39(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_442[0x6];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimNotify* GetDefaultObj();

	bool Received_Notify(class UAnimSequenceBase* Animation);
	class FString GetNotifyName();
	float GetDefaultTriggerWeightThreshold();
};

// 0x0 (0x4C8 - 0x4C8)
// Class Engine.TrueSkyActorParent
class ATrueSkyActorParent : public AActor
{
public:

	static class UClass* StaticClass();
	static class ATrueSkyActorParent* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class Engine.Subsystem
class USubsystem : public UObject
{
public:
	uint8                                        Pad_449[0x8];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class USubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.DynamicSubsystem
class UDynamicSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass();
	static class UDynamicSubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.EngineSubsystem
class UEngineSubsystem : public UDynamicSubsystem
{
public:

	static class UClass* StaticClass();
	static class UEngineSubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.OnlineBlueprintCallProxyBase
class UOnlineBlueprintCallProxyBase : public UBlueprintAsyncActionBase
{
public:

	static class UClass* StaticClass();
	static class UOnlineBlueprintCallProxyBase* GetDefaultObj();

};

// 0x28 (0x50 - 0x28)
// Class Engine.Player
class UPlayer : public UObject
{
public:
	uint8                                        Pad_44D[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	class APlayerController*                     PlayerController;                                  // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, GlobalConfig)
	int32                                        CurrentNetSpeed;                                   // 0x38(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        ConfiguredInternetSpeed;                           // 0x3C(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	int32                                        ConfiguredLanSpeed;                                // 0x40(0x4)(ConstParm, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	uint8                                        Pad_453[0xC];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UPlayer* GetDefaultObj();

};

// 0x1D98 (0x1DE8 - 0x50)
// Class Engine.NetConnection
class UNetConnection : public UPlayer
{
public:
	TArray<class UChildConnection*>              Children;                                          // 0x50(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance)
	class UNetDriver*                            Driver;                                            // 0x60(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                PackageMapClass;                                   // 0x68(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UPackageMap*                           PackageMap;                                        // 0x70(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, Transient, Config, GlobalConfig)
	TArray<class UChannel*>                      OpenChannels;                                      // 0x78(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class AActor*>                        SentTemporaries;                                   // 0x88(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class AActor*                                ViewTarget;                                        // 0x98(0x8)(Edit, ConstParm, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	class AActor*                                OwningActor;                                       // 0xA0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxPacket;                                         // 0xA8(0x4)(Edit, BlueprintReadOnly, Net, Parm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        InternalAck : 1;                                   // Mask: 0x1, PropSize: 0x10xAC(0x1)(ConstParm, ExportObject, Net, Parm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_34 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_457[0xBB];                                     // Fixing Size After Last Property  > TateDumper <
	struct FUniqueNetIdRepl                      PlayerID;                                          // 0x168(0x30)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_45A[0x48];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LastReceiveTime;                                   // 0x1E0(0x8)(Edit, Net, Parm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_45B[0x11E0];                                   // Fixing Size After Last Property  > TateDumper <
	int32                                        DefaultMaxChannelSize;                             // 0x13C8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_45C[0x304];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<class UChannel*>                      ChannelsToTick;                                    // 0x16D0(0x10)(Edit, BlueprintVisible, ExportObject, Parm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_45D[0x700];                                    // Fixing Size After Last Property  > TateDumper <
	uint8                                        bHasArkLoginLock : 1;                              // Mask: 0x1, PropSize: 0x10x1DE0(0x1)(BlueprintVisible, Parm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_45E[0x7];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UNetConnection* GetDefaultObj();

};

// 0x768 (0x790 - 0x28)
// Class Engine.NetDriver
class UNetDriver : public UObject
{
public:
	uint8                                        Pad_464[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	class FString                                NetConnectionClassName;                            // 0x30(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	class FString                                ReplicationDriverClassName;                        // 0x40(0x10)(Edit, BlueprintVisible, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                ReplicationBridgeClassName;                        // 0x50(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxDownloadSize;                                   // 0x60(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bClampListenServerTickRate : 1;                    // Mask: 0x1, PropSize: 0x10x64(0x1)(Net, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_35 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_465[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        NetServerMaxTickRate;                              // 0x68(0x4)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	int32                                        MaxNetTickRate;                                    // 0x6C(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	int32                                        MaxInternetClientRate;                             // 0x70(0x4)(ConstParm, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	int32                                        MaxClientRate;                                     // 0x74(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	float                                        ServerTravelPause;                                 // 0x78(0x4)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	float                                        SpawnPrioritySeconds;                              // 0x7C(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	float                                        RelevantTimeout;                                   // 0x80(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	float                                        KeepAliveTime;                                     // 0x84(0x4)(ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	float                                        InitialConnectTimeout;                             // 0x88(0x4)(Edit, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	float                                        ConnectionTimeout;                                 // 0x8C(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	float                                        TimeoutMultiplierForUnoptimizedBuilds;             // 0x90(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	uint8                                        Pad_466[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	class UNetConnection*                        ServerConnection;                                  // 0x98(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class UNetConnection*>                ClientConnections;                                 // 0xA0(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_467[0x60];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        RecentlyDisconnectedTrackingTime;                  // 0x110(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	uint8                                        Pad_468[0x3C];                                     // Fixing Size After Last Property  > TateDumper <
	class UWorld*                                World;                                             // 0x150(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	class UPackage*                              WorldPackage;                                      // 0x158(0x8)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_469[0x20];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                NetConnectionClass;                                // 0x180(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                ReplicationDriverClass;                            // 0x188(0x8)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                ReplicationBridgeClass;                            // 0x190(0x8)(BlueprintVisible, Net, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_46A[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  NetDriverName;                                     // 0x1A8(0x8)(ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<struct FChannelDefinition>            ChannelDefinitions;                                // 0x1B0(0x10)(BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	TMap<class FName, struct FChannelDefinition> ChannelDefinitionMap;                              // 0x1C0(0x50)(BlueprintVisible, ExportObject, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class UChannel*>                      ActorChannelPool;                                  // 0x210(0x10)(Edit, ConstParm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_46B[0x21];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        BitPad_36 : 6;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bNoTimeouts : 1;                                   // Mask: 0x40, PropSize: 0x10x241(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bNeverApplyNetworkEmulationSettings : 1;           // Mask: 0x80, PropSize: 0x10x241(0x1)(Edit, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_46C[0x4DE];                                    // Fixing Size After Last Property  > TateDumper <
	class UReplicationDriver*                    ReplicationDriver;                                 // 0x720(0x8)(OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst)
	uint8                                        Pad_46D[0x68];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UNetDriver* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.OnlineEngineInterface
class UOnlineEngineInterface : public UObject
{
public:

	static class UClass* StaticClass();
	static class UOnlineEngineInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.OnlineSession
class UOnlineSession : public UObject
{
public:

	static class UClass* StaticClass();
	static class UOnlineSession* GetDefaultObj();

};

// 0x40 (0x6D8 - 0x698)
// Class Engine.MeshComponent
class UMeshComponent : public UPrimitiveComponent
{
public:
	TArray<class UMaterialInterface*>            OverrideMaterials;                                 // 0x698(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class UMaterialInterface*                    OverlayMaterial;                                   // 0x6A8(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	float                                        OverlayMaterialMaxDrawDistance;                    // 0x6B0(0x4)(Edit, ConstParm, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_499[0x14];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        bEnableMaterialParameterCaching : 1;               // Mask: 0x1, PropSize: 0x10x6C8(0x1)(ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3F : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_49B[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	class UClass*                                DamageFXActorToSpawn;                              // 0x6D0(0x8)(Edit, ConstParm, BlueprintVisible, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)

	static class UClass* StaticClass();
	static class UMeshComponent* GetDefaultObj();

	struct FVector SetVectorParameterValueOnMaterials(class FName* ParameterName);
	float SetScalarParameterValueOnMaterials(class FName* ParameterName);
	float SetOverlayMaterialMaxDrawDistance();
	class UMaterialInterface* SetOverlayMaterial();
	int32 PrestreamTextures(float* Seconds);
	int32 MulticastShowInstance();
	bool MulticastHideInstance();
	bool IsMaterialSlotNameValid(class FName* MaterialSlotName);
	class UMaterialInterface* GetOverlayMaterial();
	TArray<class FName> GetMaterialSlotNames();
	TArray<class UMaterialInterface*> GetMaterials();
	int32 GetMaterialIndex(class FName* MaterialSlotName);
};

// 0x88 (0xB0 - 0x28)
// Class Engine.MaterialExpression
class UMaterialExpression : public UObject
{
public:
	int32                                        MaterialExpressionEditorX;                         // 0x28(0x4)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaterialExpressionEditorY;                         // 0x2C(0x4)(Edit, ConstParm, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UEdGraphNode*                          GraphNode;                                         // 0x30(0x8)(Edit, BlueprintVisible, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UMaterialExpression*                   SubgraphExpression;                                // 0x38(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_49F[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	struct FGuid                                 MaterialExpressionGuid;                            // 0x50(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UMaterial*                             Material;                                          // 0x60(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance)
	class UMaterialFunction*                     Function;                                          // 0x68(0x8)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor)
	class FString                                Desc;                                              // 0x70(0x10)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4A0[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bRealtimePreview : 1;                              // Mask: 0x1, PropSize: 0x10x84(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bNeedToUpdatePreview : 1;                          // Mask: 0x2, PropSize: 0x10x84(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_40 : 6;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_4A1[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bIsParameterExpression : 1;                        // Mask: 0x1, PropSize: 0x10x88(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_41 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_4A2[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bCommentBubbleVisible : 1;                         // Mask: 0x1, PropSize: 0x10x8C(0x1)(Edit, ConstParm, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bShowOutputNameOnPin : 1;                          // Mask: 0x2, PropSize: 0x10x8C(0x1)(ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bShowMaskColorsOnPin : 1;                          // Mask: 0x4, PropSize: 0x10x8C(0x1)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bHidePreviewWindow : 1;                            // Mask: 0x8, PropSize: 0x10x8C(0x1)(Edit, ConstParm, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bCollapsed : 1;                                    // Mask: 0x10, PropSize: 0x10x8C(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bShaderInputData : 1;                              // Mask: 0x20, PropSize: 0x10x8C(0x1)(BlueprintVisible, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bShowInputs : 1;                                   // Mask: 0x40, PropSize: 0x10x8C(0x1)(Edit, BlueprintVisible, ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bShowOutputs : 1;                                  // Mask: 0x80, PropSize: 0x10x8C(0x1)(ConstParm, BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_4A4[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<class FText>                          MenuCategories;                                    // 0x90(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FExpressionOutput>             Outputs;                                           // 0xA0(0x10)(Edit, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)

	static class UClass* StaticClass();
	static class UMaterialExpression* GetDefaultObj();

};

// 0x48 (0x70 - 0x28)
// Class Engine.Channel
class UChannel : public UObject
{
public:
	class UNetConnection*                        Connection;                                        // 0x28(0x8)(EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4A5[0x40];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UChannel* GetDefaultObj();

};

// 0x18 (0x88 - 0x70)
// Class Engine.ControlChannel
class UControlChannel : public UChannel
{
public:
	uint8                                        Pad_4A7[0x18];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UControlChannel* GetDefaultObj();

};

// 0x198 (0x1C0 - 0x28)
// Class Engine.GameInstance
class UGameInstance : public UObject
{
public:
	uint8                                        Pad_4A9[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class ULocalPlayer*>                  LocalPlayers;                                      // 0x38(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	class UOnlineSession*                        OnlineSession;                                     // 0x48(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst)
	TArray<class UObject*>                       ReferencedObjects;                                 // 0x50(0x10)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_4AB[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnPawnControllerChangedDelegates;                  // 0x78(0x10)(Edit, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_4AC[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnInputDeviceConnectionChange;                     // 0xA0(0x10)(Edit, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnUserInputDevicePairingChange;                    // 0xB0(0x10)(Edit, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_4AD[0x100];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UGameInstance* GetDefaultObj();

	void ReceiveShutdown();
	void ReceiveInit();
	void HandleTravelError(enum class ETravelFailure FailureType);
	void HandleNetworkError(enum class ENetworkFailure FailureType, bool bIsServer);
	int32 DebugRemovePlayer();
	int32 DebugCreatePlayer();
};

// 0x0 (0x30 - 0x30)
// Class Engine.GameInstanceSubsystem
class UGameInstanceSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass();
	static class UGameInstanceSubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.WorldSubsystem
class UWorldSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass();
	static class UWorldSubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.RecentPlayersWorldSubsystemBase
class URecentPlayersWorldSubsystemBase : public UWorldSubsystem
{
public:

	static class UClass* StaticClass();
	static class URecentPlayersWorldSubsystemBase* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.AssetImportData
class UAssetImportData : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAssetImportData* GetDefaultObj();

};

// 0x368 (0xA40 - 0x6D8)
// Class Engine.SkinnedMeshComponent
class USkinnedMeshComponent : public UMeshComponent
{
public:
	uint8                                        Pad_4EC[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	class USkeletalMesh*                         SkeletalMesh;                                      // 0x6E0(0x8)(Edit, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, GlobalConfig)
	class USkinnedAsset*                         SkinnedAsset;                                      // 0x6E8(0x8)(BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, GlobalConfig)
	TWeakObjectPtr<class USkinnedMeshComponent>  LeaderPoseComponent;                               // 0x6F0(0x8)(Edit, ConstParm, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<enum class ESkinCacheUsage>           SkinCacheUsage;                                    // 0x6F8(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bSetMeshDeformer;                                  // 0x708(0x1)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_4ED[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	class UMeshDeformer*                         MeshDeformer;                                      // 0x710(0x8)(BlueprintVisible, ReturnParm, DisableEditOnTemplate, Transient, EditConst)
	class UMeshDeformerInstanceSettings*         MeshDeformerInstanceSettings;                      // 0x718(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst)
	class UMeshDeformerInstance*                 MeshDeformerInstance;                              // 0x720(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst)
	uint8                                        Pad_4EE[0x178];                                    // Fixing Size After Last Property  > TateDumper <
	class UPhysicsAsset*                         PhysicsAssetOverride;                              // 0x8A0(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, EditConst, InstancedReference, SubobjectReference)
	int32                                        ForcedLodModel;                                    // 0x8A8(0x4)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, EditConst, InstancedReference, SubobjectReference)
	int32                                        MinLodModel;                                       // 0x8AC(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_4EF[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        StreamingDistanceMultiplier;                       // 0x8B8(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, GlobalConfig)
	uint8                                        Pad_4F0[0xC];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<struct FSkelMeshComponentLODInfo>     LODInfo;                                           // 0x8C8(0x10)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_4F1[0x24];                                     // Fixing Size After Last Property  > TateDumper <
	enum class EVisibilityBasedAnimTickOption    VisibilityBasedAnimTickOption;                     // 0x8FC(0x1)(Edit, ConstParm, EditFixedSize, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_4F2[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        BitPad_46 : 3;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bOverrideMinLod : 1;                               // Mask: 0x8, PropSize: 0x10x8FE(0x1)(BlueprintReadOnly, EditFixedSize, Parm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUseBoundsFromLeaderPoseComponent : 1;             // Mask: 0x10, PropSize: 0x10x8FE(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bForceWireframe : 1;                               // Mask: 0x20, PropSize: 0x10x8FE(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDisableMorphTarget : 1;                           // Mask: 0x40, PropSize: 0x10x8FE(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bHideSkin : 1;                                     // Mask: 0x80, PropSize: 0x10x8FE(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bPerBoneMotionBlur : 1;                            // Mask: 0x1, PropSize: 0x10x8FF(0x1)(BlueprintVisible, ExportObject, Net, Parm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bComponentUseFixedSkelBounds : 1;                  // Mask: 0x2, PropSize: 0x10x8FF(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bConsiderAllBodiesForBounds : 1;                   // Mask: 0x4, PropSize: 0x10x8FF(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bSyncAttachParentLOD : 1;                          // Mask: 0x8, PropSize: 0x10x8FF(0x1)(Edit, ConstParm, Parm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bCanHighlightSelectedSections : 1;                 // Mask: 0x10, PropSize: 0x10x8FF(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bRecentlyRendered : 1;                             // Mask: 0x20, PropSize: 0x10x8FF(0x1)(Edit, ExportObject, Net, EditFixedSize, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bCastCapsuleDirectShadow : 1;                      // Mask: 0x40, PropSize: 0x10x8FF(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bCastCapsuleIndirectShadow : 1;                    // Mask: 0x80, PropSize: 0x10x8FF(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bCPUSkinning : 1;                                  // Mask: 0x1, PropSize: 0x10x900(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bEnableUpdateRateOptimizations : 1;                // Mask: 0x2, PropSize: 0x10x900(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDisplayDebugUpdateRateOptimizations : 1;          // Mask: 0x4, PropSize: 0x10x900(0x1)(BlueprintVisible, Net, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bRenderStatic : 1;                                 // Mask: 0x8, PropSize: 0x10x900(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bIgnoreLeaderPoseComponentLOD : 1;                 // Mask: 0x10, PropSize: 0x10x900(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        BitPad_47 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bCachedLocalBoundsUpToDate : 1;                    // Mask: 0x80, PropSize: 0x10x900(0x1)(ConstParm, BlueprintVisible, ExportObject, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bCachedWorldSpaceBoundsUpToDate : 1;               // Mask: 0x1, PropSize: 0x10x901(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_48 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bForceMeshObjectUpdate : 1;                        // Mask: 0x4, PropSize: 0x10x901(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bForceUpdateDynamicDataImmediately : 1;            // Mask: 0x8, PropSize: 0x10x901(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_49 : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        BitPad_4A : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bFollowerShouldTickPose : 1;                       // Mask: 0x2, PropSize: 0x10x902(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_4B : 6;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_4F3[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        CapsuleIndirectShadowMinVisibility;                // 0x904(0x4)(EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_4F4[0x38];                                     // Fixing Size After Last Property  > TateDumper <
	struct FBoxSphereBounds                      CachedWorldOrLocalSpaceBounds;                     // 0x940(0x38)(BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_4F5[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FMatrix                               CachedWorldToLocalTransform;                       // 0x980(0x80)(Edit, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_4F6[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        bForceUpdateKinematic : 1;                         // Mask: 0x1, PropSize: 0x10xA18(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bChartDistanceFactor : 1;                          // Mask: 0x2, PropSize: 0x10xA18(0x1)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bFreeSpaceBasesOnUnregister : 1;                   // Mask: 0x4, PropSize: 0x10xA18(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bForceTickPoseWithinRange : 1;                     // Mask: 0x8, PropSize: 0x10xA18(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bAlwaysUpdateMeshForShadowRendering : 1;           // Mask: 0x10, PropSize: 0x10xA18(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bAddAttachedParentBounds : 1;                      // Mask: 0x20, PropSize: 0x10xA18(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bBasedPawnsTriggerChildTick : 1;                   // Mask: 0x40, PropSize: 0x10xA18(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_4C : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_4F7[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        ForceTickPoseWithinRangeSquared;                   // 0xA1C(0x4)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class USkinnedMeshComponent*                 OverrideTickingVisiblityMesh;                      // 0xA20(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	float                                        ShadowedRecentlyRenderedBoundsScaleMultiplier;     // 0xA28(0x4)(ConstParm, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_4F8[0x14];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class USkinnedMeshComponent* GetDefaultObj();

	void UnsetMeshDeformer();
	class FName UnloadSkinWeightProfile();
	void UnHideBoneByName(class FName BoneName);
	struct FRotator TransformToBoneSpace(class FName BoneName, struct FRotator* InRotation);
	struct FRotator TransformFromBoneSpace(class FName BoneName, struct FRotator* InRotation);
	int32 ShowMaterialSection(int32 MaterialID, bool bShow);
	int32 ShowAllMaterialSections();
	int32 SetVertexOffsetUsage(int32* Usage);
	int32 SetVertexColorOverride_LinearColor(const TArray<struct FLinearColor>& VertexColors);
	bool SetSkinWeightProfile();
	TArray<struct FSkelMeshSkinWeightInfo> SetSkinWeightOverride();
	bool SetSkinnedAssetAndUpdate(class USkinnedAsset** NewMesh);
	void SetRenderStatic(bool bNewValue);
	TArray<struct FVector> SetPreSkinningOffsets();
	TArray<struct FVector> SetPostSkinningOffsets();
	bool SetPhysicsAsset();
	int32 SetMinLOD();
	void SetMeshDeformer(class UMeshDeformer* InMeshDeformer);
	bool SetLeaderPoseComponent(class USkinnedMeshComponent** NewLeaderBoneComponent);
	int32 SetForcedLOD();
	void SetCastCapsuleIndirectShadow(bool bNewValue);
	void SetCastCapsuleDirectShadow(bool bNewValue);
	void SetCapsuleIndirectShadowMinVisibility(float NewValue);
	bool IsUsingSkinWeightProfile();
	bool IsMaterialSectionShown(int32 MaterialID);
	bool IsBoneHiddenByName(class FName BoneName);
	enum class EPhysBodyOp HideBoneByName(class FName BoneName);
	int32 GetVertexOffsetUsage();
	bool GetTwistAndSwingAngleOfDeltaRotationFromRefPose(class FName BoneName);
	class FName GetSocketBoneName();
	class USkinnedAsset* GetSkinnedAsset();
	class USkeletalMesh* GetSkeletalMesh_DEPRECATED();
	struct FTransform GetRefPoseTransform();
	struct FVector GetRefPosePosition();
	int32 GetPredictedLODLevel();
	class FName GetParentBone(class FName BoneName);
	int32 GetNumLODs();
	int32 GetNumBones();
	class UMeshDeformerInstance* GetMeshDeformerInstance();
	int32 GetForcedLOD();
	struct FTransform GetDeltaTransformFromRefPose(class FName BoneName);
	class FName GetCurrentSkinWeightProfileName();
	class FName GetBoneName();
	int32 GetBoneIndex(class FName BoneName);
	class FName FindClosestBone_K2();
	int32 ClearVertexColorOverride();
	void ClearSkinWeightProfile();
	int32 ClearSkinWeightOverride();
	bool BoneIsChildOf(class FName BoneName);
};

// 0x9C8 (0x1408 - 0xA40)
// Class Engine.SkeletalMeshComponent
class USkeletalMeshComponent : public USkinnedMeshComponent
{
public:
	uint8                                        Pad_592[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	class USkeletalMesh*                         SkeletalMeshAsset;                                 // 0xA48(0x8)(Edit, ConstParm, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                AnimBlueprintGeneratedClass;                       // 0xA50(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, GlobalConfig)
	class UClass*                                AnimClass;                                         // 0xA58(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class UAnimInstance*                         AnimScriptInstance;                                // 0xA60(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class UAnimInstance*                         PostProcessAnimInstance;                           // 0xA68(0x8)(ConstParm, BlueprintVisible, Net, Parm, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	struct FSingleAnimationPlayData              AnimationData;                                     // 0xA70(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig)
	uint8                                        Pad_593[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RootBoneTranslation;                               // 0xA98(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               LineCheckBoundsScale;                              // 0xAB0(0x18)(BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_594[0x30];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class UAnimInstance*>                 LinkedInstances;                                   // 0xAF8(0x10)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FTransform>                    CachedBoneSpaceTransforms;                         // 0xB08(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FTransform>                    CachedComponentSpaceTransforms;                    // 0xB18(0x10)(Edit, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_595[0xB0];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GlobalAnimRateScale;                               // 0xBD8(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bAllowKinematicUpdateStaggering : 1;               // Mask: 0x1, PropSize: 0x10xBDC(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_50 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_596[0xB];                                      // Fixing Size After Last Property  > TateDumper <
	enum class EKinematicBonesUpdateToPhysics    KinematicBonesUpdateType;                          // 0xBE8(0x1)(EditFixedSize, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	enum class EPhysicsTransformUpdateMode       PhysicsTransformUpdateMode;                        // 0xBE9(0x1)(ConstParm, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_597[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	enum class ECollisionEnabled                 PreSleepingKinematicsCollisionType;                // 0xBEB(0x1)(Net, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	enum class EAnimationMode                    AnimationMode;                                     // 0xBEC(0x1)(ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_598[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bDisablePostProcessBlueprint : 1;                  // Mask: 0x1, PropSize: 0x10xBEE(0x1)(Edit, ExportObject, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_51 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bUpdateOverlapsOnAnimationFinalize : 1;            // Mask: 0x4, PropSize: 0x10xBEE(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_52 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bHasValidBodies : 1;                               // Mask: 0x10, PropSize: 0x10xBEE(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bBlendPhysics : 1;                                 // Mask: 0x20, PropSize: 0x10xBEE(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bEnablePhysicsOnDedicatedServer : 1;               // Mask: 0x40, PropSize: 0x10xBEE(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUpdateMeshWhenKinematic : 1;                      // Mask: 0x80, PropSize: 0x10xBEE(0x1)(ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUpdateJointsFromAnimation : 1;                    // Mask: 0x1, PropSize: 0x10xBEF(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bAllowClothActors : 1;                             // Mask: 0x2, PropSize: 0x10xBEF(0x1)(BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDisableClothSimulation : 1;                       // Mask: 0x4, PropSize: 0x10xBEF(0x1)(Edit, ConstParm, Net, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_53 : 5;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_599[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bDisableRigidBodyAnimNode : 1;                     // Mask: 0x1, PropSize: 0x10xBF4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bAllowAnimCurveEvaluation : 1;                     // Mask: 0x2, PropSize: 0x10xBF4(0x1)(Edit, ConstParm, BlueprintVisible, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_54 : 3;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bCollideWithEnvironment : 1;                       // Mask: 0x20, PropSize: 0x10xBF4(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bCollideWithAttachedChildren : 1;                  // Mask: 0x40, PropSize: 0x10xBF4(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bForceCollisionUpdate : 1;                         // Mask: 0x80, PropSize: 0x10xBF4(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bLocalSpaceSimulation : 1;                         // Mask: 0x1, PropSize: 0x10xBF5(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bResetAfterTeleport : 1;                           // Mask: 0x2, PropSize: 0x10xBF5(0x1)(ExportObject, EditFixedSize, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_55 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bDeferKinematicBoneUpdate : 1;                     // Mask: 0x8, PropSize: 0x10xBF5(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bNoSkeletonUpdate : 1;                             // Mask: 0x10, PropSize: 0x10xBF5(0x1)(BlueprintReadOnly, Net, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bPauseAnims : 1;                                   // Mask: 0x20, PropSize: 0x10xBF5(0x1)(Edit, ExportObject, Net, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUseRefPoseOnInitAnim : 1;                         // Mask: 0x40, PropSize: 0x10xBF5(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bEnablePerPolyCollision : 1;                       // Mask: 0x80, PropSize: 0x10xBF5(0x1)(BlueprintReadOnly, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bForceRefpose : 1;                                 // Mask: 0x1, PropSize: 0x10xBF6(0x1)(ExportObject, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bOnlyAllowAutonomousTickPose : 1;                  // Mask: 0x2, PropSize: 0x10xBF6(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bIsAutonomousTickPose : 1;                         // Mask: 0x4, PropSize: 0x10xBF6(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bOldForceRefPose : 1;                              // Mask: 0x8, PropSize: 0x10xBF6(0x1)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bShowPrePhysBones : 1;                             // Mask: 0x10, PropSize: 0x10xBF6(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bRequiredBonesUpToDate : 1;                        // Mask: 0x20, PropSize: 0x10xBF6(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bAnimTreeInitialised : 1;                          // Mask: 0x40, PropSize: 0x10xBF6(0x1)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bIncludeComponentLocationIntoBounds : 1;           // Mask: 0x80, PropSize: 0x10xBF6(0x1)(BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bEnableLineCheckWithBounds : 1;                    // Mask: 0x1, PropSize: 0x10xBF7(0x1)(ConstParm, Net, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bPropagateCurvesToFollowers : 1;                   // Mask: 0x2, PropSize: 0x10xBF7(0x1)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bSkipKinematicUpdateWhenInterpolating : 1;         // Mask: 0x4, PropSize: 0x10xBF7(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bSkipBoundsUpdateWhenInterpolating : 1;            // Mask: 0x8, PropSize: 0x10xBF7(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bPreventDediServerAutoUnregistration : 1;          // Mask: 0x10, PropSize: 0x10xBF7(0x1)(Edit, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_56 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bNeedsQueuedAnimEventsDispatched : 1;              // Mask: 0x80, PropSize: 0x10xBF7(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_59A[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	uint16                                       CachedAnimCurveUidVersion;                         // 0xBFA(0x2)(ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        ClothBlendWeight;                                  // 0xBFC(0x4)(Edit, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bWaitForParallelClothTask;                         // 0xC00(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_59B[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<class FName>                          DisallowedAnimCurves;                              // 0xC08(0x10)(ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UBodySetup*                            BodySetup;                                         // 0xC18(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, GlobalConfig)
	uint8                                        Pad_59C[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        ClothMaxDistanceScale;                             // 0xC24(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnConstraintBroken;                                // 0xC28(0x10)(ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnPlasticDeformation;                              // 0xC38(0x10)(Edit, ConstParm, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                ClothingSimulationFactory;                         // 0xC48(0x8)(Edit, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
	uint8                                        Pad_59D[0xF8];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TeleportDistanceThreshold;                         // 0xD48(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        TeleportRotationThreshold;                         // 0xD4C(0x4)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_59E[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	uint32                                       LastPoseTickFrame;                                 // 0xD58(0x4)(Edit, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_59F[0x94];                                     // Fixing Size After Last Property  > TateDumper <
	class UClothingSimulationInteractor*         ClothingInteractor;                                // 0xDF0(0x8)(Edit, ConstParm, BlueprintVisible, Net, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
	uint8                                        Pad_5A0[0xC8];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnAnimInitialized;                                 // 0xEC0(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5A1[0x1B0];                                    // Fixing Size After Last Property  > TateDumper <
	double                                       PreventSoundCuesTime;                              // 0x1080(0x8)(BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5A2[0x14C];                                    // Fixing Size After Last Property  > TateDumper <
	float                                        DinoIKAnimationLegZOffsetingMultiplier;            // 0x11D4(0x4)(ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        DinoIKDelayedTraceFreezeDurationMultiplier;        // 0x11D8(0x4)(ConstParm, Net, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        DinoIKSlopeMatchingRootHeightOffset;               // 0x11DC(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        DistanceFromGroundToStartIK;                       // 0x11E0(0x4)(Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        DistanceFromGroundToStartIKBias;                   // 0x11E4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        FeetAlignmentLimit;                                // 0x11E8(0x4)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        ForceUpdateValuesTimeLimit;                        // 0x11EC(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        IkFabrikInterpSpeed;                               // 0x11F0(0x4)(BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        IkFeetAlignmentInterpSpeed;                        // 0x11F4(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        IkGroundPlaneInterpSpeed;                          // 0x11F8(0x4)(Edit, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        IkInterpSpeed;                                     // 0x11FC(0x4)(Edit, ExportObject, Net, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        IkInterpSpeedUp;                                   // 0x1200(0x4)(Net, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5A5[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               IkRootLocationOffset;                              // 0x1208(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	struct FRotator                              IkRootRotationOffset;                              // 0x1220(0x18)(ConstParm, ExportObject, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        IkRootOffsetInterpSpeed;                           // 0x1238(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        IkRootOffsetInterpSpeedUp;                         // 0x123C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        IkRootWorldOffsetInterpSpeed;                      // 0x1240(0x4)(Net, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        IkRootWorldOffsetInterpSpeedUp;                    // 0x1244(0x4)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        LegLimitRatioFromCylinderHeight;                   // 0x1248(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        MatchSlopeRotationSpeed;                           // 0x124C(0x4)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        RootPitchRotationLimit;                            // 0x1250(0x4)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        RootRollRotationLimit;                             // 0x1254(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        MaxIterations;                                     // 0x1258(0x4)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5A7[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               TwoLegVirtualHitLocationWS;                        // 0x1260(0x18)(BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               TwoLegVirtualHitLocationWSTarget;                  // 0x1278(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               TwoLegVirtualHitLocationCS;                        // 0x1290(0x18)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        RootOffset;                                        // 0x12A8(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_5A8[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              RootRotationOffset;                                // 0x12B0(0x18)(Edit, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bForceTickDisabled : 1;                            // Mask: 0x1, PropSize: 0x10x12C8(0x1)(Edit, ConstParm, Net, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bFreezeGroundPlaneIK : 1;                          // Mask: 0x2, PropSize: 0x10x12C8(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bSuppressAnimNotifies : 1;                         // Mask: 0x4, PropSize: 0x10x12C8(0x1)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        UseWorldSpaceFeetAlignment : 1;                    // Mask: 0x8, PropSize: 0x10x12C8(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bRotateFeetToAlignWithGround : 1;                  // Mask: 0x10, PropSize: 0x10x12C8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bEnableMultiFabrik : 1;                            // Mask: 0x20, PropSize: 0x10x12C8(0x1)(Edit, BlueprintVisible, Net, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKUseExperimentalInvalidTraceZeroing : 1;     // Mask: 0x40, PropSize: 0x10x12C8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bAlignRootOnlyToGround : 1;                        // Mask: 0x80, PropSize: 0x10x12C8(0x1)(Edit, ConstParm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKAnimationLegZOffseting : 1;                 // Mask: 0x1, PropSize: 0x10x12C9(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bIKRotationEnabled : 1;                            // Mask: 0x2, PropSize: 0x10x12C9(0x1)(Edit, ExportObject, Net, EditFixedSize, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bMovedLastFrame : 1;                               // Mask: 0x4, PropSize: 0x10x12C9(0x1)(Net, EditFixedSize, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKLerpFeet : 1;                               // Mask: 0x8, PropSize: 0x10x12C9(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKLerpLegs : 1;                               // Mask: 0x10, PropSize: 0x10x12C9(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKRootWorldSpaceLerpZ : 1;                    // Mask: 0x20, PropSize: 0x10x12C9(0x1)(EditFixedSize, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKSmoothGroundPlaneLerping : 1;               // Mask: 0x40, PropSize: 0x10x12C9(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKSlopeMatchingRootHeightOffsetMultiplier : 1; // Mask: 0x80, PropSize: 0x10x12C9(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKUseLegLimits : 1;                           // Mask: 0x1, PropSize: 0x10x12CA(0x1)(BlueprintVisible, ExportObject, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bEnableIkOnlyWhenIdle : 1;                         // Mask: 0x2, PropSize: 0x10x12CA(0x1)(Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bEnableSimpleIK : 1;                               // Mask: 0x4, PropSize: 0x10x12CA(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bForceSimpleIK : 1;                                // Mask: 0x8, PropSize: 0x10x12CA(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bSetAttachmentMasterPoseComponent : 1;             // Mask: 0x10, PropSize: 0x10x12CA(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bInterpolateRootPhys : 1;                          // Mask: 0x20, PropSize: 0x10x12CA(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_58 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_5AC[0x35];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                OriginalBonesOffsets;                              // 0x1300(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FIKLegInfo>                    IkLegs;                                            // 0x1310(0x10)(Edit, ConstParm, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FIKGroundPlaneOverrideInfo>    IkGroundPlaneOverrides;                            // 0x1320(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FIKRootAdjustmentInfo>         IkRootAdjustmentPoints;                            // 0x1330(0x10)(Edit, ConstParm, ExportObject, Net, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        MinHitNormalZForFeetAlignment;                     // 0x1340(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        ComponentMassScale;                                // 0x1344(0x4)(Edit, BlueprintReadOnly, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        GroundBoneInstantSyncTillTime;                     // 0x1348(0x4)(Edit, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        MinLinearDamping;                                  // 0x134C(0x4)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	float                                        MinAngularDamping;                                 // 0x1350(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	float                                        CachedFootZDiff;                                   // 0x1354(0x4)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bOnlyTickWhenRenderedDontDisableOnDedicatedServer : 1; // Mask: 0x1, PropSize: 0x10x1358(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bSkipUpdateTransformIfBlendedPhysics : 1;          // Mask: 0x2, PropSize: 0x10x1358(0x1)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        AnimationFrozen : 1;                               // Mask: 0x4, PropSize: 0x10x1358(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bInitOffset : 1;                                   // Mask: 0x8, PropSize: 0x10x1358(0x1)(ConstParm, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUpdatedKinematics : 1;                            // Mask: 0x10, PropSize: 0x10x1358(0x1)(Edit, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUpdatedKinematicsOnce : 1;                        // Mask: 0x20, PropSize: 0x10x1358(0x1)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bSetKinematicsSleeping : 1;                        // Mask: 0x40, PropSize: 0x10x1358(0x1)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bNeverTickOnDediServer : 1;                        // Mask: 0x80, PropSize: 0x10x1358(0x1)(Edit, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bAlwaysTeleportKinematic : 1;                      // Mask: 0x1, PropSize: 0x10x1359(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bForceDisablePhysicsOnDediServer : 1;              // Mask: 0x2, PropSize: 0x10x1359(0x1)(Edit, ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bForceDisablePhysicsOnDediServerAllowRagdoll : 1;  // Mask: 0x4, PropSize: 0x10x1359(0x1)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bSleepKinematicsWhenNotRefreshingBones : 1;        // Mask: 0x8, PropSize: 0x10x1359(0x1)(ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bPhysicsRequiredOnDediServer : 1;                  // Mask: 0x10, PropSize: 0x10x1359(0x1)(Edit, ExportObject, Net, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bAlwaysForceUpdateKinematicsOnDedicatedServer : 1; // Mask: 0x20, PropSize: 0x10x1359(0x1)(Edit, BlueprintReadOnly, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bRotateToMatchWalkingSlope : 1;                    // Mask: 0x40, PropSize: 0x10x1359(0x1)(Edit, ConstParm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bFootZDiffIsCached : 1;                            // Mask: 0x80, PropSize: 0x10x1359(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bShouldCacheFootZDiff : 1;                         // Mask: 0x1, PropSize: 0x10x135A(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bEnableIKTraceFreezing : 1;                        // Mask: 0x2, PropSize: 0x10x135A(0x1)(Edit, Net, EditFixedSize, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_59 : 6;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_5AE[0x5];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bModifyBoneAnimNodeUseCurrentBoneModifiers : 1;    // Mask: 0x1, PropSize: 0x10x1360(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_5A : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bHumanIKUseBoneModiferLegScalars : 1;              // Mask: 0x4, PropSize: 0x10x1360(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bApplyGroundBoneModifiers : 1;                     // Mask: 0x8, PropSize: 0x10x1360(0x1)(BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_5B : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_5AF[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bEnableIKCartGroundConforming : 1;                 // Mask: 0x1, PropSize: 0x10x1364(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_5C : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_5B0[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              RotOffset;                                         // 0x1368(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUseRotOffset : 1;                                 // Mask: 0x1, PropSize: 0x10x1380(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUseItemSlotAttachmentTranformOffsets : 1;         // Mask: 0x2, PropSize: 0x10x1380(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bInitializedArticulated : 1;                       // Mask: 0x4, PropSize: 0x10x1380(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_5D : 5;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_5B1[0xF];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        BoneModifiersLegLengthPercentage;                  // 0x1390(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5B2[0x24];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LastStartedRenderingTime;                          // 0x13B8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5B3[0x48];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class USkeletalMeshComponent* GetDefaultObj();

	class UClass* UnlinkAnimClassLayers();
	void UnbindClothFromLeaderPoseComponent(bool bRestoreSimulationSpace);
	void ToggleDisablePostProcessBlueprint();
	class FName TermBodiesBelow();
	void SuspendClothingSimulation();
	void Stop();
	void SnapshotPose(struct FPoseSnapshot* Snapshot);
	void SetUpdateClothInEditor(bool NewUpdateState);
	void SetUpdateAnimationInEditor(bool NewUpdateState);
	void SetupBetweenAnimationBlueprintBlending();
	void SetTeleportRotationThreshold(float Threshold);
	void SetTeleportDistanceThreshold(float Threshold);
	void SetSkeletalMeshAsset(class USkeletalMesh** NewMesh);
	void SetPosition(float InPos, bool bFireNotifies);
	void SetPlayRate(float Rate);
	float SetPhysicsBlendWeight();
	void SetNotifyRigidBodyCollisionBelow(bool* bNewNotifyRigidBodyCollision, class FName BoneName, bool* bIncludeSelf);
	class FName SetMorphTarget(float Value, bool bRemoveZeroWeight);
	void SetEnablePhysicsBlending(bool bNewBlendPhysics);
	void SetEnableGravityOnAllBodiesBelow(bool* bEnableGravity, class FName BoneName, bool* bIncludeSelf);
	void SetEnableBodyGravity(bool* bEnableGravity, class FName BoneName);
	void SetDisablePostProcessBlueprint(bool bInDisablePostProcess);
	void SetDisableAnimCurves(bool bInDisableAnimCurves);
	void SetConstraintProfileForAll(class FName* ProfileName, bool* bDefaultIfNotFound);
	class FName SetConstraintProfile(class FName* ProfileName, bool* bDefaultIfNotFound);
	void SetClothMaxDistanceScale(float Scale);
	void SetBodyNotifyRigidBodyCollision(bool* bNewNotifyRigidBodyCollision, class FName BoneName);
	void SetAnimClass(class UClass* NewClass);
	void SetAnimationMode(enum class EAnimationMode* InAnimationMode);
	void SetAnimation(class UAnimationAsset** NewAnimToPlay);
	void SetAngularLimits(class FName* InBoneName, float* Swing1LimitAngle, float* TwistLimitAngle, float* Swing2LimitAngle);
	void SetAllowRigidBodyAnimNode(bool* bInAllow, bool* bReinitAnim);
	bool SetAllowedAnimCurvesEvaluation(TArray<class FName>* List);
	void SetAllowClothActors(bool* bInAllow);
	void SetAllowAnimCurveEvaluation(bool* bInAllow);
	void SetAllMotorsAngularVelocityDrive(bool* bEnableSwingDrive, bool* bEnableTwistDrive, bool* bSkipCustomPhysicsType);
	void SetAllMotorsAngularPositionDrive(bool* bEnableSwingDrive, bool* bEnableTwistDrive, bool* bSkipCustomPhysicsType);
	float SetAllMotorsAngularDriveParams(float* InSpring, float* InForceLimit, bool* bSkipCustomPhysicsType);
	void SetAllBodiesSimulatePhysics(bool* bNewSimulate);
	float SetAllBodiesPhysicsBlendWeight(bool* bSkipCustomPhysicsType);
	void SetAllBodiesBelowSimulatePhysics(class FName* InBoneName, bool* bNewSimulate, bool* bIncludeSelf);
	bool SetAllBodiesBelowPhysicsDisabled(class FName* InBoneName, bool* bIncludeSelf);
	float SetAllBodiesBelowPhysicsBlendWeight(class FName* InBoneName, bool* bSkipCustomPhysicsType, bool* bIncludeSelf);
	void SetAllBodiesBelowLinearVelocity(class FName* InBoneName, struct FVector* LinearVelocity, bool* bIncludeSelf);
	void ResumeClothingSimulation();
	void ResetClothTeleportMode();
	enum class ETeleportType ResetAnimInstanceDynamics();
	void ResetAllowedAnimCurveEvaluation();
	void ResetAllBodiesSimulatePhysics();
	bool PlayAnimation(class UAnimationAsset** NewAnimToPlay);
	bool Play();
	bool OverrideAnimationData(class UAnimationAsset** InAnimToPlay, bool* bIsPlaying, float Position, float PlayRate);
	class UClass* LinkAnimGraphByTag();
	class UClass* LinkAnimClassLayers();
	bool K2_GetClosestPointOnPhysicsAsset(struct FVector* ClosestWorldPosition, class FName BoneName);
	bool IsPlayingMontage(class UAnimMontage* Montage);
	bool IsPlayingAnimationMontagesOnSlotName();
	bool IsPlaying();
	bool IsClothingSimulationSuspended();
	bool IsBodyGravityEnabled(class FName BoneName);
	void IncrementIKLegMute(int32* LegIndex);
	bool HasValidAnimationInstance();
	TArray<class APawn*> GetTrueBasedPawns();
	bool GetTransformAttribute_Ref(class FName BoneName, class FName* AttributeName, enum class ECustomBoneAttributeLookup* LookupType);
	bool GetTransformAttribute(class FName BoneName, class FName* AttributeName, enum class ECustomBoneAttributeLookup* LookupType);
	float GetTeleportRotationThreshold();
	float GetTeleportDistanceThreshold();
	bool GetStringAttribute_Ref(class FName BoneName, class FName* AttributeName, enum class ECustomBoneAttributeLookup* LookupType);
	bool GetStringAttribute(class FName BoneName, class FName* AttributeName, enum class ECustomBoneAttributeLookup* LookupType);
	class USkeletalMesh* GetSkeletalMeshAsset();
	struct FVector GetSkeletalCenterOfMass();
	class UAnimInstance* GetPostProcessInstance();
	float GetPosition();
	float GetPlayRate();
	float GetMorphTarget();
	class UAnimInstance* GetLinkedAnimLayerInstanceByGroup();
	class UAnimInstance* GetLinkedAnimLayerInstanceByClass();
	class FName GetLinkedAnimGraphInstancesByTag(const TArray<class UAnimInstance*>& OutLinkedInstances);
	class UAnimInstance* GetLinkedAnimGraphInstanceByTag();
	bool GetIntegerAttribute_Ref(class FName BoneName, class FName* AttributeName, enum class ECustomBoneAttributeLookup* LookupType);
	bool GetIntegerAttribute(class FName BoneName, class FName* AttributeName, enum class ECustomBoneAttributeLookup* LookupType);
	bool GetFloatAttribute_Ref(class FName BoneName, class FName* AttributeName, enum class ECustomBoneAttributeLookup* LookupType);
	bool GetFloatAttribute(class FName BoneName, class FName* AttributeName, enum class ECustomBoneAttributeLookup* LookupType);
	class FName GetFirstBoneWithChildren();
	bool GetDisablePostProcessBlueprint();
	bool GetDisableAnimCurves();
	float GetCurrentJointAngles(class FName* InBoneName, float* Swing1Angle, float* Swing2Angle);
	class FName GetConstraintsFromBody(bool* bParentConstraints, bool* bChildConstraints, bool* bIncludesTerminated, TArray<struct FConstraintInstanceAccessor>* OutConstraints);
	void GetConstraints(bool* bIncludesTerminated, TArray<struct FConstraintInstanceAccessor>* OutConstraints);
	struct FConstraintInstanceAccessor GetConstraintByName(class FName* ConstraintName, bool* bIncludesTerminated);
	float GetClothMaxDistanceScale();
	class UClothingSimulationInteractor* GetClothingSimulationInteractor();
	float GetBoneMass(class FName BoneName, bool* bScaleMass);
	struct FVector GetBoneLinearVelocity(class FName* InBoneName);
	class UAnimInstance* GetAnimInstance();
	class UClass* GetAnimClass();
	enum class EAnimationMode GetAnimationMode();
	bool GetAllowRigidBodyAnimNode();
	bool GetAllowedAnimCurveEvaluate();
	bool GetAllowClothActors();
	void ForceClothNextUpdateTeleportAndReset();
	void ForceClothNextUpdateTeleport();
	class FName FindConstraintBoneName(int32* ConstraintIndex);
	void EnableRagdoll(struct FVector* WithVelocity);
	void DecrementIKLegMute(int32* LegIndex);
	void ClearMorphTargets();
	struct FVector BreakConstraint(const struct FVector& Impulse, class FName* InBoneName);
	bool BPValidBoneToUnhide();
	void BPTickPose(float* DeltaTime);
	void BPSetBoneModifiers(TArray<struct FBoneModifierNamed>* NamedBoneModifiers);
	void BPRefreshBoneTransforms();
	void BindClothToLeaderPoseComponent();
	bool AllowAnimCurveEvaluation(class FName* NameOfCurve);
	void AddImpulseToAllBodiesBelow(const struct FVector& Impulse, class FName BoneName, bool* bVelChange, bool* bIncludeSelf);
	void AddForceToAllBodiesBelow(struct FVector* Force, class FName BoneName, bool* bAccelChange, bool* bIncludeSelf);
	void AccumulateAllBodiesBelowPhysicsBlendWeight(class FName* InBoneName, float* AddPhysicsBlendWeight, bool* bSkipCustomPhysicsType);
};

// 0x320 (0x348 - 0x28)
// Class Engine.AnimInstance
class UAnimInstance : public UObject
{
public:
	class USkeleton*                             CurrentSkeleton;                                   // 0x28(0x8)(Edit, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	enum class ERootMotionMode                   RootMotionMode;                                    // 0x30(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseMultiThreadedAnimationUpdate : 1;              // Mask: 0x1, PropSize: 0x10x31(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUsingCopyPoseFromMesh : 1;                        // Mask: 0x2, PropSize: 0x10x31(0x1)(Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_69 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bReceiveNotifiesFromLinkedInstances : 1;           // Mask: 0x10, PropSize: 0x10x31(0x1)(Edit, OutParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bPropagateNotifiesToLinkedInstances : 1;           // Mask: 0x20, PropSize: 0x10x31(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseMainInstanceMontageEvaluationData : 1;         // Mask: 0x40, PropSize: 0x10x31(0x1)(BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bQueueMontageEvents : 1;                           // Mask: 0x80, PropSize: 0x10x31(0x1)(Edit, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_670[0x6];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnMontageBlendingOut;                              // 0x38(0x10)(Edit, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig)
	FMulticastInlineDelegateProperty_            OnMontageStarted;                                  // 0x48(0x10)(ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnMontageEnded;                                    // 0x58(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig)
	FMulticastInlineDelegateProperty_            OnAllMontageInstancesEnded;                        // 0x68(0x10)(ConstParm, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_672[0xD8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnimNotifyQueue                      NotifyQueue;                                       // 0x150(0x70)(Edit, ConstParm, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FAnimNotifyEvent>              ActiveAnimNotifyState;                             // 0x1C0(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FAnimNotifyEventReference>     ActiveAnimNotifyEventReference;                    // 0x1D0(0x10)(Edit, ConstParm, BlueprintVisible, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_673[0x168];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimInstance* GetDefaultObj();

	bool WasAnimNotifyTriggeredInStateMachine();
	bool WasAnimNotifyTriggeredInSourceState();
	bool WasAnimNotifyTriggeredInAnyState();
	bool WasAnimNotifyStateActiveInStateMachine();
	bool WasAnimNotifyStateActiveInSourceState();
	bool WasAnimNotifyStateActiveInAnyState();
	bool WasAnimNotifyNameTriggeredInStateMachine(class FName NotifyName);
	bool WasAnimNotifyNameTriggeredInSourceState(class FName NotifyName);
	bool WasAnimNotifyNameTriggeredInAnyState(class FName NotifyName);
	bool UnlockAIResources();
	class UClass* UnlinkAnimClassLayers();
	class APawn* TryGetPawnOwner();
	class FName StopSlotAnimation();
	void SnapshotPose(struct FPoseSnapshot* Snapshot);
	bool SetUseMainInstanceMontageEvaluationData();
	void SetRootMotionMode(enum class ERootMotionMode Value);
	bool SetReceiveNotifiesFromLinkedInstances();
	bool SetPropagateNotifiesToLinkedInstances();
	class FName SetMorphTarget(float Value);
	void SavePoseSnapshot(class FName* SnapshotName);
	enum class ETeleportType ResetDynamics();
	bool RequestTransitionEvent(class FName* EventName);
	class UBlendProfile* RequestSlotGroupInertialization();
	void RemovePoseSnapshot(class FName* SnapshotName);
	bool QueryTransitionEvent(int32 TransitionIndex, class FName* EventName);
	bool QueryAndMarkTransitionEvent(int32 TransitionIndex, class FName* EventName);
	class UAnimMontage* PlaySlotAnimationAsDynamicMontage_WithBlendSettings(class UAnimSequenceBase** Asset, int32* LoopCount);
	class UAnimMontage* PlaySlotAnimationAsDynamicMontage_WithBlendArgs(class UAnimSequenceBase** Asset, struct FAlphaBlendArgs* BlendIn, int32* LoopCount);
	class UAnimMontage* PlaySlotAnimationAsDynamicMontage(class UAnimSequenceBase** Asset, float BlendInTime, float BlendOutTime, int32* LoopCount);
	struct FVector OnCharacterStepped();
	class UAnimMontage* MontageSync_StopFollowing();
	class UAnimMontage* MontageSync_Follow();
	struct FMontageBlendSettings Montage_StopWithBlendSettings(class UAnimMontage* Montage);
	struct FAlphaBlendArgs Montage_StopWithBlendOut(class UAnimMontage* Montage);
	class FName Montage_StopGroupByName();
	float Montage_Stop(class UAnimMontage* Montage);
	void Montage_SetPosition(class UAnimMontage* Montage, float NewPosition);
	float Montage_SetPlayRate(class UAnimMontage* Montage);
	class FName Montage_SetNextSection(class UAnimMontage* Montage);
	void Montage_Resume(class UAnimMontage* Montage);
	float Montage_PlayWithBlendSettings();
	float Montage_PlayWithBlendIn(struct FAlphaBlendArgs* BlendIn);
	float Montage_Play_WithBlending(float BlendInTime, float BlendOutTime, bool bPauseOnFinish);
	float Montage_Play(bool bPauseOnFinish);
	void Montage_Pause(class UAnimMontage* Montage);
	void Montage_JumpToSectionsEnd(class FName SectionName, class UAnimMontage* Montage);
	void Montage_JumpToSection(class FName SectionName, class UAnimMontage* Montage);
	bool Montage_IsPlaying(class UAnimMontage* Montage);
	bool Montage_IsActive(class UAnimMontage* Montage);
	float Montage_GetPosition(class UAnimMontage* Montage);
	float Montage_GetPlayRate(class UAnimMontage* Montage);
	bool Montage_GetIsStopped(class UAnimMontage* Montage);
	float Montage_GetEffectivePlayRate(class UAnimMontage* Montage);
	bool Montage_GetCurrentTime(class UAnimMontage* Montage);
	class FName Montage_GetCurrentSection(class UAnimMontage* Montage);
	float Montage_GetBlendTime(class UAnimMontage* Montage);
	bool LockAIResources();
	class UClass* LinkAnimGraphByTag();
	class UClass* LinkAnimClassLayers();
	bool IsUsingRootTransform();
	bool IsUsingMainInstanceMontageEvaluationData();
	bool IsSyncGroupBetweenMarkers();
	bool IsPlayingSlotAnimation(class UAnimSequenceBase** Asset);
	bool IsAnyMontagePlaying();
	bool HasMarkerBeenHitThisFrame(class FName MarkerName);
	bool GetTimeToClosestMarker(class FName MarkerName);
	struct FMarkerSyncAnimPosition GetSyncGroupPosition();
	float GetRelevantAnimTimeRemainingFraction();
	float GetRelevantAnimTimeRemaining();
	float GetRelevantAnimTimeFraction();
	float GetRelevantAnimTime();
	float GetRelevantAnimLength();
	bool GetReceiveNotifiesFromLinkedInstances();
	bool GetPropagateNotifiesToLinkedInstances();
	class USkeletalMeshComponent* GetOwningComponent();
	class AActor* GetOwningActor();
	class FName GetLinkedAnimLayerInstancesByGroup(const TArray<class UAnimInstance*>& OutLinkedInstances);
	class UAnimInstance* GetLinkedAnimLayerInstanceByGroupAndClass();
	class UAnimInstance* GetLinkedAnimLayerInstanceByGroup();
	class UAnimInstance* GetLinkedAnimLayerInstanceByClass();
	class FName GetLinkedAnimGraphInstancesByTag(const TArray<class UAnimInstance*>& OutLinkedInstances);
	class UAnimInstance* GetLinkedAnimGraphInstanceByTag();
	float GetInstanceTransitionTimeElapsedFraction(int32 TransitionIndex);
	float GetInstanceTransitionTimeElapsed(int32 TransitionIndex);
	float GetInstanceTransitionCrossfadeDuration(int32 TransitionIndex);
	float GetInstanceStateWeight();
	float GetInstanceMachineWeight();
	float GetInstanceCurrentStateElapsedTime();
	float GetInstanceAssetPlayerTimeFromEndFraction();
	float GetInstanceAssetPlayerTimeFromEnd();
	float GetInstanceAssetPlayerTimeFraction();
	float GetInstanceAssetPlayerTime();
	float GetInstanceAssetPlayerLength();
	float GetDeltaSeconds();
	bool GetCurveValueWithDefault(class FName CurveName);
	float GetCurveValue(class FName CurveName);
	class FName GetCurrentStateName();
	class UAnimMontage* GetCurrentActiveMontage();
	TArray<class FName> GetAllCurveNames();
	TArray<class FName> GetActiveCurveNames();
	struct FVector ControlRigNotify(class FName NotifyName, struct FHitResult* WorldSpaceHitResult);
	void ClearTransitionEvents(class FName* EventName);
	void ClearMorphTargets();
	void ClearAllTransitionEvents();
	float CalculateDirection();
	float BlueprintUpdateAnimation();
	float BlueprintTriggerAnimationEvent();
	void BlueprintThreadSafeUpdateAnimation(float* DeltaTime);
	void BlueprintPostEvaluateAnimation();
	float BlueprintPlayAnimationEvent(float PlayRate, bool bPauseOnFinish, float* StartPosition);
	void BlueprintLinkedAnimationLayersInitialized();
	void BlueprintInitializeAnimation();
	void BlueprintBeginPlay();
};

// 0x150 (0x370 - 0x220)
// Class Engine.BlueprintGeneratedClass
class UBlueprintGeneratedClass : public UClass
{
public:
	uint8                                        Pad_690[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        NumReplicatedProperties;                           // 0x228(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	uint8                                        bHasNativizedParent : 1;                           // Mask: 0x1, PropSize: 0x10x22C(0x1)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bHasCookedComponentInstancingData : 1;             // Mask: 0x2, PropSize: 0x10x22C(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_6A : 6;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_694[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<class UDynamicBlueprintBinding*>      DynamicBindingObjects;                             // 0x230(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class UActorComponent*>               ComponentTemplates;                                // 0x240(0x10)(Edit, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class UTimelineTemplate*>             Timelines;                                         // 0x250(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FBPComponentClassOverride>     ComponentClassOverrides;                           // 0x260(0x10)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USimpleConstructionScript*             SimpleConstructionScript;                          // 0x270(0x8)(ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, GlobalConfig)
	class UInheritableComponentHandler*          InheritableComponentHandler;                       // 0x278(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, GlobalConfig)
	class UStructProperty*                       UberGraphFramePointerProperty;                     // 0x280(0x8)(ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_699[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	class UFunction*                             UberGraphFunction;                                 // 0x290(0x8)(ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TMap<class FName, struct FGuid>              CookedPropertyGuids;                               // 0x298(0x50)(Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TMap<class FName, struct FBlueprintCookedComponentInstancingData> CookedComponentInstancingData;                     // 0x2E8(0x50)(Edit, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_69B[0x38];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UBlueprintGeneratedClass* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class Engine.TimecodeProvider
class UTimecodeProvider : public UObject
{
public:
	float                                        FrameDelay;                                        // 0x28(0x4)(ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, EditConst)
	uint8                                        Pad_6A7[0x4];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UTimecodeProvider* GetDefaultObj();

	struct FTimecode GetTimecode();
	enum class ETimecodeProviderSynchronizationState GetSynchronizationState();
	struct FQualifiedFrameTime GetQualifiedFrameTime();
	struct FFrameRate GetFrameRate();
	struct FTimecode GetDelayedTimecode();
	struct FQualifiedFrameTime GetDelayedQualifiedFrameTime();
	bool FetchTimecode();
	void FetchAndUpdate();
};

// 0x0 (0x28 - 0x28)
// Class Engine.MeshDeformer
class UMeshDeformer : public UObject
{
public:

	static class UClass* StaticClass();
	static class UMeshDeformer* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.MeshDeformerInstanceSettings
class UMeshDeformerInstanceSettings : public UObject
{
public:

	static class UClass* StaticClass();
	static class UMeshDeformerInstanceSettings* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.MeshDeformerInstance
class UMeshDeformerInstance : public UObject
{
public:

	static class UClass* StaticClass();
	static class UMeshDeformerInstance* GetDefaultObj();

};

// 0x0 (0x4C8 - 0x4C8)
// Class Engine.Info
class AInfo : public AActor
{
public:

	static class UClass* StaticClass();
	static class AInfo* GetDefaultObj();

};

// 0xA0 (0x568 - 0x4C8)
// Class Engine.GameModeBase
class AGameModeBase : public AInfo
{
public:
	class FString                                OptionsString;                                     // 0x4C8(0x10)(Edit, ConstParm, ExportObject, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                GameSessionClass;                                  // 0x4D8(0x8)(ConstParm, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                GameStateClass;                                    // 0x4E0(0x8)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	class UClass*                                PlayerControllerClass;                             // 0x4E8(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                PlayerStateClass;                                  // 0x4F0(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	class UClass*                                HUDClass;                                          // 0x4F8(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                DefaultPawnClass;                                  // 0x500(0x8)(ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                SpectatorClass;                                    // 0x508(0x8)(Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                ReplaySpectatorPlayerControllerClass;              // 0x510(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                ServerStatReplicatorClass;                         // 0x518(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class AGameSession*                          GameSession;                                       // 0x520(0x8)(BlueprintVisible, EditFixedSize, ReturnParm)
	class AGameStateBase*                        GameState;                                         // 0x528(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, GlobalConfig)
	class AServerStatReplicator*                 ServerStatReplicator;                              // 0x530(0x8)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, Transient, DisableEditOnInstance, GlobalConfig)
	class FText                                  DefaultPlayerName;                                 // 0x538(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUseSeamlessTravel : 1;                            // Mask: 0x1, PropSize: 0x10x550(0x1)(Edit, ConstParm, ExportObject, Net, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bStartPlayersAsSpectators : 1;                     // Mask: 0x2, PropSize: 0x10x550(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bPauseable : 1;                                    // Mask: 0x4, PropSize: 0x10x550(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_6D2[0x17];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class AGameModeBase* GetDefaultObj();

	void StartPlay();
	class APawn* SpawnDefaultPawnFor(class AController** NewPlayer);
	class APawn* SpawnDefaultPawnAtTransform(class AController** NewPlayer, const struct FTransform& SpawnTransform);
	bool ShouldReset();
	void ReturnToMainMenuHost();
	void RestartPlayerAtTransform(class AController** NewPlayer, const struct FTransform& SpawnTransform);
	class AActor* RestartPlayerAtPlayerStart(class AController** NewPlayer);
	void RestartPlayer(class AController** NewPlayer);
	void ResetLevel();
	bool PlayerCanRestart();
	bool MustSpectate();
	void K2_PostLogin(class APlayerController** NewPlayer);
	class APlayerController* K2_OnSwapPlayerControllers();
	void K2_OnRestartPlayer(class AController** NewPlayer);
	class AController* K2_OnLogout();
	bool K2_OnChangeName(class AController** Other);
	class AActor* K2_FindPlayerStart();
	class AActor* InitStartSpot(class AController** NewPlayer);
	void InitializeHUDForPlayer(class APlayerController** NewPlayer);
	bool HasMatchStarted();
	bool HasMatchEnded();
	void HandleStartingNewPlayer(class APlayerController** NewPlayer);
	int32 GetNumSpectators();
	int32 GetNumPlayers();
	class UClass* GetDefaultPawnClassForController();
	class AActor* FindPlayerStart();
	class AActor* ChoosePlayerStart();
	bool ChangeName(class AController** Controller);
	bool CanSpectate();
};

// 0x0 (0x28 - 0x28)
// Class Engine.EngineCustomTimeStep
class UEngineCustomTimeStep : public UObject
{
public:

	static class UClass* StaticClass();
	static class UEngineCustomTimeStep* GetDefaultObj();

};

// 0x0 (0x4C8 - 0x4C8)
// Class Engine.PartitionActor
class APartitionActor : public AActor
{
public:

	static class UClass* StaticClass();
	static class APartitionActor* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class Engine.TickableWorldSubsystem
class UTickableWorldSubsystem : public UWorldSubsystem
{
public:
	uint8                                        Pad_6D6[0x10];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UTickableWorldSubsystem* GetDefaultObj();

};

// 0x38 (0x500 - 0x4C8)
// Class Engine.Brush
class ABrush : public AActor
{
public:
	enum class EBrushType                        BrushType;                                         // 0x4C8(0x1)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_6D7[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	struct FColor                                BrushColor;                                        // 0x4CC(0x4)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	int32                                        PolyFlags;                                         // 0x4D0(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bColored : 1;                                      // Mask: 0x1, PropSize: 0x10x4D4(0x1)(Edit, BlueprintVisible, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bSolidWhenSelected : 1;                            // Mask: 0x2, PropSize: 0x10x4D4(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bPlaceableFromClassBrowser : 1;                    // Mask: 0x4, PropSize: 0x10x4D4(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bNotForClientOrServer : 1;                         // Mask: 0x8, PropSize: 0x10x4D4(0x1)(Edit, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_6B : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_6D9[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	class UModel*                                Brush;                                             // 0x4D8(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, EditConst)
	class UBrushComponent*                       BrushComponent;                                    // 0x4E0(0x8)(Edit, ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig)
	uint8                                        bInManipulation : 1;                               // Mask: 0x1, PropSize: 0x10x4E8(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_6C : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_6DA[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<struct FGeomSelection>                SavedSelections;                                   // 0x4F0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class ABrush* GetDefaultObj();

};

// 0x18 (0x518 - 0x500)
// Class Engine.Volume
class AVolume : public ABrush
{
public:
	TArray<struct FBoxOptimization>              BoxOptimization;                                   // 0x500(0x10)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Config, EditConst)
	bool                                         bAllowCollisionComponentWithZeroRadius;            // 0x510(0x1)(Net, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_6DE[0x7];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class AVolume* GetDefaultObj();

	bool BPEncompassesPoint(float* OutDistanceToPoint);
};

// 0x34F8 (0x39C0 - 0x4C8)
// Class Engine.PlayerCameraManager
class APlayerCameraManager : public AActor
{
public:
	class APlayerController*                     PCOwner;                                           // 0x4C8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class USceneComponent*                       TransformComponent;                                // 0x4D0(0x8)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_728[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        DefaultFOV;                                        // 0x4E0(0x4)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_729[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        DefaultOrthoWidth;                                 // 0x4E8(0x4)(Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_72A[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        DefaultAspectRatio;                                // 0x4F0(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_72B[0x6C];                                     // Fixing Size After Last Property  > TateDumper <
	struct FCameraCacheEntry                     CameraCache;                                       // 0x560(0x870)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	struct FCameraCacheEntry                     LastFrameCameraCache;                              // 0xDD0(0x870)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	struct FTViewTarget                          ViewTarget;                                        // 0x1640(0x880)(Edit, ConstParm, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FTViewTarget                          PendingViewTarget;                                 // 0x1EC0(0x880)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_72E[0x30];                                     // Fixing Size After Last Property  > TateDumper <
	struct FCameraCacheEntry                     CameraCachePrivate;                                // 0x2770(0x870)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	struct FCameraCacheEntry                     LastFrameCameraCachePrivate;                       // 0x2FE0(0x870)(Edit, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class UCameraModifier*>               ModifierList;                                      // 0x3850(0x10)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class UClass*>                        DefaultModifiers;                                  // 0x3860(0x10)(Edit, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        FreeCamDistance;                                   // 0x3870(0x4)(ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_730[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FreeCamOffset;                                     // 0x3878(0x18)(OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               ViewTargetOffset;                                  // 0x3890(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnAudioFadeChangeEvent;                            // 0x38A8(0x10)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_732[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<TScriptInterface<class ICameraLensEffectInterface>> CameraLensEffects;                                 // 0x38D0(0x10)(Edit, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class UCameraModifier_CameraShake*           CachedCameraShakeMod;                              // 0x38E0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class UCameraAnimInst*                       AnimInstPool[0x8];                                 // 0x38E8(0x40)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
