#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xA8 (0x4A0 - 0x3F8)
// RigVMBlueprintGeneratedClass Female_Hair_Afro_Mid_CtrlRig.Female_Hair_Afro_Mid_CtrlRig_C
class UFemale_Hair_Afro_Mid_CtrlRig_C : public UControlRig
{
public:
	TArray<struct FVector>                       BoneArraySpringSolver_CurrentSpringPositionGlobal; // 0x3F8(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	TArray<struct FVector>                       BoneArraySpringSolver_LastFrameSpringPositionGlobal; // 0x408(0x10)(ConstParm, ExportObject, Parm, Config, InstancedReference, SubobjectReference)
	TArray<struct FVector>                       BoneArraySpringSolver_CurrentVelocity;             // 0x418(0x10)(BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	TArray<struct FVector>                       BoneArraySpringSolver_CurrentVelocityGlobal;       // 0x428(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<double>                               BoneArraySpringSolver_Alphas;                      // 0x438(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	TArray<float>                                BoneArraySpringSolver_SpringStrength;              // 0x448(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<float>                                BoneArraySpringSolver_SpringDamping;               // 0x458(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<struct FVector>                       BoneArraySpringSolver_CurrentSpringPositionWorld;  // 0x468(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	bool                                         Swimming;                                          // 0x478(0x1)(ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_4FB6[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<double>                               SwimStrength;                                      // 0x480(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<double>                               SwimDamping;                                       // 0x490(0x10)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UFemale_Hair_Afro_Mid_CtrlRig_C* GetDefaultObj();

};

// 0x357 (0x37F - 0x28)
// RigVMMemoryStorageGeneratorClass Female_Hair_Afro_Mid_CtrlRig.RigVMMemory_Literal
class URigVMMemory_Literal : public URigVMMemoryStorage
{
public:
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_Items__Const;       // 0x28(0x10)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	float                                        RigVMModel___BoneArraySpringSolver_2_MaximumSpringLength__Const; // 0x38(0x4)(Edit, BlueprintReadOnly, EditFixedSize, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         RigVMModel___BoneArraySpringSolver_2_ConstrainLength__Const; // 0x3C(0x1)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FB9[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___BoneArraySpringSolver_2_ConstrainLengthMin__Const; // 0x40(0x8)(ConstParm, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	double                                       RigVMModel___BoneArraySpringSolver_2_ConstrainLengthMax__Const; // 0x48(0x8)(BlueprintVisible, ExportObject, Net, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         RigVMModel___BoneArraySpringSolver_2_BonesLookAtParent__Const; // 0x50(0x1)(BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FBA[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___BoneArraySpringSolver_2_BonesLookAtParentAlpha__Const; // 0x58(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               LocalVariableDefault__BoneArraySpringSolver_PrevPos__Const; // 0x60(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               LocalVariableDefault__BoneArraySpringSolver_BonePosition__Const; // 0x78(0x18)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_Space__Const; // 0x90(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_bInitial__Const; // 0x91(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FBB[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_IsNearlyZero_Tolerance__Const; // 0x94(0x4)(ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Multiply_7_B__Const; // 0x98(0x8)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_1_Add_1_1_B__Const; // 0xA0(0x18)(ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_SourceMinimum__Const; // 0xB8(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_SourceMaximum__Const; // 0xC0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_TargetMinimum__Const; // 0xC8(0x8)(ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_TargetMaximum__Const; // 0xD0(0x8)(BlueprintVisible, Parm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	bool                                         SpringSolver_0___SpringSolver_Remap_1_bClamp__Const; // 0xD8(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FBC[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        SpringSolver_0___SpringSolver_Multiply_2_B__Const; // 0xDC(0x4)(Edit, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_MathVectorClampLength_MinimumLength__Const; // 0xE0(0x4)(Edit, ConstParm, ExportObject, Net, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Divide_A__Const;     // 0xE4(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        ToBoneSpace___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0xE8(0xC)(Edit, ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              ToBoneSpace___ToBoneSpace_GetTransform_Space__Const; // 0xF4(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         ToBoneSpace___ToBoneSpace_GetTransform_bInitial__Const; // 0xF5(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FBD[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Add_1_A__Const; // 0xF8(0x4)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        ToBoneSpace_2_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0xFC(0xC)(BlueprintVisible, Net, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              ToBoneSpace_2_1___ToBoneSpace_GetTransform_Space__Const; // 0x108(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	bool                                         ToBoneSpace_2_1___ToBoneSpace_GetTransform_bInitial__Const; // 0x109(0x1)(ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FBE[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Divide_1_A__Const; // 0x10C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Multiply_B__Const; // 0x110(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FBF[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_7_B__Const; // 0x118(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_SourceMinimum__Const; // 0x120(0x8)(Edit, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_SourceMaximum__Const; // 0x128(0x8)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_TargetMinimum__Const; // 0x130(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_TargetMaximum__Const; // 0x138(0x8)(Edit, ConstParm, Net, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	bool                                         SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_bClamp__Const; // 0x140(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FC0[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_2_B__Const; // 0x144(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_MathVectorClampLength_MinimumLength__Const; // 0x148(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_A__Const; // 0x14C(0x4)(Edit, BlueprintVisible, ExportObject, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        FromBoneSpace_1___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x150(0xC)(ConstParm, Net, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              FromBoneSpace_1___FromBoneSpace_GetTransform_Space__Const; // 0x15C(0x1)(Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         FromBoneSpace_1___FromBoneSpace_GetTransform_bInitial__Const; // 0x15D(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FC1[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        ToBoneSpace_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x160(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              ToBoneSpace_1___ToBoneSpace_GetTransform_Space__Const; // 0x16C(0x1)(ConstParm, BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         ToBoneSpace_1___ToBoneSpace_GetTransform_bInitial__Const; // 0x16D(0x1)(Net, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FC2[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_2___BoneArraySpringSolver_Set_Transform_1_Value__Const; // 0x170(0x60)(Edit, ConstParm, BlueprintVisible, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        FromBoneSpace___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x1D0(0xC)(ExportObject, BlueprintReadOnly, Net, ZeroConstructor, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              FromBoneSpace___FromBoneSpace_GetTransform_Space__Const; // 0x1DC(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         FromBoneSpace___FromBoneSpace_GetTransform_bInitial__Const; // 0x1DD(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         BoneArraySpringSolver_2___BoneArraySpringSolver_Set_Transform_1_bPropagateToChildren__Const; // 0x1DE(0x1)(ConstParm, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FC3[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        RigVMModel___BoneArraySpringSolver_3_MaximumSpringLength__Const; // 0x1E0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FC4[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___BoneArraySpringSolver_3_ConstrainLengthMin__Const; // 0x1E8(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	double                                       RigVMModel___BoneArraySpringSolver_3_ConstrainLengthMax__Const; // 0x1F0(0x8)(ConstParm, ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               LocalVariableDefault__BoneArraySpringSolver_PrevPos__Const; // 0x1F8(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               LocalVariableDefault__BoneArraySpringSolver_BonePosition__Const; // 0x210(0x18)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_Space__Const; // 0x228(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_bInitial__Const; // 0x229(0x1)(Edit, EditFixedSize, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FC5[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_IsNearlyZero_Tolerance__Const; // 0x22C(0x4)(ConstParm, Net, EditFixedSize, Config, InstancedReference, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Multiply_7_B__Const; // 0x230(0x8)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_1_Add_1_1_B__Const; // 0x238(0x18)(ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_SourceMinimum__Const; // 0x250(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_SourceMaximum__Const; // 0x258(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_TargetMinimum__Const; // 0x260(0x8)(ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_TargetMaximum__Const; // 0x268(0x8)(BlueprintVisible, Parm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	bool                                         SpringSolver_0___SpringSolver_Remap_1_bClamp__Const; // 0x270(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FC6[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        SpringSolver_0___SpringSolver_Multiply_2_B__Const; // 0x274(0x4)(Edit, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_MathVectorClampLength_MinimumLength__Const; // 0x278(0x4)(Edit, ConstParm, ExportObject, Net, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Divide_A__Const;     // 0x27C(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        ToBoneSpace___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x280(0xC)(Edit, ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              ToBoneSpace___ToBoneSpace_GetTransform_Space__Const; // 0x28C(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         ToBoneSpace___ToBoneSpace_GetTransform_bInitial__Const; // 0x28D(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FC7[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Add_1_A__Const; // 0x290(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        ToBoneSpace_2_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x294(0xC)(BlueprintVisible, Net, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              ToBoneSpace_2_1___ToBoneSpace_GetTransform_Space__Const; // 0x2A0(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	bool                                         ToBoneSpace_2_1___ToBoneSpace_GetTransform_bInitial__Const; // 0x2A1(0x1)(ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FC8[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Divide_1_A__Const; // 0x2A4(0x4)(BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Multiply_B__Const; // 0x2A8(0x4)(ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FC9[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_7_B__Const; // 0x2B0(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_SourceMinimum__Const; // 0x2B8(0x8)(Edit, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_SourceMaximum__Const; // 0x2C0(0x8)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_TargetMinimum__Const; // 0x2C8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_TargetMaximum__Const; // 0x2D0(0x8)(Edit, ConstParm, Net, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	bool                                         SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_bClamp__Const; // 0x2D8(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FCA[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_2_B__Const; // 0x2DC(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_MathVectorClampLength_MinimumLength__Const; // 0x2E0(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_A__Const; // 0x2E4(0x4)(Edit, BlueprintVisible, ExportObject, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        FromBoneSpace_1___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x2E8(0xC)(ConstParm, Net, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              FromBoneSpace_1___FromBoneSpace_GetTransform_Space__Const; // 0x2F4(0x1)(Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         FromBoneSpace_1___FromBoneSpace_GetTransform_bInitial__Const; // 0x2F5(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FCB[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        ToBoneSpace_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x2F8(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              ToBoneSpace_1___ToBoneSpace_GetTransform_Space__Const; // 0x304(0x1)(ConstParm, BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         ToBoneSpace_1___ToBoneSpace_GetTransform_bInitial__Const; // 0x305(0x1)(Net, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FCC[0xA];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_3___BoneArraySpringSolver_Set_Transform_1_Value__Const; // 0x310(0x60)(Edit, OutParm, Transient, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        FromBoneSpace___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x370(0xC)(ExportObject, BlueprintReadOnly, Net, ZeroConstructor, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              FromBoneSpace___FromBoneSpace_GetTransform_Space__Const; // 0x37C(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         FromBoneSpace___FromBoneSpace_GetTransform_bInitial__Const; // 0x37D(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         BoneArraySpringSolver_3___BoneArraySpringSolver_Set_Transform_1_bPropagateToChildren__Const; // 0x37E(0x1)(ExportObject, Net, OutParm, Transient, Config, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class URigVMMemory_Literal* GetDefaultObj();

};

// 0x1E80 (0x1EA8 - 0x28)
// RigVMMemoryStorageGeneratorClass Female_Hair_Afro_Mid_CtrlRig.RigVMMemory_Work
class URigVMMemory_Work : public URigVMMemoryStorage
{
public:
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_Items__IO;          // 0x28(0x10)(Edit, ConstParm, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<float>                                RigVMModel___BoneArraySpringSolver_2_SpringStrength; // 0x38(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	TArray<float>                                RigVMModel___BoneArraySpringSolver_2_SpringDamping; // 0x48(0x10)(ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_2___BoneArraySpringSolver_Entry_SimSpaceBone; // 0x58(0xC)(Edit, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FCD[0xC];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_Transform; // 0x70(0x60)(BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0xD0(0xC)(ConstParm, EditFixedSize, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FCE[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_CachedIndex; // 0xE0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               LocalVariable__BoneArraySpringSolver_BonePosition; // 0xF0(0x18)(Edit, ConstParm, ExportObject, Net, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	bool                                         BoneArraySpringSolver_2___BoneArraySpringSolver_IsNearlyZero_Result; // 0x108(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FCF[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_Element; // 0x110(0x18)(ConstParm, BlueprintVisible, EditFixedSize, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	int32                                        BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x128(0x4)(ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FD0[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_To_World_1_World; // 0x130(0x18)(Edit, ExportObject, EditFixedSize, Parm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_Element; // 0x148(0x4)(ExportObject, Net, EditFixedSize, Parm, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Element; // 0x14C(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_To_World_2_World; // 0x150(0x18)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x168(0x18)(ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolver_0_Strength; // 0x180(0x8)(Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolver_0_Damping; // 0x188(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolver_0_Out; // 0x190(0x18)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolver_0_Velocity; // 0x1A8(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_7_Element; // 0x1C0(0x18)(BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Entry_Maximum_Length; // 0x1D8(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FD1[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolver_0___SpringSolver_Return_Velocity;     // 0x1E0(0x18)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Entry_VelocityIn;    // 0x1F8(0x18)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_MathVectorClampLength_Result; // 0x210(0x18)(ConstParm, Net, Parm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Subtract_1_2_Result; // 0x228(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_9_1_Result;      // 0x240(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Scale_3_Result;      // 0x258(0x18)(Edit, ExportObject, Net, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_1_Add_1_1_Result; // 0x270(0x18)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_1_Add_1_Result;  // 0x288(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Scale_Result;        // 0x2A0(0x18)(Edit, ConstParm, BlueprintVisible, Net, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Subtract_Result;     // 0x2B8(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Multiply_1_Result;   // 0x2D0(0x8)(BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Multiply_7_Result;   // 0x2D8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_GetDeltaTime_3_2_1_Result; // 0x2E0(0x4)(Edit, Net, EditFixedSize, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FD2[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Multiply_1_B;        // 0x2E8(0x8)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Scale_Factor;        // 0x2F0(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FD3[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Multiply_6_Result;   // 0x2F8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_GetDeltaTime_3_Result; // 0x300(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FD4[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Multiply_6_A;        // 0x308(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Power_1_Result;      // 0x310(0x8)(ConstParm, ExportObject, Net, Parm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_Result;      // 0x318(0x8)(Edit, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Multiply_2_Result;   // 0x320(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FD5[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Power_1_B;           // 0x328(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Scale_3_Factor;      // 0x330(0x4)(ConstParm, Net, Parm, OutParm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FD6[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolver_0___SpringSolver_Subtract_1_Result;   // 0x338(0x18)(Edit, ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Divide_Result;       // 0x350(0x4)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_RigVMFunction_GetDeltaTime_Result; // 0x354(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         BoneArraySpringSolver_2___BoneArraySpringSolver_IsNearlyZero_1_Result; // 0x358(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FD7[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_1_Element; // 0x360(0x18)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_ToBoneSpace_RootSpaceResult; // 0x378(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         ToBoneSpace___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x390(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FD8[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ToBoneSpace___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x398(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace___ToBoneSpace_Inverse_Result;          // 0x3B0(0x60)(Edit, ConstParm, EditFixedSize, ReturnParm, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace___ToBoneSpace_GetTransform_Transform;  // 0x410(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             ToBoneSpace___ToBoneSpace_GetTransform_CachedIndex; // 0x470(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_4_Element; // 0x480(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolverGlobal_0_Strength; // 0x498(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolverGlobal_0_Damping; // 0x4A0(0x8)(Edit, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolverGlobal_0_Out; // 0x4A8(0x18)(ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Cast_Result; // 0x4C0(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Add_1_Result; // 0x4D8(0x4)(BlueprintVisible, Net, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FD9[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Scale_1_1_Result; // 0x4E0(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_ToBoneSpace_2_1_RootSpaceResult; // 0x4F8(0x18)(Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_1_Result; // 0x510(0x18)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_From_World_Global; // 0x528(0x18)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_Element; // 0x540(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_5_Element; // 0x558(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	bool                                         ToBoneSpace_2_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x570(0x1)(Edit, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FDA[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ToBoneSpace_2_1___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x578(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_2_1___ToBoneSpace_Inverse_Result;      // 0x590(0x60)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_2_1___ToBoneSpace_GetTransform_Transform; // 0x5F0(0x60)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             ToBoneSpace_2_1___ToBoneSpace_GetTransform_CachedIndex; // 0x650(0x10)(Edit, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Multiply_Result; // 0x660(0x4)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Divide_1_Result; // 0x664(0x4)(BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_RigVMFunction_GetDeltaTime_1_Result; // 0x668(0x4)(ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FDB[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_8_Element; // 0x670(0x18)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolverGlobal_0_VelocityGlobal; // 0x688(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Entry_Maximum_Length; // 0x6A0(0x4)(ConstParm, BlueprintVisible, Net, OutParm, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FDC[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Entry_VelocityIn; // 0x6A8(0x18)(Edit, BlueprintReadOnly, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Return_VelocityGlobal; // 0x6C0(0x18)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_MathVectorClampLength_Result; // 0x6D8(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_2_Result; // 0x6F0(0x18)(ExportObject, Net, EditFixedSize, Parm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Add_9_1_Result; // 0x708(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Result; // 0x720(0x18)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_1_Result; // 0x738(0x18)(Edit, ConstParm, Parm, OutParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_Result; // 0x750(0x18)(BlueprintVisible, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Multiply_Result; // 0x768(0x18)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Scale_Result; // 0x780(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Subtract_Result; // 0x798(0x18)(ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_1_Result; // 0x7B0(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_7_Result; // 0x7B8(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_GetDeltaTime_3_2_1_Result; // 0x7C0(0x4)(Edit, ConstParm, Net, Parm, OutParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FDD[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_1_B; // 0x7C8(0x8)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Scale_Factor; // 0x7D0(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FDE[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_Result; // 0x7D8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_GetDeltaTime_3_Result; // 0x7E0(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FDF[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_A; // 0x7E8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Power_1_Result; // 0x7F0(0x8)(ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_Result; // 0x7F8(0x8)(BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_2_Result; // 0x800(0x4)(Edit, BlueprintVisible, Net, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FE1[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Power_1_B; // 0x808(0x8)(ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Factor; // 0x810(0x4)(Edit, BlueprintVisible, ExportObject, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FE2[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_Result; // 0x818(0x18)(Edit, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_Result; // 0x830(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_RigVMFunction_GetDeltaTime_Result; // 0x834(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FE4[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_2_Transform; // 0x840(0x60)(ConstParm, BlueprintVisible, ExportObject, OutParm, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_2___BoneArraySpringSolver_HierarchyGetParent_Parent; // 0x8A0(0xC)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FE5[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_2___BoneArraySpringSolver_HierarchyGetParent_CachedChild; // 0x8B0(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_2___BoneArraySpringSolver_HierarchyGetParent_CachedParent; // 0x8C0(0x10)(Edit, BlueprintReadOnly, Parm, ReturnParm, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_2_CachedIndex; // 0x8D0(0x10)(BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_Result; // 0x8E0(0x18)(BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_FromBoneSpace_1_BoneSpacePosition; // 0x8F8(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         FromBoneSpace_1___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x910(0x1)(Edit, ConstParm, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FE7[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FromBoneSpace_1___FromBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x918(0x18)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	struct FTransform                            FromBoneSpace_1___FromBoneSpace_GetTransform_Transform; // 0x930(0x60)(ExportObject, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             FromBoneSpace_1___FromBoneSpace_GetTransform_CachedIndex; // 0x990(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_B; // 0x9A0(0x18)(Edit, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_If_Result; // 0x9B8(0x18)(ConstParm, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_ToBoneSpace_1_RootSpaceResult; // 0x9D0(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Add_Result; // 0x9E8(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Scale_Result; // 0xA00(0x18)(ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Unit_Result; // 0xA18(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Multiply_2_Result; // 0xA30(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Clamp_Result; // 0xA34(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Divide_Result; // 0xA38(0x4)(BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_RigVMFunction_MathVectorLength_1_Result; // 0xA3C(0x4)(BlueprintVisible, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_RigVMFunction_MathVectorLength_Result; // 0xA40(0x4)(ConstParm, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FE8[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_2_Result; // 0xA48(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FTransform                            BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_2_1_1_Transform; // 0xA60(0x60)(Edit, BlueprintVisible, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_2_1_1_CachedIndex; // 0xAC0(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_2_A; // 0xAD0(0x18)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FE9[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_2_1_Transform; // 0xAF0(0x60)(ConstParm, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_2___BoneArraySpringSolver_HierarchyGetParent_1_Parent; // 0xB50(0xC)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FEB[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_2___BoneArraySpringSolver_HierarchyGetParent_1_CachedChild; // 0xB60(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_2___BoneArraySpringSolver_HierarchyGetParent_1_CachedParent; // 0xB70(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_2_1_CachedIndex; // 0xB80(0x10)(Edit, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_2_B; // 0xB90(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Clamp_Minimum; // 0xBA8(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Clamp_Maximum; // 0xBAC(0x4)(BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         ToBoneSpace_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0xBB0(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FED[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ToBoneSpace_1___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0xBB8(0x18)(Edit, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_1___ToBoneSpace_Inverse_Result;        // 0xBD0(0x60)(ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_1___ToBoneSpace_GetTransform_Transform; // 0xC30(0x60)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             ToBoneSpace_1___ToBoneSpace_GetTransform_CachedIndex; // 0xC90(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_From_World_2_2_Global; // 0xCA0(0x18)(Edit, BlueprintVisible, Net, Parm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_1_Element; // 0xCB8(0x18)(Edit, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_If_1_Result; // 0xCD0(0x20)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_2___BoneArraySpringSolver_Multiply_1_Result; // 0xCF0(0x20)(ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_2___BoneArraySpringSolver_Scale_1_Result; // 0xD10(0x20)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_2___BoneArraySpringSolver_QuatBetweenDirections_0_Quat; // 0xD30(0x20)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_3_Result; // 0xD50(0x18)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FF1[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 QuatBetweenDirections_0___QuatBetweenDirections_MathQuaternionFromAxisAndAngle_Result; // 0xD70(0x20)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_Unit_2_Result; // 0xD90(0x18)(OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_MathVectorCross_Result; // 0xDA8(0x18)(Edit, Net, EditFixedSize, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_Unit_1_Result; // 0xDC0(0x18)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_Unit_Result; // 0xDD8(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       QuatBetweenDirections_0___QuatBetweenDirections_Acos_Result; // 0xDF0(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        QuatBetweenDirections_0___QuatBetweenDirections_Dot___Result; // 0xDF8(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FF2[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       QuatBetweenDirections_0___QuatBetweenDirections_Acos_Value; // 0xE00(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        QuatBetweenDirections_0___QuatBetweenDirections_MathQuaternionFromAxisAndAngle_Angle; // 0xE08(0x4)(BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Scale_1_Factor; // 0xE0C(0x4)(ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_2___BoneArraySpringSolver_Multiply_1_B; // 0xE10(0x20)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_FromBoneSpace_BoneSpacePosition; // 0xE30(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         FromBoneSpace___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0xE48(0x1)(Edit, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FF3[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FromBoneSpace___FromBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0xE50(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FF4[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            FromBoneSpace___FromBoneSpace_GetTransform_Transform; // 0xE70(0x60)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             FromBoneSpace___FromBoneSpace_GetTransform_CachedIndex; // 0xED0(0x10)(Edit, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            BoneArraySpringSolver_2___BoneArraySpringSolver_Set_Transform_1_Value__IO; // 0xEE0(0x60)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_10_Element; // 0xF40(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Transient, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Set_Transform_1_Weight; // 0xF48(0x4)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FF7[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_2___BoneArraySpringSolver_Set_Transform_1_CachedIndex; // 0xF50(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	class FName                                  BoneArraySpringSolver_2___BoneArraySpringSolver_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0xF60(0x8)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	class FName                                  BoneArraySpringSolver_2___BoneArraySpringSolver_RigVMFunction_ControlFlowBranch_BlockToRun; // 0xF68(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	int32                                        BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0xF70(0x4)(ConstParm, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0xF74(0x4)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	class FName                                  BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0xF78(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_3___BoneArraySpringSolver_Entry_SimSpaceBone; // 0xF80(0xC)(ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FF8[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_Transform; // 0xF90(0x60)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0xFF0(0xC)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FF9[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_CachedIndex; // 0x1000(0x10)(ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	struct FVector                               LocalVariable__BoneArraySpringSolver_BonePosition; // 0x1010(0x18)(Edit, ConstParm, ExportObject, Net, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	bool                                         BoneArraySpringSolver_3___BoneArraySpringSolver_IsNearlyZero_Result; // 0x1028(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FFA[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_Element; // 0x1030(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	int32                                        BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x1048(0x4)(ConstParm, BlueprintVisible, Net, Parm, OutParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_4FFB[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_To_World_1_World; // 0x1050(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_Element; // 0x1068(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Element; // 0x106C(0x4)(Edit, ConstParm, BlueprintVisible, Parm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_To_World_2_World; // 0x1070(0x18)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x1088(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, Transient, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolver_0_Strength; // 0x10A0(0x8)(BlueprintVisible, ExportObject, Net, Transient, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolver_0_Damping; // 0x10A8(0x8)(ConstParm, ExportObject, Net, EditFixedSize, Parm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolver_0_Out; // 0x10B0(0x18)(BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolver_0_Velocity; // 0x10C8(0x18)(Edit, ExportObject, BlueprintReadOnly, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_7_Element; // 0x10E0(0x18)(ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Entry_Maximum_Length; // 0x10F8(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FFC[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolver_0___SpringSolver_Return_Velocity;     // 0x1100(0x18)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Entry_VelocityIn;    // 0x1118(0x18)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_MathVectorClampLength_Result; // 0x1130(0x18)(ConstParm, Net, Parm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Subtract_1_2_Result; // 0x1148(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_9_1_Result;      // 0x1160(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Scale_3_Result;      // 0x1178(0x18)(Edit, ExportObject, Net, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_1_Add_1_1_Result; // 0x1190(0x18)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_1_Add_1_Result;  // 0x11A8(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Scale_Result;        // 0x11C0(0x18)(Edit, ConstParm, BlueprintVisible, Net, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Subtract_Result;     // 0x11D8(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Multiply_1_Result;   // 0x11F0(0x8)(BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Multiply_7_Result;   // 0x11F8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_GetDeltaTime_3_2_1_Result; // 0x1200(0x4)(Edit, Net, EditFixedSize, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FFE[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Multiply_1_B;        // 0x1208(0x8)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Scale_Factor;        // 0x1210(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	uint8                                        Pad_4FFF[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Multiply_6_Result;   // 0x1218(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_GetDeltaTime_3_Result; // 0x1220(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5000[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Multiply_6_A;        // 0x1228(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Power_1_Result;      // 0x1230(0x8)(ConstParm, ExportObject, Net, Parm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_Result;      // 0x1238(0x8)(Edit, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Multiply_2_Result;   // 0x1240(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5001[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Power_1_B;           // 0x1248(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Scale_3_Factor;      // 0x1250(0x4)(ConstParm, Net, Parm, OutParm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5002[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolver_0___SpringSolver_Subtract_1_Result;   // 0x1258(0x18)(Edit, ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Divide_Result;       // 0x1270(0x4)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_RigVMFunction_GetDeltaTime_Result; // 0x1274(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         BoneArraySpringSolver_3___BoneArraySpringSolver_IsNearlyZero_1_Result; // 0x1278(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_5003[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_1_Element; // 0x1280(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_ToBoneSpace_RootSpaceResult; // 0x1298(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         ToBoneSpace___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x12B0(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5004[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ToBoneSpace___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x12B8(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace___ToBoneSpace_Inverse_Result;          // 0x12D0(0x60)(Edit, ConstParm, EditFixedSize, ReturnParm, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace___ToBoneSpace_GetTransform_Transform;  // 0x1330(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             ToBoneSpace___ToBoneSpace_GetTransform_CachedIndex; // 0x1390(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_4_Element; // 0x13A0(0x18)(BlueprintVisible, ExportObject, Parm, OutParm, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolverGlobal_0_Strength; // 0x13B8(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolverGlobal_0_Damping; // 0x13C0(0x8)(BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolverGlobal_0_Out; // 0x13C8(0x18)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Cast_Result; // 0x13E0(0x18)(BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Add_1_Result; // 0x13F8(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_5005[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Scale_1_1_Result; // 0x1400(0x18)(Edit, ConstParm, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_ToBoneSpace_2_1_RootSpaceResult; // 0x1418(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_1_Result; // 0x1430(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_From_World_Global; // 0x1448(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_Element; // 0x1460(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_5_Element; // 0x1478(0x18)(Edit, ConstParm, EditFixedSize, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         ToBoneSpace_2_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x1490(0x1)(Edit, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5006[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ToBoneSpace_2_1___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x1498(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_2_1___ToBoneSpace_Inverse_Result;      // 0x14B0(0x60)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_2_1___ToBoneSpace_GetTransform_Transform; // 0x1510(0x60)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             ToBoneSpace_2_1___ToBoneSpace_GetTransform_CachedIndex; // 0x1570(0x10)(Edit, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Multiply_Result; // 0x1580(0x4)(ConstParm, BlueprintVisible, Parm, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Divide_1_Result; // 0x1584(0x4)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_RigVMFunction_GetDeltaTime_1_Result; // 0x1588(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_5007[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_8_Element; // 0x1590(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolverGlobal_0_VelocityGlobal; // 0x15A8(0x18)(BlueprintReadOnly, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Entry_Maximum_Length; // 0x15C0(0x4)(ConstParm, BlueprintVisible, Net, OutParm, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5008[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Entry_VelocityIn; // 0x15C8(0x18)(Edit, BlueprintReadOnly, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Return_VelocityGlobal; // 0x15E0(0x18)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_MathVectorClampLength_Result; // 0x15F8(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_2_Result; // 0x1610(0x18)(ExportObject, Net, EditFixedSize, Parm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Add_9_1_Result; // 0x1628(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Result; // 0x1640(0x18)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_1_Result; // 0x1658(0x18)(Edit, ConstParm, Parm, OutParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_Result; // 0x1670(0x18)(BlueprintVisible, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Multiply_Result; // 0x1688(0x18)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Scale_Result; // 0x16A0(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Subtract_Result; // 0x16B8(0x18)(ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_1_Result; // 0x16D0(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_7_Result; // 0x16D8(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_GetDeltaTime_3_2_1_Result; // 0x16E0(0x4)(Edit, ConstParm, Net, Parm, OutParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_500A[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_1_B; // 0x16E8(0x8)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Scale_Factor; // 0x16F0(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_500B[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_Result; // 0x16F8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_GetDeltaTime_3_Result; // 0x1700(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_500C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_A; // 0x1708(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Power_1_Result; // 0x1710(0x8)(ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_Result; // 0x1718(0x8)(BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_2_Result; // 0x1720(0x4)(Edit, BlueprintVisible, Net, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_500D[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Power_1_B; // 0x1728(0x8)(ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Factor; // 0x1730(0x4)(Edit, BlueprintVisible, ExportObject, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_500E[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_Result; // 0x1738(0x18)(Edit, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_Result; // 0x1750(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_RigVMFunction_GetDeltaTime_Result; // 0x1754(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, GlobalConfig, SubobjectReference)
	uint8                                        Pad_500F[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_2_Transform; // 0x1760(0x60)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_3___BoneArraySpringSolver_HierarchyGetParent_Parent; // 0x17C0(0xC)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_5010[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_3___BoneArraySpringSolver_HierarchyGetParent_CachedChild; // 0x17D0(0x10)(ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_3___BoneArraySpringSolver_HierarchyGetParent_CachedParent; // 0x17E0(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_2_CachedIndex; // 0x17F0(0x10)(BlueprintVisible, ExportObject, Net, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_Result; // 0x1800(0x18)(Edit, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_FromBoneSpace_1_BoneSpacePosition; // 0x1818(0x18)(Edit, ConstParm, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         FromBoneSpace_1___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x1830(0x1)(Edit, ConstParm, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5011[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FromBoneSpace_1___FromBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x1838(0x18)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	struct FTransform                            FromBoneSpace_1___FromBoneSpace_GetTransform_Transform; // 0x1850(0x60)(ExportObject, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             FromBoneSpace_1___FromBoneSpace_GetTransform_CachedIndex; // 0x18B0(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_B; // 0x18C0(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_If_Result; // 0x18D8(0x18)(Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_ToBoneSpace_1_RootSpaceResult; // 0x18F0(0x18)(EditFixedSize, Parm, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Add_Result; // 0x1908(0x18)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Scale_Result; // 0x1920(0x18)(BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Unit_Result; // 0x1938(0x18)(Net, EditFixedSize, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Multiply_2_Result; // 0x1950(0x4)(ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Clamp_Result; // 0x1954(0x4)(ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Divide_Result; // 0x1958(0x4)(ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_RigVMFunction_MathVectorLength_1_Result; // 0x195C(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_RigVMFunction_MathVectorLength_Result; // 0x1960(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_5014[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_2_Result; // 0x1968(0x18)(BlueprintVisible, Net, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FTransform                            BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_2_1_1_Transform; // 0x1980(0x60)(ConstParm, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_2_1_1_CachedIndex; // 0x19E0(0x10)(Edit, BlueprintVisible, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_2_A; // 0x19F0(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_5015[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_2_1_Transform; // 0x1A10(0x60)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_3___BoneArraySpringSolver_HierarchyGetParent_1_Parent; // 0x1A70(0xC)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_5017[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_3___BoneArraySpringSolver_HierarchyGetParent_1_CachedChild; // 0x1A80(0x10)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_3___BoneArraySpringSolver_HierarchyGetParent_1_CachedParent; // 0x1A90(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_2_1_CachedIndex; // 0x1AA0(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_2_B; // 0x1AB0(0x18)(ConstParm, ExportObject, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Clamp_Minimum; // 0x1AC8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Clamp_Maximum; // 0x1ACC(0x4)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	bool                                         ToBoneSpace_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x1AD0(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5019[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ToBoneSpace_1___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x1AD8(0x18)(Edit, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_1___ToBoneSpace_Inverse_Result;        // 0x1AF0(0x60)(ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_1___ToBoneSpace_GetTransform_Transform; // 0x1B50(0x60)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             ToBoneSpace_1___ToBoneSpace_GetTransform_CachedIndex; // 0x1BB0(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_From_World_2_2_Global; // 0x1BC0(0x18)(Edit, ConstParm, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_1_Element; // 0x1BD8(0x18)(Net, EditFixedSize, Parm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_If_1_Result; // 0x1BF0(0x20)(ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_3___BoneArraySpringSolver_Multiply_1_Result; // 0x1C10(0x20)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_3___BoneArraySpringSolver_Scale_1_Result; // 0x1C30(0x20)(BlueprintVisible, ExportObject, Transient, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_3___BoneArraySpringSolver_QuatBetweenDirections_0_Quat; // 0x1C50(0x20)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_3_Result; // 0x1C70(0x18)(Edit, Net, EditFixedSize, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_501C[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 QuatBetweenDirections_0___QuatBetweenDirections_MathQuaternionFromAxisAndAngle_Result; // 0x1C90(0x20)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_Unit_2_Result; // 0x1CB0(0x18)(OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_MathVectorCross_Result; // 0x1CC8(0x18)(Edit, Net, EditFixedSize, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_Unit_1_Result; // 0x1CE0(0x18)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_Unit_Result; // 0x1CF8(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       QuatBetweenDirections_0___QuatBetweenDirections_Acos_Result; // 0x1D10(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        QuatBetweenDirections_0___QuatBetweenDirections_Dot___Result; // 0x1D18(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_501E[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       QuatBetweenDirections_0___QuatBetweenDirections_Acos_Value; // 0x1D20(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        QuatBetweenDirections_0___QuatBetweenDirections_MathQuaternionFromAxisAndAngle_Angle; // 0x1D28(0x4)(BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Scale_1_Factor; // 0x1D2C(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_3___BoneArraySpringSolver_Multiply_1_B; // 0x1D30(0x20)(ConstParm, BlueprintVisible, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_FromBoneSpace_BoneSpacePosition; // 0x1D50(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	bool                                         FromBoneSpace___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x1D68(0x1)(Edit, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_501F[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FromBoneSpace___FromBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x1D70(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5020[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            FromBoneSpace___FromBoneSpace_GetTransform_Transform; // 0x1D90(0x60)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             FromBoneSpace___FromBoneSpace_GetTransform_CachedIndex; // 0x1DF0(0x10)(Edit, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            BoneArraySpringSolver_3___BoneArraySpringSolver_Set_Transform_1_Value__IO; // 0x1E00(0x60)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_10_Element; // 0x1E60(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Set_Transform_1_Weight; // 0x1E68(0x4)(BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_5021[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_3___BoneArraySpringSolver_Set_Transform_1_CachedIndex; // 0x1E70(0x10)(Edit, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	class FName                                  BoneArraySpringSolver_3___BoneArraySpringSolver_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x1E80(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	class FName                                  BoneArraySpringSolver_3___BoneArraySpringSolver_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x1E88(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	int32                                        BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x1E90(0x4)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x1E94(0x4)(ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	class FName                                  BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x1E98(0x8)(ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_BlockToRun; // 0x1EA0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)

	static class UClass* StaticClass();
	static class URigVMMemory_Work* GetDefaultObj();

};

}


