#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xA8 (0x4A0 - 0x3F8)
// RigVMBlueprintGeneratedClass Female_Hair_Mohawk_Mid_CtrlRig.Female_Hair_Mohawk_Mid_CtrlRig_C
class UFemale_Hair_Mohawk_Mid_CtrlRig_C : public UControlRig
{
public:
	TArray<struct FVector>                       BoneArraySpringSolver_CurrentSpringPositionWorld;  // 0x3F8(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	TArray<struct FVector>                       BoneArraySpringSolver_CurrentSpringPositionGlobal; // 0x408(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	TArray<struct FVector>                       BoneArraySpringSolver_LastFrameSpringPositionGlobal; // 0x418(0x10)(ConstParm, ExportObject, Parm, Config, InstancedReference, SubobjectReference)
	TArray<struct FVector>                       BoneArraySpringSolver_CurrentVelocity;             // 0x428(0x10)(BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	TArray<struct FVector>                       BoneArraySpringSolver_CurrentVelocityGlobal;       // 0x438(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<float>                                BoneArraySpringSolver_SpringStrength;              // 0x448(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<float>                                BoneArraySpringSolver_SpringDamping;               // 0x458(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<double>                               BoneArraySpringSolver_Alphas;                      // 0x468(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         Swimming;                                          // 0x478(0x1)(ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_3ABF[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<double>                               SwimStrength;                                      // 0x480(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<double>                               SwimDamping;                                       // 0x490(0x10)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UFemale_Hair_Mohawk_Mid_CtrlRig_C* GetDefaultObj();

};

// 0x367 (0x38F - 0x28)
// RigVMMemoryStorageGeneratorClass Female_Hair_Mohawk_Mid_CtrlRig.RigVMMemory_Literal
class URigVMMemory_Literal : public URigVMMemoryStorage
{
public:
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_Items__Const;       // 0x28(0x10)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	float                                        RigVMModel___BoneArraySpringSolver_2_MaximumSpringLength__Const; // 0x38(0x4)(Edit, BlueprintReadOnly, EditFixedSize, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         RigVMModel___BoneArraySpringSolver_2_ConstrainLength__Const; // 0x3C(0x1)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3AC1[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___BoneArraySpringSolver_2_ConstrainLengthMin__Const; // 0x40(0x8)(ConstParm, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	double                                       RigVMModel___BoneArraySpringSolver_2_ConstrainLengthMax__Const; // 0x48(0x8)(BlueprintVisible, ExportObject, Net, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	double                                       RigVMModel___BoneArraySpringSolver_2_BonesLookAtParentAlpha__Const; // 0x50(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        RigVMModel___BoneArraySpringSolver_2_SimSpaceBone__Const; // 0x58(0xC)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3AC2[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalVariableDefault__BoneArraySpringSolver_PrevPos__Const; // 0x68(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               LocalVariableDefault__BoneArraySpringSolver_BonePosition__Const; // 0x80(0x18)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_Space__Const; // 0x98(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_bInitial__Const; // 0x99(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3AC3[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_IsNearlyZero_Tolerance__Const; // 0x9C(0x4)(ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Multiply_7_B__Const; // 0xA0(0x8)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_1_Add_1_1_B__Const; // 0xA8(0x18)(ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_SourceMinimum__Const; // 0xC0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_SourceMaximum__Const; // 0xC8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_TargetMinimum__Const; // 0xD0(0x8)(ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_TargetMaximum__Const; // 0xD8(0x8)(BlueprintVisible, Parm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	bool                                         SpringSolver_0___SpringSolver_Remap_1_bClamp__Const; // 0xE0(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AC4[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        SpringSolver_0___SpringSolver_Multiply_2_B__Const; // 0xE4(0x4)(Edit, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_MathVectorClampLength_MinimumLength__Const; // 0xE8(0x4)(Edit, ConstParm, ExportObject, Net, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Divide_A__Const;     // 0xEC(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        ToBoneSpace___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0xF0(0xC)(Edit, ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              ToBoneSpace___ToBoneSpace_GetTransform_Space__Const; // 0xFC(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         ToBoneSpace___ToBoneSpace_GetTransform_bInitial__Const; // 0xFD(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AC5[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Add_1_A__Const; // 0x100(0x4)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        ToBoneSpace_2_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x104(0xC)(BlueprintVisible, Net, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              ToBoneSpace_2_1___ToBoneSpace_GetTransform_Space__Const; // 0x110(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	bool                                         ToBoneSpace_2_1___ToBoneSpace_GetTransform_bInitial__Const; // 0x111(0x1)(ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AC7[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Divide_1_A__Const; // 0x114(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Multiply_B__Const; // 0x118(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3AC8[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_7_B__Const; // 0x120(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_SourceMinimum__Const; // 0x128(0x8)(Edit, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_SourceMaximum__Const; // 0x130(0x8)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_TargetMinimum__Const; // 0x138(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_TargetMaximum__Const; // 0x140(0x8)(Edit, ConstParm, Net, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	bool                                         SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_bClamp__Const; // 0x148(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AC9[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_2_B__Const; // 0x14C(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_MathVectorClampLength_MinimumLength__Const; // 0x150(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_A__Const; // 0x154(0x4)(Edit, BlueprintVisible, ExportObject, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        FromBoneSpace_1___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x158(0xC)(ConstParm, Net, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              FromBoneSpace_1___FromBoneSpace_GetTransform_Space__Const; // 0x164(0x1)(Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         FromBoneSpace_1___FromBoneSpace_GetTransform_bInitial__Const; // 0x165(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3ACA[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        ToBoneSpace_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x168(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              ToBoneSpace_1___ToBoneSpace_GetTransform_Space__Const; // 0x174(0x1)(ConstParm, BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         ToBoneSpace_1___ToBoneSpace_GetTransform_bInitial__Const; // 0x175(0x1)(Net, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3ACB[0xA];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_2___BoneArraySpringSolver_Set_Transform_1_Value__Const; // 0x180(0x60)(Edit, ConstParm, BlueprintVisible, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        FromBoneSpace___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x1E0(0xC)(ExportObject, BlueprintReadOnly, Net, ZeroConstructor, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              FromBoneSpace___FromBoneSpace_GetTransform_Space__Const; // 0x1EC(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         FromBoneSpace___FromBoneSpace_GetTransform_bInitial__Const; // 0x1ED(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         BoneArraySpringSolver_2___BoneArraySpringSolver_Set_Transform_1_bPropagateToChildren__Const; // 0x1EE(0x1)(ConstParm, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3ACC[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        RigVMModel___BoneArraySpringSolver_3_MaximumSpringLength__Const; // 0x1F0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3ACD[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___BoneArraySpringSolver_3_ConstrainLengthMax__Const; // 0x1F8(0x8)(ConstParm, ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	double                                       RigVMModel___BoneArraySpringSolver_3_BonesLookAtParentAlpha__Const; // 0x200(0x8)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector                               LocalVariableDefault__BoneArraySpringSolver_PrevPos__Const; // 0x208(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               LocalVariableDefault__BoneArraySpringSolver_BonePosition__Const; // 0x220(0x18)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_Space__Const; // 0x238(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_bInitial__Const; // 0x239(0x1)(Edit, EditFixedSize, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3ACE[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_IsNearlyZero_Tolerance__Const; // 0x23C(0x4)(ConstParm, Net, EditFixedSize, Config, InstancedReference, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Multiply_7_B__Const; // 0x240(0x8)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_1_Add_1_1_B__Const; // 0x248(0x18)(ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_SourceMinimum__Const; // 0x260(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_SourceMaximum__Const; // 0x268(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_TargetMinimum__Const; // 0x270(0x8)(ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_TargetMaximum__Const; // 0x278(0x8)(BlueprintVisible, Parm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	bool                                         SpringSolver_0___SpringSolver_Remap_1_bClamp__Const; // 0x280(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AD0[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        SpringSolver_0___SpringSolver_Multiply_2_B__Const; // 0x284(0x4)(Edit, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_MathVectorClampLength_MinimumLength__Const; // 0x288(0x4)(Edit, ConstParm, ExportObject, Net, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Divide_A__Const;     // 0x28C(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        ToBoneSpace___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x290(0xC)(Edit, ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              ToBoneSpace___ToBoneSpace_GetTransform_Space__Const; // 0x29C(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         ToBoneSpace___ToBoneSpace_GetTransform_bInitial__Const; // 0x29D(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AD2[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Add_1_A__Const; // 0x2A0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        ToBoneSpace_2_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x2A4(0xC)(BlueprintVisible, Net, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              ToBoneSpace_2_1___ToBoneSpace_GetTransform_Space__Const; // 0x2B0(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	bool                                         ToBoneSpace_2_1___ToBoneSpace_GetTransform_bInitial__Const; // 0x2B1(0x1)(ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AD3[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Divide_1_A__Const; // 0x2B4(0x4)(BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Multiply_B__Const; // 0x2B8(0x4)(ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3AD4[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_7_B__Const; // 0x2C0(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_SourceMinimum__Const; // 0x2C8(0x8)(Edit, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_SourceMaximum__Const; // 0x2D0(0x8)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_TargetMinimum__Const; // 0x2D8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_TargetMaximum__Const; // 0x2E0(0x8)(Edit, ConstParm, Net, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	bool                                         SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_bClamp__Const; // 0x2E8(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AD6[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_2_B__Const; // 0x2EC(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_MathVectorClampLength_MinimumLength__Const; // 0x2F0(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_A__Const; // 0x2F4(0x4)(Edit, BlueprintVisible, ExportObject, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        FromBoneSpace_1___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x2F8(0xC)(ConstParm, Net, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              FromBoneSpace_1___FromBoneSpace_GetTransform_Space__Const; // 0x304(0x1)(Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         FromBoneSpace_1___FromBoneSpace_GetTransform_bInitial__Const; // 0x305(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AD8[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        ToBoneSpace_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x308(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              ToBoneSpace_1___ToBoneSpace_GetTransform_Space__Const; // 0x314(0x1)(ConstParm, BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         ToBoneSpace_1___ToBoneSpace_GetTransform_bInitial__Const; // 0x315(0x1)(Net, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AD9[0xA];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_3___BoneArraySpringSolver_Set_Transform_1_Value__Const; // 0x320(0x60)(Edit, OutParm, Transient, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        FromBoneSpace___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x380(0xC)(ExportObject, BlueprintReadOnly, Net, ZeroConstructor, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              FromBoneSpace___FromBoneSpace_GetTransform_Space__Const; // 0x38C(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         FromBoneSpace___FromBoneSpace_GetTransform_bInitial__Const; // 0x38D(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         BoneArraySpringSolver_3___BoneArraySpringSolver_Set_Transform_1_bPropagateToChildren__Const; // 0x38E(0x1)(ExportObject, Net, OutParm, Transient, Config, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class URigVMMemory_Literal* GetDefaultObj();

};

// 0x1E60 (0x1E88 - 0x28)
// RigVMMemoryStorageGeneratorClass Female_Hair_Mohawk_Mid_CtrlRig.RigVMMemory_Work
class URigVMMemory_Work : public URigVMMemoryStorage
{
public:
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_Items__IO;          // 0x28(0x10)(Edit, ConstParm, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<float>                                RigVMModel___BoneArraySpringSolver_2_SpringStrength; // 0x38(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	TArray<float>                                RigVMModel___BoneArraySpringSolver_2_SpringDamping; // 0x48(0x10)(ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3ADB[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_Transform; // 0x60(0x60)(BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0xC0(0xC)(ConstParm, EditFixedSize, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3ADC[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_CachedIndex; // 0xD0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               LocalVariable__BoneArraySpringSolver_BonePosition; // 0xE0(0x18)(Edit, ConstParm, ExportObject, Net, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	bool                                         BoneArraySpringSolver_2___BoneArraySpringSolver_IsNearlyZero_Result; // 0xF8(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3ADD[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_Element; // 0x100(0x18)(ConstParm, BlueprintVisible, EditFixedSize, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	int32                                        BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x118(0x4)(ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3ADE[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_To_World_1_World; // 0x120(0x18)(Edit, ExportObject, EditFixedSize, Parm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_Element; // 0x138(0x4)(ExportObject, Net, EditFixedSize, Parm, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Element; // 0x13C(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_To_World_2_World; // 0x140(0x18)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x158(0x18)(ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolver_0_Strength; // 0x170(0x8)(Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolver_0_Damping; // 0x178(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolver_0_Out; // 0x180(0x18)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolver_0_Velocity; // 0x198(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_7_Element; // 0x1B0(0x18)(BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Entry_Maximum_Length; // 0x1C8(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3ADF[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolver_0___SpringSolver_Return_Velocity;     // 0x1D0(0x18)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Entry_VelocityIn;    // 0x1E8(0x18)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_MathVectorClampLength_Result; // 0x200(0x18)(ConstParm, Net, Parm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Subtract_1_2_Result; // 0x218(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_9_1_Result;      // 0x230(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Scale_3_Result;      // 0x248(0x18)(Edit, ExportObject, Net, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_1_Add_1_1_Result; // 0x260(0x18)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_1_Add_1_Result;  // 0x278(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Scale_Result;        // 0x290(0x18)(Edit, ConstParm, BlueprintVisible, Net, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Subtract_Result;     // 0x2A8(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Multiply_1_Result;   // 0x2C0(0x8)(BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Multiply_7_Result;   // 0x2C8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_GetDeltaTime_3_2_1_Result; // 0x2D0(0x4)(Edit, Net, EditFixedSize, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AE2[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Multiply_1_B;        // 0x2D8(0x8)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Scale_Factor;        // 0x2E0(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AE3[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Multiply_6_Result;   // 0x2E8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_GetDeltaTime_3_Result; // 0x2F0(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AE4[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Multiply_6_A;        // 0x2F8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Power_1_Result;      // 0x300(0x8)(ConstParm, ExportObject, Net, Parm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_Result;      // 0x308(0x8)(Edit, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Multiply_2_Result;   // 0x310(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AE5[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Power_1_B;           // 0x318(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Scale_3_Factor;      // 0x320(0x4)(ConstParm, Net, Parm, OutParm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AE6[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolver_0___SpringSolver_Subtract_1_Result;   // 0x328(0x18)(Edit, ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Divide_Result;       // 0x340(0x4)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_RigVMFunction_GetDeltaTime_Result; // 0x344(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         BoneArraySpringSolver_2___BoneArraySpringSolver_IsNearlyZero_1_Result; // 0x348(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3AE8[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_1_Element; // 0x350(0x18)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_ToBoneSpace_RootSpaceResult; // 0x368(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         ToBoneSpace___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x380(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AE9[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ToBoneSpace___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x388(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace___ToBoneSpace_Inverse_Result;          // 0x3A0(0x60)(Edit, ConstParm, EditFixedSize, ReturnParm, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace___ToBoneSpace_GetTransform_Transform;  // 0x400(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             ToBoneSpace___ToBoneSpace_GetTransform_CachedIndex; // 0x460(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_4_Element; // 0x470(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolverGlobal_0_Strength; // 0x488(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolverGlobal_0_Damping; // 0x490(0x8)(Edit, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolverGlobal_0_Out; // 0x498(0x18)(ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Cast_Result; // 0x4B0(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Add_1_Result; // 0x4C8(0x4)(BlueprintVisible, Net, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3AEB[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Scale_1_1_Result; // 0x4D0(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_ToBoneSpace_2_1_RootSpaceResult; // 0x4E8(0x18)(Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_1_Result; // 0x500(0x18)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_From_World_Global; // 0x518(0x18)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_Element; // 0x530(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_5_Element; // 0x548(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	bool                                         ToBoneSpace_2_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x560(0x1)(Edit, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AED[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ToBoneSpace_2_1___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x568(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_2_1___ToBoneSpace_Inverse_Result;      // 0x580(0x60)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_2_1___ToBoneSpace_GetTransform_Transform; // 0x5E0(0x60)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             ToBoneSpace_2_1___ToBoneSpace_GetTransform_CachedIndex; // 0x640(0x10)(Edit, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Multiply_Result; // 0x650(0x4)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Divide_1_Result; // 0x654(0x4)(BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_RigVMFunction_GetDeltaTime_1_Result; // 0x658(0x4)(ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3AEF[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_8_Element; // 0x660(0x18)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolverGlobal_0_VelocityGlobal; // 0x678(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Entry_Maximum_Length; // 0x690(0x4)(ConstParm, BlueprintVisible, Net, OutParm, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AF0[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Entry_VelocityIn; // 0x698(0x18)(Edit, BlueprintReadOnly, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Return_VelocityGlobal; // 0x6B0(0x18)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_MathVectorClampLength_Result; // 0x6C8(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_2_Result; // 0x6E0(0x18)(ExportObject, Net, EditFixedSize, Parm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Add_9_1_Result; // 0x6F8(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Result; // 0x710(0x18)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_1_Result; // 0x728(0x18)(Edit, ConstParm, Parm, OutParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_Result; // 0x740(0x18)(BlueprintVisible, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Multiply_Result; // 0x758(0x18)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Scale_Result; // 0x770(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Subtract_Result; // 0x788(0x18)(ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_1_Result; // 0x7A0(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_7_Result; // 0x7A8(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_GetDeltaTime_3_2_1_Result; // 0x7B0(0x4)(Edit, ConstParm, Net, Parm, OutParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AF2[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_1_B; // 0x7B8(0x8)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Scale_Factor; // 0x7C0(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AF3[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_Result; // 0x7C8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_GetDeltaTime_3_Result; // 0x7D0(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AF4[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_A; // 0x7D8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Power_1_Result; // 0x7E0(0x8)(ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_Result; // 0x7E8(0x8)(BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_2_Result; // 0x7F0(0x4)(Edit, BlueprintVisible, Net, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AF5[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Power_1_B; // 0x7F8(0x8)(ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Factor; // 0x800(0x4)(Edit, BlueprintVisible, ExportObject, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AF6[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_Result; // 0x808(0x18)(Edit, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_Result; // 0x820(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_RigVMFunction_GetDeltaTime_Result; // 0x824(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AF7[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_2_Transform; // 0x830(0x60)(ConstParm, BlueprintVisible, ExportObject, OutParm, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_2___BoneArraySpringSolver_HierarchyGetParent_Parent; // 0x890(0xC)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3AF8[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_2___BoneArraySpringSolver_HierarchyGetParent_CachedChild; // 0x8A0(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_2___BoneArraySpringSolver_HierarchyGetParent_CachedParent; // 0x8B0(0x10)(Edit, BlueprintReadOnly, Parm, ReturnParm, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_2_CachedIndex; // 0x8C0(0x10)(BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_Result; // 0x8D0(0x18)(BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_FromBoneSpace_1_BoneSpacePosition; // 0x8E8(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         FromBoneSpace_1___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x900(0x1)(Edit, ConstParm, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3AFB[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FromBoneSpace_1___FromBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x908(0x18)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	struct FTransform                            FromBoneSpace_1___FromBoneSpace_GetTransform_Transform; // 0x920(0x60)(ExportObject, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             FromBoneSpace_1___FromBoneSpace_GetTransform_CachedIndex; // 0x980(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_B; // 0x990(0x18)(Edit, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_If_Result; // 0x9A8(0x18)(ConstParm, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_ToBoneSpace_1_RootSpaceResult; // 0x9C0(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Add_Result; // 0x9D8(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Scale_Result; // 0x9F0(0x18)(ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Unit_Result; // 0xA08(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Multiply_2_Result; // 0xA20(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Clamp_Result; // 0xA24(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Divide_Result; // 0xA28(0x4)(BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_RigVMFunction_MathVectorLength_1_Result; // 0xA2C(0x4)(BlueprintVisible, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_RigVMFunction_MathVectorLength_Result; // 0xA30(0x4)(ConstParm, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3AFE[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_2_Result; // 0xA38(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FTransform                            BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_2_1_1_Transform; // 0xA50(0x60)(Edit, BlueprintVisible, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_2_1_1_CachedIndex; // 0xAB0(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_2_A; // 0xAC0(0x18)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3AFF[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_2_1_Transform; // 0xAE0(0x60)(ConstParm, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_2___BoneArraySpringSolver_HierarchyGetParent_1_Parent; // 0xB40(0xC)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3B00[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_2___BoneArraySpringSolver_HierarchyGetParent_1_CachedChild; // 0xB50(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_2___BoneArraySpringSolver_HierarchyGetParent_1_CachedParent; // 0xB60(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_2_1_CachedIndex; // 0xB70(0x10)(Edit, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_2_B; // 0xB80(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Clamp_Minimum; // 0xB98(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Clamp_Maximum; // 0xB9C(0x4)(BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         ToBoneSpace_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0xBA0(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B02[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ToBoneSpace_1___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0xBA8(0x18)(Edit, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_1___ToBoneSpace_Inverse_Result;        // 0xBC0(0x60)(ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_1___ToBoneSpace_GetTransform_Transform; // 0xC20(0x60)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             ToBoneSpace_1___ToBoneSpace_GetTransform_CachedIndex; // 0xC80(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_From_World_2_2_Global; // 0xC90(0x18)(Edit, BlueprintVisible, Net, Parm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_1_Element; // 0xCA8(0x18)(Edit, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_If_1_Result; // 0xCC0(0x20)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_2___BoneArraySpringSolver_Multiply_1_Result; // 0xCE0(0x20)(ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_2___BoneArraySpringSolver_Scale_1_Result; // 0xD00(0x20)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_2___BoneArraySpringSolver_QuatBetweenDirections_0_Quat; // 0xD20(0x20)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_3_Result; // 0xD40(0x18)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3B06[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 QuatBetweenDirections_0___QuatBetweenDirections_MathQuaternionFromAxisAndAngle_Result; // 0xD60(0x20)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_Unit_2_Result; // 0xD80(0x18)(OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_MathVectorCross_Result; // 0xD98(0x18)(Edit, Net, EditFixedSize, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_Unit_1_Result; // 0xDB0(0x18)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_Unit_Result; // 0xDC8(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       QuatBetweenDirections_0___QuatBetweenDirections_Acos_Result; // 0xDE0(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        QuatBetweenDirections_0___QuatBetweenDirections_Dot___Result; // 0xDE8(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B07[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       QuatBetweenDirections_0___QuatBetweenDirections_Acos_Value; // 0xDF0(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        QuatBetweenDirections_0___QuatBetweenDirections_MathQuaternionFromAxisAndAngle_Angle; // 0xDF8(0x4)(BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Scale_1_Factor; // 0xDFC(0x4)(ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_2___BoneArraySpringSolver_Multiply_1_B; // 0xE00(0x20)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_2___BoneArraySpringSolver_FromBoneSpace_BoneSpacePosition; // 0xE20(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         FromBoneSpace___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0xE38(0x1)(Edit, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B09[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FromBoneSpace___FromBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0xE40(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B0A[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            FromBoneSpace___FromBoneSpace_GetTransform_Transform; // 0xE60(0x60)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             FromBoneSpace___FromBoneSpace_GetTransform_CachedIndex; // 0xEC0(0x10)(Edit, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            BoneArraySpringSolver_2___BoneArraySpringSolver_Set_Transform_1_Value__IO; // 0xED0(0x60)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_10_Element; // 0xF30(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Transient, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_Set_Transform_1_Weight; // 0xF38(0x4)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3B0C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_2___BoneArraySpringSolver_Set_Transform_1_CachedIndex; // 0xF40(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	class FName                                  BoneArraySpringSolver_2___BoneArraySpringSolver_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0xF50(0x8)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	class FName                                  BoneArraySpringSolver_2___BoneArraySpringSolver_RigVMFunction_ControlFlowBranch_BlockToRun; // 0xF58(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	int32                                        BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0xF60(0x4)(ConstParm, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0xF64(0x4)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	class FName                                  BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0xF68(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FTransform                            BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_Transform; // 0xF70(0x60)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0xFD0(0xC)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3B12[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_CachedIndex; // 0xFE0(0x10)(ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	struct FVector                               LocalVariable__BoneArraySpringSolver_BonePosition; // 0xFF0(0x18)(Edit, ConstParm, ExportObject, Net, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	bool                                         BoneArraySpringSolver_3___BoneArraySpringSolver_IsNearlyZero_Result; // 0x1008(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3B13[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_Element; // 0x1010(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	int32                                        BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x1028(0x4)(ConstParm, BlueprintVisible, Net, Parm, OutParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3B14[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_To_World_1_World; // 0x1030(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_Element; // 0x1048(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Element; // 0x104C(0x4)(Edit, ConstParm, BlueprintVisible, Parm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_To_World_2_World; // 0x1050(0x18)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x1068(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, Transient, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolver_0_Strength; // 0x1080(0x8)(BlueprintVisible, ExportObject, Net, Transient, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolver_0_Damping; // 0x1088(0x8)(ConstParm, ExportObject, Net, EditFixedSize, Parm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolver_0_Out; // 0x1090(0x18)(BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolver_0_Velocity; // 0x10A8(0x18)(Edit, ExportObject, BlueprintReadOnly, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_7_Element; // 0x10C0(0x18)(ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Entry_Maximum_Length; // 0x10D8(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B15[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolver_0___SpringSolver_Return_Velocity;     // 0x10E0(0x18)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Entry_VelocityIn;    // 0x10F8(0x18)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_MathVectorClampLength_Result; // 0x1110(0x18)(ConstParm, Net, Parm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Subtract_1_2_Result; // 0x1128(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_9_1_Result;      // 0x1140(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Scale_3_Result;      // 0x1158(0x18)(Edit, ExportObject, Net, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_1_Add_1_1_Result; // 0x1170(0x18)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_1_Add_1_Result;  // 0x1188(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Scale_Result;        // 0x11A0(0x18)(Edit, ConstParm, BlueprintVisible, Net, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Subtract_Result;     // 0x11B8(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Multiply_1_Result;   // 0x11D0(0x8)(BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Multiply_7_Result;   // 0x11D8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_GetDeltaTime_3_2_1_Result; // 0x11E0(0x4)(Edit, Net, EditFixedSize, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B17[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Multiply_1_B;        // 0x11E8(0x8)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Scale_Factor;        // 0x11F0(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B18[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Multiply_6_Result;   // 0x11F8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_GetDeltaTime_3_Result; // 0x1200(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B1A[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Multiply_6_A;        // 0x1208(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Power_1_Result;      // 0x1210(0x8)(ConstParm, ExportObject, Net, Parm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_Result;      // 0x1218(0x8)(Edit, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Multiply_2_Result;   // 0x1220(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B1C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Power_1_B;           // 0x1228(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Scale_3_Factor;      // 0x1230(0x4)(ConstParm, Net, Parm, OutParm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B1E[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolver_0___SpringSolver_Subtract_1_Result;   // 0x1238(0x18)(Edit, ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Divide_Result;       // 0x1250(0x4)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_RigVMFunction_GetDeltaTime_Result; // 0x1254(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         BoneArraySpringSolver_3___BoneArraySpringSolver_IsNearlyZero_1_Result; // 0x1258(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3B20[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_1_Element; // 0x1260(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_ToBoneSpace_RootSpaceResult; // 0x1278(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         ToBoneSpace___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x1290(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B21[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ToBoneSpace___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x1298(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace___ToBoneSpace_Inverse_Result;          // 0x12B0(0x60)(Edit, ConstParm, EditFixedSize, ReturnParm, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace___ToBoneSpace_GetTransform_Transform;  // 0x1310(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             ToBoneSpace___ToBoneSpace_GetTransform_CachedIndex; // 0x1370(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_4_Element; // 0x1380(0x18)(BlueprintVisible, ExportObject, Parm, OutParm, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolverGlobal_0_Strength; // 0x1398(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolverGlobal_0_Damping; // 0x13A0(0x8)(BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolverGlobal_0_Out; // 0x13A8(0x18)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Cast_Result; // 0x13C0(0x18)(BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Add_1_Result; // 0x13D8(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3B22[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Scale_1_1_Result; // 0x13E0(0x18)(Edit, ConstParm, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_ToBoneSpace_2_1_RootSpaceResult; // 0x13F8(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_1_Result; // 0x1410(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_From_World_Global; // 0x1428(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_Element; // 0x1440(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_5_Element; // 0x1458(0x18)(Edit, ConstParm, EditFixedSize, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         ToBoneSpace_2_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x1470(0x1)(Edit, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B23[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ToBoneSpace_2_1___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x1478(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_2_1___ToBoneSpace_Inverse_Result;      // 0x1490(0x60)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_2_1___ToBoneSpace_GetTransform_Transform; // 0x14F0(0x60)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             ToBoneSpace_2_1___ToBoneSpace_GetTransform_CachedIndex; // 0x1550(0x10)(Edit, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Multiply_Result; // 0x1560(0x4)(ConstParm, BlueprintVisible, Parm, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Divide_1_Result; // 0x1564(0x4)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_RigVMFunction_GetDeltaTime_1_Result; // 0x1568(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3B24[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_8_Element; // 0x1570(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolverGlobal_0_VelocityGlobal; // 0x1588(0x18)(BlueprintReadOnly, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Entry_Maximum_Length; // 0x15A0(0x4)(ConstParm, BlueprintVisible, Net, OutParm, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B25[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Entry_VelocityIn; // 0x15A8(0x18)(Edit, BlueprintReadOnly, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Return_VelocityGlobal; // 0x15C0(0x18)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_MathVectorClampLength_Result; // 0x15D8(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_2_Result; // 0x15F0(0x18)(ExportObject, Net, EditFixedSize, Parm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Add_9_1_Result; // 0x1608(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Result; // 0x1620(0x18)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_1_Result; // 0x1638(0x18)(Edit, ConstParm, Parm, OutParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_Result; // 0x1650(0x18)(BlueprintVisible, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Multiply_Result; // 0x1668(0x18)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Scale_Result; // 0x1680(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Subtract_Result; // 0x1698(0x18)(ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_1_Result; // 0x16B0(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_7_Result; // 0x16B8(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_GetDeltaTime_3_2_1_Result; // 0x16C0(0x4)(Edit, ConstParm, Net, Parm, OutParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B26[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_1_B; // 0x16C8(0x8)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Scale_Factor; // 0x16D0(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B27[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_Result; // 0x16D8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_GetDeltaTime_3_Result; // 0x16E0(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B28[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_A; // 0x16E8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Power_1_Result; // 0x16F0(0x8)(ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_Result; // 0x16F8(0x8)(BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_2_Result; // 0x1700(0x4)(Edit, BlueprintVisible, Net, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B29[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Power_1_B; // 0x1708(0x8)(ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Factor; // 0x1710(0x4)(Edit, BlueprintVisible, ExportObject, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B2A[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_Result; // 0x1718(0x18)(Edit, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_Result; // 0x1730(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_RigVMFunction_GetDeltaTime_Result; // 0x1734(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B2C[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_2_Transform; // 0x1740(0x60)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_3___BoneArraySpringSolver_HierarchyGetParent_Parent; // 0x17A0(0xC)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3B2D[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_3___BoneArraySpringSolver_HierarchyGetParent_CachedChild; // 0x17B0(0x10)(ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_3___BoneArraySpringSolver_HierarchyGetParent_CachedParent; // 0x17C0(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_2_CachedIndex; // 0x17D0(0x10)(BlueprintVisible, ExportObject, Net, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_Result; // 0x17E0(0x18)(Edit, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_FromBoneSpace_1_BoneSpacePosition; // 0x17F8(0x18)(Edit, ConstParm, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         FromBoneSpace_1___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x1810(0x1)(Edit, ConstParm, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B2E[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FromBoneSpace_1___FromBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x1818(0x18)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	struct FTransform                            FromBoneSpace_1___FromBoneSpace_GetTransform_Transform; // 0x1830(0x60)(ExportObject, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             FromBoneSpace_1___FromBoneSpace_GetTransform_CachedIndex; // 0x1890(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_B; // 0x18A0(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_If_Result; // 0x18B8(0x18)(Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_ToBoneSpace_1_RootSpaceResult; // 0x18D0(0x18)(EditFixedSize, Parm, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Add_Result; // 0x18E8(0x18)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Scale_Result; // 0x1900(0x18)(BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Unit_Result; // 0x1918(0x18)(Net, EditFixedSize, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Multiply_2_Result; // 0x1930(0x4)(ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Clamp_Result; // 0x1934(0x4)(ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Divide_Result; // 0x1938(0x4)(ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_RigVMFunction_MathVectorLength_1_Result; // 0x193C(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_RigVMFunction_MathVectorLength_Result; // 0x1940(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3B30[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_2_Result; // 0x1948(0x18)(BlueprintVisible, Net, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FTransform                            BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_2_1_1_Transform; // 0x1960(0x60)(ConstParm, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_2_1_1_CachedIndex; // 0x19C0(0x10)(Edit, BlueprintVisible, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_2_A; // 0x19D0(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3B31[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_2_1_Transform; // 0x19F0(0x60)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_3___BoneArraySpringSolver_HierarchyGetParent_1_Parent; // 0x1A50(0xC)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3B32[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_3___BoneArraySpringSolver_HierarchyGetParent_1_CachedChild; // 0x1A60(0x10)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_3___BoneArraySpringSolver_HierarchyGetParent_1_CachedParent; // 0x1A70(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_2_1_CachedIndex; // 0x1A80(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_2_B; // 0x1A90(0x18)(ConstParm, ExportObject, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Clamp_Minimum; // 0x1AA8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Clamp_Maximum; // 0x1AAC(0x4)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	bool                                         ToBoneSpace_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x1AB0(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B33[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ToBoneSpace_1___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x1AB8(0x18)(Edit, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_1___ToBoneSpace_Inverse_Result;        // 0x1AD0(0x60)(ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_1___ToBoneSpace_GetTransform_Transform; // 0x1B30(0x60)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             ToBoneSpace_1___ToBoneSpace_GetTransform_CachedIndex; // 0x1B90(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_From_World_2_2_Global; // 0x1BA0(0x18)(Edit, ConstParm, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_1_Element; // 0x1BB8(0x18)(Net, EditFixedSize, Parm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_If_1_Result; // 0x1BD0(0x20)(ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_3___BoneArraySpringSolver_Multiply_1_Result; // 0x1BF0(0x20)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_3___BoneArraySpringSolver_Scale_1_Result; // 0x1C10(0x20)(BlueprintVisible, ExportObject, Transient, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_3___BoneArraySpringSolver_QuatBetweenDirections_0_Quat; // 0x1C30(0x20)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_3_Result; // 0x1C50(0x18)(Edit, Net, EditFixedSize, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3B34[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 QuatBetweenDirections_0___QuatBetweenDirections_MathQuaternionFromAxisAndAngle_Result; // 0x1C70(0x20)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_Unit_2_Result; // 0x1C90(0x18)(OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_MathVectorCross_Result; // 0x1CA8(0x18)(Edit, Net, EditFixedSize, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_Unit_1_Result; // 0x1CC0(0x18)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_Unit_Result; // 0x1CD8(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       QuatBetweenDirections_0___QuatBetweenDirections_Acos_Result; // 0x1CF0(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        QuatBetweenDirections_0___QuatBetweenDirections_Dot___Result; // 0x1CF8(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B35[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       QuatBetweenDirections_0___QuatBetweenDirections_Acos_Value; // 0x1D00(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        QuatBetweenDirections_0___QuatBetweenDirections_MathQuaternionFromAxisAndAngle_Angle; // 0x1D08(0x4)(BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Scale_1_Factor; // 0x1D0C(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_3___BoneArraySpringSolver_Multiply_1_B; // 0x1D10(0x20)(ConstParm, BlueprintVisible, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_3___BoneArraySpringSolver_FromBoneSpace_BoneSpacePosition; // 0x1D30(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	bool                                         FromBoneSpace___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x1D48(0x1)(Edit, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B36[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FromBoneSpace___FromBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x1D50(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3B37[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            FromBoneSpace___FromBoneSpace_GetTransform_Transform; // 0x1D70(0x60)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             FromBoneSpace___FromBoneSpace_GetTransform_CachedIndex; // 0x1DD0(0x10)(Edit, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            BoneArraySpringSolver_3___BoneArraySpringSolver_Set_Transform_1_Value__IO; // 0x1DE0(0x60)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Config, InstancedReference, SubobjectReference)
	double                                       BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_10_Element; // 0x1E40(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_Set_Transform_1_Weight; // 0x1E48(0x4)(BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_3B38[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_3___BoneArraySpringSolver_Set_Transform_1_CachedIndex; // 0x1E50(0x10)(Edit, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	class FName                                  BoneArraySpringSolver_3___BoneArraySpringSolver_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x1E60(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	class FName                                  BoneArraySpringSolver_3___BoneArraySpringSolver_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x1E68(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	int32                                        BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x1E70(0x4)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x1E74(0x4)(ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	class FName                                  BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x1E78(0x8)(ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_BlockToRun; // 0x1E80(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)

	static class UClass* StaticClass();
	static class URigVMMemory_Work* GetDefaultObj();

};

}


