#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x13F (0x140 - 0x1)
// ScriptStruct FPVMeleeWeaponAnimBP_Base.FPVMeleeWeaponAnimBP_Base_C.AnimBlueprintGeneratedConstantData
struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                        Pad_52F9[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  __NameProperty_142;                                // 0x4(0x8)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, ContainsInstancedReference)
	class FName                                  __NameProperty_143;                                // 0xC(0x8)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, NoDestructor, ContainsInstancedReference)
	class FName                                  __NameProperty_144;                                // 0x14(0x8)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, RepNotify, NoDestructor, ContainsInstancedReference)
	int32                                        __IntProperty_145;                                 // 0x1C(0x4)(ConstParm, ExportObject, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, Interp, NoDestructor, ContainsInstancedReference)
	class FName                                  __NameProperty_146;                                // 0x20(0x8)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NoDestructor, ContainsInstancedReference)
	int32                                        __IntProperty_147;                                 // 0x28(0x4)(ConstParm, ExportObject, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, NonTransactional, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_148;                                // 0x2C(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, NoDestructor, ContainsInstancedReference)
	uint8                                        Pad_52FA[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  __NameProperty_149;                                // 0x30(0x8)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, NoDestructor, ContainsInstancedReference)
	int32                                        __IntProperty_150;                                 // 0x38(0x4)(ConstParm, ExportObject, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, ContainsInstancedReference)
	class FName                                  __NameProperty_151;                                // 0x3C(0x8)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor, ContainsInstancedReference)
	float                                        __FloatProperty_152;                               // 0x44(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor, ContainsInstancedReference)
	struct FInputScaleBiasClampConstants         __StructProperty_153;                              // 0x48(0x2C)(ConstParm, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor, ContainsInstancedReference)
	float                                        __FloatProperty_154;                               // 0x74(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, ContainsInstancedReference)
	bool                                         __BoolProperty_155;                                // 0x78(0x1)(BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	enum class EAnimSyncMethod                   __EnumProperty_156;                                // 0x79(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	enum class EAnimGroupRole                    __ByteProperty_157;                                // 0x7A(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	uint8                                        Pad_52FB[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  __NameProperty_158;                                // 0x7C(0x8)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, ContainsInstancedReference)
	uint8                                        Pad_52FC[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnimNodeFunctionRef                  __StructProperty_159;                              // 0x88(0x20)(ConstParm, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference, ContainsInstancedReference)
	struct FAnimSubsystem_PropertyAccess         AnimBlueprintExtension_PropertyAccess;             // 0xA8(0x80)(ConstParm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FAnimSubsystem_Base                   AnimBlueprintExtension_Base;                       // 0x128(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
};

// 0x0 (0x1 - 0x1)
// ScriptStruct FPVMeleeWeaponAnimBP_Base.FPVMeleeWeaponAnimBP_Base_C.AnimBlueprintGeneratedMutableData
struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
public:
};

}


