#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x20F (0x210 - 0x1)
// ScriptStruct FPVWeaponAnimBP_Base_Carrying.FPVWeaponAnimBP_Base_Carrying_C.AnimBlueprintGeneratedConstantData
struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                        Pad_4639[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  __NameProperty_471;                                // 0x4(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	class FName                                  __NameProperty_472;                                // 0xC(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	int32                                        __IntProperty_473;                                 // 0x14(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	class FName                                  __NameProperty_474;                                // 0x18(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	int32                                        __IntProperty_475;                                 // 0x20(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	class FName                                  __NameProperty_476;                                // 0x24(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	int32                                        __IntProperty_477;                                 // 0x2C(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	enum class EAlphaBlendOption                 __EnumProperty_478;                                // 0x30(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	uint8                                        Pad_463A[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  __NameProperty_479;                                // 0x34(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	int32                                        __IntProperty_480;                                 // 0x3C(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	class FName                                  __NameProperty_481;                                // 0x40(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	int32                                        __IntProperty_482;                                 // 0x48(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	class FName                                  __NameProperty_483;                                // 0x4C(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	uint8                                        Pad_463B[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                __ArrayProperty_484;                               // 0x58(0x10)(Edit, BlueprintVisible, Net, ZeroConstructor, ReturnParm, EditConst, SubobjectReference, RepNotify, NonTransactional, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	class FName                                  __NameProperty_485;                                // 0x68(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, NonTransactional, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	TArray<float>                                __ArrayProperty_486;                               // 0x70(0x10)(Edit, BlueprintVisible, Net, ZeroConstructor, ReturnParm, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	enum class EAlphaBlendOption                 __EnumProperty_487;                                // 0x80(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference, EditorOnly, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	uint8                                        Pad_463E[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                __ArrayProperty_488;                               // 0x88(0x10)(Edit, BlueprintVisible, Net, ZeroConstructor, ReturnParm, EditConst, SubobjectReference, RepNotify, EditorOnly, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	enum class EAnimSyncMethod                   __EnumProperty_489;                                // 0x98(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference, Interp, EditorOnly, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	uint8                                        Pad_463F[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  __NameProperty_490;                                // 0x9C(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, EditorOnly, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	class FName                                  __NameProperty_491;                                // 0xA4(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, NonTransactional, EditorOnly, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	class FName                                  __NameProperty_492;                                // 0xAC(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, NonTransactional, EditorOnly, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	int32                                        __IntProperty_493;                                 // 0xB4(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	class FName                                  __NameProperty_494;                                // 0xB8(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	int32                                        __IntProperty_495;                                 // 0xC0(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	uint8                                        Pad_4640[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                __ArrayProperty_496;                               // 0xC8(0x10)(Edit, BlueprintVisible, Net, ZeroConstructor, ReturnParm, EditConst, SubobjectReference, RepNotify, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	TArray<float>                                __ArrayProperty_497;                               // 0xD8(0x10)(Edit, BlueprintVisible, Net, ZeroConstructor, ReturnParm, EditConst, SubobjectReference, Interp, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	class UBlendProfile*                         __BlendProfile_498;                                // 0xE8(0x8)(Edit, ConstParm, BlueprintReadOnly, ZeroConstructor, Transient, Config, EditConst, SubobjectReference, RepNotify, Interp, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	class UCurveFloat*                           __CurveFloat_499;                                  // 0xF0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, NonTransactional, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	enum class EAlphaBlendOption                 __EnumProperty_500;                                // 0xF8(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	enum class EBlendListTransitionType          __EnumProperty_501;                                // 0xF9(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference, Interp, NonTransactional, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	uint8                                        Pad_4642[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                __ArrayProperty_502;                               // 0x100(0x10)(Edit, BlueprintVisible, Net, ZeroConstructor, ReturnParm, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	bool                                         __BoolProperty_503;                                // 0x110(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	uint8                                        Pad_4643[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_504;                               // 0x114(0x4)(Edit, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference, RepNotify, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	struct FInputScaleBiasClampConstants         __StructProperty_505;                              // 0x118(0x2C)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, Interp, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	float                                        __FloatProperty_506;                               // 0x144(0x4)(Edit, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	bool                                         __BoolProperty_507;                                // 0x148(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	enum class EAnimSyncMethod                   __EnumProperty_508;                                // 0x149(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	enum class EAnimGroupRole                    __ByteProperty_509;                                // 0x14A(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	uint8                                        Pad_4645[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  __NameProperty_510;                                // 0x14C(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	uint8                                        Pad_4646[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnimNodeFunctionRef                  __StructProperty_511;                              // 0x158(0x20)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference, SimpleDisplay)
	struct FAnimSubsystem_PropertyAccess         AnimBlueprintExtension_PropertyAccess;             // 0x178(0x80)(Edit, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FAnimSubsystem_Base                   AnimBlueprintExtension_Base;                       // 0x1F8(0x18)(ConstParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
};

// 0x30 (0x31 - 0x1)
// ScriptStruct FPVWeaponAnimBP_Base_Carrying.FPVWeaponAnimBP_Base_Carrying_C.AnimBlueprintGeneratedMutableData
struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
public:
	bool                                         __BoolProperty;                                    // 0x1(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_4647[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_0;                                 // 0x4(0x4)(Edit, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference, RepNotify)
	bool                                         __BoolProperty_1;                                  // 0x8(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference, Interp)
	uint8                                        Pad_4648[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_2;                                 // 0xC(0x4)(Edit, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference, RepNotify, Interp)
	bool                                         __BoolProperty_3;                                  // 0x10(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference, NonTransactional)
	bool                                         __BoolProperty_4;                                  // 0x11(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference, RepNotify, NonTransactional)
	uint8                                        Pad_4649[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_5;                                 // 0x14(0x4)(Edit, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference, Interp, NonTransactional)
	bool                                         __BoolProperty_6;                                  // 0x18(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional)
	uint8                                        Pad_464A[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_7;                                 // 0x1C(0x4)(Edit, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference, EditorOnly)
	bool                                         __BoolProperty_8;                                  // 0x20(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference, RepNotify, EditorOnly)
	uint8                                        Pad_464B[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_9;                                 // 0x24(0x4)(Edit, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference, Interp, EditorOnly)
	bool                                         __BoolProperty_10;                                 // 0x28(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference, RepNotify, Interp, EditorOnly)
	bool                                         __BoolProperty_11;                                 // 0x29(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference, NonTransactional, EditorOnly)
	bool                                         __BoolProperty_12;                                 // 0x2A(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference, RepNotify, NonTransactional, EditorOnly)
	uint8                                        Pad_464C[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        __FloatProperty_13;                                // 0x2C(0x4)(Edit, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference, Interp, NonTransactional, EditorOnly)
	bool                                         __BoolProperty_14;                                 // 0x30(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference, RepNotify, Interp, NonTransactional, EditorOnly)
};

}


