#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x6C0 (0x7E8 - 0x128)
// BlueprintGeneratedClass GlobalUIData_BP.GlobalUIData_BP_C
class UGlobalUIData_BP_C : public UPrimalGlobalUIData
{
public:
	struct FHUDElement                           StruggleHUDElementTemplate;                        // 0x128(0x1B0)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FHUDRichTextOverlayData               StruggleHUDRichTextOverlay;                        // 0x2D8(0x70)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          StruggleHUDRichTextColor;                          // 0x348(0x10)(BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       StruggleHUDRichTextBlinkSpeed;                     // 0x358(0x8)(OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                DefaultStruggleHUDTextString;                      // 0x360(0x10)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FHUDElement                           FuelOrAmmoHUDElementTemplate;                      // 0x370(0x1B0)(BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       FuelOrAmmoSpaceBetweenSlots;                       // 0x520(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          FuelOrAmmoHUDTextColor_Default;                    // 0x528(0x10)(BlueprintVisible, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          FuelOrAmmoHUDTextColor_Low;                        // 0x538(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          FuelOrAmmoHUDTextColor_Critical;                   // 0x548(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          FuelOrAmmoHUDTextColor_Upgrade1;                   // 0x558(0x10)(ConstParm, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          FuelOrAmmoHUDTextColor_Upgrade2;                   // 0x568(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          FuelOrAmmoHUDBackgroundColor_Default;              // 0x578(0x10)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          FuelOrAmmoHUDBackgroundColor_Low;                  // 0x588(0x10)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          FuelOrAmmoHUDBackgroundColor_Critical;             // 0x598(0x10)(BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          FuelOrAmmoHUDBackgroundColor_Upgrade1;             // 0x5A8(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          FuelOrAmmoHUDBackgroundColor_Upgrade2;             // 0x5B8(0x10)(BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          FuelOrAmmoHUDForegroundColor_Default;              // 0x5C8(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          FuelOrAmmoHUDForegroundColor_Low;                  // 0x5D8(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          FuelOrAmmoHUDForegroundColor_Critical;             // 0x5E8(0x10)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          FuelOrAmmoHUDForegroundColor_Upgrade1;             // 0x5F8(0x10)(Edit, ConstParm, ExportObject, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          FuelOrAmmoHUDForegroundColor_Upgrade2;             // 0x608(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FHUDElement                           FuelOrAmmoExtraBarHUDElementTemplate;              // 0x618(0x1B0)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       FuelOrAmmoExtraBarOffsetY;                         // 0x7C8(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       FuelOrAmmoExtraBarLocationSpanOffsetMult;          // 0x7D0(0x8)(Edit, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FHUDElement>                   FuelOrAmmoSlotsInUse;                              // 0x7D8(0x10)(BlueprintVisible, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UGlobalUIData_BP_C* GetDefaultObj();

	struct FLinearColor BPGetHUDElements_Module_FuelOrAmmo_ExtraBar(int32* StateIndex, class FString* ExtendedInfoText, bool* CallFunc_EqualEqual_IntInt_ReturnValue, bool* CallFunc_EqualEqual_IntInt_ReturnValue_1, bool* CallFunc_EqualEqual_IntInt_ReturnValue_2, bool* CallFunc_EqualEqual_IntInt_ReturnValue_3, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Max_ReturnValue, int32 CallFunc_Max_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue_1, double* CallFunc_Multiply_IntFloat_ReturnValue, double* CallFunc_Multiply_IntFloat_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_ReturnValue, double* CallFunc_Add_DoubleDouble_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_ReturnValue_2, double CallFunc_Multiply_DoubleDouble_ReturnValue_3, double* CallFunc_Add_DoubleDouble_ReturnValue_1, double* CallFunc_Add_DoubleDouble_ReturnValue_2, struct FVector2D* CallFunc_MakeVector2D_ReturnValue, double* CallFunc_Add_DoubleDouble_ReturnValue_3, struct FVector2D* CallFunc_MakeVector2D_ReturnValue_1, float CallFunc_SetHUDElementProgress_NewProgress_ImplicitCast);
	float BPGetHUDElements_Module_FuelOrAmmo(int32* SlotIndex, int32* StateIndex, class FString* ExtendedInfoText, class UTexture2D* Icon, class UShooterGameUserSettings* CallFunc_GetShooterGameUserSettings_ReturnValue, bool* CallFunc_EqualEqual_IntInt_ReturnValue, bool* CallFunc_EqualEqual_IntInt_ReturnValue_1, bool* CallFunc_EqualEqual_IntInt_ReturnValue_2, bool* CallFunc_EqualEqual_IntInt_ReturnValue_3, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_Multiply_DoubleFloat_ReturnValue, double CallFunc_Multiply_DoubleFloat_ReturnValue_1, double CallFunc_Multiply_DoubleFloat_ReturnValue_2, double CallFunc_Multiply_DoubleFloat_ReturnValue_3, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, struct FVector2D* CallFunc_MakeVector2D_ReturnValue, double* CallFunc_Add_DoubleDouble_ReturnValue, struct FVector2D* CallFunc_MakeVector2D_ReturnValue_1, float CallFunc_SetHUDElementProgress_NewProgress_ImplicitCast, double CallFunc_MapRangeClamped_Value_ImplicitCast);
	int32 BPGetHUDElements_Module_Struggle(class APlayerController** ForPC, class AActor* Instigator, const TArray<struct FHUDRichTextOverlayData>& CallFunc_BPGetHUDRichTextOverlays_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, double CallFunc_DegSin_ReturnValue, double CallFunc_MapRangeUnclamped_ReturnValue, class AShooterPlayerController** K2Node_DynamicCast_AsShooter_Player_Controller, bool* K2Node_DynamicCast_bSuccess, double CallFunc_Multiply_DoubleDouble_ReturnValue_2, double CallFunc_SelectFloat_ReturnValue, struct FLinearColor* CallFunc_MakeColor_ReturnValue, const struct FHUDRichTextOverlayData& CallFunc_BPSetHUDRichTextOverlayDisplayText_OutOverlay, const struct FHUDRichTextOverlayData& CallFunc_BPSetHUDRichTextOverlayDefaultTextColor_OutOverlay, const struct FHUDRichTextOverlayData& CallFunc_BPSetHUDRichTextOverlayInstigator_OutOverlay, float CallFunc_SetHUDElementProgress_NewProgress_ImplicitCast, double CallFunc_SelectFloat_A_ImplicitCast, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast, float CallFunc_MakeColor_A_ImplicitCast);
};

}


