#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x168 (0x8C0 - 0x758)
// WidgetBlueprintGeneratedClass HUDNotificationPanel.HUDNotificationPanel_C
class UHUDNotificationPanel_C : public UPrimalUI
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x758(0x8)(Edit, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, SubobjectReference)
	class UWidgetAnimation*                      Reopen;                                            // 0x760(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
	class UCanvasPanel*                          CanvasPanel_NotifPanel;                            // 0x768(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UUniformGridPanel*                     HUDNotifPanel_UniformGridPanel;                    // 0x770(0x8)(ExportObject, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UUniformGridPanel*                     HUDNotifPanel_UniformGridPanel_ExtraInfo;          // 0x778(0x8)(ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USizeBox*                              PositionCanvas;                                    // 0x780(0x8)(ConstParm, BlueprintVisible, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UHorizontalBox*                        SmallNotificationsBox;                             // 0x788(0x8)(ConstParm, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UWidgetSwitcher*                       WidgetSwitcherNotifications;                       // 0x790(0x8)(Edit, ConstParm, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class UHUDNotificationEntry_C*>       HUDNotificationEntriesWidgets;                     // 0x798(0x10)(Edit, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FHUDNotificationEntry_Struct>  HUDNotificationEntries;                            // 0x7A8(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxDisplayedEntries;                               // 0x7B8(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_5765[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class UHUDNotificationEntry_C*>       SingletonHUDNotificationEntriesWidgets;            // 0x7C0(0x10)(Edit, ConstParm, BlueprintVisible, Net, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FHUDNotificationEntry_Struct>  SingletonHUDNotificationEntries;                   // 0x7D0(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        SingletonMaxDisplayedEntries;                      // 0x7E0(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_5766[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class UHUDNotificationEntrySmall_C*>  SmallNotificationsWidgets;                         // 0x7E8(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ShowingExtraInfo;                                  // 0x7F8(0x1)(Edit, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_5767[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LastTimeRefresh;                                   // 0x800(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UTexture2D*                            ButtonGamepad;                                     // 0x808(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FText                                  KBM_Button_Name;                                   // 0x810(0x18)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       LastTimeUpdateKeyboardKeybinding;                  // 0x828(0x8)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FVector2D                             NotificationPanelPosition;                         // 0x830(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FHUDNotificationEntry_Struct          LastNotification;                                  // 0x840(0x4C)(Edit, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_5768[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LastTimeRepeatedNotification;                      // 0x890(0x8)(Edit, ConstParm, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ForceSmallNotiifcations;                           // 0x898(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_5769[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                DinoNotificationString;                            // 0x8A0(0x10)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                PlayerNotificationString;                          // 0x8B0(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UHUDNotificationPanel_C* GetDefaultObj();

	struct FHUDNotificationEntry_Struct GetStatusStateNotifications(class UObject** Object, class APrimalCharacter** K2Node_DynamicCast_AsPrimal_Character, bool* K2Node_DynamicCast_bSuccess, int32* Temp_int_Variable, class APrimalDinoCharacter** K2Node_DynamicCast_AsPrimal_Dino_Character, bool* K2Node_DynamicCast_bSuccess_1, bool CallFunc_LessEqual_IntInt_ReturnValue, bool Temp_bool_Variable, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class APawn* CallFunc_K2_GetPawn_ReturnValue, int32* CallFunc_GetChildrenCount_ReturnValue, class APrimalDinoCharacter** K2Node_DynamicCast_AsPrimal_Dino_Character_1, bool* K2Node_DynamicCast_bSuccess_2, int32 CallFunc_Subtract_IntInt_ReturnValue, int32* Temp_int_Variable_1, class UWidget** CallFunc_GetChildAt_ReturnValue, bool* K2Node_DynamicCast_bSuccess_3, bool CallFunc_LessEqual_IntInt_ReturnValue_1, class UPrimalGameData* CallFunc_BPGetGameData_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, TArray<struct FHUDNotificationEntry_Struct>* K2Node_MakeArray_Array);
	bool ShouldShowExtendedInfoButton(bool* CallFunc_Greater_IntInt_ReturnValue, int32* CallFunc_GetChildrenCount_ReturnValue, bool* CallFunc_Greater_IntInt_ReturnValue_1);
	bool HaveSameNotificationStyle(struct FHUDNotificationEntry_Struct* HUDNotificationEntry_Struct);
	bool UpdateNotifications(bool Temp_bool_Variable, int32* Temp_int_Variable, bool CallFunc_Less_DoubleDouble_ReturnValue, class UWidget** CallFunc_GetChildAt_ReturnValue, class UWidget** CallFunc_GetChildAt_ReturnValue_1, bool* K2Node_DynamicCast_bSuccess, bool* K2Node_DynamicCast_bSuccess_1, int32* CallFunc_GetChildrenCount_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue);
	bool UpdateVisibilitySmallNotifications(bool RequireToHide, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Array_Index_Variable, int32* Temp_int_Variable, int32* Temp_int_Variable_1, bool Temp_bool_Variable, int32* Temp_int_Variable_2, bool Temp_bool_Variable_1, bool Temp_bool_Variable_2, bool Temp_bool_Variable_3, int32* CallFunc_GetChildrenCount_ReturnValue, class UWidget** CallFunc_GetChildAt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, bool* K2Node_DynamicCast_bSuccess, int32* CallFunc_GetChildrenCount_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue_1, bool CallFunc_LessEqual_IntInt_ReturnValue, class UWidget** CallFunc_GetChildAt_ReturnValue_1, int32* CallFunc_GetChildrenCount_ReturnValue_2, bool* K2Node_DynamicCast_bSuccess_1, int32 CallFunc_Subtract_IntInt_ReturnValue_2, bool CallFunc_LessEqual_IntInt_ReturnValue_1, int32* Temp_int_Variable_3, class UWidget** CallFunc_GetChildAt_ReturnValue_2, bool* K2Node_DynamicCast_bSuccess_2, bool CallFunc_LessEqual_IntInt_ReturnValue_2, class UWidget** CallFunc_GetChildAt_ReturnValue_3, int32* CallFunc_GetChildrenCount_ReturnValue_3, int32 CallFunc_Subtract_IntInt_ReturnValue_3, bool* K2Node_DynamicCast_bSuccess_3, bool CallFunc_LessEqual_IntInt_ReturnValue_3, const struct FHUDNotificationEntry_Struct& CallFunc_Array_Get_Item);
	int32 Get_Quantity_Type_Notifications_Repeated(class UPanelWidget* Widget, const TArray<class UPrimalUserWidget*>& ReturnHudNotiifcation1, const TArray<class UPrimalUserWidget*>& ReturnHudNotiifcation, int32* CallFunc_GetChildrenCount_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32* Temp_int_Variable, int32* Temp_int_Variable_1, int32* Temp_int_Variable_2, class UWidget** CallFunc_GetChildAt_ReturnValue, bool* K2Node_DynamicCast_bSuccess, bool* K2Node_DynamicCast_bSuccess_1, int32* CallFunc_Array_LastIndex_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue_1);
	class UHorizontalBoxSlot* CreateSmallEntryNotification(TArray<struct FHUDNotificationEntry_Struct>* K2Node_MakeArray_Array, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UHUDNotificationEntrySmall_C* CallFunc_Create_ReturnValue);
	int32 CreateEntryWidgetForNotification(class UUniformGridPanel* ToGridPanel, bool PreventAnim, TArray<struct FHUDNotificationEntry_Struct>* Array, int32* CallFunc_GetChildrenCount_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32* Temp_int_Variable, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UWidget** CallFunc_GetChildAt_ReturnValue, class UHUDNotificationEntry_C* CallFunc_Create_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue);
	bool AddHUDNotificationEntry(const class FString& String, struct FColor* Color, class UMaterialInterface* Material, int32 MessageTypeID, int32* Priority, bool* WasLastNotification, class UHUDNotificationEntry_C* NotificationToReplace, int32 QuantittyOfCurrentNotification, class UShooterGameUserSettings* CallFunc_GetShooterGameUserSettings_ReturnValue, bool CallFunc_Less_DoubleDouble_ReturnValue, double CallFunc_SelectFloat_ReturnValue, int32 CallFunc_Len_ReturnValue, int32 Temp_int_Array_Index_Variable, bool* CallFunc_Greater_IntInt_ReturnValue, bool Temp_bool_True_if_break_was_hit_Variable, int32 Temp_int_Loop_Counter_Variable, bool Temp_bool_True_if_break_was_hit_Variable_1, int32 Temp_int_Array_Index_Variable_1, bool CallFunc_IsTimeSince_ReturnValue, bool* CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue, bool* CallFunc_GreaterEqual_IntInt_ReturnValue, double CallFunc_Multiply_DoubleFloat_ReturnValue, TArray<struct FHUDNotificationEntry_Struct>* K2Node_MakeArray_Array, int32 Temp_int_Loop_Counter_Variable_1, class UPrimalUserWidget* CallFunc_Array_Get_Item, bool* K2Node_DynamicCast_bSuccess, TArray<struct FHUDNotificationEntry_Struct>* K2Node_MakeArray_Array_1, class UPrimalUserWidget* CallFunc_Array_Get_Item_1, bool* K2Node_DynamicCast_bSuccess_1, bool* CallFunc_Array_IsValidIndex_ReturnValue, int32* CallFunc_GetChildrenCount_ReturnValue, int32* CallFunc_GetChildrenCount_ReturnValue_1, bool* CallFunc_Greater_IntInt_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue, class UWidget** CallFunc_GetChildAt_ReturnValue, bool* K2Node_DynamicCast_bSuccess_2, bool* CallFunc_GreaterEqual_IntInt_ReturnValue_1);
	float Tick(struct FGeometry* MyGeometry);
	void OnGamepadActiveChangedBP(bool* bIsGamepadActive);
	void Construct();
	void DoExtraScalingForSplitscreen(const struct FVector2D& PlayerSize);
	float ExecuteUbergraph_HUDNotificationPanel(int32* EntryPoint, bool Temp_bool_True_if_break_was_hit_Variable, int32 Temp_int_Array_Index_Variable, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, int32* CallFunc_GetChildrenCount_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, bool* CallFunc_Greater_IntInt_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AShooterPlayerController** K2Node_DynamicCast_AsShooter_Player_Controller, bool* K2Node_DynamicCast_bSuccess, int32* CallFunc_GetChildrenCount_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue_1, bool* K2Node_Event_bIsGamepadActive, class UPrimalGameData* CallFunc_BPGetGameData_ReturnValue, class UPrimalGlobalUIData** K2Node_DynamicCast_AsPrimal_Global_UIData, bool* K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsTimeSince_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, class AShooterPlayerController** K2Node_DynamicCast_AsShooter_Player_Controller_1, bool* K2Node_DynamicCast_bSuccess_2, class UCanvasPanelSlot** CallFunc_SlotAsCanvasSlot_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32* Temp_int_Variable, class UWidget** CallFunc_GetChildAt_ReturnValue, bool* K2Node_DynamicCast_bSuccess_3, bool CallFunc_LessEqual_IntInt_ReturnValue, class UCanvasPanelSlot** CallFunc_SlotAsCanvasSlot_ReturnValue_1, double CallFunc_Multiply_DoubleFloat_ReturnValue, struct FVector2D* CallFunc_MakeVector2D_ReturnValue, struct FVector2D* CallFunc_MakeVector2D_ReturnValue_1, bool CallFunc_Less_DoubleDouble_ReturnValue, bool CallFunc_Less_DoubleDouble_ReturnValue_1, double CallFunc_SelectFloat_ReturnValue, double CallFunc_SelectFloat_ReturnValue_1, struct FVector2D* CallFunc_MakeVector2D_ReturnValue_2, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_2, class APawn* CallFunc_K2_GetPawn_ReturnValue, class AShooterCharacter* K2Node_DynamicCast_AsShooter_Character, bool* K2Node_DynamicCast_bSuccess_4, class APrimalDinoCharacter** K2Node_DynamicCast_AsPrimal_Dino_Character, bool* K2Node_DynamicCast_bSuccess_5, bool Temp_bool_Variable, int32* Temp_int_Variable_1, class UWidget** CallFunc_GetChildAt_ReturnValue_1, bool* K2Node_DynamicCast_bSuccess_6, double CallFunc_SelectFloat_ReturnValue_2, const struct FHUDNotificationEntry_Struct& CallFunc_Array_Get_Item, double CallFunc_Multiply_DoubleFloat_ReturnValue_1, TArray<struct FHUDNotificationEntry_Struct>* K2Node_MakeArray_Array, bool CallFunc_LessEqual_IntInt_ReturnValue_1);
};

}


