#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x255 (0x64D - 0x3F8)
// RigVMBlueprintGeneratedClass Human_WeaponIK_CtrlRig.Human_WeaponIK_CtrlRig_C
class UHuman_WeaponIK_CtrlRig_C : public UControlRig
{
public:
	struct FVector                               ElbowOffset;                                       // 0x3F8(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RightHandIKAlpha;                                  // 0x410(0x4)(Edit, Net, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_1B34[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LeftHandIKAlpha;                                   // 0x418(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       ShoulderWidthScale;                                // 0x420(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        PV_OffsetFactor;                                   // 0x428(0x4)(Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B35[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               PV_L;                                              // 0x430(0x18)(Edit, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               PV_R;                                              // 0x448(0x18)(Edit, ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         TimerTest;                                         // 0x460(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B38[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               WeaponPositionOffset_ShortArms;                    // 0x468(0x18)(Edit, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               WeaponPositionOffset_Female;                       // 0x480(0x18)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnInstance, SubobjectReference)
	double                                       BoneModifier_ArmLength;                            // 0x498(0x8)(Edit, Net, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       BoneModifier_TorsoSize;                            // 0x4A0(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       BoneModifier_Shoulders;                            // 0x4A8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FVector                               L_WeaponShift;                                     // 0x4B0(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FVector                               R_WeaponShift;                                     // 0x4C8(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, ReturnParm, DisableEditOnInstance, SubobjectReference)
	struct FRigPose                              LArmPose;                                          // 0x4E0(0x70)(BlueprintVisible, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigPose                              RArmPose;                                          // 0x550(0x70)(BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigPose                              InitialArmScalePose;                               // 0x5C0(0x70)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               WeaponScale;                                       // 0x630(0x18)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        ShiftHandScalePivotToMiddleFinger;                 // 0x648(0x4)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         bFemale;                                           // 0x64C(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UHuman_WeaponIK_CtrlRig_C* GetDefaultObj();

};

// 0x85C (0x884 - 0x28)
// RigVMMemoryStorageGeneratorClass Human_WeaponIK_CtrlRig.RigVMMemory_Literal
class URigVMMemory_Literal : public URigVMMemoryStorage
{
public:
	bool                                         RigVMModel___RigVMFunction_ControlFlowBranch_2_Condition__Const; // 0x28(0x1)(BlueprintVisible, Net, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___HierarchyGetPoseItemArray_2_Initial__Const; // 0x29(0x1)(ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigElementType                   RigVMModel___HierarchyGetPoseItemArray_2_ElementType__Const; // 0x2A(0x1)(BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B3A[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_1_1_Items__Const;   // 0x30(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Interpolate_1_A__Const;               // 0x40(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_31_Item__Const;  // 0x58(0xC)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              RigVMModel___RigUnit_GetTransform_31_Space__Const; // 0x64(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B3B[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        RigVMModel___Interpolate_1_T__Const;               // 0x68(0x4)(BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetTranslation_3_1_1_1_Item__Const; // 0x6C(0xC)(Edit, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              RigVMModel___RigUnit_SetTranslation_3_1_1_1_Space__Const; // 0x78(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B3F[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        RigVMModel___RigUnit_SetTranslation_3_1_1_1_Weight__Const; // 0x7C(0x4)(BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetTranslation_3_1_1_Item__Const; // 0x80(0xC)(Edit, EditFixedSize, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetTranslation_3_1_2_Item__Const; // 0x8C(0xC)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetTranslation_3_1_3_Item__Const; // 0x98(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetTranslation_Item__Const;   // 0xA4(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_23_Item__Const;  // 0xB0(0xC)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_27_Item__Const;  // 0xBC(0xC)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Subtract_4_A__Const;                  // 0xC8(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_4_Add_4_1_B__Const;               // 0xD0(0x18)(ConstParm, BlueprintVisible, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetTranslation_5_Item__Const; // 0xE8(0xC)(EditFixedSize, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_23_1_Item__Const; // 0xF4(0xC)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_27_1_Item__Const; // 0x100(0xC)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetTranslation_1_Item__Const; // 0x10C(0xC)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B43[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___Multiply_2_2_1_A__Const;              // 0x120(0x60)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_9_1_Item__Const; // 0x180(0xC)(ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_9_Item__Const;   // 0x18C(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B46[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___Multiply_2_2_A__Const;                // 0x1A0(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          RigVMModel___RigVMFunction_DebugLineNoSpace_1_Color__Const; // 0x200(0x10)(BlueprintVisible, ExportObject, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigVMFunction_DebugLineNoSpace_1_WorldOffset__Const; // 0x210(0x60)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_DebugLineNoSpace_1_1_Thickness__Const; // 0x270(0x4)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetTranslation_2_Item__Const; // 0x274(0xC)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___Multiply_2_2_1_1_A__Const;            // 0x280(0x60)(Edit, ConstParm, BlueprintVisible, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_9_1_1_Item__Const; // 0x2E0(0xC)(ConstParm, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B48[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_Items__Const;       // 0x2F0(0x10)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_1_Items__Const;     // 0x300(0x10)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	float                                        RigVMModel___Greater_B__Const;                     // 0x310(0x4)(BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B49[0xC];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_SetTransform_6_1_Value__Const; // 0x320(0x60)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_SourceMinimum__Const;           // 0x380(0x8)(Edit, BlueprintReadOnly, Net, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_SourceMaximum__Const;           // 0x388(0x8)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___TwoBoneIKWeight_1_Primary_Axis__Const; // 0x390(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___TwoBoneIKWeight_1_Secondary_Axis__Const; // 0x3A8(0x18)(Edit, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_Strength__Const;         // 0x3C0(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B4B[0xC];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_Effector__Const; // 0x3D0(0x60)(BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         TwoBoneIKWeight_1___TwoBoneIKWeight_ProjectTransformToNewParent_bChildInitial__Const; // 0x430(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         TwoBoneIKWeight_1___TwoBoneIKWeight_ProjectTransformToNewParent_bNewParentInitial__Const; // 0x431(0x1)(Edit, ConstParm, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              TwoBoneIKWeight_1___TwoBoneIKWeight_GetTransform_Space__Const; // 0x432(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B4D[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TwoBoneIKWeight_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_SecondaryAxisWeight__Const; // 0x434(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class EControlRigVectorKind             TwoBoneIKWeight_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_PoleVectorKind__Const; // 0x438(0x1)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B4F[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        TwoBoneIKWeight_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_PoleVectorSpace__Const; // 0x43C(0xC)(Edit, ConstParm, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B50[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigUnit_TwoBoneIKSimple_DebugSettings TwoBoneIKWeight_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_DebugSettings__Const; // 0x450(0x70)(Edit, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          TwoBoneIKWeight_1___TwoBoneIKWeight_DebugLineItemSpace_Color__Const; // 0x4C0(0x10)(ConstParm, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___TwoBoneIKWeight_Primary_Axis__Const;  // 0x4D0(0x18)(ExportObject, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___TwoBoneIKWeight_Secondary_Axis__Const; // 0x4E8(0x18)(ConstParm, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___TwoBoneIKWeight_Stretch_Start_Ratio__Const; // 0x500(0x8)(ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___TwoBoneIKWeight_Stretch_Maximum_Ratio__Const; // 0x508(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            TwoBoneIKWeight___TwoBoneIKWeight_TwoBoneIKSimplePerItem_Effector__Const; // 0x510(0x60)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         TwoBoneIKWeight___TwoBoneIKWeight_ProjectTransformToNewParent_bChildInitial__Const; // 0x570(0x1)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         TwoBoneIKWeight___TwoBoneIKWeight_ProjectTransformToNewParent_bNewParentInitial__Const; // 0x571(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              TwoBoneIKWeight___TwoBoneIKWeight_GetTransform_Space__Const; // 0x572(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B52[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TwoBoneIKWeight___TwoBoneIKWeight_TwoBoneIKSimplePerItem_SecondaryAxisWeight__Const; // 0x574(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class EControlRigVectorKind             TwoBoneIKWeight___TwoBoneIKWeight_TwoBoneIKSimplePerItem_PoleVectorKind__Const; // 0x578(0x1)(BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B53[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        TwoBoneIKWeight___TwoBoneIKWeight_TwoBoneIKSimplePerItem_PoleVectorSpace__Const; // 0x57C(0xC)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B54[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigUnit_TwoBoneIKSimple_DebugSettings TwoBoneIKWeight___TwoBoneIKWeight_TwoBoneIKSimplePerItem_DebugSettings__Const; // 0x590(0x70)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          TwoBoneIKWeight___TwoBoneIKWeight_DebugLineItemSpace_Color__Const; // 0x600(0x10)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              RigVMModel___HierarchySetPoseItemArray_1_Space__Const; // 0x610(0x1)(ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B55[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FRigElementKey>                RigVMModel___HierarchySetPoseItemArray_1_ItemsToSet__Const; // 0x618(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B56[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight_2___TwoBoneIKWeight_TwoBoneIKSimplePerItem_Effector__Const; // 0x630(0x60)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         TwoBoneIKWeight_2___TwoBoneIKWeight_ProjectTransformToNewParent_bChildInitial__Const; // 0x690(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         TwoBoneIKWeight_2___TwoBoneIKWeight_ProjectTransformToNewParent_bNewParentInitial__Const; // 0x691(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              TwoBoneIKWeight_2___TwoBoneIKWeight_GetTransform_Space__Const; // 0x692(0x1)(Edit, ConstParm, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B5A[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TwoBoneIKWeight_2___TwoBoneIKWeight_TwoBoneIKSimplePerItem_SecondaryAxisWeight__Const; // 0x694(0x4)(ExportObject, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class EControlRigVectorKind             TwoBoneIKWeight_2___TwoBoneIKWeight_TwoBoneIKSimplePerItem_PoleVectorKind__Const; // 0x698(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B5C[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        TwoBoneIKWeight_2___TwoBoneIKWeight_TwoBoneIKSimplePerItem_PoleVectorSpace__Const; // 0x69C(0xC)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B5D[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigUnit_TwoBoneIKSimple_DebugSettings TwoBoneIKWeight_2___TwoBoneIKWeight_TwoBoneIKSimplePerItem_DebugSettings__Const; // 0x6B0(0x70)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          TwoBoneIKWeight_2___TwoBoneIKWeight_DebugLineItemSpace_Color__Const; // 0x720(0x10)(BlueprintVisible, Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            TwoBoneIKWeight_1_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_Effector__Const; // 0x730(0x60)(ConstParm, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         TwoBoneIKWeight_1_1___TwoBoneIKWeight_ProjectTransformToNewParent_bChildInitial__Const; // 0x790(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         TwoBoneIKWeight_1_1___TwoBoneIKWeight_ProjectTransformToNewParent_bNewParentInitial__Const; // 0x791(0x1)(EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              TwoBoneIKWeight_1_1___TwoBoneIKWeight_GetTransform_Space__Const; // 0x792(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B60[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TwoBoneIKWeight_1_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_SecondaryAxisWeight__Const; // 0x794(0x4)(Edit, ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class EControlRigVectorKind             TwoBoneIKWeight_1_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_PoleVectorKind__Const; // 0x798(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B63[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        TwoBoneIKWeight_1_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_PoleVectorSpace__Const; // 0x79C(0xC)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B64[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigUnit_TwoBoneIKSimple_DebugSettings TwoBoneIKWeight_1_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_DebugSettings__Const; // 0x7B0(0x70)(ConstParm, ExportObject, Net, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          TwoBoneIKWeight_1_1___TwoBoneIKWeight_DebugLineItemSpace_Color__Const; // 0x820(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              RigVMModel___HierarchySetPoseItemArray_Space__Const; // 0x830(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B67[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          RigVMModel___RigVMFunction_DebugArcNoSpace_Color__Const; // 0x834(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_DebugArcNoSpace_Radius__Const; // 0x844(0x4)(ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_DebugArcNoSpace_MaximumDegrees__Const; // 0x848(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	int32                                        RigVMModel___RigVMFunction_DebugArcNoSpace_Detail__Const; // 0x84C(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          RigVMModel___RigVMFunction_DebugArcNoSpace_2_Color__Const; // 0x850(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          RigVMModel___RigVMFunction_DebugArcNoSpace_2_1_Color__Const; // 0x860(0x10)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_DebugArcNoSpace_2_1_Radius__Const; // 0x870(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          RigVMModel___RigVMFunction_DebugArcNoSpace_2_1_1_Color__Const; // 0x874(0x10)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)

	static class UClass* StaticClass();
	static class URigVMMemory_Literal* GetDefaultObj();

};

// 0x2BA0 (0x2BC8 - 0x28)
// RigVMMemoryStorageGeneratorClass Human_WeaponIK_CtrlRig.RigVMMemory_Work
class URigVMMemory_Work : public URigVMMemoryStorage
{
public:
	struct FRigPose                              RigVMModel___HierarchyGetPoseItemArray_2_Pose;     // 0x28(0x70)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_1_1_Items__IO;      // 0x98(0x10)(Edit, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Interpolate_1_Result;                 // 0xA8(0x18)(ConstParm, BlueprintVisible, ExportObject, Parm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathVectorMake_Result;  // 0xC0(0x18)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B72[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_31_Transform;    // 0xE0(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_31_CachedIndex;  // 0x140(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_MathVectorMake_X;       // 0x150(0x4)(Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_MathVectorMake_Y;       // 0x154(0x4)(Edit, ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_MathVectorMake_Z;       // 0x158(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B74[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RigVMModel___Add_3_Result;                         // 0x160(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B75[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_11_1_1_Transform; // 0x180(0x60)(ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_11_1_1_CachedIndex; // 0x1E0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_3_A;                              // 0x1F0(0x18)(ConstParm, EditFixedSize, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTranslation_3_1_1_1_CachedIndex; // 0x208(0x10)(ExportObject, Net, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_1_Result;                         // 0x218(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_11_1_1_1_Transform; // 0x230(0x60)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_11_1_1_1_CachedIndex; // 0x290(0x10)(BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_1_A;                              // 0x2A0(0x18)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTranslation_3_1_1_CachedIndex; // 0x2B8(0x10)(Edit, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_2_Result;                         // 0x2C8(0x18)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_11_1_2_Transform; // 0x2E0(0x60)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_11_1_2_CachedIndex; // 0x340(0x10)(Edit, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_2_A;                              // 0x350(0x18)(ConstParm, BlueprintVisible, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTranslation_3_1_2_CachedIndex; // 0x368(0x10)(ConstParm, BlueprintVisible, Net, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_1_1_2_Result;                     // 0x378(0x18)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_11_1_1_1_1_Transform; // 0x390(0x60)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_11_1_1_1_1_CachedIndex; // 0x3F0(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_1_1_2_A;                          // 0x400(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTranslation_3_1_3_CachedIndex; // 0x418(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___SetScale_1_1_1_CachedIndex;           // 0x428(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___SetScale_1_1_CachedIndex;             // 0x438(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___SetScale_1_1_1_1_CachedIndex;         // 0x448(0x10)(ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___SetScale_1_CachedIndex;               // 0x458(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Parm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_4_Add_4_1_Result;                 // 0x468(0x18)(ConstParm, BlueprintVisible, Net, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_4_Add_4_Result;                   // 0x480(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B82[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_26_Transform;    // 0x4A0(0x60)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_26_CachedIndex;  // 0x500(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_4_Add_4_A;                        // 0x510(0x18)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Scale_Result;                         // 0x528(0x18)(BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Subtract_3_Result;                    // 0x540(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B88[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_23_Transform;    // 0x560(0x60)(ConstParm, BlueprintVisible, Net, EditFixedSize, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_23_CachedIndex;  // 0x5C0(0x10)(Edit, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Subtract_3_A;                         // 0x5D0(0x18)(ConstParm, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B8B[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_27_Transform;    // 0x5F0(0x60)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_27_CachedIndex;  // 0x650(0x10)(Edit, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Subtract_3_B;                         // 0x660(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Multiply_3_Result;                    // 0x678(0x4)(ExportObject, EditFixedSize, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B8C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Subtract_4_Result;                    // 0x680(0x8)(BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B8E[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_27_2_Transform;  // 0x690(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_27_2_CachedIndex; // 0x6F0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Subtract_4_B;                         // 0x700(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Multiply_3_A;                         // 0x708(0x4)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B90[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTranslation_CachedIndex;   // 0x710(0x10)(ConstParm, BlueprintVisible, Parm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_4_1_Add_4_1_1_Result;             // 0x720(0x18)(BlueprintReadOnly, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_4_1_Add_4_1_Result;               // 0x738(0x18)(BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_26_1_Transform;  // 0x750(0x60)(ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_26_1_CachedIndex; // 0x7B0(0x10)(ConstParm, Net, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_4_1_Add_4_1_A;                    // 0x7C0(0x18)(Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Scale_3_Result;                       // 0x7D8(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Subtract_3_1_Result;                  // 0x7F0(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B93[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_23_1_Transform;  // 0x810(0x60)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_23_1_CachedIndex; // 0x870(0x10)(Edit, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Subtract_3_1_A;                       // 0x880(0x18)(Net, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B96[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_27_1_Transform;  // 0x8A0(0x60)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_27_1_CachedIndex; // 0x900(0x10)(ConstParm, BlueprintVisible, ExportObject, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Subtract_3_1_B;                       // 0x910(0x18)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Multiply_4_Result;                    // 0x928(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B99[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Subtract_4_1_Result;                  // 0x930(0x8)(Edit, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B9C[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_27_1_1_Transform; // 0x940(0x60)(BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_27_1_1_CachedIndex; // 0x9A0(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Subtract_4_1_B;                       // 0x9B0(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Multiply_4_A;                         // 0x9B8(0x4)(ConstParm, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B9D[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTranslation_5_CachedIndex; // 0x9C0(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___Multiply_2_2_1_Result;                // 0x9D0(0x60)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_9_1_Transform;   // 0xA30(0x60)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_9_1_CachedIndex; // 0xA90(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigUnit_SetTranslation_1_Value;       // 0xAA0(0x18)(Edit, ConstParm, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTranslation_1_CachedIndex; // 0xAB8(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B9F[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_9_Transform;     // 0xAD0(0x60)(Edit, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_9_CachedIndex;   // 0xB30(0x10)(Edit, ConstParm, ExportObject, Net, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_DebugLineNoSpace_1_A;   // 0xB40(0x18)(Edit, ConstParm, ExportObject, Parm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BA1[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___Multiply_2_2_Result;                  // 0xB60(0x60)(BlueprintReadOnly, Net, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_DebugLineNoSpace_1_B;   // 0xBC0(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_DebugLineNoSpace_1_1_A; // 0xBD8(0x18)(Edit, BlueprintVisible, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___Multiply_2_2_1_1_Result;              // 0xBF0(0x60)(ExportObject, Net, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_9_1_1_Transform; // 0xC50(0x60)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_9_1_1_CachedIndex; // 0xCB0(0x10)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigUnit_SetTranslation_2_Value;       // 0xCC0(0x18)(ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTranslation_2_CachedIndex; // 0xCD8(0x10)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigPose                              RigVMModel___HierarchyGetPoseItemArray_Pose;       // 0xCE8(0x70)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_Items__IO;          // 0xD58(0x10)(Edit, ConstParm, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FRigPose                              RigVMModel___HierarchyGetPoseItemArray_1_Pose;     // 0xD68(0x70)(Edit, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_1_Items__IO;        // 0xDD8(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	bool                                         RigVMModel___Greater_Result;                       // 0xDE8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BA4[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_6_Transform;     // 0xDF0(0x60)(Edit, BlueprintVisible, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_6_CachedIndex;   // 0xE50(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_1_1_Add_1_1_1_Result;             // 0xE60(0x18)(ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_1_1_Add_1_1_Result;               // 0xE78(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_1_1_Add_1_1_A;                    // 0xE90(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Scale_2_Result;                       // 0xEA8(0x18)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Multiply_7_Result;                    // 0xEC0(0x8)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_Result;                         // 0xEC8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_32_Transform;    // 0xED0(0x60)(ConstParm, ExportObject, Net, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_32_CachedIndex;  // 0xF30(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Multiply_7_B;                         // 0xF40(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Scale_2_Factor;                       // 0xF48(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BA8[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RigVMModel___DISPATCH_RigVMDispatch_If_2_Result;   // 0xF50(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BA9[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_SetTransform_6_1_Value__IO;   // 0xF70(0x60)(ConstParm, ExportObject, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTransform_6_1_CachedIndex; // 0xFD0(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_Result;                  // 0xFE0(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_Velocity;                // 0xFE4(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<float>                                RigVMModel___SpringInterp_SimulatedResult;         // 0xFE8(0x10)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FFloatSpringState>             RigVMModel___SpringInterp_SpringState;             // 0xFF8(0x10)(Edit, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___TwoBoneIKWeight_1_Weight;             // 0x1008(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_1___TwoBoneIKWeight_Entry_Secondary_Axis; // 0x1010(0x18)(Edit, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight_1___TwoBoneIKWeight_Entry_Pole_Vector_Node; // 0x1028(0xC)(ConstParm, BlueprintVisible, Parm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight_1___TwoBoneIKWeight_Entry_Bone_A;  // 0x1034(0xC)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight_1___TwoBoneIKWeight_Entry_Bone_B;  // 0x1040(0xC)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight_1___TwoBoneIKWeight_Entry_Bone_C;  // 0x104C(0xC)(Edit, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight_1___TwoBoneIKWeight_Entry_End_Ctrl; // 0x1058(0xC)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         TwoBoneIKWeight_1___TwoBoneIKWeight_Entry_Enable_Stretch; // 0x1064(0x1)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BAF[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       TwoBoneIKWeight_1___TwoBoneIKWeight_Entry_Stretch_Start_Ratio; // 0x1068(0x8)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       TwoBoneIKWeight_1___TwoBoneIKWeight_Entry_Stretch_Maximum_Ratio; // 0x1070(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       TwoBoneIKWeight_1___TwoBoneIKWeight_Entry_Weight;  // 0x1078(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       TwoBoneIKWeight_1___TwoBoneIKWeight_Entry_Line_Thickness; // 0x1080(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_1___TwoBoneIKWeight_Entry_Scale;   // 0x1088(0x18)(Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         TwoBoneIKWeight_1___TwoBoneIKWeight_Entry_Debug;   // 0x10A0(0x1)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BB5[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               TwoBoneIKWeight_1___TwoBoneIKWeight_Entry_PV;      // 0x10A8(0x18)(Edit, BlueprintVisible, ExportObject, Net, Parm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            TwoBoneIKWeight_1___TwoBoneIKWeight_ProjectTransformToNewParent_Transform; // 0x10C0(0x60)(BlueprintVisible, Net, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1___TwoBoneIKWeight_ProjectTransformToNewParent_CachedChild; // 0x1120(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1___TwoBoneIKWeight_ProjectTransformToNewParent_CachedOldParent; // 0x1130(0x10)(ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1___TwoBoneIKWeight_ProjectTransformToNewParent_CachedNewParent; // 0x1140(0x10)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            TwoBoneIKWeight_1___TwoBoneIKWeight_GetTransform_Transform; // 0x1150(0x60)(EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1___TwoBoneIKWeight_GetTransform_CachedIndex; // 0x11B0(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            TwoBoneIKWeight_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_Effector__IO; // 0x11C0(0x60)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            TwoBoneIKWeight_1___TwoBoneIKWeight_RigUnit_GetTransform_14_1_1_1_Transform; // 0x1220(0x60)(BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1___TwoBoneIKWeight_RigUnit_GetTransform_14_1_1_1_CachedIndex; // 0x1280(0x10)(ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_PoleVector; // 0x1290(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_StretchStartRatio; // 0x12A8(0x4)(ConstParm, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_StretchMaximumRatio; // 0x12AC(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_Weight; // 0x12B0(0x4)(BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight_1___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_Result; // 0x12B4(0x4)(GlobalConfig, SubobjectReference)
	uint8                                        Pad_1BBD[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight_1___TwoBoneIKWeight_RigUnit_GetTransform_20_2_Transform; // 0x12C0(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1___TwoBoneIKWeight_RigUnit_GetTransform_20_2_CachedIndex; // 0x1320(0x10)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_1___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_A; // 0x1330(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BBF[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight_1___TwoBoneIKWeight_GetTransform_5_Transform; // 0x1350(0x60)(Edit, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1___TwoBoneIKWeight_GetTransform_5_CachedIndex; // 0x13B0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_1___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_B; // 0x13C0(0x18)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight_1___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_1_Result; // 0x13D8(0x4)(Edit, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BCC[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               TwoBoneIKWeight_1___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_1_B; // 0x13E0(0x18)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_CachedItemAIndex; // 0x13F8(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_CachedItemBIndex; // 0x1408(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_CachedEffectorItemIndex; // 0x1418(0x10)(ConstParm, EditFixedSize, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_CachedPoleVectorSpaceIndex; // 0x1428(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BCE[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight_1___TwoBoneIKWeight_RigUnit_GetTransform_14_1_Transform; // 0x1440(0x60)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1___TwoBoneIKWeight_RigUnit_GetTransform_14_1_CachedIndex; // 0x14A0(0x10)(Edit, ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_1___TwoBoneIKWeight_DebugLineItemSpace_A; // 0x14B0(0x18)(ConstParm, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BCF[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight_1___TwoBoneIKWeight_GetTransform_4_Transform; // 0x14D0(0x60)(Net, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1___TwoBoneIKWeight_GetTransform_4_CachedIndex; // 0x1530(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_1___TwoBoneIKWeight_DebugLineItemSpace_B; // 0x1540(0x18)(Edit, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight_1___TwoBoneIKWeight_DebugLineItemSpace_Thickness; // 0x1558(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BD5[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               TwoBoneIKWeight___TwoBoneIKWeight_Entry_Secondary_Axis; // 0x1560(0x18)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight___TwoBoneIKWeight_Entry_Pole_Vector_Node; // 0x1578(0xC)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight___TwoBoneIKWeight_Entry_Bone_A;    // 0x1584(0xC)(ExportObject, Net, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight___TwoBoneIKWeight_Entry_Bone_B;    // 0x1590(0xC)(Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight___TwoBoneIKWeight_Entry_Bone_C;    // 0x159C(0xC)(Edit, ConstParm, ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight___TwoBoneIKWeight_Entry_End_Ctrl;  // 0x15A8(0xC)(Edit, ConstParm, BlueprintVisible, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         TwoBoneIKWeight___TwoBoneIKWeight_Entry_Enable_Stretch; // 0x15B4(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BD7[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       TwoBoneIKWeight___TwoBoneIKWeight_Entry_Stretch_Start_Ratio; // 0x15B8(0x8)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       TwoBoneIKWeight___TwoBoneIKWeight_Entry_Stretch_Maximum_Ratio; // 0x15C0(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       TwoBoneIKWeight___TwoBoneIKWeight_Entry_Weight;    // 0x15C8(0x8)(Edit, ConstParm, BlueprintVisible, Net, GlobalConfig, SubobjectReference)
	double                                       TwoBoneIKWeight___TwoBoneIKWeight_Entry_Line_Thickness; // 0x15D0(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight___TwoBoneIKWeight_Entry_Scale;     // 0x15D8(0x18)(Edit, ExportObject, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         TwoBoneIKWeight___TwoBoneIKWeight_Entry_Debug;     // 0x15F0(0x1)(Edit, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BDA[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               TwoBoneIKWeight___TwoBoneIKWeight_Entry_PV;        // 0x15F8(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            TwoBoneIKWeight___TwoBoneIKWeight_ProjectTransformToNewParent_Transform; // 0x1610(0x60)(ConstParm, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight___TwoBoneIKWeight_ProjectTransformToNewParent_CachedChild; // 0x1670(0x10)(Edit, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight___TwoBoneIKWeight_ProjectTransformToNewParent_CachedOldParent; // 0x1680(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight___TwoBoneIKWeight_ProjectTransformToNewParent_CachedNewParent; // 0x1690(0x10)(Edit, ConstParm, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            TwoBoneIKWeight___TwoBoneIKWeight_GetTransform_Transform; // 0x16A0(0x60)(Edit, ConstParm, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight___TwoBoneIKWeight_GetTransform_CachedIndex; // 0x1700(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            TwoBoneIKWeight___TwoBoneIKWeight_TwoBoneIKSimplePerItem_Effector__IO; // 0x1710(0x60)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            TwoBoneIKWeight___TwoBoneIKWeight_RigUnit_GetTransform_14_1_1_1_Transform; // 0x1770(0x60)(ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight___TwoBoneIKWeight_RigUnit_GetTransform_14_1_1_1_CachedIndex; // 0x17D0(0x10)(ConstParm, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight___TwoBoneIKWeight_TwoBoneIKSimplePerItem_PoleVector; // 0x17E0(0x18)(BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight___TwoBoneIKWeight_TwoBoneIKSimplePerItem_StretchStartRatio; // 0x17F8(0x4)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight___TwoBoneIKWeight_TwoBoneIKSimplePerItem_StretchMaximumRatio; // 0x17FC(0x4)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight___TwoBoneIKWeight_TwoBoneIKSimplePerItem_Weight; // 0x1800(0x4)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_Result; // 0x1804(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BDF[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight___TwoBoneIKWeight_RigUnit_GetTransform_20_2_Transform; // 0x1810(0x60)(Edit, ConstParm, BlueprintReadOnly, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight___TwoBoneIKWeight_RigUnit_GetTransform_20_2_CachedIndex; // 0x1870(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_A; // 0x1880(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BE0[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight___TwoBoneIKWeight_GetTransform_5_Transform; // 0x18A0(0x60)(ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight___TwoBoneIKWeight_GetTransform_5_CachedIndex; // 0x1900(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_B; // 0x1910(0x18)(Edit, ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_1_Result; // 0x1928(0x4)(Edit, ConstParm, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BE2[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               TwoBoneIKWeight___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_1_B; // 0x1930(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight___TwoBoneIKWeight_TwoBoneIKSimplePerItem_CachedItemAIndex; // 0x1948(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight___TwoBoneIKWeight_TwoBoneIKSimplePerItem_CachedItemBIndex; // 0x1958(0x10)(Edit, ConstParm, BlueprintReadOnly, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight___TwoBoneIKWeight_TwoBoneIKSimplePerItem_CachedEffectorItemIndex; // 0x1968(0x10)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight___TwoBoneIKWeight_TwoBoneIKSimplePerItem_CachedPoleVectorSpaceIndex; // 0x1978(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BE7[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight___TwoBoneIKWeight_RigUnit_GetTransform_14_1_Transform; // 0x1990(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight___TwoBoneIKWeight_RigUnit_GetTransform_14_1_CachedIndex; // 0x19F0(0x10)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight___TwoBoneIKWeight_DebugLineItemSpace_A; // 0x1A00(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BE9[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight___TwoBoneIKWeight_GetTransform_4_Transform; // 0x1A20(0x60)(ConstParm, BlueprintVisible, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight___TwoBoneIKWeight_GetTransform_4_CachedIndex; // 0x1A80(0x10)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight___TwoBoneIKWeight_DebugLineItemSpace_B; // 0x1A90(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight___TwoBoneIKWeight_DebugLineItemSpace_Thickness; // 0x1AA8(0x4)(ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BEA[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Clamp_1_Result;                       // 0x1AB0(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Subtract_2_1_Result;                  // 0x1AB8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Subtract_2_1_B;                       // 0x1AC0(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___HierarchySetPoseItemArray_1_Weight;   // 0x1AC8(0x4)(BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___Greater_1_Result;                     // 0x1ACC(0x1)(Edit, ExportObject, Net, Parm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BEB[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_6_2_Transform;   // 0x1AD0(0x60)(BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_6_2_CachedIndex; // 0x1B30(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_1_1_1_Add_1_1_1_1_Result;         // 0x1B40(0x18)(BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_1_1_1_Add_1_1_1_Result;           // 0x1B58(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_1_1_1_Add_1_1_1_A;                // 0x1B70(0x18)(BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Scale_2_1_Result;                     // 0x1B88(0x18)(Edit, ConstParm, ExportObject, Net, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Multiply_7_1_Result;                  // 0x1BA0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_Result;                       // 0x1BA8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_32_1_Transform;  // 0x1BB0(0x60)(Edit, ConstParm, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_32_1_CachedIndex; // 0x1C10(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Multiply_7_1_B;                       // 0x1C20(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Scale_2_1_Factor;                     // 0x1C28(0x4)(Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BF0[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RigVMModel___DISPATCH_RigVMDispatch_If_2_1_Result; // 0x1C30(0x18)(Edit, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BF2[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_SetTransform_6_Value__IO;     // 0x1C50(0x60)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTransform_6_CachedIndex;   // 0x1CB0(0x10)(BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_1_Result;                // 0x1CC0(0x4)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_1_Target;                // 0x1CC4(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_1_Velocity;              // 0x1CC8(0x4)(Edit, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BF3[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                RigVMModel___SpringInterp_1_SimulatedResult;       // 0x1CD0(0x10)(ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FFloatSpringState>             RigVMModel___SpringInterp_1_SpringState;           // 0x1CE0(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___TwoBoneIKWeight_2_Weight;             // 0x1CF0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_2___TwoBoneIKWeight_Entry_Secondary_Axis; // 0x1CF8(0x18)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight_2___TwoBoneIKWeight_Entry_Pole_Vector_Node; // 0x1D10(0xC)(Edit, BlueprintReadOnly, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight_2___TwoBoneIKWeight_Entry_Bone_A;  // 0x1D1C(0xC)(ConstParm, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight_2___TwoBoneIKWeight_Entry_Bone_B;  // 0x1D28(0xC)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight_2___TwoBoneIKWeight_Entry_Bone_C;  // 0x1D34(0xC)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight_2___TwoBoneIKWeight_Entry_End_Ctrl; // 0x1D40(0xC)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         TwoBoneIKWeight_2___TwoBoneIKWeight_Entry_Enable_Stretch; // 0x1D4C(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BF6[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       TwoBoneIKWeight_2___TwoBoneIKWeight_Entry_Stretch_Start_Ratio; // 0x1D50(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       TwoBoneIKWeight_2___TwoBoneIKWeight_Entry_Stretch_Maximum_Ratio; // 0x1D58(0x8)(ExportObject, Net, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       TwoBoneIKWeight_2___TwoBoneIKWeight_Entry_Weight;  // 0x1D60(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       TwoBoneIKWeight_2___TwoBoneIKWeight_Entry_Line_Thickness; // 0x1D68(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_2___TwoBoneIKWeight_Entry_Scale;   // 0x1D70(0x18)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         TwoBoneIKWeight_2___TwoBoneIKWeight_Entry_Debug;   // 0x1D88(0x1)(Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BFB[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               TwoBoneIKWeight_2___TwoBoneIKWeight_Entry_PV;      // 0x1D90(0x18)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BFC[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight_2___TwoBoneIKWeight_ProjectTransformToNewParent_Transform; // 0x1DB0(0x60)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_2___TwoBoneIKWeight_ProjectTransformToNewParent_CachedChild; // 0x1E10(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_2___TwoBoneIKWeight_ProjectTransformToNewParent_CachedOldParent; // 0x1E20(0x10)(ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_2___TwoBoneIKWeight_ProjectTransformToNewParent_CachedNewParent; // 0x1E30(0x10)(Edit, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            TwoBoneIKWeight_2___TwoBoneIKWeight_GetTransform_Transform; // 0x1E40(0x60)(ConstParm, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_2___TwoBoneIKWeight_GetTransform_CachedIndex; // 0x1EA0(0x10)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            TwoBoneIKWeight_2___TwoBoneIKWeight_TwoBoneIKSimplePerItem_Effector__IO; // 0x1EB0(0x60)(ConstParm, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            TwoBoneIKWeight_2___TwoBoneIKWeight_RigUnit_GetTransform_14_1_1_1_Transform; // 0x1F10(0x60)(Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_2___TwoBoneIKWeight_RigUnit_GetTransform_14_1_1_1_CachedIndex; // 0x1F70(0x10)(BlueprintVisible, EditFixedSize, Parm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_2___TwoBoneIKWeight_TwoBoneIKSimplePerItem_PoleVector; // 0x1F80(0x18)(BlueprintVisible, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight_2___TwoBoneIKWeight_TwoBoneIKSimplePerItem_StretchStartRatio; // 0x1F98(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight_2___TwoBoneIKWeight_TwoBoneIKSimplePerItem_StretchMaximumRatio; // 0x1F9C(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight_2___TwoBoneIKWeight_TwoBoneIKSimplePerItem_Weight; // 0x1FA0(0x4)(ConstParm, BlueprintReadOnly, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight_2___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_Result; // 0x1FA4(0x4)(BlueprintVisible, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C02[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight_2___TwoBoneIKWeight_RigUnit_GetTransform_20_2_Transform; // 0x1FB0(0x60)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_2___TwoBoneIKWeight_RigUnit_GetTransform_20_2_CachedIndex; // 0x2010(0x10)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_2___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_A; // 0x2020(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C06[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight_2___TwoBoneIKWeight_GetTransform_5_Transform; // 0x2040(0x60)(Net, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_2___TwoBoneIKWeight_GetTransform_5_CachedIndex; // 0x20A0(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_2___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_B; // 0x20B0(0x18)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight_2___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_1_Result; // 0x20C8(0x4)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C07[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               TwoBoneIKWeight_2___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_1_B; // 0x20D0(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_2___TwoBoneIKWeight_TwoBoneIKSimplePerItem_CachedItemAIndex; // 0x20E8(0x10)(Edit, ExportObject, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_2___TwoBoneIKWeight_TwoBoneIKSimplePerItem_CachedItemBIndex; // 0x20F8(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_2___TwoBoneIKWeight_TwoBoneIKSimplePerItem_CachedEffectorItemIndex; // 0x2108(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_2___TwoBoneIKWeight_TwoBoneIKSimplePerItem_CachedPoleVectorSpaceIndex; // 0x2118(0x10)(ConstParm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C09[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight_2___TwoBoneIKWeight_RigUnit_GetTransform_14_1_Transform; // 0x2130(0x60)(ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_2___TwoBoneIKWeight_RigUnit_GetTransform_14_1_CachedIndex; // 0x2190(0x10)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_2___TwoBoneIKWeight_DebugLineItemSpace_A; // 0x21A0(0x18)(OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C0B[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight_2___TwoBoneIKWeight_GetTransform_4_Transform; // 0x21C0(0x60)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_2___TwoBoneIKWeight_GetTransform_4_CachedIndex; // 0x2220(0x10)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_2___TwoBoneIKWeight_DebugLineItemSpace_B; // 0x2230(0x18)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight_2___TwoBoneIKWeight_DebugLineItemSpace_Thickness; // 0x2248(0x4)(ConstParm, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C0C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               TwoBoneIKWeight_1_1___TwoBoneIKWeight_Entry_Secondary_Axis; // 0x2250(0x18)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight_1_1___TwoBoneIKWeight_Entry_Pole_Vector_Node; // 0x2268(0xC)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight_1_1___TwoBoneIKWeight_Entry_Bone_A; // 0x2274(0xC)(ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight_1_1___TwoBoneIKWeight_Entry_Bone_B; // 0x2280(0xC)(ConstParm, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight_1_1___TwoBoneIKWeight_Entry_Bone_C; // 0x228C(0xC)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        TwoBoneIKWeight_1_1___TwoBoneIKWeight_Entry_End_Ctrl; // 0x2298(0xC)(ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         TwoBoneIKWeight_1_1___TwoBoneIKWeight_Entry_Enable_Stretch; // 0x22A4(0x1)(Edit, ExportObject, BlueprintReadOnly, Parm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C0E[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       TwoBoneIKWeight_1_1___TwoBoneIKWeight_Entry_Stretch_Start_Ratio; // 0x22A8(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       TwoBoneIKWeight_1_1___TwoBoneIKWeight_Entry_Stretch_Maximum_Ratio; // 0x22B0(0x8)(BlueprintVisible, Net, EditFixedSize, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       TwoBoneIKWeight_1_1___TwoBoneIKWeight_Entry_Weight; // 0x22B8(0x8)(Edit, ConstParm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       TwoBoneIKWeight_1_1___TwoBoneIKWeight_Entry_Line_Thickness; // 0x22C0(0x8)(Edit, ExportObject, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_1_1___TwoBoneIKWeight_Entry_Scale; // 0x22C8(0x18)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         TwoBoneIKWeight_1_1___TwoBoneIKWeight_Entry_Debug; // 0x22E0(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C10[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               TwoBoneIKWeight_1_1___TwoBoneIKWeight_Entry_PV;    // 0x22E8(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            TwoBoneIKWeight_1_1___TwoBoneIKWeight_ProjectTransformToNewParent_Transform; // 0x2300(0x60)(ConstParm, ExportObject, Net, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1_1___TwoBoneIKWeight_ProjectTransformToNewParent_CachedChild; // 0x2360(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1_1___TwoBoneIKWeight_ProjectTransformToNewParent_CachedOldParent; // 0x2370(0x10)(ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1_1___TwoBoneIKWeight_ProjectTransformToNewParent_CachedNewParent; // 0x2380(0x10)(Edit, ConstParm, ExportObject, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            TwoBoneIKWeight_1_1___TwoBoneIKWeight_GetTransform_Transform; // 0x2390(0x60)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1_1___TwoBoneIKWeight_GetTransform_CachedIndex; // 0x23F0(0x10)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            TwoBoneIKWeight_1_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_Effector__IO; // 0x2400(0x60)(BlueprintVisible, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            TwoBoneIKWeight_1_1___TwoBoneIKWeight_RigUnit_GetTransform_14_1_1_1_Transform; // 0x2460(0x60)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1_1___TwoBoneIKWeight_RigUnit_GetTransform_14_1_1_1_CachedIndex; // 0x24C0(0x10)(Edit, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_1_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_PoleVector; // 0x24D0(0x18)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight_1_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_StretchStartRatio; // 0x24E8(0x4)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight_1_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_StretchMaximumRatio; // 0x24EC(0x4)(BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight_1_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_Weight; // 0x24F0(0x4)(Edit, BlueprintVisible, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight_1_1___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_Result; // 0x24F4(0x4)(BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C16[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight_1_1___TwoBoneIKWeight_RigUnit_GetTransform_20_2_Transform; // 0x2500(0x60)(Edit, BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1_1___TwoBoneIKWeight_RigUnit_GetTransform_20_2_CachedIndex; // 0x2560(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_1_1___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_A; // 0x2570(0x18)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C17[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight_1_1___TwoBoneIKWeight_GetTransform_5_Transform; // 0x2590(0x60)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1_1___TwoBoneIKWeight_GetTransform_5_CachedIndex; // 0x25F0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_1_1___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_B; // 0x2600(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight_1_1___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_1_Result; // 0x2618(0x4)(ConstParm, ExportObject, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C1B[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               TwoBoneIKWeight_1_1___TwoBoneIKWeight_RigVMFunction_MathVectorDistance_1_B; // 0x2620(0x18)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_CachedItemAIndex; // 0x2638(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_CachedItemBIndex; // 0x2648(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_CachedEffectorItemIndex; // 0x2658(0x10)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1_1___TwoBoneIKWeight_TwoBoneIKSimplePerItem_CachedPoleVectorSpaceIndex; // 0x2668(0x10)(ConstParm, EditFixedSize, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C1F[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight_1_1___TwoBoneIKWeight_RigUnit_GetTransform_14_1_Transform; // 0x2680(0x60)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1_1___TwoBoneIKWeight_RigUnit_GetTransform_14_1_CachedIndex; // 0x26E0(0x10)(Edit, Net, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_1_1___TwoBoneIKWeight_DebugLineItemSpace_A; // 0x26F0(0x18)(Edit, ConstParm, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C22[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            TwoBoneIKWeight_1_1___TwoBoneIKWeight_GetTransform_4_Transform; // 0x2710(0x60)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             TwoBoneIKWeight_1_1___TwoBoneIKWeight_GetTransform_4_CachedIndex; // 0x2770(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               TwoBoneIKWeight_1_1___TwoBoneIKWeight_DebugLineItemSpace_B; // 0x2780(0x18)(ConstParm, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        TwoBoneIKWeight_1_1___TwoBoneIKWeight_DebugLineItemSpace_Thickness; // 0x2798(0x4)(BlueprintReadOnly, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C28[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Clamp_Result;                         // 0x27A0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Subtract_2_Result;                    // 0x27A8(0x8)(BlueprintVisible, ExportObject, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___HierarchySetPoseItemArray_Weight;     // 0x27B0(0x4)(BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_4_BlockToRun; // 0x27B4(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x27BC(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C2D[0xC];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_3_Transform;     // 0x27D0(0x60)(Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_3_CachedIndex;   // 0x2830(0x10)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_4_Transform;     // 0x2840(0x60)(Edit, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_4_CachedIndex;   // 0x28A0(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_4_1_Transform;   // 0x28B0(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_4_1_CachedIndex; // 0x2910(0x10)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_4_1_1_Transform; // 0x2920(0x60)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_4_1_1_CachedIndex; // 0x2980(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_11_Transform;    // 0x2990(0x60)(Edit, BlueprintVisible, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_11_CachedIndex;  // 0x29F0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_DebugLineNoSpace_A;     // 0x2A00(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C35[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_12_Transform;    // 0x2A20(0x60)(ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_12_CachedIndex;  // 0x2A80(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_DebugLineNoSpace_B;     // 0x2A90(0x18)(ConstParm, ExportObject, Net, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___PoseLoop_Item;                        // 0x2AA8(0xC)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C3B[0xC];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___PoseLoop_GlobalTransform;             // 0x2AC0(0x60)(ExportObject, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___SetScale_Scale;                       // 0x2B20(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___SetScale_CachedIndex;                 // 0x2B38(0x10)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  RigVMModel___PoseLoop_BlockToRun;                  // 0x2B48(0x8)(BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___PoseLoop_LocalTransform;              // 0x2B50(0x60)(ExportObject, Net, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___PoseLoop_CurveValue;                  // 0x2BB0(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	int32                                        RigVMModel___PoseLoop_Index;                       // 0x2BB4(0x4)(EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	int32                                        RigVMModel___PoseLoop_Count;                       // 0x2BB8(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___PoseLoop_Ratio;                       // 0x2BBC(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_2_BlockToRun; // 0x2BC0(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)

	static class UClass* StaticClass();
	static class URigVMMemory_Work* GetDefaultObj();

};

}


