#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x2DA (0x6D2 - 0x3F8)
// RigVMBlueprintGeneratedClass Human_GroundConform_CtrlRig.Human_GroundConform_CtrlRig_C
class UHuman_GroundConform_CtrlRig_C : public UControlRig
{
public:
	struct FRigPose                              Pose;                                              // 0x3F8(0x70)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst)
	TArray<struct FPBIKEffector>                 IKEffectors;                                       // 0x468(0x10)(ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FVector>                       EffectorPos;                                       // 0x478(0x10)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<double>                               Settings_TraceRadii;                               // 0x488(0x10)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, Config, DisableEditOnInstance, SubobjectReference)
	TArray<double>                               Settings_TraceLengths;                             // 0x498(0x10)(ConstParm, BlueprintReadOnly, Net, Transient, DisableEditOnInstance, SubobjectReference)
	TArray<bool>                                 Settings_ConstrainLength;                          // 0x4A8(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<double>                               Settings_BendStiffness;                            // 0x4B8(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	TArray<double>                               Settings_SpringDampingFactor;                      // 0x4C8(0x10)(BlueprintVisible, Net, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<double>                               Settings_SpringStrengthFactor;                     // 0x4D8(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FPBIKBoneSetting>              PBIKBoneSettings;                                  // 0x4E8(0x10)(Edit, BlueprintVisible, ExportObject, Net, OutParm, Transient, EditConst, SubobjectReference)
	bool                                         bFoundCtrlParent;                                  // 0x4F8(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_24B7[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TailAndNeck_RotationStiffness;                     // 0x4FC(0x4)(BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                SortedEffectorBones;                               // 0x500(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<int32>                                SortedRigElements_IndexArray;                      // 0x510(0x10)(Edit, ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<struct FRigElementKey>                SortedParentBones;                                 // 0x520(0x10)(ExportObject, EditFixedSize, ReturnParm, EditConst, SubobjectReference)
	TArray<struct FQuat>                         EffectorRotations;                                 // 0x530(0x10)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FVector>                       TracePathPositions;                                // 0x540(0x10)(ConstParm, ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         bBreakTracePath;                                   // 0x550(0x1)(EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_24B9[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               MeshScale;                                         // 0x558(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       GroundConform_GravityFactor;                       // 0x570(0x8)(ConstParm, BlueprintReadOnly, Parm, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         GroundConform_IsBeingDragged;                      // 0x578(0x1)(Edit, ConstParm, BlueprintReadOnly, Parm, DisableEditOnTemplate, SubobjectReference)
	bool                                         Swimming;                                          // 0x579(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, SubobjectReference)
	bool                                         GroundConform_Motionless;                          // 0x57A(0x1)(BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_24BD[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigPose                              PoseLastFrame;                                     // 0x580(0x70)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         Interpolate;                                       // 0x5F0(0x1)(Edit, BlueprintVisible, ExportObject, Net, Parm, DisableEditOnTemplate, SubobjectReference)
	bool                                         IsFalling;                                         // 0x5F1(0x1)(ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, Config, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	uint8                                        Pad_24BE[0xE];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RootControlTransform_LastFrame;                    // 0x600(0x60)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	double                                       DetectedNoMotion_LastFrame;                        // 0x660(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_24BF[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            HipTransform_LastFrame;                            // 0x670(0x60)(ConstParm, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         Has_Initially_Updated_Bone_Distances;              // 0x6D0(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         bHasDynamicBase_;                                  // 0x6D1(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, SubobjectReference)

	static class UClass* StaticClass();
	static class UHuman_GroundConform_CtrlRig_C* GetDefaultObj();

};

// 0x145C (0x1484 - 0x28)
// RigVMMemoryStorageGeneratorClass Human_GroundConform_CtrlRig.RigVMMemory_Literal
class URigVMMemory_Literal : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_2_Item__Const;    // 0x28(0xC)(Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              RigVMModel___RigUnit_SetRotation_2_Space__Const;   // 0x34(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         RigVMModel___RigUnit_SetRotation_2_bInitial__Const; // 0x35(0x1)(ConstParm, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_24C8[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RigVMModel___RigVMFunction_MathQuaternionFromEuler_Euler__Const; // 0x38(0x18)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	enum class EEulerRotationOrder               RigVMModel___RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const; // 0x50(0x1)(Edit, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_24C9[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        RigVMModel___RigUnit_SetRotation_2_Weight__Const;  // 0x54(0x4)(Edit, Net, EditFixedSize, Parm, Transient, EditConst, SubobjectReference)
	bool                                         RigVMModel___RigUnit_SetRotation_2_bPropagateToChildren__Const; // 0x58(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_24CA[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        RigVMModel___GroundConformForwardsSolve_DebugDrawThickness__Const; // 0x5C(0x4)(ConstParm, BlueprintVisible, Net, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       RigVMModel___GroundConformForwardsSolve_DebugDrawScale__Const; // 0x60(0x8)(Edit, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        RigVMModel___GroundConformForwardsSolve_SpringStrength__Const; // 0x68(0x4)(Edit, BlueprintVisible, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_24CF[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___GroundConformForwardsSolve_DampingFactor__Const; // 0x70(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FRigElementKey                        RigVMModel___GroundConformForwardsSolve_Root_Bone__Const; // 0x78(0xC)(Edit, ExportObject, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___GroundConformForwardsSolve_Hip_Bone__Const; // 0x84(0xC)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	float                                        RigVMModel___GroundConformForwardsSolve_Effector_Rotation_Alpha__Const; // 0x90(0x4)(Edit, BlueprintReadOnly, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	float                                        RigVMModel___GroundConformForwardsSolve_Effector_Pin_Rotation__Const; // 0x94(0x4)(ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, SubobjectReference)
	TArray<double>                               RigVMModel___GroundConformForwardsSolve_TimingBias__Const; // 0x98(0x10)(Edit, ExportObject, Net, Parm, OutParm, ReturnParm, EditConst, SubobjectReference)
	double                                       RigVMModel___GroundConformForwardsSolve_TimingBiasSpeed__Const; // 0xA8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	float                                        RigVMModel___GroundConformForwardsSolve_ForceSleepTimeLimit__Const; // 0xB0(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalVariableDefault__GroundConformForwardsSolve_bNotAppliedCachedPose__Const; // 0xB4(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalVariableDefault__GroundConformForwardsSolve_bComponentMotionDetected__Const; // 0xB5(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalVariableDefault__GroundConformForwardsSolve_bTempMotionDetected__Const; // 0xB6(0x1)(Edit, ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	enum class ERigVMTransformSpace              GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_SetTransform_4_Space__Const; // 0xB7(0x1)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_SetTransform_4_bInitial__Const; // 0xB8(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_bInitial__Const; // 0xB9(0x1)(Edit, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_24D5[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_SetTransform_4_Weight__Const; // 0xBC(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, EditConst, SubobjectReference)
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_To_World_Value__Const; // 0xC0(0x60)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_2_1_Index__Const; // 0x120(0x4)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_4_Name__Const; // 0x124(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_1_Name__Const; // 0x12C(0x8)(ConstParm, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_1_Value__Const; // 0x134(0x4)(Edit, BlueprintVisible, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_1_Item__Const; // 0x138(0xC)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_1_Name__Const; // 0x144(0x8)(BlueprintVisible, Net, Parm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_Name__Const; // 0x14C(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	int32                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_1_Value__Const; // 0x154(0x4)(Edit, ConstParm, Net, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__CheckForAnimationMotion_CallGroundConform__Const; // 0x158(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalVariableDefault__CheckForAnimationMotion_DetectedPoseDifference__Const; // 0x159(0x1)(BlueprintVisible, ExportObject, OutParm, EditConst, SubobjectReference)
	uint8                                        Pad_24DA[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            LocalVariableDefault__CheckForAnimationMotion_To_World_World__Const; // 0x160(0x60)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              CheckForAnimationMotion___CheckForAnimationMotion_GetTransform_1_1_Space__Const; // 0x1C0(0x1)(ConstParm, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_GetTransform_1_1_bInitial__Const; // 0x1C1(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	enum class ERigElementType                   CheckForAnimationMotion___CheckForAnimationMotion_HierarchyGetPoseItemArray_1_ElementType__Const; // 0x1C2(0x1)(Edit, ExportObject, EditFixedSize, OutParm, EditConst, SubobjectReference)
	uint8                                        Pad_24DD[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CheckForAnimationMotion___CheckForAnimationMotion_PoseGetDelta_RotationThreshold__Const; // 0x1C4(0x4)(Edit, ExportObject, BlueprintReadOnly, Parm, ReturnParm, Config, EditConst, SubobjectReference)
	struct FRigElementKeyCollection              CheckForAnimationMotion___CheckForAnimationMotion_PoseGetDelta_ItemsToCompare__Const; // 0x1C8(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         LocalVariable__FunctionLibrary___CheckForAnimationMotion_VariableNode_1_Value__Const; // 0x1D8(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_24DF[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CheckForAnimationMotion___CheckForAnimationMotion_IsNearlyEqual_Tolerance__Const; // 0x1DC(0x4)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_2_Name__Const; // 0x1E0(0x8)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	int32                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Subtract_B__Const; // 0x1E8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	enum class ERigElementType                   GroundConformForwardsSolve___GroundConformForwardsSolve_HierarchyGetPoseItemArray_ElementType__Const; // 0x1EC(0x1)(ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_24E0[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FRigElementKey>                GroundConformForwardsSolve___GroundConformForwardsSolve_HierarchyGetPoseItemArray_ItemsToGet__Const; // 0x1F0(0x10)(Edit, ConstParm, ExportObject, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_VariableNode_1_Value__Const; // 0x200(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_24E1[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_2_Name__Const; // 0x204(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_Space__Const; // 0x20C(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_bInitial__Const; // 0x20D(0x1)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_24E2[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_Name__Const; // 0x210(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_Default__Const; // 0x218(0x4)(Edit, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_24E5[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Minimum_1_B__Const; // 0x220(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_Name__Const; // 0x228(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_Default__Const; // 0x230(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_2_Name__Const; // 0x248(0x8)(ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_Name__Const; // 0x250(0x8)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_Name__Const; // 0x258(0x8)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_Default__Const; // 0x260(0xC)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_1_Name__Const; // 0x26C(0x8)(Edit, ConstParm, BlueprintVisible, Net, Parm, ReturnParm, Config, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_2_1_1_Name__Const; // 0x274(0x8)(BlueprintReadOnly, EditFixedSize, Parm, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_3_1_Name__Const; // 0x27C(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_24E9[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LookAt_1_1___LookAt_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x288(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        LookAt_1_1___LookAt_Scale_Factor__Const;           // 0x2A0(0x4)(ExportObject, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_24EB[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LookAt_1_1___LookAt_Rotate_Vector_1_Vector__Const; // 0x2A8(0x18)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__MakeArrayFromStartToEndBone_ChildrenArray__Const; // 0x2C0(0x10)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__MakeArrayFromStartToEndBone_ParentsArray__Const; // 0x2D0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__MakeArrayFromStartToEndBone_OutChain__Const; // 0x2E0(0x10)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalVariableDefault__MakeArrayFromStartToEndBone_ChainComplete__Const; // 0x2F0(0x1)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_24EE[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_Prefix__Const; // 0x2F8(0x10)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_Enabled__Const; // 0x308(0x1)(BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_24EF[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_ScreenDuration__Const; // 0x30C(0x4)(ExportObject, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	struct FLinearColor                          MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_ScreenColor__Const; // 0x310(0x10)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_1_Prefix__Const; // 0x320(0x10)(Edit, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_CollectionChildrenArray_bIncludeParent__Const; // 0x330(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	enum class ERigElementType                   MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_CollectionChildrenArray_TypeToSearch__Const; // 0x331(0x1)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_24F0[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_Prefix__Const; // 0x338(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_1_Prefix__Const; // 0x348(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_2_Prefix__Const; // 0x358(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_2_1_Prefix__Const; // 0x368(0x10)(ConstParm, ExportObject, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_Prefix__Const; // 0x378(0x10)(Edit, ConstParm, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_1_Prefix__Const; // 0x388(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__CalculateLengthOfElementChain_NewLocalVar__Const; // 0x398(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__CalculateLengthOfElementChain_MathIntEquals_Result__Const; // 0x3A8(0x1)(Edit, ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_24F4[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        LocalVariableDefault__CalculateLengthOfElementChain_numBones__Const; // 0x3AC(0x4)(BlueprintVisible, ExportObject, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        LocalVariableDefault__CalculateLengthOfElementChain_currentDistance__Const; // 0x3B0(0x4)(ConstParm, EditFixedSize, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	float                                        LocalVariableDefault__CalculateLengthOfElementChain_averageDistance__Const; // 0x3B4(0x4)(ConstParm, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class FString                                CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_Prefix__Const; // 0x3B8(0x10)(EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_Enabled__Const; // 0x3C8(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, EditConst, SubobjectReference)
	uint8                                        Pad_24F5[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_ScreenDuration__Const; // 0x3CC(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FLinearColor                          CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_ScreenColor__Const; // 0x3D0(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, EditConst, SubobjectReference)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntSub_1_B__Const; // 0x3E0(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	float                                        LocalVariable__FunctionLibrary___CalculateLengthOfElementChain_VariableNode_7_Value__Const; // 0x3E4(0x4)(ConstParm, BlueprintVisible, DisableEditOnTemplate, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_1_Space__Const; // 0x3E8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_24F6[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_Name__Const; // 0x3EC(0x8)(Edit, ConstParm, BlueprintVisible, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	int32                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Index__Const; // 0x3F4(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_Name__Const; // 0x3F8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_5_Name__Const; // 0x400(0x8)(ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_Strength__Const; // 0x408(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, Transient, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_1_Strength__Const; // 0x40C(0x4)(BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	int32                                        GroundConformForwardsSolve___GroundConformForwardsSolve_GroundConform_HitNotifyCheckFrame__Const; // 0x410(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_24FA[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Multiply_B__Const; // 0x418(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalVariableDefault__GroundConform_SphereTrace_bHit__Const; // 0x420(0x1)(Edit, ExportObject, Net, EditFixedSize, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalVariableDefault__GroundConform_FirstSphereTrace_bHit__Const; // 0x421(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_24FC[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        LocalVariableDefault__GroundConform_CurrentIndex__Const; // 0x424(0x4)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FRigElementKey                        LocalVariableDefault__GroundConform_CurrentElement__Const; // 0x428(0xC)(Edit, ZeroConstructor, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_24FD[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FHitResult                            LocalVariableDefault__GroundConform_SphereTraceByTraceChannel_WorldSpaceHitResult__Const; // 0x438(0xF0)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FVector>                       LocalVariableDefault__GroundConform_EffectorPositionCache__Const; // 0x528(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalVariableDefault__GroundConform_HasMotion__Const; // 0x538(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_24FF[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LocalVariableDefault__GroundConform_CurrentElementGravity__Const; // 0x540(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__GroundConform_bShouldCheckHitNotify__Const; // 0x548(0x1)(BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2500[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        LocalVariableDefault__GroundConform_CurrentControl__Const; // 0x54C(0xC)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__GroundConform_TargetPosition__Const; // 0x558(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FQuat                                 LocalVariableDefault__GroundConform_TargetRotation__Const; // 0x570(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FTransform                            LocalVariableDefault__GroundConform_ParentTransform__Const; // 0x590(0x60)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	struct FTransform                            LocalVariableDefault__GroundConform_CurrentTransform__Const; // 0x5F0(0x60)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	float                                        LocalVariableDefault__GroundConform_DistanceToParent__Const; // 0x650(0x4)(Edit, ConstParm, Net, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2503[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalVariableDefault__GroundConform_PreviousPosition__Const; // 0x658(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               LocalVariableDefault__GroundConform_Solver_Position__Const; // 0x670(0x18)(ExportObject, Parm, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               LocalVariableDefault__GroundConform_If_4_Result__Const; // 0x688(0x18)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               LocalVariableDefault__GroundConform_TrueIn__Const; // 0x6A0(0x18)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__GroundConform_FalseIn__Const; // 0x6B8(0x18)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalVariableDefault__GroundConform_BoolIn__Const; // 0x6D0(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2505[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FVector>                       LocalVariableDefault__GroundConform_TracePathPositions_Local__Const; // 0x6D8(0x10)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__GroundConform_bHasDynamicBase_LastFrame_Local__Const; // 0x6E8(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2506[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalVariableDefault__GroundConform_TraceHitPosition_Local__Const; // 0x6F0(0x18)(Edit, BlueprintVisible, Net, EditFixedSize, Config, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__GroundConform_TraceCenter_Local__Const; // 0x708(0x18)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	int32                                        GroundConform___GroundConform_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Index__Const; // 0x720(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_17_Name__Const; // 0x724(0x8)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_17_Default__Const; // 0x72C(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2508[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_9_Name__Const; // 0x730(0x8)(Edit, EditFixedSize, Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	bool                                         LocalVariable__FunctionLibrary___GroundConform_VariableNode_80_Value__Const; // 0x738(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2509[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        GroundConform___GroundConform_Subtract_9_B__Const; // 0x73C(0x4)(BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_Name__Const; // 0x740(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	enum class ERigVMTransformSpace              GroundConform___GroundConform_GetTransform_3_Space__Const; // 0x748(0x1)(ConstParm, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_250A[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_7_Name__Const; // 0x74C(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0x754(0x8)(Edit, ConstParm, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_2_Default__Const; // 0x75C(0xC)(BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_5_1_Name__Const; // 0x768(0x8)(ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FRigElementKey                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_5_1_Default__Const; // 0x770(0xC)(Edit, BlueprintVisible, Net, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_250D[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConform___GroundConform_Add_2_B__Const;      // 0x780(0x8)(ConstParm, BlueprintVisible, Net, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Clamp_2_Minimum__Const; // 0x788(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_Name__Const; // 0x790(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_Default__Const; // 0x798(0x4)(ConstParm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_2_Name__Const; // 0x79C(0x8)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	uint8                                        Pad_250F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_4_Default__Const; // 0x7A8(0x18)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_7_Name__Const; // 0x7C0(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_3_Add_3_B__Const; // 0x7C8(0x18)(ConstParm, ExportObject, Net, OutParm, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_5_B__Const; // 0x7E0(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FVector>                       GroundConform___GroundConform_ArrayAppend_Other__Const; // 0x7E8(0x10)(ConstParm, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Add_9_A__Const;      // 0x7F8(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Add_9_1_A__Const;    // 0x800(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_4_3_B__Const; // 0x808(0x8)(ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	enum class ETraceTypeQuery                   GroundConform___GroundConform_SphereTraceByTraceChannel_TraceChannel__Const; // 0x810(0x1)(ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2511[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        GroundConform___GroundConform_ArrayGetAtIndex_8_1_1_Index__Const; // 0x814(0x4)(Edit, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2512[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 GroundConform___GroundConform_From_World_4_1_Value__Const; // 0x820(0x20)(Edit, ConstParm, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	double                                       GroundConform___GroundConform_Less_1_B__Const;     // 0x840(0x8)(BlueprintVisible, ExportObject, OutParm, EditConst, SubobjectReference)
	int32                                        MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x848(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FName                                  MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_6_1_Name__Const; // 0x84C(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FRigElementKey                        MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_6_1_Default__Const; // 0x854(0xC)(Edit, ExportObject, Net, EditFixedSize, ReturnParm, Transient, EditConst, SubobjectReference)
	class FName                                  MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_14_Name__Const; // 0x860(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class FName                                  LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0x868(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, SubobjectReference)
	struct FTransform                            LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Default__Const; // 0x870(0x60)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_6_True__Const; // 0x8D0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_6_False__Const; // 0x8D8(0x8)(Edit, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_3_Multiply_3_1_B__Const; // 0x8E0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               ReorientBone___ReorientBone_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x8E8(0x18)(Edit, EditFixedSize, Parm, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	class FName                                  ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0x900(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, EditConst, SubobjectReference)
	class FName                                  ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Name__Const; // 0x908(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Default__Const; // 0x910(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, EditConst, SubobjectReference)
	class FName                                  ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Name__Const; // 0x91C(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_2514[0xC];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Default__Const; // 0x930(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       GroundConform___GroundConform_Interpolate_1_1_B__Const; // 0x950(0x8)(Edit, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Interpolate_1_2_A__Const; // 0x958(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Interpolate_1_2_B__Const; // 0x960(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__Solver_PostZConstraint__Const; // 0x968(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	double                                       Solver___Solver_GreaterEqual_1_B__Const;           // 0x980(0x8)(BlueprintVisible, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	double                                       Solver___Solver_Subtract_6_A__Const;               // 0x988(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	double                                       Solver___Solver_Power_A__Const;                    // 0x990(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	double                                       Solver___Solver_Multiply_B__Const;                 // 0x998(0x8)(BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       Solver___Solver_Clamp_2_1_Minimum__Const;          // 0x9A0(0x8)(ConstParm, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  Solver___Solver_DISPATCH_RigDispatch_GetMetadata_Name__Const; // 0x9A8(0x8)(EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               Solver___Solver_DISPATCH_RigDispatch_GetMetadata_Default__Const; // 0x9B0(0x18)(ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       Solver___Solver_Multiply_7_B__Const;               // 0x9C8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       Solver___Solver_Remap_1_SourceMaximum__Const;      // 0x9D0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Config, EditConst, SubobjectReference)
	double                                       Solver___Solver_Remap_1_TargetMinimum__Const;      // 0x9D8(0x8)(Edit, ExportObject, Net, OutParm, ReturnParm, EditConst, SubobjectReference)
	double                                       Solver___Solver_Remap_1_TargetMaximum__Const;      // 0x9E0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         Solver___Solver_Remap_1_bClamp__Const;             // 0x9E8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2516[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Solver___Solver_Divide_2_B__Const;                 // 0x9F0(0x8)(ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       Solver___Solver_Greater_3_B__Const;                // 0x9F8(0x8)(ConstParm, ExportObject, Parm, ZeroConstructor, EditConst, SubobjectReference)
	float                                        Solver___Solver_Scale_2_1_Factor__Const;           // 0xA00(0x4)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2517[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Solver___Solver_Multiply_8_B__Const;               // 0xA08(0x8)(ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	int32                                        Solver___Solver_DISPATCH_RigDispatch_CoreEquals_B__Const; // 0xA10(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, Transient, Config, EditConst, SubobjectReference)
	bool                                         Solver___Solver_If_2_Condition__Const;             // 0xA14(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_251A[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  Solver___Solver_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0xA18(0x8)(Edit, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FTransform                            Solver___Solver_DISPATCH_RigDispatch_GetMetadata_2_Default__Const; // 0xA20(0x60)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	double                                       Solver___Solver_Multiply_5_B__Const;               // 0xA80(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       Solver___Solver_Clamp_1_Maximum__Const;            // 0xA88(0x8)(ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        Solver___Solver_Interpolate_T__Const;              // 0xA90(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	int32                                        ParentChainLengthConstraint___ParentChainLengthConstraint_DISPATCH_RigDispatch_CoreEquals_B__Const; // 0xA94(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	struct FVector                               ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0xA98(0x18)(BlueprintReadOnly, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0xAB0(0x8)(Edit, ConstParm, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	class FName                                  ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Name__Const; // 0xAB8(0x8)(Edit, ConstParm, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FRigElementKey                        ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Default__Const; // 0xAC0(0xC)(Edit, Net, EditFixedSize, Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	class FName                                  ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Name__Const; // 0xACC(0x8)(ConstParm, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_251F[0xC];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Default__Const; // 0xAE0(0x20)(ExportObject, BlueprintReadOnly, Net, Parm, Transient, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_SpringInterpQuaternionV2_Strength__Const; // 0xB00(0x4)(Edit, ConstParm, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConform___GroundConform_SpringInterpQuaternionV2_CriticalDamping__Const; // 0xB04(0x4)(Net, EditFixedSize, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_253D[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FPBIKEffector                         GroundConform___GroundConform_ArraySetAtIndex_Element__Const; // 0xB10(0x90)(ConstParm, Net, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	struct FTransform                            GroundConform___GroundConform_Set_Transform_1_Value__Const; // 0xBA0(0x60)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	class FString                                GroundConform___GroundConform_DISPATCH_RigVMDispatch_Print_Prefix__Const; // 0xC00(0x10)(ConstParm, ExportObject, Net, ReturnParm, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_DISPATCH_RigVMDispatch_Print_ScreenDuration__Const; // 0xC10(0x4)(Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FLinearColor                          GroundConform___GroundConform_DISPATCH_RigVMDispatch_Print_ScreenColor__Const; // 0xC14(0x10)(Edit, ExportObject, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FLinearColor                          GroundConform___GroundConform_DebugLineItemSpace_1_Color__Const; // 0xC24(0x10)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_253F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_RigVMFunction_MathQuaternionFromTwoVectors_A__Const; // 0xC38(0x18)(ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	struct FLinearColor                          GroundConform___GroundConform_DebugRectangleItemSpace_1_Color__Const; // 0xC50(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_8_B__Const; // 0xC60(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_8_1_B__Const; // 0xC68(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	struct FLinearColor                          GroundConform___GroundConform_DebugLineItemSpace_1_2_Color__Const; // 0xC70(0x10)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, Config, EditConst, SubobjectReference)
	struct FLinearColor                          GroundConform___GroundConform_DebugLineItemSpace_1_1_Color__Const; // 0xC80(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_5_Name__Const; // 0xC90(0x8)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_14_Name__Const; // 0xC98(0x8)(Edit, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_1_Name__Const; // 0xCA0(0x8)(ConstParm, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_If_5_True__Const;    // 0xCA8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_If_5_False__Const;   // 0xCB0(0x8)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FTransform>                    GroundConform___GroundConform_DrawTransforms_Transforms__Const; // 0xCB8(0x10)(Edit, ConstParm, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_12_B__Const; // 0xCC8(0x8)(BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_4_B__Const; // 0xCD0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	enum class ERigUnitDebugTransformMode        GroundConform___GroundConform_DrawTransforms_Mode__Const; // 0xCD8(0x1)(Edit, ConstParm, BlueprintVisible, Net, Parm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_2543[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          GroundConform___GroundConform_DrawTransforms_Color__Const; // 0xCDC(0x10)(ConstParm, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2545[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FTransform>                    LocalVariableDefault__DrawTransforms_the_transforms__Const; // 0xCF0(0x10)(BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FTransform                            DrawTransforms___DrawTransforms_DebugTransformMutableItemSpace_WorldOffset__Const; // 0xD00(0x60)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         DrawTransforms___DrawTransforms_DebugTransformMutableItemSpace_bEnabled__Const; // 0xD60(0x1)(Edit, BlueprintVisible, ExportObject, OutParm, EditConst, SubobjectReference)
	uint8                                        Pad_2546[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_4_Value__Const; // 0xD64(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConform___GroundConform_RigVMFunction_DebugArcNoSpace_MaximumDegrees__Const; // 0xD68(0x4)(Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	int32                                        GroundConform___GroundConform_RigVMFunction_DebugArcNoSpace_Detail__Const; // 0xD6C(0x4)(BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_RigVMFunction_MathQuaternionFromEuler_Euler__Const; // 0xD70(0x18)(Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	enum class EEulerRotationOrder               GroundConform___GroundConform_RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const; // 0xD88(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2547[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          GroundConform___GroundConform_RigVMFunction_DebugArcNoSpace_1_Color__Const; // 0xD8C(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	uint8                                        Pad_2548[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Greater_B__Const; // 0xDA0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_5_Name__Const; // 0xDA8(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_8_Name__Const; // 0xDB0(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_Add_5_B__Const; // 0xDB8(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_Add_2_1_B__Const; // 0xDD0(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	enum class ETraceTypeQuery                   GroundConformForwardsSolve___GroundConformForwardsSolve_SphereTraceByTraceChannel_1_TraceChannel__Const; // 0xDE8(0x1)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2549[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SphereTraceByTraceChannel_1_Radius__Const; // 0xDEC(0x4)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Scale_Factor__Const; // 0xDF0(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FLinearColor                          GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_DebugLineNoSpace_1_Color__Const; // 0xDF4(0x10)(BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_DebugLineNoSpace_1_Thickness__Const; // 0xE04(0x4)(Edit, ConstParm, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_6_Default__Const; // 0xE08(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_9_Name__Const; // 0xE20(0x8)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	enum class ERigElementType                   RigVMModel___HierarchySetPoseItemArray_1_1_ElementType__Const; // 0xE28(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	enum class ERigVMTransformSpace              RigVMModel___HierarchySetPoseItemArray_1_1_Space__Const; // 0xE29(0x1)(BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_254C[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FRigElementKey>                RigVMModel___HierarchySetPoseItemArray_1_1_ItemsToSet__Const; // 0xE30(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  RigVMModel___PBIK_1_Root__Const;                   // 0xE40(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<struct FPBIKBoneSetting>              RigVMModel___PBIK_1_BoneSettings__Const;           // 0xE48(0x10)(BlueprintVisible, Net, Parm, ReturnParm, EditConst, SubobjectReference)
	TArray<class FName>                          RigVMModel___PBIK_1_ExcludedBones__Const;          // 0xE58(0x10)(BlueprintVisible, Parm, ReturnParm, Config, EditConst, SubobjectReference)
	struct FPBIKSolverSettings                   RigVMModel___PBIK_1_Settings__Const;               // 0xE68(0x3C)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FPBIKDebug                            RigVMModel___PBIK_1_Debug__Const;                  // 0xEA4(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	class FName                                  RigVMModel___DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0xEAC(0x8)(ExportObject, Net, EditFixedSize, OutParm, Transient, Config, EditConst, SubobjectReference)
	int32                                        RigVMModel___DISPATCH_RigDispatch_GetMetadata_2_Default__Const; // 0xEB4(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	enum class ERigElementType                   RigVMModel___HierarchyGetPoseItemArray_1_1_ElementType__Const; // 0xEB8(0x1)(ConstParm, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_254D[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_Items__Const;       // 0xEC0(0x10)(BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_1_Items__Const;     // 0xED0(0x10)(ConstParm, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<struct FRigPoseElement>               LocalVariableDefault__GroundConform_Constructor_CalculateLengthOfChain_Bones__Const; // 0xEE0(0x10)(Edit, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__SortRigElements_NewElements__Const; // 0xEF0(0x10)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        LocalVariableDefault__SortRigElements_InsertIndex__Const; // 0xF00(0x4)(Edit, BlueprintVisible, Net, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	int32                                        LocalVariableDefault__SortRigElements_NewElementsNum__Const; // 0xF04(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__SortRigElements_ArrayIntersection_Result__Const; // 0xF08(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__SortRigElements_CollectionChildrenArray_Items__Const; // 0xF18(0x10)(Edit, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalVariableDefault__SortRigElements_bBreakLoop__Const; // 0xF28(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_2559[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<int32>                                LocalVariableDefault__SortRigElements_SortedIndexArray__Const; // 0xF30(0x10)(Edit, BlueprintVisible, Net, Parm, EditConst, SubobjectReference)
	int32                                        LocalVariableDefault__SortRigElements_MainLoopIndex__Const; // 0xF40(0x4)(Edit, ExportObject, Net, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	int32                                        LocalVariable__FunctionLibrary___SortRigElements_VariableNode_13_Value__Const; // 0xF44(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	struct FRigElementKey                        SortRigElements___SortRigElements_DISPATCH_RigDispatch_CoreEquals_B__Const; // 0xF48(0xC)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	int32                                        SortRigElements___SortRigElements_ArrayInsert_1_1_Element__Const; // 0xF54(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         SortRigElements___SortRigElements_CollectionChildrenArray_bIncludeParent__Const; // 0xF58(0x1)(BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         SortRigElements___SortRigElements_CollectionChildrenArray_bRecursive__Const; // 0xF59(0x1)(Edit, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	enum class ERigElementType                   SortRigElements___SortRigElements_CollectionChildrenArray_TypeToSearch__Const; // 0xF5A(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_255A[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        SortRigElements___SortRigElements_Add_B__Const;    // 0xF5C(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__SortByIndexArray_NewElements__Const; // 0xF60(0x10)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	int32                                        SortByIndexArray_1___SortByIndexArray_GreaterEqual_B__Const; // 0xF70(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_255B[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<double>                               LocalVariableDefault__SortByIndexArrayFloat_NewElements__Const; // 0xF78(0x10)(ConstParm, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	int32                                        SortByIndexArrayFloat___SortByIndexArrayFloat_GreaterEqual_B__Const; // 0xF88(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_255D[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<double>                               LocalVariableDefault__SortByIndexArrayFloat_NewElements__Const; // 0xF90(0x10)(ConstParm, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	int32                                        SortByIndexArrayFloat_1___SortByIndexArrayFloat_GreaterEqual_B__Const; // 0xFA0(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, EditConst, SubobjectReference)
	uint8                                        Pad_255F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<bool>                                 LocalVariableDefault__SortByIndexArrayBoolean_NewElements__Const; // 0xFA8(0x10)(BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	int32                                        SortByIndexArrayBoolean___SortByIndexArrayBoolean_GreaterEqual_B__Const; // 0xFB8(0x4)(Edit, BlueprintVisible, ExportObject, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2560[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<double>                               LocalVariableDefault__SortByIndexArrayFloat_NewElements__Const; // 0xFC0(0x10)(ConstParm, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	int32                                        SortByIndexArrayFloat_1_1___SortByIndexArrayFloat_GreaterEqual_B__Const; // 0xFD0(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2561[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<double>                               LocalVariableDefault__SortByIndexArrayFloat_NewElements__Const; // 0xFD8(0x10)(ConstParm, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	int32                                        SortByIndexArrayFloat_1_1_1___SortByIndexArrayFloat_GreaterEqual_B__Const; // 0xFE8(0x4)(ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2562[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<double>                               LocalVariableDefault__SortByIndexArrayFloat_NewElements__Const; // 0xFF0(0x10)(ConstParm, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	int32                                        SortByIndexArrayFloat_0___SortByIndexArrayFloat_GreaterEqual_B__Const; // 0x1000(0x4)(ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_GetMetadata_4_1_Name__Const; // 0x1004(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, Transient, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_GetMetadata_4_1_Default__Const; // 0x100C(0xC)(BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FRigElementKey                        GroundConform_Constructor_1___GroundConform_Constructor_If_1_False__Const; // 0x1018(0xC)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_Concat_1_B__Const; // 0x1024(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2563[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            GroundConform_Constructor_1___GroundConform_Constructor_SpawnControl_OffsetTransform__Const; // 0x1030(0x60)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	enum class ERigVMTransformSpace              GroundConform_Constructor_1___GroundConform_Constructor_GetTransform_Space__Const; // 0x1090(0x1)(ExportObject, Net, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform_Constructor_1___GroundConform_Constructor_GetTransform_bInitial__Const; // 0x1091(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2565[0xE];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigUnit_HierarchyAddControlTransform_Settings GroundConform_Constructor_1___GroundConform_Constructor_SpawnControl_Settings__Const; // 0x10A0(0xC0)(ConstParm, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform_Constructor_1___GroundConform_Constructor_Scale_Value__Const; // 0x1160(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2566[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FPBIKEffector                         GroundConform_Constructor_1___GroundConform_Constructor_ArrayAdd_Element__Const; // 0x1180(0x90)(BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_1_Name__Const; // 0x1210(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform_Constructor_1___GroundConform_Constructor_ArrayAdd_1_Element__Const; // 0x1218(0x18)(Edit, Net, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_3_Name__Const; // 0x1230(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2567[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 GroundConform_Constructor_1___GroundConform_Constructor_ArrayAdd_3_Element__Const; // 0x1240(0x20)(ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_5_Name__Const; // 0x1260(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_Name__Const; // 0x1268(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         GroundConform_Constructor_1___GroundConform_Constructor_GetTransform_2_2_bInitial__Const; // 0x1270(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2568[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_3_Name__Const; // 0x1274(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_2_1_Name__Const; // 0x127C(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_2_Name__Const; // 0x1284(0x8)(ConstParm, Net, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_1_Name__Const; // 0x128C(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_2_1_1_Name__Const; // 0x1294(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_3_1_Name__Const; // 0x129C(0x8)(BlueprintVisible, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_256C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LookAt_1_1___LookAt_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x12A8(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        LookAt_1_1___LookAt_Scale_Factor__Const;           // 0x12C0(0x4)(ExportObject, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_256E[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LookAt_1_1___LookAt_Rotate_Vector_1_Vector__Const; // 0x12C8(0x18)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__MakeArrayFromStartToEndBone_ChildrenArray__Const; // 0x12E0(0x10)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__MakeArrayFromStartToEndBone_ParentsArray__Const; // 0x12F0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__MakeArrayFromStartToEndBone_OutChain__Const; // 0x1300(0x10)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalVariableDefault__MakeArrayFromStartToEndBone_ChainComplete__Const; // 0x1310(0x1)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2571[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_Prefix__Const; // 0x1318(0x10)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_Enabled__Const; // 0x1328(0x1)(BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2572[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_ScreenDuration__Const; // 0x132C(0x4)(ExportObject, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	struct FLinearColor                          MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_ScreenColor__Const; // 0x1330(0x10)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_1_Prefix__Const; // 0x1340(0x10)(Edit, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_CollectionChildrenArray_bIncludeParent__Const; // 0x1350(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	enum class ERigElementType                   MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_CollectionChildrenArray_TypeToSearch__Const; // 0x1351(0x1)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2573[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_Prefix__Const; // 0x1358(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_1_Prefix__Const; // 0x1368(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_2_Prefix__Const; // 0x1378(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_2_1_Prefix__Const; // 0x1388(0x10)(ConstParm, ExportObject, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_Prefix__Const; // 0x1398(0x10)(Edit, ConstParm, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_1_Prefix__Const; // 0x13A8(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__CalculateLengthOfElementChain_NewLocalVar__Const; // 0x13B8(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__CalculateLengthOfElementChain_MathIntEquals_Result__Const; // 0x13C8(0x1)(Edit, ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2574[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        LocalVariableDefault__CalculateLengthOfElementChain_numBones__Const; // 0x13CC(0x4)(BlueprintVisible, ExportObject, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        LocalVariableDefault__CalculateLengthOfElementChain_currentDistance__Const; // 0x13D0(0x4)(ConstParm, EditFixedSize, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	float                                        LocalVariableDefault__CalculateLengthOfElementChain_averageDistance__Const; // 0x13D4(0x4)(ConstParm, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class FString                                CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_Prefix__Const; // 0x13D8(0x10)(EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_Enabled__Const; // 0x13E8(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, EditConst, SubobjectReference)
	uint8                                        Pad_2575[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_ScreenDuration__Const; // 0x13EC(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FLinearColor                          CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_ScreenColor__Const; // 0x13F0(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, EditConst, SubobjectReference)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntSub_1_B__Const; // 0x1400(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	float                                        LocalVariable__FunctionLibrary___CalculateLengthOfElementChain_VariableNode_7_Value__Const; // 0x1404(0x4)(ConstParm, BlueprintVisible, DisableEditOnTemplate, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_1_Space__Const; // 0x1408(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2578[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_Name__Const; // 0x140C(0x8)(Edit, BlueprintVisible, EditFixedSize, Parm, ReturnParm, Transient, EditConst, SubobjectReference)
	float                                        GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_GetMetadata_Default__Const; // 0x1414(0x4)(Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_4_Name__Const; // 0x1418(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_4_1_Name__Const; // 0x1420(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_4_1_1_Name__Const; // 0x1428(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  SnapControlsToBoneElements___SnapControlsToBoneElements_DISPATCH_RigDispatch_GetMetadata_3_Name__Const; // 0x1430(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FRigElementKey                        SnapControlsToBoneElements___SnapControlsToBoneElements_DISPATCH_RigDispatch_GetMetadata_3_Default__Const; // 0x1438(0xC)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              SnapControlsToBoneElements___SnapControlsToBoneElements_Set_Transform_Space__Const; // 0x1444(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	bool                                         SnapControlsToBoneElements___SnapControlsToBoneElements_Set_Transform_bInitial__Const; // 0x1445(0x1)(BlueprintVisible, ExportObject, Parm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_257C[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        SnapControlsToBoneElements___SnapControlsToBoneElements_RigUnit_GetTransform_20_Item__Const; // 0x1448(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        SnapControlsToBoneElements___SnapControlsToBoneElements_Set_Transform_Weight__Const; // 0x1454(0x4)(BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         SnapControlsToBoneElements___SnapControlsToBoneElements_Set_Transform_bPropagateToChildren__Const; // 0x1458(0x1)(ExportObject, BlueprintReadOnly, Net, Parm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_257E[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        SnapControlsToBoneElements___SnapControlsToBoneElements_Set_Transform_1_Item__Const; // 0x145C(0xC)(Edit, Config, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__InitConstrainLengthArray_NewArray__Const; // 0x1468(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	int32                                        InitConstrainLengthArray___InitConstrainLengthArray_Greater_B__Const; // 0x1478(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  InitConstrainLengthArray___InitConstrainLengthArray_DISPATCH_RigDispatch_SetMetadata_6_Name__Const; // 0x147C(0x8)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)

	static class UClass* StaticClass();
	static class URigVMMemory_Literal* GetDefaultObj();

};

// 0x5D50 (0x5D78 - 0x28)
// RigVMMemoryStorageGeneratorClass Human_GroundConform_CtrlRig.RigVMMemory_Work
class URigVMMemory_Work : public URigVMMemoryStorage
{
public:
	uint8                                        Pad_258C[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionFromEuler_Result; // 0x30(0x20)(ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_2_CachedIndex;    // 0x50(0x10)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         RigVMModel___GroundConformForwardsSolve_DidNotApplyCachedPose; // 0x60(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, EditConst, SubobjectReference)
	bool                                         RigVMModel___GroundConformForwardsSolve_Argument;  // 0x61(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_258D[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Root_Control; // 0x64(0xC)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Root_Bone; // 0x70(0xC)(Edit, Parm, Transient, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Hip_Bone; // 0x7C(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Effector_Rotation_Alpha; // 0x88(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Effector_Strength_Alpha; // 0x8C(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Effector_Position_Alpha; // 0x90(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Effector_Pin_Rotation; // 0x94(0x4)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_EnableGroundConforming; // 0x98(0x4)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2591[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<double>                               GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_TimingBias; // 0xA0(0x10)(Edit, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_TimingBiasSpeed; // 0xB0(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_ShowDebug; // 0xB8(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_IsFalling; // 0xB9(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2592[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_SleepPositionThreshold; // 0xC0(0x8)(BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Return_DidNotApplyCachedPose; // 0xC8(0x1)(BlueprintVisible, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Return_Argument; // 0xC9(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2593[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_ForceSleepTimeLimit; // 0xCC(0x4)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_Multiply_1_Result; // 0xD0(0x60)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, EditConst, SubobjectReference)
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_Transform; // 0x130(0x60)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_CachedIndex; // 0x190(0x10)(BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_20_Transform; // 0x1A0(0x60)(Edit, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_20_CachedIndex; // 0x200(0x10)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_SetTransform_4_CachedIndex; // 0x210(0x10)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolAnd_1_Result; // 0x220(0x1)(ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolNot_2_1_Result; // 0x221(0x1)(BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolNot_Result; // 0x222(0x1)(Edit, BlueprintVisible, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x223(0x1)(Edit, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2595[0xC];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_To_World_World; // 0x230(0x60)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_4_Value; // 0x290(0x60)(EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_2_1_Element; // 0x2F0(0xC)(Edit, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2596[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_4_Cache; // 0x300(0x10)(BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_4_Found; // 0x310(0x1)(ConstParm, EditFixedSize, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalVariable__GroundConformForwardsSolve_bComponentMotionDetected; // 0x311(0x1)(ConstParm, Net, EditFixedSize, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2597[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_6_Cache; // 0x318(0x10)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_6_Success; // 0x328(0x1)(Edit, ConstParm, Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_2598[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_Element; // 0x32C(0xC)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_1_Cache; // 0x338(0x10)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_1_Success; // 0x348(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2599[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_1_Cache; // 0x350(0x10)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_1_Success; // 0x360(0x1)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_259B[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_Value; // 0x364(0x4)(Edit, ExportObject, BlueprintReadOnly, Parm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_Cache; // 0x368(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_Found; // 0x378(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolAnd_3_Result; // 0x379(0x1)(BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Less_1_Result; // 0x37A(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Greater_2_1_Result; // 0x37B(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_Timeline_1_1_Time; // 0x37C(0x4)(Net, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	TArray<float>                                GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_Timeline_1_1_AccumulatedValue; // 0x380(0x10)(BlueprintVisible, Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<bool>                                 GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_Timeline_1_1_bIsInitialized; // 0x390(0x10)(ExportObject, Net, Parm, Transient, DisableEditOnInstance, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_Cache; // 0x3A0(0x10)(BlueprintVisible, EditFixedSize, ReturnParm, Config, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Add_1_Result; // 0x3B0(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_GetDeltaTime_1_Result; // 0x3B4(0x4)(BlueprintReadOnly, EditFixedSize, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_Success; // 0x3B8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_259D[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_ControlFlowBranch_3_BlockToRun; // 0x3BC(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_ControlFlowBranch_2_BlockToRun; // 0x3C4(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	int32                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_Value; // 0x3CC(0x4)(ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_Cache; // 0x3D0(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_Found; // 0x3E0(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_LessEqual_Result; // 0x3E1(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_259E[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_1_Cache; // 0x3E8(0x10)(Edit, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_1_Success; // 0x3F8(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_CheckForAnimationMotion_ShouldCallGroundConform; // 0x3F9(0x1)(BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_25A0[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_CheckForAnimationMotion_DetectedNoMotion; // 0x400(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_25A1[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_CheckForAnimationMotion_RootControlTransform; // 0x410(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Transient, EditConst, SubobjectReference)
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_CheckForAnimationMotion_HipTransform; // 0x470(0x60)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_CheckForAnimationMotion_Position_Threshold; // 0x4D0(0x4)(ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolNot_2_Result; // 0x4D4(0x1)(Edit, ConstParm, BlueprintVisible, Net, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_25A3[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        CheckForAnimationMotion___CheckForAnimationMotion_Entry_Root_Control; // 0x4D8(0xC)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FRigElementKey                        CheckForAnimationMotion___CheckForAnimationMotion_Entry_Hip_Bone; // 0x4E4(0xC)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	struct FTransform                            CheckForAnimationMotion___CheckForAnimationMotion_Entry_HipTransformLastFrame; // 0x4F0(0x60)(BlueprintVisible, ExportObject, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	struct FTransform                            CheckForAnimationMotion___CheckForAnimationMotion_Return_HipTransform; // 0x550(0x60)(Edit, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	float                                        CheckForAnimationMotion___CheckForAnimationMotion_Entry_Position_Threshold; // 0x5B0(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_Entry_NotOnPlatform; // 0x5B4(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_25A5[0xB];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            CheckForAnimationMotion___CheckForAnimationMotion_To_World_World; // 0x5C0(0x60)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	struct FTransform                            CheckForAnimationMotion___CheckForAnimationMotion_GetTransform_1_1_Transform; // 0x620(0x60)(Edit, ConstParm, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             CheckForAnimationMotion___CheckForAnimationMotion_GetTransform_1_1_CachedIndex; // 0x680(0x10)(Edit, ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalVariable__CheckForAnimationMotion_DetectedPoseDifference; // 0x690(0x1)(Edit, Net, EditFixedSize, Parm, OutParm, Transient, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolNot_Result; // 0x691(0x1)(BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_PoseGetDelta_PosesAreEqual; // 0x692(0x1)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_25A6[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigPose                              CheckForAnimationMotion___CheckForAnimationMotion_HierarchyGetPoseItemArray_1_Pose; // 0x698(0x70)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FRigElementKeyCollection              CheckForAnimationMotion___CheckForAnimationMotion_PoseGetDelta_ItemsToCompare__IO; // 0x708(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FRigElementKeyCollection              CheckForAnimationMotion___CheckForAnimationMotion_PoseGetDelta_ItemsWithDelta; // 0x718(0x10)(Edit, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	class FName                                  CheckForAnimationMotion___CheckForAnimationMotion_Branch_BlockToRun; // 0x728(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolOr_MathBoolOr_1_Result; // 0x730(0x1)(BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolOr_MathBoolOr_Result; // 0x731(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x732(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_25A8[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             CheckForAnimationMotion___CheckForAnimationMotion_GetTransform_1_CachedIndex; // 0x738(0x10)(ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_RigVMFunction_MathBoolAnd_Result; // 0x748(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolNot_1_Result; // 0x749(0x1)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_IsNearlyEqual_Result; // 0x74A(0x1)(BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_25AA[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               CheckForAnimationMotion___CheckForAnimationMotion_IsNearlyEqual_A; // 0x750(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Config, EditConst, SubobjectReference)
	struct FVector                               CheckForAnimationMotion___CheckForAnimationMotion_IsNearlyEqual_B; // 0x768(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolOr_1_MathBoolOr_1_1_Result; // 0x780(0x1)(BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolOr_1_MathBoolOr_1_Result; // 0x781(0x1)(ExportObject, OutParm, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_25AB[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CheckForAnimationMotion___CheckForAnimationMotion_Cast_Result; // 0x784(0x4)(Edit, ConstParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolNot_4_Result; // 0x788(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_25AC[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_2_Cache; // 0x790(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_2_Success; // 0x7A0(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_25AE[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_2_Element; // 0x7A4(0xC)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_Cache; // 0x7B0(0x10)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_2_Value; // 0x7C0(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_25B0[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_2_Cache; // 0x7C8(0x10)(ExportObject, Net, Parm, OutParm, ReturnParm, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_2_Found; // 0x7D8(0x1)(Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_Success; // 0x7D9(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_25B3[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_Cache; // 0x7E0(0x10)(Edit, ConstParm, BlueprintVisible, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Subtract_Result; // 0x7F0(0x4)(Edit, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_Success; // 0x7F4(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_25B4[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_Branch_1_BlockToRun; // 0x7F8(0x8)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FRigPose                              GroundConformForwardsSolve___GroundConformForwardsSolve_HierarchyGetPoseItemArray_Pose; // 0x800(0x70)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_MathBoolOr_1_Result; // 0x870(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolAnd_Result; // 0x871(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_1_Value; // 0x872(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_25B8[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_1_Cache; // 0x878(0x10)(Edit, BlueprintReadOnly, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_1_Found; // 0x888(0x1)(BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Less_Result; // 0x889(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_25B9[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_1_Value; // 0x88C(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_1_Element; // 0x890(0xC)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_25BB[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_1_Cache; // 0x8A0(0x10)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_1_Found; // 0x8B0(0x1)(Net, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_MathBoolNot_1_Result; // 0x8B1(0x1)(Edit, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_25BC[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ArrayIterator_Element; // 0x8B4(0xC)(Edit, BlueprintReadOnly, EditFixedSize, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_2_Cache; // 0x8C0(0x10)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Divide_Result; // 0x8D0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_25BD[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_Transform; // 0x8E0(0x60)(ConstParm, BlueprintReadOnly, OutParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_CachedIndex; // 0x940(0x10)(Edit, ExportObject, EditFixedSize, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Divide_A; // 0x950(0x8)(Edit, BlueprintReadOnly, Parm, ZeroConstructor, EditConst, SubobjectReference)
	uint8                                        Pad_25BE[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_1_2_2_Transform; // 0x960(0x60)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_1_2_2_CachedIndex; // 0x9C0(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Divide_B; // 0x9D0(0x8)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_2_Value; // 0x9D8(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_2_Success; // 0x9DC(0x1)(Edit, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Greater_Result; // 0x9DD(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_25C1[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArrayGetNum_Num; // 0x9E0(0x4)(EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	int32                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ArrayIterator_Index; // 0x9E4(0x4)(Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_2_3_Multiply_2_3_1_Result; // 0x9E8(0x4)(ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_2_3_Multiply_2_3_Result; // 0x9EC(0x4)(Edit, ConstParm, Net, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_Value; // 0x9F0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_25C3[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_Cache; // 0x9F8(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_Found; // 0xA08(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_25C4[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_Value; // 0xA0C(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_Cache; // 0xA10(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_Found; // 0xA20(0x1)(ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_25C5[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Divide_1_Result; // 0xA28(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Minimum_1_Result; // 0xA30(0x8)(ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Minimum_1_A; // 0xA38(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_Value; // 0xA40(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, Config, DisableEditOnInstance, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_Cache; // 0xA58(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_Found; // 0xA68(0x1)(ExportObject, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_25C6[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Divide_1_B; // 0xA70(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_2_3_Multiply_2_3_1_B; // 0xA78(0x4)(ConstParm, BlueprintVisible, Net, Parm, OutParm, EditConst, SubobjectReference)
	uint8                                        Pad_25C7[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArraySetAtIndex_Element; // 0xA80(0x8)(BlueprintReadOnly, DisableEditOnTemplate, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0xA88(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Greater_1_Result; // 0xA90(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_25C8[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArrayGetNum_1_Num; // 0xA94(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_2_1_Result; // 0xA98(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_2_Value; // 0xA9C(0x4)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_2_Cache; // 0xAA0(0x10)(ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_2_Found; // 0xAB0(0x1)(BlueprintVisible, Net, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_25CC[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_1_Value; // 0xAB4(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_1_Cache; // 0xAB8(0x10)(Edit, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_1_Found; // 0xAC8(0x1)(ConstParm, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_25CE[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArraySetAtIndex_1_Element; // 0xAD0(0x8)(Edit, ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_RigVMFunction_ControlFlowBranch_1_1_BlockToRun; // 0xAD8(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_Cache; // 0xAE0(0x10)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_MathVectorDistance_2_Result; // 0xAF0(0x4)(BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_25D3[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_2_Result; // 0xAF8(0x18)(Edit, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_2_2_Transform; // 0xB10(0x60)(EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_2_2_CachedIndex; // 0xB70(0x10)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_2_A; // 0xB80(0x18)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_1_1_Result; // 0xB98(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_1_2_Transform; // 0xBB0(0x60)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, EditConst, SubobjectReference)
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_Value; // 0xC10(0xC)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_25D9[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_Cache; // 0xC20(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_Found; // 0xC30(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_25DA[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_1_2_CachedIndex; // 0xC38(0x10)(Edit, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_1_1_A; // 0xC48(0x18)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_Success; // 0xC60(0x1)(ConstParm, BlueprintReadOnly, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_25DB[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_1_Value; // 0xC64(0xC)(ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_1_Cache; // 0xC70(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_1_Found; // 0xC80(0x1)(Edit, ExportObject, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_25DD[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_1_Cache; // 0xC88(0x10)(Edit, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_MathVectorDistance_2_1_Result; // 0xC98(0x4)(Edit, ConstParm, BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_25DF[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_Result; // 0xCA0(0x18)(Edit, ExportObject, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_25E0[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_2_2_1_Transform; // 0xCC0(0x60)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_2_2_1_CachedIndex; // 0xD20(0x10)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_A; // 0xD30(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, EditConst, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_1_Result; // 0xD48(0x18)(BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, Config, EditConst, SubobjectReference)
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_1_2_1_Transform; // 0xD60(0x60)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditConst, SubobjectReference)
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_2_Value; // 0xDC0(0xC)(Edit, ConstParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_25E2[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_2_Cache; // 0xDD0(0x10)(BlueprintVisible, ExportObject, Net, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_If_Result; // 0xDE0(0xC)(Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ItemExists_Exists; // 0xDEC(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_25E3[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_HierarchyGetParent_2_Parent; // 0xDF0(0xC)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_25E5[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_HierarchyGetParent_2_CachedChild; // 0xE00(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_HierarchyGetParent_2_CachedParent; // 0xE10(0x10)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ItemExists_CachedIndex; // 0xE20(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_2_Found; // 0xE30(0x1)(Edit, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_25E7[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_1_2_1_CachedIndex; // 0xE38(0x10)(Edit, BlueprintReadOnly, Net, ReturnParm, Config, EditConst, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_1_B; // 0xE48(0x18)(BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_1_Success; // 0xE60(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_25EB[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_2_1_1_Cache; // 0xE68(0x10)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_2_1_1_Success; // 0xE78(0x1)(Edit, ConstParm, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_25ED[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_1_Value; // 0xE7C(0xC)(Edit, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_1_Cache; // 0xE88(0x10)(Edit, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_1_Found; // 0xE98(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_25F0[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_3_1_Cache; // 0xEA0(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	struct FQuat                                 Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_11_Result; // 0xEB0(0x20)(Edit, ConstParm, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FQuat                                 Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Inverse_1_Result; // 0xED0(0x20)(ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	struct FQuat                                 Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_LookAt_1_1_Rotation; // 0xEF0(0x20)(Edit, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_3_1_1_Transform; // 0xF10(0x60)(EditFixedSize, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_3_1_1_CachedIndex; // 0xF70(0x10)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FQuat                                 Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_LookAt_1_1_CurrentRotation; // 0xF80(0x20)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_LookAt_1_1_Position; // 0xFA0(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_25F3[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_3_1_Transform; // 0xFC0(0x60)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_3_1_CachedIndex; // 0x1020(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_LookAt_1_1_ParentPosition; // 0x1030(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, Transient, Config, EditConst, SubobjectReference)
	bool                                         LookAt_1_1___LookAt_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x1048(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_25F6[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            LookAt_1_1___LookAt_Cast_Result;                   // 0x1050(0x60)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FMatrix                               LookAt_1_1___LookAt_MathMatrixFromVectors_1_Result; // 0x10B0(0x80)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, EditConst, SubobjectReference)
	struct FVector                               LookAt_1_1___LookAt_Unit_Result;                   // 0x1130(0x18)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               LookAt_1_1___LookAt_Scale_Result;                  // 0x1148(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               LookAt_1_1___LookAt_Subtract_Result;               // 0x1160(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FVector                               LookAt_1_1___LookAt_MathVectorCross_1_1_Result;    // 0x1178(0x18)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               LookAt_1_1___LookAt_Rotate_Vector_1_Result;        // 0x1190(0x18)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               LookAt_1_1___LookAt_MathVectorCross_1_1_1_Result;  // 0x11A8(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FQuat                                 LookAt_1_1___LookAt_If_True;                       // 0x11C0(0x20)(Edit, BlueprintVisible, ExportObject, Net, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_3_1_Success; // 0x11E0(0x1)(BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x11E1(0x1)(Edit, Net, Parm, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_25FB[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_HierarchyGetParent_Parent; // 0x11E4(0xC)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_HierarchyGetParent_CachedChild; // 0x11F0(0x10)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_HierarchyGetParent_CachedParent; // 0x1200(0x10)(BlueprintVisible, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_MakeArrayFromStartToEndBone_Chain; // 0x1210(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_CollectionChildrenArray_Items; // 0x1220(0x10)(Edit, EditFixedSize, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariable__MakeArrayFromStartToEndBone_ChildrenArray; // 0x1230(0x10)(ConstParm, Net, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayGetNum_Num; // 0x1240(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_2600[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FRigElementKey>                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_HierarchyGetParentsItemArray_Parents; // 0x1248(0x10)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_HierarchyGetParentsItemArray_CachedChild; // 0x1258(0x10)(Edit, ConstParm, EditFixedSize, Parm, Config, EditConst, SubobjectReference)
	TArray<struct FRigElementKeyCollection>      MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_HierarchyGetParentsItemArray_CachedParents; // 0x1268(0x10)(Edit, BlueprintVisible, Parm, Transient, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariable__MakeArrayFromStartToEndBone_ParentsArray; // 0x1278(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayGetNum_1_Num; // 0x1288(0x4)(Edit, ExportObject, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalVariable__MakeArrayFromStartToEndBone_ChainComplete; // 0x128C(0x1)(BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_MathBoolNot_Result; // 0x128D(0x1)(Edit, ExportObject, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayFind_Success; // 0x128E(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_2604[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_Element; // 0x1290(0xC)(ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayFind_Index; // 0x129C(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayAdd_Index; // 0x12A0(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_2_Value; // 0x12A4(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, EditConst, SubobjectReference)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_CoreEquals_Result; // 0x12AC(0x1)(OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2605[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_Branch_1_BlockToRun; // 0x12B0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_Branch_BlockToRun; // 0x12B8(0x8)(Edit, Net, EditFixedSize, Parm, ReturnParm, EditConst, SubobjectReference)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_Branch_2_BlockToRun; // 0x12C0(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_Index; // 0x12C8(0x4)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_Count; // 0x12CC(0x4)(EditFixedSize, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	float                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_Ratio; // 0x12D0(0x4)(Edit, BlueprintVisible, OutParm, Transient, EditConst, SubobjectReference)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_BlockToRun; // 0x12D4(0x8)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FRigElementKey                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_Element; // 0x12DC(0xC)(Edit, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_Value; // 0x12E8(0x8)(ConstParm, EditFixedSize, Parm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_Index; // 0x12F0(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_Count; // 0x12F4(0x4)(ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	float                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_Ratio; // 0x12F8(0x4)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_BlockToRun; // 0x12FC(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_1_Element; // 0x1304(0xC)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, EditConst, SubobjectReference)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_1_Value; // 0x1310(0x8)(ConstParm, Net, EditFixedSize, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_1_Index; // 0x1318(0x4)(Edit, ConstParm, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_1_Count; // 0x131C(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	float                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_1_Ratio; // 0x1320(0x4)(ConstParm, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_1_BlockToRun; // 0x1324(0x8)(ConstParm, Net, EditFixedSize, Parm, Transient, Config, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_CalculateLengthOfElementChain_Length; // 0x132C(0x4)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayGetNum_1_Num; // 0x1330(0x4)(Edit, BlueprintVisible, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntSub_1_Result; // 0x1334(0x4)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        LocalVariable__CalculateLengthOfElementChain_numBones; // 0x1338(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathBoolNot_Result; // 0x133C(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, ZeroConstructor, EditConst, SubobjectReference)
	bool                                         CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_CoreEquals_Result; // 0x133D(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2609[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayIterator_Index; // 0x1340(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, EditConst, SubobjectReference)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntSub_Result; // 0x1344(0x4)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayIterator_Count; // 0x1348(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathFloatAdd_Result; // 0x134C(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathVectorDistance_Result; // 0x1350(0x4)(BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_260B[0xC];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_1_Transform; // 0x1360(0x60)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FRigElementKey                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayIterator_Element; // 0x13C0(0xC)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_260D[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_1_CachedIndex; // 0x13D0(0x10)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathVectorDistance_A; // 0x13E0(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_260F[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_Transform; // 0x1400(0x60)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayGetAtIndex_Element; // 0x1460(0xC)(Edit, ConstParm, BlueprintVisible, Net, OutParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntAdd_Result; // 0x146C(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	TArray<struct FCachedRigElement>             CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_CachedIndex; // 0x1470(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathVectorDistance_B; // 0x1480(0x18)(Edit, ExportObject, Net, EditFixedSize, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  CalculateLengthOfElementChain___CalculateLengthOfElementChain_Branch_BlockToRun; // 0x1498(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayIterator_Ratio; // 0x14A0(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	class FName                                  CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayIterator_BlockToRun; // 0x14A4(0x8)(BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathFloatDiv_Result; // 0x14AC(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntToFloat_Result; // 0x14B0(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        LocalVariable__CalculateLengthOfElementChain_averageDistance; // 0x14B4(0x4)(Edit, ConstParm, BlueprintVisible, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_Cache; // 0x14B8(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_Success; // 0x14C8(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2613[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_Cache; // 0x14D0(0x10)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_Value; // 0x14E0(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2615[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_Cache; // 0x14E8(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_Found; // 0x14F8(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, ReturnParm, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_Success; // 0x14F9(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2616[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Branch_1_BlockToRun; // 0x14FC(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Branch_BlockToRun; // 0x1504(0x8)(BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x150C(0xC)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_Cache; // 0x1518(0x10)(Edit, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_Success; // 0x1528(0x1)(ConstParm, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2632[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_5_Cache; // 0x1530(0x10)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_5_Success; // 0x1540(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2634[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ArrayIterator_Count; // 0x1544(0x4)(OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ArrayIterator_Ratio; // 0x1548(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ArrayIterator_BlockToRun; // 0x154C(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x1554(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2636[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                GroundConformForwardsSolve___GroundConformForwardsSolve_GroundConform_TraceRadiiArray; // 0x1560(0x10)(Edit, ConstParm, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	TArray<float>                                GroundConformForwardsSolve___GroundConformForwardsSolve_GroundConform_InBendStiffness; // 0x1570(0x10)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_If_1_Result; // 0x1580(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Minimum_Result; // 0x1588(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Cast_Result; // 0x1590(0x4)(Edit, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_MathBoolNot_Result; // 0x1594(0x1)(BlueprintVisible, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2638[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Minimum_A; // 0x1598(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Cast_2_Result; // 0x15A0(0x4)(Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_MathBoolNot_2_Result; // 0x15A4(0x1)(ExportObject, Net, EditFixedSize, OutParm, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2639[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Minimum_B; // 0x15A8(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_Result; // 0x15B0(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_Target; // 0x15B4(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_Velocity; // 0x15B8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_263B[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_SimulatedResult; // 0x15C0(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, EditConst, SubobjectReference)
	TArray<struct FFloatSpringState>             GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_SpringState; // 0x15D0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, EditConst, SubobjectReference)
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_If_1_True; // 0x15E0(0x8)(ExportObject, Parm, Transient, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_GroundConform_Motionless; // 0x15E8(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_263C[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_If_2_Result; // 0x15EC(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Cast_1_Result; // 0x15F0(0x4)(Edit, ExportObject, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_1_Result; // 0x15F4(0x4)(BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_1_Velocity; // 0x15F8(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_263E[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_1_SimulatedResult; // 0x1600(0x10)(ConstParm, BlueprintVisible, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	TArray<struct FFloatSpringState>             GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_1_SpringState; // 0x1610(0x10)(BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_GroundConform_GroundConformProgressIn; // 0x1620(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Multiply_Result; // 0x1628(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConform___GroundConform_Entry_Effector_Rotation_Alpha; // 0x1630(0x4)(Edit, ConstParm, BlueprintVisible, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConform___GroundConform_Entry_Effector_Strength_Alpha; // 0x1634(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConform___GroundConform_Entry_Effector_Position_Alpha; // 0x1638(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, Transient, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_Entry_Effector_Pin_Rotation; // 0x163C(0x4)(BlueprintVisible, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_Entry_Effector_Pull_Chain_Alpha; // 0x1640(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConform___GroundConform_Entry_SwimmingDragAmount; // 0x1644(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Entry_GroundConformProgressIn; // 0x1648(0x8)(Edit, ConstParm, BlueprintVisible, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<double>                               GroundConform___GroundConform_Entry_TimingBias;    // 0x1650(0x10)(Edit, ConstParm, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Entry_TimingBiasSpeed; // 0x1660(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_Entry_WasMotionless; // 0x1668(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_2643[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        GroundConform___GroundConform_Entry_HitNotifyCheckFrame; // 0x166C(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform___GroundConform_Entry_TransformBones; // 0x1670(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_Entry_ShowDebug;     // 0x1671(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2647[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConform___GroundConform_Entry_SleepPositionThreshold; // 0x1678(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_17_Value; // 0x1680(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_264A[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        GroundConform___GroundConform_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Element; // 0x1684(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_17_Cache; // 0x1690(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_17_Found; // 0x16A0(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	bool                                         LocalVariable__GroundConform_bHasDynamicBase_LastFrame_Local; // 0x16A1(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform___GroundConform_MathBoolNot_5_Result; // 0x16A2(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalVariable__GroundConform_HasMotion;            // 0x16A3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_264E[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FVector>                       GroundConform___GroundConform_ArrayClone_Clone;    // 0x16A8(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FVector>                       LocalVariable__GroundConform_EffectorPositionCache; // 0x16B8(0x10)(Edit, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConform___GroundConform_ArrayGetAtIndex_14_Element; // 0x16C8(0xC)(Edit, BlueprintVisible, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	int32                                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_9_Value; // 0x16D4(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_9_Cache; // 0x16D8(0x10)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_9_Found; // 0x16E8(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_LessEqual_2_Result;  // 0x16E9(0x1)(ConstParm, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_264F[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_1_1_Cache; // 0x16F0(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_1_1_Success; // 0x1700(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         LocalVariable__GroundConform_bShouldCheckHitNotify; // 0x1701(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2651[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_6_Cache; // 0x1708(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	int32                                        GroundConform___GroundConform_Subtract_9_Result;   // 0x1718(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_6_Success; // 0x171C(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2652[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  GroundConform___GroundConform_Branch_1_1_BlockToRun; // 0x1720(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConform___GroundConform_ArrayIterator_1_1_Element; // 0x1728(0xC)(Edit, Net, OutParm, EditConst, SubobjectReference)
	uint8                                        Pad_2653[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_Cache; // 0x1738(0x10)(Edit, ConstParm, ExportObject, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2654[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            GroundConform___GroundConform_GetTransform_3_Transform; // 0x1750(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_GetTransform_3_CachedIndex; // 0x17B0(0x10)(ConstParm, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_Value; // 0x17C0(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_Success; // 0x17D8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2656[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_7_Cache; // 0x17E0(0x10)(Edit, BlueprintReadOnly, Net, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	struct FQuat                                 GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_7_Value; // 0x17F0(0x20)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_7_Success; // 0x1810(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_2657[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        GroundConform___GroundConform_ArrayIterator_1_1_Index; // 0x1814(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	int32                                        GroundConform___GroundConform_ArrayIterator_1_1_Count; // 0x1818(0x4)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_ArrayIterator_1_1_Ratio; // 0x181C(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  GroundConform___GroundConform_ArrayIterator_1_1_BlockToRun; // 0x1820(0x8)(Edit, ExportObject, Net, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        GroundConform___GroundConform_ArrayIterator_1_Index; // 0x1828(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	int32                                        LocalVariable__GroundConform_CurrentIndex;         // 0x182C(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FRigElementKey                        GroundConform___GroundConform_ArrayIterator_1_Element; // 0x1830(0xC)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FRigElementKey                        LocalVariable__GroundConform_CurrentElement;       // 0x183C(0xC)(ConstParm, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FRigElementKey                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_2_Value; // 0x1848(0xC)(BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2659[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_2_Cache; // 0x1858(0x10)(BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_2_Found; // 0x1868(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_265A[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        LocalVariable__GroundConform_CurrentControl;       // 0x186C(0xC)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_265B[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            GroundConform___GroundConform_GetTransform_5_2_Transform; // 0x1880(0x60)(BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_GetTransform_5_2_CachedIndex; // 0x18E0(0x10)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FTransform                            LocalVariable__GroundConform_CurrentTransform;     // 0x18F0(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	struct FTransform                            GroundConform___GroundConform_GetTransform_2_Transform; // 0x1950(0x60)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_5_1_Value; // 0x19B0(0xC)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_265D[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_5_1_Cache; // 0x19C0(0x10)(ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_5_1_Found; // 0x19D0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_265E[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_GetTransform_2_CachedIndex; // 0x19D8(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_265F[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            LocalVariable__GroundConform_ParentTransform;      // 0x19F0(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_10_Result;  // 0x1A50(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       GroundConform___GroundConform_Clamp_1_Result;      // 0x1A58(0x8)(ConstParm, ExportObject, EditFixedSize, Config, DisableEditOnInstance, SubobjectReference)
	double                                       GroundConform___GroundConform_Subtract_8_Result;   // 0x1A60(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	double                                       GroundConform___GroundConform_Add_2_Result;        // 0x1A68(0x8)(Edit, EditFixedSize, Transient, Config, DisableEditOnInstance, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_13_1_Result; // 0x1A70(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_15_Result;  // 0x1A78(0x8)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_13_Result;  // 0x1A80(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Clamp_2_Result;      // 0x1A88(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_ArrayGetAtIndex_15_Element; // 0x1A90(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, Transient, Config, EditConst, SubobjectReference)
	double                                       LocalVariable__GroundConform_CurrentElementGravity; // 0x1A98(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_If_16_Result;        // 0x1AA0(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform___GroundConform_ArrayGetAtIndex_9_1_1_Element; // 0x1AA4(0x1)(Edit, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2661[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_Value; // 0x1AA8(0x4)(ExportObject, EditFixedSize, Parm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2662[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_Cache; // 0x1AB0(0x10)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_Found; // 0x1AC0(0x1)(ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_2663[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_2_Value; // 0x1AC4(0x4)(BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_2_Cache; // 0x1AC8(0x10)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_2_Found; // 0x1AD8(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2664[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        LocalVariable__GroundConform_DistanceToParent;     // 0x1ADC(0x4)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_5_Result;        // 0x1AE0(0x18)(ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_4_Value; // 0x1AF8(0x18)(Edit, ConstParm, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_4_Cache; // 0x1B10(0x10)(BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_4_Found; // 0x1B20(0x1)(Edit, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2666[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_7_Value; // 0x1B28(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_7_Cache; // 0x1B40(0x10)(Edit, ConstParm, ExportObject, Net, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_7_Found; // 0x1B50(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2667[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalVariable__GroundConform_TraceCenter_Local;    // 0x1B58(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	TArray<struct FVector>                       LocalVariable__GroundConform_TracePathPositions_Local; // 0x1B70(0x10)(ConstParm, ExportObject, EditFixedSize, Parm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_3_1_Add_3_1_Result; // 0x1B80(0x18)(ConstParm, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_3_1_Add_3_Result; // 0x1B98(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_8_Result;        // 0x1BB0(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_2_Result;   // 0x1BC8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_5_Result;   // 0x1BD0(0x8)(ConstParm, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_If_18_Result;        // 0x1BD8(0x4)(ExportObject, BlueprintReadOnly, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_MathBoolAnd_2_MathBoolAnd_2_1_Result; // 0x1BDC(0x1)(Edit, ConstParm, Net, Parm, ReturnParm, Transient, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_MathBoolAnd_2_MathBoolAnd_2_Result; // 0x1BDD(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_12_Found; // 0x1BDE(0x1)(BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_2669[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_12_Cache; // 0x1BE0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_12_Value; // 0x1BF0(0x4)(BlueprintVisible, ExportObject, Net, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_CoreNotEquals_1_Result; // 0x1BF4(0x1)(Edit, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_266B[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConform___GroundConform_ArrayGetAtIndex_6_Element; // 0x1BF8(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_If_18_False;         // 0x1C00(0x4)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_266C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConform___GroundConform_Multiply_5_A;        // 0x1C08(0x8)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_3_1_Add_3_B;     // 0x1C10(0x18)(Edit, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_If_1_Result;         // 0x1C28(0x18)(ConstParm, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_3_Add_3_1_Result; // 0x1C40(0x18)(Edit, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_3_Add_3_Result;  // 0x1C58(0x18)(Edit, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_4_2_Result; // 0x1C70(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_4_2_A;      // 0x1C78(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_DISPATCH_RigVMDispatch_If_1_Result; // 0x1C80(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_ArrayGetAtIndex_9_1_1_1_Element; // 0x1C88(0x1)(Edit, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2670[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConform___GroundConform_Add_9_Result;        // 0x1C90(0x8)(Edit, ConstParm, BlueprintReadOnly, Parm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	double                                       GroundConform___GroundConform_Add_9_1_Result;      // 0x1C98(0x8)(Edit, ConstParm, Net, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_3_Add_3_B;       // 0x1CA0(0x18)(Edit, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Interpolate_Result;  // 0x1CB8(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_6_Result;        // 0x1CD0(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigVMDispatch_If_Result; // 0x1CE8(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_CoreNotEquals_1_1_Result; // 0x1D00(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2671[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigVMDispatch_If_True; // 0x1D08(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_4_3_Result; // 0x1D20(0x8)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_4_3_A;      // 0x1D28(0x8)(ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_6_B__IO;         // 0x1D30(0x18)(EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConform___GroundConform_Interpolate_T;       // 0x1D48(0x4)(Edit, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2674[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FVector>                       GroundConform___GroundConform_ArrayAppend_Other__IO; // 0x1D50(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalVariable__GroundConform_FirstSphereTrace_bHit; // 0x1D60(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         LocalVariable__GroundConform_SphereTrace_bHit;     // 0x1D61(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2675[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_8_1_Element; // 0x1D68(0x18)(Edit, ConstParm, BlueprintVisible, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform___GroundConform_SphereTraceByTraceChannel_bHit; // 0x1D80(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2676[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_8_Element; // 0x1D88(0x18)(ConstParm, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_ArrayGetAtIndex_2_1_Element; // 0x1DA0(0x4)(ExportObject, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2680[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_SphereTraceByTraceChannel_HitLocation; // 0x1DA8(0x18)(Net, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_SphereTraceByTraceChannel_HitNormal; // 0x1DC0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	struct FHitResult                            GroundConform___GroundConform_SphereTraceByTraceChannel_WorldSpaceHitResult; // 0x1DD8(0xF0)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FHitResult                            GroundConform___GroundConform_SphereTraceByTraceChannel_1_WorldSpaceHitResult; // 0x1EC8(0xF0)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_8_1_1_Element; // 0x1FB8(0x18)(Edit, ExportObject, Net, Parm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConform___GroundConform_ArrayGetAtIndex_2_Element; // 0x1FD0(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_SphereTraceByTraceChannel_1_bHit; // 0x1FD4(0x1)(ConstParm, BlueprintVisible, Net, ZeroConstructor, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2682[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_SphereTraceByTraceChannel_1_HitLocation; // 0x1FD8(0x18)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_SphereTraceByTraceChannel_1_HitNormal; // 0x1FF0(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FHitResult                            GroundConform___GroundConform_If_17_Result;        // 0x2008(0xF0)(Edit, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FHitResult                            LocalVariable__GroundConform_SphereTraceByTraceChannel_WorldSpaceHitResult; // 0x20F8(0xF0)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform___GroundConform_MathBoolOr_Result;   // 0x21E8(0x1)(Edit, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2684[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_If_2_3_Result;       // 0x21F0(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_From_World_3_Global; // 0x2208(0x18)(ConstParm, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_From_World_3_Value__IO; // 0x2220(0x18)(Edit, ConstParm, BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_If_11_Result;        // 0x2238(0x18)(BlueprintVisible, EditFixedSize, Parm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_From_World_3_1_Global; // 0x2250(0x18)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_From_World_3_1_Value__IO; // 0x2268(0x18)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               LocalVariable__GroundConform_TraceHitPosition_Local; // 0x2280(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_MinDistanceToParentConstraint_Result; // 0x2298(0x18)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_4_Result;        // 0x22B0(0x18)(BlueprintVisible, EditFixedSize, OutParm, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigVMDispatch_If_2_Result; // 0x22C8(0x18)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform___GroundConform_RigVMFunction_MathBoolAnd_1_Result; // 0x22E0(0x1)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform___GroundConform_Less_1_Result;       // 0x22E1(0x1)(ConstParm, Net, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_268A[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_Rotate_Vector_1_Result; // 0x22E8(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	struct FQuat                                 GroundConform___GroundConform_From_World_4_1_Global; // 0x2300(0x20)(Net, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_10_1_Result;     // 0x2320(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_10_1_A__IO;      // 0x2338(0x18)(Edit, ConstParm, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Less_1_A;            // 0x2350(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigVMDispatch_CoreEquals_2_Result; // 0x2358(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2690[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConform___GroundConform_DISPATCH_RigVMDispatch_CoreEquals_2_A; // 0x235C(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConform___GroundConform_ArrayGetAtIndex_2_2_1_Element; // 0x2360(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2691[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConform___GroundConform_MinDistanceToParentConstraint_Radius; // 0x2368(0x8)(BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	TArray<double>                               GroundConform___GroundConform_MinDistanceToParentConstraint_TraceRadii; // 0x2370(0x10)(ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         MinDistanceToParentConstraint___MinDistanceToParentConstraint_MathBoolAnd_Result; // 0x2380(0x1)(Edit, Net, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	bool                                         MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x2381(0x1)(ExportObject, Net, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         MinDistanceToParentConstraint___MinDistanceToParentConstraint_Less_Result; // 0x2382(0x1)(Edit, ConstParm, Net, OutParm, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2693[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MinDistanceToParentConstraint___MinDistanceToParentConstraint_MathVectorLength_Result; // 0x2384(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	struct FVector                               MinDistanceToParentConstraint___MinDistanceToParentConstraint_Subtract_Result; // 0x2388(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               MinDistanceToParentConstraint___MinDistanceToParentConstraint_Subtract_B; // 0x23A0(0x18)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	double                                       MinDistanceToParentConstraint___MinDistanceToParentConstraint_Less_A; // 0x23B8(0x8)(Edit, ConstParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	double                                       MinDistanceToParentConstraint___MinDistanceToParentConstraint_Multiply_Result; // 0x23C0(0x8)(ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	double                                       MinDistanceToParentConstraint___MinDistanceToParentConstraint_Add_Result; // 0x23C8(0x8)(Net, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	double                                       MinDistanceToParentConstraint___MinDistanceToParentConstraint_ArrayGetAtIndex_Element; // 0x23D0(0x8)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	int32                                        MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_14_Value; // 0x23D8(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_6_1_Value; // 0x23DC(0xC)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<struct FCachedRigElement>             MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_6_1_Cache; // 0x23E8(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, EditConst, SubobjectReference)
	bool                                         MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_6_1_Found; // 0x23F8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2694[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_14_Cache; // 0x2400(0x10)(Parm, ReturnParm, EditConst, SubobjectReference)
	bool                                         MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_14_Found; // 0x2410(0x1)(ExportObject, Net, ZeroConstructor, EditConst, SubobjectReference)
	uint8                                        Pad_2697[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               MinDistanceToParentConstraint___MinDistanceToParentConstraint_Add_1_Result; // 0x2418(0x18)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               MinDistanceToParentConstraint___MinDistanceToParentConstraint_Scale_1_Result; // 0x2430(0x18)(Net, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               MinDistanceToParentConstraint___MinDistanceToParentConstraint_Unit_1_Result; // 0x2448(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        MinDistanceToParentConstraint___MinDistanceToParentConstraint_Scale_1_Factor; // 0x2460(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_2699[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalVariable__GroundConform_FalseIn;              // 0x2468(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_If_13_Result;        // 0x2480(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_LocalBendConstraint_Optimized_1_TranslationOut; // 0x2498(0x18)(BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_DistanceToParentConstraint_Result; // 0x24B0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_DistanceToParentConstraint_ParentPosition; // 0x24C8(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       GroundConform___GroundConform_DistanceToParentConstraint_ParentDistanceIn; // 0x24E0(0x8)(ConstParm, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               DistanceToParentConstraint___DistanceToParentConstraint_Scale_1_Result; // 0x24E8(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               DistanceToParentConstraint___DistanceToParentConstraint_Unit_1_Result; // 0x2500(0x18)(ConstParm, BlueprintVisible, ReturnParm, EditConst, SubobjectReference)
	struct FVector                               DistanceToParentConstraint___DistanceToParentConstraint_Subtract_1_Result; // 0x2518(0x18)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	float                                        DistanceToParentConstraint___DistanceToParentConstraint_Scale_1_Factor; // 0x2530(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	float                                        GroundConform___GroundConform_ArrayGetAtIndex_7_Element; // 0x2534(0x4)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_LocalBendConstraint_Optimized_1_Target; // 0x2538(0x18)(Edit, BlueprintVisible, ExportObject, Net, Parm, EditConst, SubobjectReference)
	struct FQuat                                 GroundConform___GroundConform_LocalBendConstraint_Optimized_1_DefaultRotation; // 0x2550(0x20)(Net, Parm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_LocalBendConstraint_Optimized_1_ParentDistanceIn; // 0x2570(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_269D[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Make_Absolute_1_2_Global; // 0x2580(0x60)(Edit, Parm, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	struct FTransform                            LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Value; // 0x25E0(0x60)(BlueprintVisible, ExportObject, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Cache; // 0x2640(0x10)(Edit, Net, Parm, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	struct FTransform                            LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Default__IO; // 0x2650(0x60)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Found; // 0x26B0(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_269F[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DistanceToParentConstraint_Result; // 0x26B8(0x18)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Interpolate_2_Result; // 0x26D0(0x18)(Edit, BlueprintVisible, ExportObject, Net, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	float                                        LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_1_Result; // 0x26E8(0x4)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_26A1[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_2_Result; // 0x26F0(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_6_Result; // 0x26F8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_MathBoolAnd_1_Result; // 0x2700(0x1)(Edit, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Less_Result; // 0x2701(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_26A5[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Less_A; // 0x2708(0x8)(Edit, Net, EditFixedSize, Transient, EditConst, SubobjectReference)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Less_B; // 0x2710(0x8)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_2_B; // 0x2718(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_3_Multiply_3_2_Result; // 0x2720(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_3_Multiply_3_1_Result; // 0x2728(0x8)(ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_3_Multiply_3_Result; // 0x2730(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_GetDeltaTime_Result; // 0x2738(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_26A9[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_3_Multiply_3_B; // 0x2740(0x8)(ConstParm, BlueprintVisible, ExportObject, EditConst, SubobjectReference)
	float                                        LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_1_True; // 0x2748(0x4)(Edit, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	float                                        LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_1_False; // 0x274C(0x4)(Edit, BlueprintVisible, Parm, OutParm, Config, EditConst, SubobjectReference)
	struct FVector                               LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DistanceToParentConstraint_ParentPosition; // 0x2750(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               DistanceToParentConstraint___DistanceToParentConstraint_Scale_1_Result; // 0x2768(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               DistanceToParentConstraint___DistanceToParentConstraint_Unit_1_Result; // 0x2780(0x18)(ConstParm, BlueprintVisible, ReturnParm, EditConst, SubobjectReference)
	struct FVector                               DistanceToParentConstraint___DistanceToParentConstraint_Subtract_1_Result; // 0x2798(0x18)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	float                                        DistanceToParentConstraint___DistanceToParentConstraint_Scale_1_Factor; // 0x27B0(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_26AC[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalVariable__GroundConform_TrueIn;               // 0x27B8(0x18)(Edit, ConstParm, Net, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform___GroundConform_ArrayGetAtIndex_9_Element; // 0x27D0(0x1)(Edit, ConstParm, BlueprintReadOnly, Parm, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         LocalVariable__GroundConform_BoolIn;               // 0x27D1(0x1)(Edit, ConstParm, ExportObject, Parm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_26AD[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_If_4_Result;         // 0x27D8(0x18)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	struct FVector                               LocalVariable__GroundConform_If_4_Result;          // 0x27F0(0x18)(Edit, ExportObject, BlueprintReadOnly, Parm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               LocalVariable__GroundConform_TargetPosition;       // 0x2808(0x18)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_MathBoolAnd_Result;  // 0x2820(0x1)(Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_Greater_1_Result;    // 0x2821(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_26AF[0xE];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 GroundConform___GroundConform_If_12_Result;        // 0x2830(0x20)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FQuat                                 GroundConform___GroundConform_ReorientBone_Result; // 0x2850(0x20)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_ReorientBone_ParentPosition; // 0x2870(0x18)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_26B0[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 ReorientBone___ReorientBone_If_16_Result;          // 0x2890(0x20)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	bool                                         ReorientBone___ReorientBone_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x28B0(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_26B1[0xF];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 ReorientBone___ReorientBone_Multiply_Multiply_1_Result; // 0x28C0(0x20)(Edit, ConstParm, ExportObject, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	struct FQuat                                 ReorientBone___ReorientBone_Multiply_Multiply_Result; // 0x28E0(0x20)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FQuat                                 ReorientBone___ReorientBone_Unit_3_Result;         // 0x2900(0x20)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	struct FQuat                                 ReorientBone___ReorientBone_MathQuaternionFromAxisAndAngle_Result; // 0x2920(0x20)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               ReorientBone___ReorientBone_Unit_2_Result;         // 0x2940(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               ReorientBone___ReorientBone_MathVectorCross_Result; // 0x2958(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               ReorientBone___ReorientBone_Unit_1_Result;         // 0x2970(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               ReorientBone___ReorientBone_Subtract_1_Result;     // 0x2988(0x18)(BlueprintVisible, ExportObject, Net, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Value; // 0x29A0(0x18)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Cache; // 0x29B8(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Found; // 0x29C8(0x1)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_26B7[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_1_Value; // 0x29D0(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, Transient, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Value; // 0x29E8(0xC)(BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_26B8[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Cache; // 0x29F8(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	bool                                         ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Found; // 0x2A08(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_26B9[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_1_Cache; // 0x2A10(0x10)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_1_Found; // 0x2A20(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_26BA[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ReorientBone___ReorientBone_Unit_Result;           // 0x2A28(0x18)(BlueprintVisible, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               ReorientBone___ReorientBone_Subtract_Result;       // 0x2A40(0x18)(ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	double                                       ReorientBone___ReorientBone_Acos_Result;           // 0x2A58(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	float                                        ReorientBone___ReorientBone_Dot___Result;          // 0x2A60(0x4)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_26BB[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       ReorientBone___ReorientBone_Acos_Value;            // 0x2A68(0x8)(BlueprintReadOnly, Parm, ReturnParm, EditConst, SubobjectReference)
	float                                        ReorientBone___ReorientBone_MathQuaternionFromAxisAndAngle_Angle; // 0x2A70(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_26BC[0xC];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Value; // 0x2A80(0x20)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	TArray<struct FCachedRigElement>             ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Cache; // 0x2AA0(0x10)(Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Found; // 0x2AB0(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_26BD[0xF];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 ReorientBone___ReorientBone_If_16_False;           // 0x2AC0(0x20)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FQuat                                 GroundConform___GroundConform_If_12_False;         // 0x2AE0(0x20)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	struct FQuat                                 LocalVariable__GroundConform_TargetRotation;       // 0x2B00(0x20)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform___GroundConform_RigVMFunction_MathBoolOr_Result; // 0x2B20(0x1)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_RigVMFunction_MathBoolAnd_Result; // 0x2B21(0x1)(ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_RigVMFunction_MathBoolNot_Result; // 0x2B22(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_IsNearlyEqual_Result; // 0x2B23(0x1)(Edit, BlueprintVisible, Net, Parm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_26BF[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_16_Element; // 0x2B28(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_ToWorldCustom_1_Result; // 0x2B40(0x18)(Edit, ConstParm, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               ToWorldCustom_1___ToWorldCustom_To_World_1_1_World; // 0x2B58(0x18)(ExportObject, EditFixedSize, DisableEditOnTemplate, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_Branch_11_BlockToRun; // 0x2B70(0x8)(Net, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_Element; // 0x2B78(0x18)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               LocalVariable__GroundConform_PreviousPosition;     // 0x2B90(0x18)(Edit, ExportObject, Parm, OutParm, Config, DisableEditOnInstance, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_ToWorldCustom_Result; // 0x2BA8(0x18)(Edit, ConstParm, BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
