#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xE9 (0x4E1 - 0x3F8)
// RigVMBlueprintGeneratedClass Human_Male_TPV_Twist_CtrlRig.Human_Male_TPV_Twist_CtrlRig_C
class UHuman_Male_TPV_Twist_CtrlRig_C : public UControlRig
{
public:
	TArray<struct FVector>                       CurrentSpringPositionWorld;                        // 0x3F8(0x10)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FVector>                       CurrentSpringPositionGlobal;                       // 0x408(0x10)(ConstParm, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FVector>                       LastFrameSpringPositionGlobal;                     // 0x418(0x10)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FVector>                       CurrentVelocity;                                   // 0x428(0x10)(Edit, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FVector>                       CurrentVelocityGlobal;                             // 0x438(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	TArray<struct FRigElementKey>                BoneArraySpringSolver_RigElements;                 // 0x448(0x10)(Edit, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       OverallFat;                                        // 0x458(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FQuat                                 InverseRotation_LeftUpperArm;                      // 0x460(0x20)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FQuat                                 InverseRotation_RightUpperArm;                     // 0x480(0x20)(BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       PhysicsFactor_Belly;                               // 0x4A0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       PhysicsFactor_Breast;                              // 0x4A8(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         bFemale;                                           // 0x4B0(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_26ED[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       CharacterCreatorFatChest;                          // 0x4B8(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       CharacterCreatorFatBelly;                          // 0x4C0(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       ChestFat_Spring_Local;                             // 0x4C8(0x8)(ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       BellyFat_Spring_Local;                             // 0x4D0(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       OverallFat_Spring_Local;                           // 0x4D8(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         bShouldReset;                                      // 0x4E0(0x1)(ConstParm, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)

	static class UClass* StaticClass();
	static class UHuman_Male_TPV_Twist_CtrlRig_C* GetDefaultObj();

};

// 0x3A7 (0x3CF - 0x28)
// RigVMMemoryStorageGeneratorClass Human_Male_TPV_Twist_CtrlRig.RigVMMemory_Literal
class URigVMMemory_Literal : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_Item__Const;     // 0x28(0xC)(Edit, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              RigVMModel___RigUnit_GetTransform_Space__Const;    // 0x34(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         RigVMModel___RigUnit_GetTransform_bInitial__Const; // 0x35(0x1)(ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	bool                                         RigVMModel___RigUnit_GetTransform_1_bInitial__Const; // 0x36(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_26F8[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RigVMModel___RigVMFunction_MathQuaternionSwingTwist_TwistAxis__Const; // 0x38(0x18)(ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_Item__Const;      // 0x50(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigUnit_SetRotation_Weight__Const;    // 0x5C(0x4)(Edit, BlueprintVisible, EditFixedSize, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_2_Item__Const;    // 0x60(0xC)(Edit, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        RigVMModel___RigUnit_SetRotation_2_Weight__Const;  // 0x6C(0x4)(ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_3_Item__Const;    // 0x70(0xC)(EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigUnit_SetRotation_3_Weight__Const;  // 0x7C(0x4)(ConstParm, ExportObject, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_1_1_2_Item__Const; // 0x80(0xC)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_2_1_1_Item__Const; // 0x8C(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        RigVMModel___RigUnit_SetRotation_1_1_2_Weight__Const; // 0x98(0x4)(BlueprintVisible, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_1_1_1_1_Item__Const; // 0x9C(0xC)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        RigVMModel___RigUnit_SetRotation_1_1_1_1_Weight__Const; // 0xA8(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_1_1_Item__Const;  // 0xAC(0xC)(BlueprintVisible, ExportObject, EditFixedSize, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_2_1_Item__Const; // 0xB8(0xC)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_1_1_1_Item__Const; // 0xC4(0xC)(Net, EditFixedSize, OutParm, Transient, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_2_Item__Const;   // 0xD0(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_1_Item__Const;    // 0xDC(0xC)(ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_1_2_Item__Const;  // 0xE8(0xC)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_1_3_Item__Const;  // 0xF4(0xC)(Edit, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	struct FTransform                            RigVMModel___Set_Transform_Value__Const;           // 0x100(0x60)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	float                                        RigVMModel___Interpolate_T__Const;                 // 0x160(0x4)(ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_270E[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FVector>                       RigVMModel___VariableNode_18_Value__Const;         // 0x168(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_1_1_SourceMinimum__Const;   // 0x178(0x8)(BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_1_1_SourceMaximum__Const;   // 0x180(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_1_1_TargetMinimum__Const;   // 0x188(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_1_1_TargetMaximum__Const;   // 0x190(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_2_TargetMinimum__Const;     // 0x198(0x8)(Edit, ConstParm, BlueprintVisible, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_2_TargetMaximum__Const;     // 0x1A0(0x8)(Edit, ExportObject, EditFixedSize, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_1_TargetMinimum__Const;     // 0x1A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_1_TargetMaximum__Const;     // 0x1B0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_TargetMinimum__Const;       // 0x1B8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_TargetMaximum__Const;       // 0x1C0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_2_1_TargetMinimum__Const;     // 0x1C8(0x8)(BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_2_1_TargetMaximum__Const;     // 0x1D0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_3_TargetMinimum__Const;       // 0x1D8(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_3_TargetMaximum__Const;       // 0x1E0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_2_TargetMinimum__Const;       // 0x1E8(0x8)(ExportObject, Parm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	float                                        RigVMModel___Multiply_1_A__Const;                  // 0x1F0(0x4)(ConstParm, BlueprintVisible, ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2718[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<double>                               RigVMModel___BoneArraySpringSolver_1_Alphas__Const; // 0x1F8(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_3_1_SourceMinimum__Const;       // 0x208(0x8)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_3_1_TargetMinimum__Const;       // 0x210(0x8)(BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_3_SourceMinimum__Const;         // 0x218(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_3_SourceMaximum__Const;         // 0x220(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_3_TargetMinimum__Const;         // 0x228(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___BoneArraySpringSolver_1_BonesLookAtParentAlpha__Const; // 0x230(0x8)(ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        RigVMModel___BoneArraySpringSolver_1_SimSpaceBone__Const; // 0x238(0xC)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_271C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalVariableDefault__BoneArraySpringSolver_PrevPos__Const; // 0x248(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               LocalVariableDefault__BoneArraySpringSolver_BonePosition__Const; // 0x260(0x18)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_Space__Const; // 0x278(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, GlobalConfig, SubobjectReference)
	bool                                         BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_bInitial__Const; // 0x279(0x1)(ConstParm, Net, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_271F[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_IsNearlyZero_Tolerance__Const; // 0x27C(0x4)(ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Multiply_7_B__Const; // 0x280(0x8)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_1_Add_1_1_B__Const; // 0x288(0x18)(ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_SourceMinimum__Const; // 0x2A0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_SourceMaximum__Const; // 0x2A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_TargetMinimum__Const; // 0x2B0(0x8)(ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_TargetMaximum__Const; // 0x2B8(0x8)(BlueprintVisible, Parm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	bool                                         SpringSolver_0___SpringSolver_Remap_1_bClamp__Const; // 0x2C0(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2724[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        SpringSolver_0___SpringSolver_Multiply_2_B__Const; // 0x2C4(0x4)(Edit, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_MathVectorClampLength_MinimumLength__Const; // 0x2C8(0x4)(Edit, ConstParm, ExportObject, Net, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Divide_A__Const;     // 0x2CC(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        ToBoneSpace___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x2D0(0xC)(Edit, ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              ToBoneSpace___ToBoneSpace_GetTransform_Space__Const; // 0x2DC(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         ToBoneSpace___ToBoneSpace_GetTransform_bInitial__Const; // 0x2DD(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2727[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Add_1_A__Const; // 0x2E0(0x4)(ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        ToBoneSpace_2_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x2E4(0xC)(BlueprintVisible, Net, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              ToBoneSpace_2_1___ToBoneSpace_GetTransform_Space__Const; // 0x2F0(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	bool                                         ToBoneSpace_2_1___ToBoneSpace_GetTransform_bInitial__Const; // 0x2F1(0x1)(ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2729[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Divide_1_A__Const; // 0x2F4(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Multiply_B__Const; // 0x2F8(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_272A[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_7_B__Const; // 0x300(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_SourceMinimum__Const; // 0x308(0x8)(Edit, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_SourceMaximum__Const; // 0x310(0x8)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_TargetMinimum__Const; // 0x318(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_TargetMaximum__Const; // 0x320(0x8)(Edit, ConstParm, Net, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	bool                                         SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_bClamp__Const; // 0x328(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2731[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_2_B__Const; // 0x32C(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_MathVectorClampLength_MinimumLength__Const; // 0x330(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_A__Const; // 0x334(0x4)(Edit, BlueprintVisible, ExportObject, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        FromBoneSpace_1___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x338(0xC)(ConstParm, Net, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              FromBoneSpace_1___FromBoneSpace_GetTransform_Space__Const; // 0x344(0x1)(Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         FromBoneSpace_1___FromBoneSpace_GetTransform_bInitial__Const; // 0x345(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2735[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        ToBoneSpace_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x348(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              ToBoneSpace_1___ToBoneSpace_GetTransform_Space__Const; // 0x354(0x1)(ConstParm, BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         ToBoneSpace_1___ToBoneSpace_GetTransform_bInitial__Const; // 0x355(0x1)(Net, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2736[0xA];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_1___BoneArraySpringSolver_Set_Transform_1_Value__Const; // 0x360(0x60)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        FromBoneSpace___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_B__Const; // 0x3C0(0xC)(ExportObject, BlueprintReadOnly, Net, ZeroConstructor, GlobalConfig, SubobjectReference)
	enum class ERigVMTransformSpace              FromBoneSpace___FromBoneSpace_GetTransform_Space__Const; // 0x3CC(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         FromBoneSpace___FromBoneSpace_GetTransform_bInitial__Const; // 0x3CD(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         BoneArraySpringSolver_1___BoneArraySpringSolver_Set_Transform_1_bPropagateToChildren__Const; // 0x3CE(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)

	static class UClass* StaticClass();
	static class URigVMMemory_Literal* GetDefaultObj();

};

// 0x1930 (0x1958 - 0x28)
// RigVMMemoryStorageGeneratorClass Human_Male_TPV_Twist_CtrlRig.RigVMMemory_Work
class URigVMMemory_Work : public URigVMMemoryStorage
{
public:
	uint8                                        Pad_2745[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 RigVMModel___Inverse_Result;                       // 0x30(0x20)(Edit, ConstParm, EditFixedSize, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_Twist; // 0x50(0x20)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            RigVMModel___Make_Relative_Local;                  // 0x70(0x60)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_Transform;       // 0xD0(0x60)(Net, Parm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_CachedIndex;     // 0x130(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_1_Transform;     // 0x140(0x60)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_1_CachedIndex;   // 0x1A0(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_Input; // 0x1B0(0x20)(Edit, BlueprintReadOnly, Net, Parm, Transient, GlobalConfig, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_Swing; // 0x1D0(0x20)(Edit, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_CachedIndex;      // 0x1F0(0x10)(BlueprintVisible, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_2_CachedIndex;    // 0x200(0x10)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_3_CachedIndex;    // 0x210(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_1_1_1_Twist; // 0x220(0x20)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	struct FTransform                            RigVMModel___Make_Relative_1_1_1_Local;            // 0x240(0x60)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, Transient, GlobalConfig, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_2_1_1_Transform; // 0x2A0(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_2_1_1_CachedIndex; // 0x300(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_1_1_1_1_Transform; // 0x310(0x60)(EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_1_1_1_1_CachedIndex; // 0x370(0x10)(BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_1_1_1_Input; // 0x380(0x20)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_1_1_1_Swing; // 0x3A0(0x20)(Edit, ConstParm, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_1_1_2_CachedIndex; // 0x3C0(0x10)(ConstParm, ExportObject, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_1_1_1_1_CachedIndex; // 0x3D0(0x10)(ExportObject, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_1_1_Twist; // 0x3E0(0x20)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            RigVMModel___Make_Relative_1_1_Local;              // 0x400(0x60)(EditFixedSize, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_2_1_Transform;   // 0x460(0x60)(EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_2_1_CachedIndex; // 0x4C0(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_1_1_1_Transform; // 0x4D0(0x60)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_1_1_1_CachedIndex; // 0x530(0x10)(Edit, ConstParm, BlueprintVisible, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_1_1_Input; // 0x540(0x20)(ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_1_1_Swing; // 0x560(0x20)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_1_1_CachedIndex;  // 0x580(0x10)(Edit, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_1_1_1_CachedIndex; // 0x590(0x10)(Edit, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FQuat                                 RigVMModel___Inverse_1_Result;                     // 0x5A0(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_1_Twist; // 0x5C0(0x20)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FTransform                            RigVMModel___Make_Relative_1_Local;                // 0x5E0(0x60)(Edit, ConstParm, ExportObject, Net, Transient, GlobalConfig, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_2_Transform;     // 0x640(0x60)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_2_CachedIndex;   // 0x6A0(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_1_1_Transform;   // 0x6B0(0x60)(ExportObject, Net, EditFixedSize, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_1_1_CachedIndex; // 0x710(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_1_Input; // 0x720(0x20)(ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_1_Swing; // 0x740(0x20)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_1_CachedIndex;    // 0x760(0x10)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_1_2_CachedIndex;  // 0x770(0x10)(Edit, EditFixedSize, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_1_3_CachedIndex;  // 0x780(0x10)(ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        RigVMModel___DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x790(0xC)(ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_2765[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___GetTransform_Transform;               // 0x7A0(0x60)(Edit, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___GetTransform_CachedIndex;             // 0x800(0x10)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___GetTransform_1_Transform;             // 0x810(0x60)(Edit, ConstParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___GetTransform_1_CachedIndex;           // 0x870(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, GlobalConfig, SubobjectReference)
	struct FTransform                            RigVMModel___Set_Transform_Value__IO;              // 0x880(0x60)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___Set_Transform_CachedIndex;            // 0x8E0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	int32                                        RigVMModel___DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x8F0(0x4)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	int32                                        RigVMModel___DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x8F4(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x8F8(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  RigVMModel___DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x8FC(0x8)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Interpolate_Result;                   // 0x904(0x4)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Interpolate_A;                        // 0x908(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Interpolate_B;                        // 0x90C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Interpolate_1_Result;                 // 0x910(0x4)(ConstParm, BlueprintVisible, ExportObject, Parm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Interpolate_1_A;                      // 0x914(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Interpolate_1_B;                      // 0x918(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Interpolate_2_Result;                 // 0x91C(0x4)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	TArray<double>                               RigVMModel___DISPATCH_RigVMDispatch_If_Result;     // 0x920(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<double>                               RigVMModel___DISPATCH_RigVMDispatch_ArrayMake_2_Array; // 0x930(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_1_1_Result;                 // 0x940(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_2_Result;                   // 0x948(0x8)(Net, EditFixedSize, OutParm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	TArray<double>                               RigVMModel___DISPATCH_RigVMDispatch_ArrayMake_Array; // 0x950(0x10)(Edit, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_1_Result;                   // 0x960(0x8)(BlueprintVisible, ExportObject, Net, Parm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_Result;                     // 0x968(0x8)(Edit, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<float>                                RigVMModel___BoneArraySpringSolver_1_SpringStrength; // 0x970(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<double>                               RigVMModel___DISPATCH_RigVMDispatch_If_1_Result;   // 0x980(0x10)(ConstParm, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<double>                               RigVMModel___DISPATCH_RigVMDispatch_ArrayMake_1_1_Array; // 0x990(0x10)(ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_2_1_Result;                   // 0x9A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_3_Result;                     // 0x9A8(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<double>                               RigVMModel___DISPATCH_RigVMDispatch_ArrayMake_1_Array; // 0x9B0(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_2_Result;                     // 0x9C0(0x8)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Remap_1_Result;                       // 0x9C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<float>                                RigVMModel___BoneArraySpringSolver_1_SpringDamping; // 0x9D0(0x10)(BlueprintVisible, Net, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_If_2_Result;   // 0x9E0(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Multiply_1_Result;                    // 0x9E4(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_2_Result;                       // 0x9E8(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        RigVMModel___Multiply_1_B;                         // 0x9F0(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	float                                        RigVMModel___Multiply_Result;                      // 0x9F4(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Clamp_Result;                         // 0x9F8(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Multiply_B;                           // 0xA00(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2779[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Multiply_2_Result;                    // 0xA08(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_3_1_Result;                     // 0xA10(0x8)(Edit, ConstParm, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       RigVMModel___Multiply_2_1_Result;                  // 0xA18(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_3_Result;                       // 0xA20(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<double>                               RigVMModel___BoneArraySpringSolver_1_Alphas__IO;   // 0xA28(0x10)(Edit, ConstParm, BlueprintVisible, Net, OutParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_277D[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_Transform; // 0xA40(0x60)(Edit, BlueprintVisible, ExportObject, Parm, Transient, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0xAA0(0xC)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_277F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_CachedIndex; // 0xAB0(0x10)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               LocalVariable__BoneArraySpringSolver_BonePosition; // 0xAC0(0x18)(Edit, ConstParm, ExportObject, Net, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	bool                                         BoneArraySpringSolver_1___BoneArraySpringSolver_IsNearlyZero_Result; // 0xAD8(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2782[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_Element; // 0xAE0(0x18)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	int32                                        BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0xAF8(0x4)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2783[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_To_World_1_World; // 0xB00(0x18)(Edit, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_Element; // 0xB18(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Element; // 0xB1C(0x4)(Edit, ConstParm, OutParm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_To_World_2_World; // 0xB20(0x18)(Edit, ConstParm, ExportObject, Parm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0xB38(0x18)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       BoneArraySpringSolver_1___BoneArraySpringSolver_SpringSolver_0_Strength; // 0xB50(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	double                                       BoneArraySpringSolver_1___BoneArraySpringSolver_SpringSolver_0_Damping; // 0xB58(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_SpringSolver_0_Out; // 0xB60(0x18)(BlueprintReadOnly, EditFixedSize, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_SpringSolver_0_Velocity; // 0xB78(0x18)(ExportObject, Net, EditFixedSize, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_7_Element; // 0xB90(0x18)(ConstParm, BlueprintReadOnly, ReturnParm, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Entry_Maximum_Length; // 0xBA8(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_278C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolver_0___SpringSolver_Return_Velocity;     // 0xBB0(0x18)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Entry_VelocityIn;    // 0xBC8(0x18)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_MathVectorClampLength_Result; // 0xBE0(0x18)(ConstParm, Net, Parm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Subtract_1_2_Result; // 0xBF8(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_9_1_Result;      // 0xC10(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Scale_3_Result;      // 0xC28(0x18)(Edit, ExportObject, Net, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_1_Add_1_1_Result; // 0xC40(0x18)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_1_Add_1_Result;  // 0xC58(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Scale_Result;        // 0xC70(0x18)(Edit, ConstParm, BlueprintVisible, Net, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Subtract_Result;     // 0xC88(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Multiply_1_Result;   // 0xCA0(0x8)(BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Multiply_7_Result;   // 0xCA8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_GetDeltaTime_3_2_1_Result; // 0xCB0(0x4)(Edit, Net, EditFixedSize, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2797[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Multiply_1_B;        // 0xCB8(0x8)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Scale_Factor;        // 0xCC0(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2799[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Multiply_6_Result;   // 0xCC8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_GetDeltaTime_3_Result; // 0xCD0(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_279A[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Multiply_6_A;        // 0xCD8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Power_1_Result;      // 0xCE0(0x8)(ConstParm, ExportObject, Net, Parm, GlobalConfig, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_Result;      // 0xCE8(0x8)(Edit, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Multiply_2_Result;   // 0xCF0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_279C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Power_1_B;           // 0xCF8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Scale_3_Factor;      // 0xD00(0x4)(ConstParm, Net, Parm, OutParm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_279F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolver_0___SpringSolver_Subtract_1_Result;   // 0xD08(0x18)(Edit, ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Divide_Result;       // 0xD20(0x4)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_RigVMFunction_GetDeltaTime_Result; // 0xD24(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         BoneArraySpringSolver_1___BoneArraySpringSolver_IsNearlyZero_1_Result; // 0xD28(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_27A3[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_1_Element; // 0xD30(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_ToBoneSpace_RootSpaceResult; // 0xD48(0x18)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	bool                                         ToBoneSpace___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0xD60(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_27A4[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ToBoneSpace___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0xD68(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace___ToBoneSpace_Inverse_Result;          // 0xD80(0x60)(Edit, ConstParm, EditFixedSize, ReturnParm, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace___ToBoneSpace_GetTransform_Transform;  // 0xDE0(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             ToBoneSpace___ToBoneSpace_GetTransform_CachedIndex; // 0xE40(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_4_Element; // 0xE50(0x18)(OutParm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	double                                       BoneArraySpringSolver_1___BoneArraySpringSolver_SpringSolverGlobal_0_Strength; // 0xE68(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	double                                       BoneArraySpringSolver_1___BoneArraySpringSolver_SpringSolverGlobal_0_Damping; // 0xE70(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_SpringSolverGlobal_0_Out; // 0xE78(0x18)(Edit, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Cast_Result; // 0xE90(0x18)(Edit, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Add_1_Result; // 0xEA8(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, GlobalConfig, SubobjectReference)
	uint8                                        Pad_27B4[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Scale_1_1_Result; // 0xEB0(0x18)(ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_ToBoneSpace_2_1_RootSpaceResult; // 0xEC8(0x18)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Subtract_1_Result; // 0xEE0(0x18)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_From_World_Global; // 0xEF8(0x18)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_Element; // 0xF10(0x18)(ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_5_Element; // 0xF28(0x18)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	bool                                         ToBoneSpace_2_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0xF40(0x1)(Edit, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_27BA[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ToBoneSpace_2_1___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0xF48(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_2_1___ToBoneSpace_Inverse_Result;      // 0xF60(0x60)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_2_1___ToBoneSpace_GetTransform_Transform; // 0xFC0(0x60)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             ToBoneSpace_2_1___ToBoneSpace_GetTransform_CachedIndex; // 0x1020(0x10)(Edit, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Multiply_Result; // 0x1030(0x4)(ConstParm, EditFixedSize, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Divide_1_Result; // 0x1034(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_RigVMFunction_GetDeltaTime_1_Result; // 0x1038(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_27C0[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_8_Element; // 0x1040(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_SpringSolverGlobal_0_VelocityGlobal; // 0x1058(0x18)(Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Entry_Maximum_Length; // 0x1070(0x4)(ConstParm, BlueprintVisible, Net, OutParm, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_27C4[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Entry_VelocityIn; // 0x1078(0x18)(Edit, BlueprintReadOnly, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Return_VelocityGlobal; // 0x1090(0x18)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_MathVectorClampLength_Result; // 0x10A8(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_2_Result; // 0x10C0(0x18)(ExportObject, Net, EditFixedSize, Parm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Add_9_1_Result; // 0x10D8(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Result; // 0x10F0(0x18)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_1_Result; // 0x1108(0x18)(Edit, ConstParm, Parm, OutParm, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_Result; // 0x1120(0x18)(BlueprintVisible, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Multiply_Result; // 0x1138(0x18)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Scale_Result; // 0x1150(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Subtract_Result; // 0x1168(0x18)(ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_1_Result; // 0x1180(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_7_Result; // 0x1188(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_GetDeltaTime_3_2_1_Result; // 0x1190(0x4)(Edit, ConstParm, Net, Parm, OutParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_27C9[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_1_B; // 0x1198(0x8)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Scale_Factor; // 0x11A0(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_27CE[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_Result; // 0x11A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_GetDeltaTime_3_Result; // 0x11B0(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_27D0[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_A; // 0x11B8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Power_1_Result; // 0x11C0(0x8)(ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_Result; // 0x11C8(0x8)(BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_2_Result; // 0x11D0(0x4)(Edit, BlueprintVisible, Net, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_27D1[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Power_1_B; // 0x11D8(0x8)(ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Factor; // 0x11E0(0x4)(Edit, BlueprintVisible, ExportObject, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_27D4[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_Result; // 0x11E8(0x18)(Edit, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_Result; // 0x1200(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_RigVMFunction_GetDeltaTime_Result; // 0x1204(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, GlobalConfig, SubobjectReference)
	uint8                                        Pad_27D6[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_2_Transform; // 0x1210(0x60)(Edit, EditFixedSize, Parm, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_1___BoneArraySpringSolver_HierarchyGetParent_Parent; // 0x1270(0xC)(ConstParm, BlueprintReadOnly, Parm, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_27F6[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_1___BoneArraySpringSolver_HierarchyGetParent_CachedChild; // 0x1280(0x10)(Edit, BlueprintVisible, Net, EditFixedSize, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_1___BoneArraySpringSolver_HierarchyGetParent_CachedParent; // 0x1290(0x10)(Edit, ExportObject, Net, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_2_CachedIndex; // 0x12A0(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Subtract_Result; // 0x12B0(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_FromBoneSpace_1_BoneSpacePosition; // 0x12C8(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, Transient, GlobalConfig, SubobjectReference)
	bool                                         FromBoneSpace_1___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x12E0(0x1)(Edit, ConstParm, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_27FD[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FromBoneSpace_1___FromBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x12E8(0x18)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	struct FTransform                            FromBoneSpace_1___FromBoneSpace_GetTransform_Transform; // 0x1300(0x60)(ExportObject, Parm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             FromBoneSpace_1___FromBoneSpace_GetTransform_CachedIndex; // 0x1360(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Subtract_B; // 0x1370(0x18)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_If_Result; // 0x1388(0x18)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_ToBoneSpace_1_RootSpaceResult; // 0x13A0(0x18)(BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Add_Result; // 0x13B8(0x18)(ExportObject, OutParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Scale_Result; // 0x13D0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Unit_Result; // 0x13E8(0x18)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Multiply_2_Result; // 0x1400(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Clamp_Result; // 0x1404(0x4)(Edit, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Divide_Result; // 0x1408(0x4)(Edit, BlueprintVisible, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_RigVMFunction_MathVectorLength_1_Result; // 0x140C(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_RigVMFunction_MathVectorLength_Result; // 0x1410(0x4)(Edit, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2805[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Subtract_2_Result; // 0x1418(0x18)(ConstParm, ExportObject, Net, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FTransform                            BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_2_1_1_Transform; // 0x1430(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_2_1_1_CachedIndex; // 0x1490(0x10)(BlueprintVisible, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Subtract_2_A; // 0x14A0(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2806[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_2_1_Transform; // 0x14C0(0x60)(Edit, BlueprintVisible, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_1___BoneArraySpringSolver_HierarchyGetParent_1_Parent; // 0x1520(0xC)(ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_280F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_1___BoneArraySpringSolver_HierarchyGetParent_1_CachedChild; // 0x1530(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_1___BoneArraySpringSolver_HierarchyGetParent_1_CachedParent; // 0x1540(0x10)(Edit, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_2_1_CachedIndex; // 0x1550(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Subtract_2_B; // 0x1560(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Clamp_Minimum; // 0x1578(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Transient, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Clamp_Maximum; // 0x157C(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	bool                                         ToBoneSpace_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x1580(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2839[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ToBoneSpace_1___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x1588(0x18)(Edit, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_1___ToBoneSpace_Inverse_Result;        // 0x15A0(0x60)(ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, GlobalConfig, SubobjectReference)
	struct FTransform                            ToBoneSpace_1___ToBoneSpace_GetTransform_Transform; // 0x1600(0x60)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             ToBoneSpace_1___ToBoneSpace_GetTransform_CachedIndex; // 0x1660(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_From_World_2_2_Global; // 0x1670(0x18)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_1_Element; // 0x1688(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_If_1_Result; // 0x16A0(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_1___BoneArraySpringSolver_Multiply_1_Result; // 0x16C0(0x20)(Net, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_1___BoneArraySpringSolver_Scale_1_Result; // 0x16E0(0x20)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_1___BoneArraySpringSolver_QuatBetweenDirections_0_Quat; // 0x1700(0x20)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Subtract_3_Result; // 0x1720(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2841[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 QuatBetweenDirections_0___QuatBetweenDirections_MathQuaternionFromAxisAndAngle_Result; // 0x1740(0x20)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_Unit_2_Result; // 0x1760(0x18)(OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_MathVectorCross_Result; // 0x1778(0x18)(Edit, Net, EditFixedSize, OutParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_Unit_1_Result; // 0x1790(0x18)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_Unit_Result; // 0x17A8(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	double                                       QuatBetweenDirections_0___QuatBetweenDirections_Acos_Result; // 0x17C0(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        QuatBetweenDirections_0___QuatBetweenDirections_Dot___Result; // 0x17C8(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2844[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       QuatBetweenDirections_0___QuatBetweenDirections_Acos_Value; // 0x17D0(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	float                                        QuatBetweenDirections_0___QuatBetweenDirections_MathQuaternionFromAxisAndAngle_Angle; // 0x17D8(0x4)(BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Scale_1_Factor; // 0x17DC(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_1___BoneArraySpringSolver_Multiply_1_B; // 0x17E0(0x20)(EditFixedSize, OutParm, GlobalConfig, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_FromBoneSpace_BoneSpacePosition; // 0x1800(0x18)(ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	bool                                         FromBoneSpace___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x1818(0x1)(Edit, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2847[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FromBoneSpace___FromBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x1820(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2849[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            FromBoneSpace___FromBoneSpace_GetTransform_Transform; // 0x1840(0x60)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	TArray<struct FCachedRigElement>             FromBoneSpace___FromBoneSpace_GetTransform_CachedIndex; // 0x18A0(0x10)(Edit, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	struct FTransform                            BoneArraySpringSolver_1___BoneArraySpringSolver_Set_Transform_1_Value__IO; // 0x18B0(0x60)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	double                                       BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_10_Element; // 0x1910(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Set_Transform_1_Weight; // 0x1918(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_284E[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_1___BoneArraySpringSolver_Set_Transform_1_CachedIndex; // 0x1920(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	class FName                                  BoneArraySpringSolver_1___BoneArraySpringSolver_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x1930(0x8)(Edit, ConstParm, Net, Parm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	class FName                                  BoneArraySpringSolver_1___BoneArraySpringSolver_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x1938(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, GlobalConfig, SubobjectReference)
	int32                                        BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x1940(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, GlobalConfig, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x1944(0x4)(ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	class FName                                  BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x1948(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_BlockToRun; // 0x1950(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)

	static class UClass* StaticClass();
	static class URigVMMemory_Work* GetDefaultObj();

};

}


