#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xE9 (0x4E1 - 0x3F8)
// RigVMBlueprintGeneratedClass Human_Male_TPV_Twist_CtrlRig.Human_Male_TPV_Twist_CtrlRig_C
class UHuman_Male_TPV_Twist_CtrlRig_C : public UControlRig
{
public:
	TArray<struct FVector>                       CurrentSpringPositionWorld;                        // 0x3F8(0x10)(Edit, BlueprintVisible, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FVector>                       CurrentSpringPositionGlobal;                       // 0x408(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FVector>                       LastFrameSpringPositionGlobal;                     // 0x418(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FVector>                       CurrentVelocity;                                   // 0x428(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FVector>                       CurrentVelocityGlobal;                             // 0x438(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                BoneArraySpringSolver_RigElements;                 // 0x448(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       OverallFat;                                        // 0x458(0x8)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FQuat                                 InverseRotation_LeftUpperArm;                      // 0x460(0x20)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 InverseRotation_RightUpperArm;                     // 0x480(0x20)(ConstParm, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       PhysicsFactor_Belly;                               // 0x4A0(0x8)(ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       PhysicsFactor_Breast;                              // 0x4A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         bFemale;                                           // 0x4B0(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1D3B[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       CharacterCreatorFatChest;                          // 0x4B8(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       CharacterCreatorFatBelly;                          // 0x4C0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	double                                       ChestFat_Spring_Local;                             // 0x4C8(0x8)(Edit, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       BellyFat_Spring_Local;                             // 0x4D0(0x8)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       OverallFat_Spring_Local;                           // 0x4D8(0x8)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         bShouldReset;                                      // 0x4E0(0x1)(ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)

	static class UClass* StaticClass();
	static class UHuman_Male_TPV_Twist_CtrlRig_C* GetDefaultObj();

};

// 0x309 (0x331 - 0x28)
// RigVMMemoryStorageGeneratorClass Human_Male_TPV_Twist_CtrlRig.RigVMMemory_Literal
class URigVMMemory_Literal : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_Item__Const;     // 0x28(0xC)(BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              RigVMModel___RigUnit_GetTransform_Space__Const;    // 0x34(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___RigUnit_GetTransform_bInitial__Const; // 0x35(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___RigUnit_GetTransform_1_bInitial__Const; // 0x36(0x1)(Edit, ConstParm, EditFixedSize, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D43[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RigVMModel___RigVMFunction_MathQuaternionSwingTwist_TwistAxis__Const; // 0x38(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_Item__Const;      // 0x50(0xC)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        RigVMModel___RigUnit_SetRotation_Weight__Const;    // 0x5C(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_2_Item__Const;    // 0x60(0xC)(Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	float                                        RigVMModel___RigUnit_SetRotation_2_Weight__Const;  // 0x6C(0x4)(Edit, Net, EditFixedSize, Parm, Transient, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_3_Item__Const;    // 0x70(0xC)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, EditConst, SubobjectReference)
	float                                        RigVMModel___RigUnit_SetRotation_3_Weight__Const;  // 0x7C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_1_1_2_Item__Const; // 0x80(0xC)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_2_1_1_Item__Const; // 0x8C(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigUnit_SetRotation_1_1_2_Weight__Const; // 0x98(0x4)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_1_1_1_1_Item__Const; // 0x9C(0xC)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigUnit_SetRotation_1_1_1_1_Weight__Const; // 0xA8(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_1_1_Item__Const;  // 0xAC(0xC)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_2_1_Item__Const; // 0xB8(0xC)(ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_1_1_1_Item__Const; // 0xC4(0xC)(ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_2_Item__Const;   // 0xD0(0xC)(Edit, ConstParm, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_1_Item__Const;    // 0xDC(0xC)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_1_2_Item__Const;  // 0xE8(0xC)(BlueprintVisible, ExportObject, OutParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_1_3_Item__Const;  // 0xF4(0xC)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Interpolate_T__Const;                 // 0x100(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_1D4B[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FVector>                       RigVMModel___VariableNode_18_Value__Const;         // 0x108(0x10)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_1_1_SourceMinimum__Const;   // 0x118(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_1_1_SourceMaximum__Const;   // 0x120(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_1_1_TargetMinimum__Const;   // 0x128(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_1_1_TargetMaximum__Const;   // 0x130(0x8)(ConstParm, BlueprintVisible, Net, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_2_TargetMinimum__Const;     // 0x138(0x8)(BlueprintVisible, ExportObject, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_2_TargetMaximum__Const;     // 0x140(0x8)(Edit, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_1_TargetMinimum__Const;     // 0x148(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_1_TargetMaximum__Const;     // 0x150(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_TargetMinimum__Const;       // 0x158(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_TargetMaximum__Const;       // 0x160(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_2_1_TargetMinimum__Const;     // 0x168(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_2_1_TargetMaximum__Const;     // 0x170(0x8)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_3_TargetMinimum__Const;       // 0x178(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_3_TargetMaximum__Const;       // 0x180(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_2_TargetMinimum__Const;       // 0x188(0x8)(ExportObject, Net, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Multiply_1_A__Const;                  // 0x190(0x4)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D4D[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<double>                               RigVMModel___BoneArraySpringSolver_1_Alphas__Const; // 0x198(0x10)(Edit, ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_3_1_SourceMinimum__Const;       // 0x1A8(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_3_1_TargetMinimum__Const;       // 0x1B0(0x8)(Edit, ConstParm, ExportObject, Net, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_3_SourceMinimum__Const;         // 0x1B8(0x8)(Edit, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_3_SourceMaximum__Const;         // 0x1C0(0x8)(Edit, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_3_TargetMinimum__Const;         // 0x1C8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	double                                       RigVMModel___BoneArraySpringSolver_1_BonesLookAtParentAlpha__Const; // 0x1D0(0x8)(ConstParm, EditFixedSize, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__BoneArraySpringSolver_PrevPos__Const; // 0x1D8(0x18)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__BoneArraySpringSolver_BonePosition__Const; // 0x1F0(0x18)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_Space__Const; // 0x208(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_bInitial__Const; // 0x209(0x1)(ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D4F[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_IsNearlyZero_Tolerance__Const; // 0x20C(0x4)(Edit, ConstParm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Multiply_7_B__Const; // 0x210(0x8)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_1_Add_1_1_B__Const; // 0x218(0x18)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_SourceMinimum__Const; // 0x230(0x8)(ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_SourceMaximum__Const; // 0x238(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_TargetMinimum__Const; // 0x240(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_TargetMaximum__Const; // 0x248(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         SpringSolver_0___SpringSolver_Remap_1_bClamp__Const; // 0x250(0x1)(Net, Parm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D52[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Divide_2_B__Const;   // 0x258(0x8)(Edit, ConstParm, ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_MathVectorClampLength_MinimumLength__Const; // 0x260(0x4)(Edit, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Divide_A__Const;     // 0x264(0x4)(ExportObject, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_SpringSolverGlobal_0_WorldVelocityInfluence__Const; // 0x268(0x18)(Edit, ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Divide_1_A__Const; // 0x280(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Multiply_B__Const; // 0x284(0x4)(BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_7_B__Const; // 0x288(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_SourceMinimum__Const; // 0x290(0x8)(BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_SourceMaximum__Const; // 0x298(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_TargetMinimum__Const; // 0x2A0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_TargetMaximum__Const; // 0x2A8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_bClamp__Const; // 0x2B0(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D57[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Divide_2_B__Const; // 0x2B8(0x8)(BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_MathVectorClampLength_MinimumLength__Const; // 0x2C0(0x4)(Edit, ConstParm, BlueprintVisible, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_A__Const; // 0x2C4(0x4)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D59[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_1___BoneArraySpringSolver_Set_Transform_1_Value__Const; // 0x2D0(0x60)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         BoneArraySpringSolver_1___BoneArraySpringSolver_Set_Transform_1_bPropagateToChildren__Const; // 0x330(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)

	static class UClass* StaticClass();
	static class URigVMMemory_Literal* GetDefaultObj();

};

// 0x13A0 (0x13C8 - 0x28)
// RigVMMemoryStorageGeneratorClass Human_Male_TPV_Twist_CtrlRig.RigVMMemory_Work
class URigVMMemory_Work : public URigVMMemoryStorage
{
public:
	uint8                                        Pad_1D60[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 RigVMModel___Inverse_Result;                       // 0x30(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_Twist; // 0x50(0x20)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___Make_Relative_Local;                  // 0x70(0x60)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_Transform;       // 0xD0(0x60)(Edit, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_CachedIndex;     // 0x130(0x10)(ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_1_Transform;     // 0x140(0x60)(ConstParm, Net, EditFixedSize, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_1_CachedIndex;   // 0x1A0(0x10)(Edit, Net, Parm, ReturnParm, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_Input; // 0x1B0(0x20)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_Swing; // 0x1D0(0x20)(ExportObject, Net, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_CachedIndex;      // 0x1F0(0x10)(Edit, ExportObject, Net, Parm, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_2_CachedIndex;    // 0x200(0x10)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_3_CachedIndex;    // 0x210(0x10)(ConstParm, Net, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_1_1_1_Twist; // 0x220(0x20)(Edit, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___Make_Relative_1_1_1_Local;            // 0x240(0x60)(Edit, BlueprintVisible, BlueprintReadOnly, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_2_1_1_Transform; // 0x2A0(0x60)(ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_2_1_1_CachedIndex; // 0x300(0x10)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_1_1_1_1_Transform; // 0x310(0x60)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_1_1_1_1_CachedIndex; // 0x370(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_1_1_1_Input; // 0x380(0x20)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_1_1_1_Swing; // 0x3A0(0x20)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_1_1_2_CachedIndex; // 0x3C0(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_1_1_1_1_CachedIndex; // 0x3D0(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_1_1_Twist; // 0x3E0(0x20)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___Make_Relative_1_1_Local;              // 0x400(0x60)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_2_1_Transform;   // 0x460(0x60)(Edit, Net, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_2_1_CachedIndex; // 0x4C0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_1_1_1_Transform; // 0x4D0(0x60)(ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_1_1_1_CachedIndex; // 0x530(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_1_1_Input; // 0x540(0x20)(Edit, BlueprintReadOnly, Net, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_1_1_Swing; // 0x560(0x20)(Edit, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_1_1_CachedIndex;  // 0x580(0x10)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_1_1_1_CachedIndex; // 0x590(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___Inverse_1_Result;                     // 0x5A0(0x20)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_1_Twist; // 0x5C0(0x20)(Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___Make_Relative_1_Local;                // 0x5E0(0x60)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_2_Transform;     // 0x640(0x60)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_2_CachedIndex;   // 0x6A0(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_1_1_Transform;   // 0x6B0(0x60)(Edit, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_1_1_CachedIndex; // 0x710(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_1_Input; // 0x720(0x20)(BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionSwingTwist_1_Swing; // 0x740(0x20)(ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_1_CachedIndex;    // 0x760(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_1_2_CachedIndex;  // 0x770(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_1_3_CachedIndex;  // 0x780(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x790(0xC)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_1D75[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___GetTransform_Transform;               // 0x7A0(0x60)(ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___GetTransform_CachedIndex;             // 0x800(0x10)(Edit, BlueprintReadOnly, Parm, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___Set_Transform_CachedIndex;            // 0x810(0x10)(BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	int32                                        RigVMModel___DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x820(0x4)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, EditConst, SubobjectReference)
	int32                                        RigVMModel___DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x824(0x4)(Net, OutParm, ReturnParm, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x828(0x4)(ConstParm, Net, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	class FName                                  RigVMModel___DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x82C(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, EditConst, SubobjectReference)
	float                                        RigVMModel___Interpolate_Result;                   // 0x834(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	float                                        RigVMModel___Interpolate_A;                        // 0x838(0x4)(Net, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        RigVMModel___Interpolate_B;                        // 0x83C(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	float                                        RigVMModel___Interpolate_1_Result;                 // 0x840(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	float                                        RigVMModel___Interpolate_1_A;                      // 0x844(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, EditConst, SubobjectReference)
	float                                        RigVMModel___Interpolate_1_B;                      // 0x848(0x4)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        RigVMModel___Interpolate_2_Result;                 // 0x84C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<double>                               RigVMModel___DISPATCH_RigVMDispatch_If_Result;     // 0x850(0x10)(ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	TArray<double>                               RigVMModel___DISPATCH_RigVMDispatch_ArrayMake_2_Array; // 0x860(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_1_1_Result;                 // 0x870(0x8)(Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_2_Result;                   // 0x878(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<double>                               RigVMModel___DISPATCH_RigVMDispatch_ArrayMake_Array; // 0x880(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_1_Result;                   // 0x890(0x8)(Net, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_1_Result;                     // 0x898(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<float>                                RigVMModel___BoneArraySpringSolver_1_SpringStrength; // 0x8A0(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<double>                               RigVMModel___DISPATCH_RigVMDispatch_If_1_Result;   // 0x8B0(0x10)(Edit, Net, Parm, OutParm, Transient, EditConst, SubobjectReference)
	TArray<double>                               RigVMModel___DISPATCH_RigVMDispatch_ArrayMake_1_1_Array; // 0x8C0(0x10)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_2_1_Result;                   // 0x8D0(0x8)(ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_3_Result;                     // 0x8D8(0x8)(BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<double>                               RigVMModel___DISPATCH_RigVMDispatch_ArrayMake_1_Array; // 0x8E0(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_2_Result;                     // 0x8F0(0x8)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_Result;                       // 0x8F8(0x8)(ConstParm, EditFixedSize, ReturnParm, Config, EditConst, SubobjectReference)
	TArray<float>                                RigVMModel___BoneArraySpringSolver_1_SpringDamping; // 0x900(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_If_2_Result;   // 0x910(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, Transient, Config, EditConst, SubobjectReference)
	float                                        RigVMModel___Multiply_1_Result;                    // 0x914(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_2_Result;                       // 0x918(0x8)(Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Multiply_1_B;                         // 0x920(0x4)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Multiply_Result;                      // 0x924(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_Result;                         // 0x928(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        RigVMModel___Multiply_B;                           // 0x930(0x4)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D8B[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Multiply_2_Result;                    // 0x938(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_3_1_Result;                     // 0x940(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Multiply_2_1_Result;                  // 0x948(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_3_Result;                       // 0x950(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<double>                               RigVMModel___BoneArraySpringSolver_1_Alphas__IO;   // 0x958(0x10)(Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D8E[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_Transform; // 0x970(0x60)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x9D0(0xC)(Edit, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D90[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_CachedIndex; // 0x9E0(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               LocalVariable__BoneArraySpringSolver_BonePosition; // 0x9F0(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         BoneArraySpringSolver_1___BoneArraySpringSolver_IsNearlyZero_Result; // 0xA08(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D92[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_Element; // 0xA10(0x18)(BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	int32                                        BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0xA28(0x4)(Edit, ConstParm, BlueprintVisible, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D93[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_To_World_1_World; // 0xA30(0x18)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_Element; // 0xA48(0x4)(BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Element; // 0xA4C(0x4)(ConstParm, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_To_World_2_World; // 0xA50(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0xA68(0x18)(BlueprintVisible, EditFixedSize, OutParm, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       BoneArraySpringSolver_1___BoneArraySpringSolver_SpringSolver_0_Strength; // 0xA80(0x8)(Edit, ConstParm, BlueprintVisible, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       BoneArraySpringSolver_1___BoneArraySpringSolver_SpringSolver_0_Damping; // 0xA88(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_SpringSolver_0_Out; // 0xA90(0x18)(ConstParm, ExportObject, Net, OutParm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_SpringSolver_0_Velocity; // 0xAA8(0x18)(ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_7_Element; // 0xAC0(0x18)(ConstParm, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Entry_Maximum_Length; // 0xAD8(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D98[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolver_0___SpringSolver_Return_Velocity;     // 0xAE0(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Entry_VelocityIn;    // 0xAF8(0x18)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_MathVectorClampLength_Result; // 0xB10(0x18)(Edit, ConstParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Subtract_1_2_Result; // 0xB28(0x18)(BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_9_1_Result;      // 0xB40(0x18)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Scale_3_Result;      // 0xB58(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_1_Add_1_1_Result; // 0xB70(0x18)(ConstParm, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Add_1_Add_1_Result;  // 0xB88(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Scale_Result;        // 0xBA0(0x18)(ConstParm, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolver_0___SpringSolver_Subtract_Result;     // 0xBB8(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Multiply_7_Result;   // 0xBD0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Scale_Factor;        // 0xBD8(0x4)(BlueprintVisible, ExportObject, Net, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DA2[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Multiply_6_Result;   // 0xBE0(0x8)(Edit, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_GetDeltaTime_3_Result; // 0xBE8(0x4)(Edit, ConstParm, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DA4[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolver_0___SpringSolver_Multiply_6_A;        // 0xBF0(0x8)(BlueprintVisible, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Power_1_Result;      // 0xBF8(0x8)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Remap_1_Result;      // 0xC00(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Divide_2_Result;     // 0xC08(0x8)(ConstParm, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolver_0___SpringSolver_Divide_2_A;          // 0xC10(0x8)(Edit, ConstParm, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Scale_3_Factor;      // 0xC18(0x4)(Edit, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DA6[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolver_0___SpringSolver_Subtract_1_Result;   // 0xC20(0x18)(ConstParm, BlueprintVisible, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_Divide_Result;       // 0xC38(0x4)(EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        SpringSolver_0___SpringSolver_RigVMFunction_GetDeltaTime_Result; // 0xC3C(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         BoneArraySpringSolver_1___BoneArraySpringSolver_IsNearlyZero_1_Result; // 0xC40(0x1)(Edit, ConstParm, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DA8[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_1_Element; // 0xC48(0x18)(ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_4_Element; // 0xC60(0x18)(Edit, Net, EditFixedSize, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       BoneArraySpringSolver_1___BoneArraySpringSolver_SpringSolverGlobal_0_Strength; // 0xC78(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       BoneArraySpringSolver_1___BoneArraySpringSolver_SpringSolverGlobal_0_Damping; // 0xC80(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_SpringSolverGlobal_0_Out; // 0xC88(0x18)(Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Scale_1_1_Result; // 0xCA0(0x18)(Edit, ConstParm, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Subtract_1_Result; // 0xCB8(0x18)(ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_From_World_Global; // 0xCD0(0x18)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_Element; // 0xCE8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_5_Element; // 0xD00(0x18)(BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Multiply_Result; // 0xD18(0x4)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Divide_1_Result; // 0xD1C(0x4)(Edit, ExportObject, OutParm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_RigVMFunction_GetDeltaTime_1_Result; // 0xD20(0x4)(BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DAD[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_8_Element; // 0xD28(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_SpringSolverGlobal_0_VelocityGlobal; // 0xD40(0x18)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Entry_Maximum_Length; // 0xD58(0x4)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DAF[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Entry_VelocityIn; // 0xD60(0x18)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Return_VelocityGlobal; // 0xD78(0x18)(ConstParm, ExportObject, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_MathVectorClampLength_Result; // 0xD90(0x18)(BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_2_Result; // 0xDA8(0x18)(ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Add_9_1_Result; // 0xDC0(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Result; // 0xDD8(0x18)(ConstParm, BlueprintVisible, Net, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_1_Result; // 0xDF0(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_Result; // 0xE08(0x18)(Edit, ExportObject, BlueprintReadOnly, Parm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Multiply_Result; // 0xE20(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Scale_Result; // 0xE38(0x18)(ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Subtract_Result; // 0xE50(0x18)(BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_7_Result; // 0xE68(0x8)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Scale_Factor; // 0xE70(0x4)(Edit, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DB7[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_Result; // 0xE78(0x8)(Edit, ConstParm, BlueprintVisible, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_GetDeltaTime_3_Result; // 0xE80(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DB8[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_A; // 0xE88(0x8)(ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Power_1_Result; // 0xE90(0x8)(ConstParm, Net, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_Result; // 0xE98(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Divide_2_Result; // 0xEA0(0x8)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpringSolverGlobal_0___SpringSolverGlobal_Divide_2_A; // 0xEA8(0x8)(BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Factor; // 0xEB0(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DBA[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_Result; // 0xEB8(0x18)(BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_Result; // 0xED0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        SpringSolverGlobal_0___SpringSolverGlobal_RigVMFunction_GetDeltaTime_Result; // 0xED4(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DBF[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_2_Transform; // 0xEE0(0x60)(Edit, ConstParm, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_1___BoneArraySpringSolver_HierarchyGetParent_Parent; // 0xF40(0xC)(Edit, ConstParm, ExportObject, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DC0[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_1___BoneArraySpringSolver_HierarchyGetParent_CachedChild; // 0xF50(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_1___BoneArraySpringSolver_HierarchyGetParent_CachedParent; // 0xF60(0x10)(Edit, ExportObject, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_2_CachedIndex; // 0xF70(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Subtract_Result; // 0xF80(0x18)(BlueprintVisible, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Subtract_B; // 0xF98(0x18)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_If_Result; // 0xFB0(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Add_Result; // 0xFC8(0x18)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Scale_Result; // 0xFE0(0x18)(Edit, ConstParm, BlueprintVisible, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Unit_Result; // 0xFF8(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Multiply_2_Result; // 0x1010(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Clamp_Result; // 0x1014(0x4)(Edit, BlueprintVisible, Net, OutParm, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Divide_Result; // 0x1018(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_RigVMFunction_MathVectorLength_1_Result; // 0x101C(0x4)(BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_RigVMFunction_MathVectorLength_Result; // 0x1020(0x4)(ConstParm, Net, Parm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DC9[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Subtract_2_Result; // 0x1028(0x18)(BlueprintVisible, Net, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_2_1_1_Transform; // 0x1040(0x60)(Edit, ConstParm, BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_2_1_1_CachedIndex; // 0x10A0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Subtract_2_A; // 0x10B0(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DD0[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_2_1_Transform; // 0x10D0(0x60)(ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        BoneArraySpringSolver_1___BoneArraySpringSolver_HierarchyGetParent_1_Parent; // 0x1130(0xC)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DD4[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_1___BoneArraySpringSolver_HierarchyGetParent_1_CachedChild; // 0x1140(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_1___BoneArraySpringSolver_HierarchyGetParent_1_CachedParent; // 0x1150(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_1___BoneArraySpringSolver_GetTransform_2_1_CachedIndex; // 0x1160(0x10)(Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Subtract_2_B; // 0x1170(0x18)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Clamp_Minimum; // 0x1188(0x4)(Edit, ExportObject, Net, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Clamp_Maximum; // 0x118C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_From_World_2_2_Global; // 0x1190(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_1_Element; // 0x11A8(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_If_1_Result; // 0x11C0(0x20)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_1___BoneArraySpringSolver_Multiply_1_Result; // 0x11E0(0x20)(ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_1___BoneArraySpringSolver_Scale_1_Result; // 0x1200(0x20)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_1___BoneArraySpringSolver_QuatBetweenDirections_0_Quat; // 0x1220(0x20)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               BoneArraySpringSolver_1___BoneArraySpringSolver_Subtract_3_Result; // 0x1240(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DE3[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 QuatBetweenDirections_0___QuatBetweenDirections_MathQuaternionFromAxisAndAngle_Result; // 0x1260(0x20)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_Unit_2_Result; // 0x1280(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_MathVectorCross_Result; // 0x1298(0x18)(BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_Unit_1_Result; // 0x12B0(0x18)(Edit, BlueprintReadOnly, EditFixedSize, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               QuatBetweenDirections_0___QuatBetweenDirections_Unit_Result; // 0x12C8(0x18)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       QuatBetweenDirections_0___QuatBetweenDirections_Acos_Result; // 0x12E0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        QuatBetweenDirections_0___QuatBetweenDirections_Dot___Result; // 0x12E8(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DEC[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       QuatBetweenDirections_0___QuatBetweenDirections_Acos_Value; // 0x12F0(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        QuatBetweenDirections_0___QuatBetweenDirections_MathQuaternionFromAxisAndAngle_Angle; // 0x12F8(0x4)(Edit, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Scale_1_Factor; // 0x12FC(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 BoneArraySpringSolver_1___BoneArraySpringSolver_Multiply_1_B; // 0x1300(0x20)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            BoneArraySpringSolver_1___BoneArraySpringSolver_Set_Transform_1_Value__IO; // 0x1320(0x60)(BlueprintVisible, Net, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_10_Element; // 0x1380(0x8)(ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_Set_Transform_1_Weight; // 0x1388(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DF0[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             BoneArraySpringSolver_1___BoneArraySpringSolver_Set_Transform_1_CachedIndex; // 0x1390(0x10)(Edit, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  BoneArraySpringSolver_1___BoneArraySpringSolver_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x13A0(0x8)(ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  BoneArraySpringSolver_1___BoneArraySpringSolver_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x13A8(0x8)(ConstParm, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	int32                                        BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x13B0(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x13B4(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  BoneArraySpringSolver_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x13B8(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_BlockToRun; // 0x13C0(0x8)(Edit, BlueprintVisible, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)

	static class UClass* StaticClass();
	static class URigVMMemory_Work* GetDefaultObj();

};

}


