#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x370 (0x768 - 0x3F8)
// RigVMBlueprintGeneratedClass Human_Male_TPV_LegIK_CtrlRig.Human_Male_TPV_LegIK_CtrlRig_C
class UHuman_Male_TPV_LegIK_CtrlRig_C : public UControlRig
{
public:
	TArray<struct FRigElementKey>                Feet;                                              // 0x3F8(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        LeftFoot;                                          // 0x408(0xC)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance)
	struct FRigElementKey                        RightFoot;                                         // 0x414(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance)
	struct FVector                               R_HitLocation;                                     // 0x420(0x18)(Edit, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               L_HitLocation;                                     // 0x438(0x18)(Net, EditFixedSize, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       R_Offset;                                          // 0x450(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       L_Offset;                                          // 0x458(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               L_Effector;                                        // 0x460(0x18)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               R_Effector;                                        // 0x478(0x18)(ConstParm, ExportObject, Net, EditFixedSize, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 L_EffectorRot;                                     // 0x490(0x20)(EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 R_EffectorRot;                                     // 0x4B0(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               L_PV;                                              // 0x4D0(0x18)(ConstParm, BlueprintReadOnly, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               R_PV;                                              // 0x4E8(0x18)(ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       CurrentZOffsetLimit;                               // 0x500(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         bCrouched;                                         // 0x508(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_E10[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	double                                       HipZOffsetLimitCrouched;                           // 0x510(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       HipZOffsetLimitStanding;                           // 0x518(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       HipZOffset;                                        // 0x520(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       HipZOffset_LayerTwo;                               // 0x528(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               L_Normal;                                          // 0x530(0x18)(ConstParm, BlueprintReadOnly, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               R_Normal;                                          // 0x548(0x18)(BlueprintReadOnly, Net, EditFixedSize, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               FPVShadowMeshOffset;                               // 0x560(0x18)(Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               SmoothedLocation;                                  // 0x578(0x18)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               RootLocOffsetGlobal;                               // 0x590(0x18)(BlueprintVisible, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       LegLengthHipZOffset;                               // 0x5A8(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       IKAlpha;                                           // 0x5B0(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	double                                       TraceDistanceFactorAbove;                          // 0x5B8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	double                                       TraceDistanceFactorBelow;                          // 0x5C0(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnInstance, SubobjectReference)
	double                                       Bone_Modifiers_Leg_Length_Percentage;              // 0x5C8(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	bool                                         bProne;                                            // 0x5D0(0x1)(ExportObject, BlueprintReadOnly, Net, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_E21[0xF];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            ProneTargetTransform;                              // 0x5E0(0x60)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 ProneCurrentRotation;                              // 0x640(0x20)(ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       L_IKFactor;                                        // 0x660(0x8)(ExportObject, Net, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       R_IKFactor;                                        // 0x668(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       WasProne;                                          // 0x670(0x8)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       SpeedRemapped;                                     // 0x678(0x8)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         bIsOnDino;                                         // 0x680(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnInstance, SubobjectReference)
	bool                                         bIsLocallyControlled;                              // 0x681(0x1)(Edit, ConstParm, BlueprintVisible, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_E27[0xE];                                      // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 ProneWorldInterpRotation;                          // 0x690(0x20)(ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RootZInterpolated;                                 // 0x6B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               InputRootPos;                                      // 0x6B8(0x18)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         bDebugRootInterpCompensation;                      // 0x6D0(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_E2C[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	double                                       Minimum_2_Result;                                  // 0x6D8(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         bUpdateInstantly;                                  // 0x6E0(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_E2D[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	struct FRigPose                              InitialLegScalePose;                               // 0x6E8(0x70)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       Add_3_Result;                                      // 0x758(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       HipZOffsetBeforeProne;                             // 0x760(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)

	static class UClass* StaticClass();
	static class UHuman_Male_TPV_LegIK_CtrlRig_C* GetDefaultObj();

};

// 0xD68 (0xD90 - 0x28)
// RigVMMemoryStorageGeneratorClass Human_Male_TPV_LegIK_CtrlRig.RigVMMemory_Literal
class URigVMMemory_Literal : public URigVMMemoryStorage
{
public:
	bool                                         RigVMModel___HierarchyGetPoseItemArray_Initial__Const; // 0x28(0x1)(BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigElementType                   RigVMModel___HierarchyGetPoseItemArray_ElementType__Const; // 0x29(0x1)(ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_E48[0x6];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_1_Items__Const;     // 0x30(0x10)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_SetTranslation_3_Item__Const; // 0x40(0xC)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              RigVMModel___RigUnit_SetTranslation_3_Space__Const; // 0x4C(0x1)(Edit, ConstParm, BlueprintReadOnly, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_E4C[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        RigVMModel___RigUnit_SetTranslation_3_Weight__Const; // 0x50(0x4)(Edit, ConstParm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___RigUnit_SetTranslation_3_bPropagateToChildren__Const; // 0x54(0x1)(ExportObject, EditFixedSize, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_E4D[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        RigVMModel___RigUnit_SetTranslation_4_Item__Const; // 0x58(0xC)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_4_Item__Const;   // 0x64(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigVMFunction_DebugRectangleNoSpace_1_Transform__Const; // 0x70(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          RigVMModel___RigVMFunction_DebugRectangleNoSpace_1_Color__Const; // 0xD0(0x10)(ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_DebugRectangleNoSpace_1_Scale__Const; // 0xE0(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_DebugRectangleNoSpace_1_Thickness__Const; // 0xE4(0x4)(BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Scale_Value__Const;                   // 0xE8(0x18)(Net, EditFixedSize, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Scale_Factor__Const;                  // 0x100(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_E54[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___DISPATCH_RigVMDispatch_If_8_True__Const; // 0x108(0x8)(BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___DISPATCH_RigVMDispatch_If_8_False__Const; // 0x110(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_4_TargetVelocityAmount__Const; // 0x118(0x4)(BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          RigVMModel___RigVMFunction_DebugRectangleNoSpace_1_1_Color__Const; // 0x11C(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_DebugLineNoSpace_2_Thickness__Const; // 0x12C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_5_Strength__Const;       // 0x130(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_E59[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Greater_B__Const;                     // 0x138(0x8)(BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Subtract_3_A__Const;                  // 0x140(0x8)(ConstParm, ExportObject, Net, EditFixedSize, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Clamp_2_Minimum__Const;               // 0x148(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___IKTrace_0_Element__Const;             // 0x150(0xC)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_E5B[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Maximum_B__Const;                     // 0x160(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathTransformTransformVector_2_1_Location__Const; // 0x168(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__IKTrace_FootBase__Const;     // 0x180(0x18)(BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              IKTrace_0___IKTrace_GetTransform_Space__Const;     // 0x198(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         IKTrace_0___IKTrace_GetTransform_bInitial__Const;  // 0x199(0x1)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_E60[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        IKTrace_0___IKTrace_RigUnit_GetTransform_Item__Const; // 0x19C(0xC)(Edit, BlueprintVisible, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0___IKTrace_Multiply_2_B__Const;           // 0x1A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0___IKTrace_Multiply_1_B__Const;           // 0x1B0(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_Add_1_B__Const;                // 0x1B8(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0___IKTrace_Multiply_B__Const;             // 0x1D0(0x8)(BlueprintVisible, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_Add_B__Const;                  // 0x1D8(0x18)(ConstParm, EditFixedSize, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          IKTrace_0___IKTrace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x1F0(0x10)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0___IKTrace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x200(0x4)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_E66[0xC];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            IKTrace_0___IKTrace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x210(0x60)(BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         IKTrace_0___IKTrace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x270(0x1)(Edit, ConstParm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ETraceTypeQuery                   IKTrace_0___IKTrace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x271(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_E69[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        IKTrace_0___IKTrace_SphereTraceByTraceChannel_Radius__Const; // 0x274(0x4)(Edit, EditFixedSize, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_RigVMFunction_MathQuaternionFromTwoVectors_1_A__Const; // 0x278(0x18)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          IKTrace_0___IKTrace_RigVMFunction_DebugRectangleNoSpace_Color__Const; // 0x290(0x10)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0___IKTrace_RigVMFunction_DebugRectangleNoSpace_Scale__Const; // 0x2A0(0x4)(ConstParm, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_E70[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               IKTrace_0___IKTrace_Subtract_B__Const;             // 0x2A8(0x18)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_Clamp_Minimum__Const;          // 0x2C0(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_Clamp_Maximum__Const;          // 0x2D8(0x18)(Edit, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathTransformTransformVector_2_Location__Const; // 0x2F0(0x18)(Edit, ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__IKTrace_FootBase__Const;     // 0x308(0x18)(BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              IKTrace_0_1___IKTrace_GetTransform_Space__Const;   // 0x320(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         IKTrace_0_1___IKTrace_GetTransform_bInitial__Const; // 0x321(0x1)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_E75[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        IKTrace_0_1___IKTrace_RigUnit_GetTransform_Item__Const; // 0x324(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_1___IKTrace_Multiply_2_B__Const;         // 0x330(0x8)(Edit, BlueprintVisible, EditFixedSize, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_1___IKTrace_Multiply_1_B__Const;         // 0x338(0x8)(Edit, BlueprintVisible, EditFixedSize, Parm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_Add_1_B__Const;              // 0x340(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_1___IKTrace_Multiply_B__Const;           // 0x358(0x8)(ExportObject, Net, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_Add_B__Const;                // 0x360(0x18)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          IKTrace_0_1___IKTrace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x378(0x10)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_1___IKTrace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x388(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_E81[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            IKTrace_0_1___IKTrace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x390(0x60)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         IKTrace_0_1___IKTrace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x3F0(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ETraceTypeQuery                   IKTrace_0_1___IKTrace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x3F1(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_E83[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        IKTrace_0_1___IKTrace_SphereTraceByTraceChannel_Radius__Const; // 0x3F4(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_RigVMFunction_MathQuaternionFromTwoVectors_1_A__Const; // 0x3F8(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          IKTrace_0_1___IKTrace_RigVMFunction_DebugRectangleNoSpace_Color__Const; // 0x410(0x10)(Edit, ConstParm, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_1___IKTrace_RigVMFunction_DebugRectangleNoSpace_Scale__Const; // 0x420(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_E8C[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               IKTrace_0_1___IKTrace_Subtract_B__Const;           // 0x428(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_Clamp_Minimum__Const;        // 0x440(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_Clamp_Maximum__Const;        // 0x458(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathTransformTransformVector_Location__Const; // 0x470(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__IKTrace_FootBase__Const;     // 0x488(0x18)(BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              IKTrace_0_2___IKTrace_GetTransform_Space__Const;   // 0x4A0(0x1)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         IKTrace_0_2___IKTrace_GetTransform_bInitial__Const; // 0x4A1(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_E95[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        IKTrace_0_2___IKTrace_RigUnit_GetTransform_Item__Const; // 0x4A4(0xC)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_2___IKTrace_Multiply_2_B__Const;         // 0x4B0(0x8)(BlueprintReadOnly, EditFixedSize, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_2___IKTrace_Multiply_1_B__Const;         // 0x4B8(0x8)(Edit, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_Add_1_B__Const;              // 0x4C0(0x18)(ConstParm, BlueprintVisible, Net, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_2___IKTrace_Multiply_B__Const;           // 0x4D8(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_Add_B__Const;                // 0x4E0(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          IKTrace_0_2___IKTrace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x4F8(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_2___IKTrace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x508(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_E9B[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            IKTrace_0_2___IKTrace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x510(0x60)(Edit, ConstParm, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         IKTrace_0_2___IKTrace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x570(0x1)(ConstParm, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ETraceTypeQuery                   IKTrace_0_2___IKTrace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x571(0x1)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_EA0[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        IKTrace_0_2___IKTrace_SphereTraceByTraceChannel_Radius__Const; // 0x574(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_RigVMFunction_MathQuaternionFromTwoVectors_1_A__Const; // 0x578(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          IKTrace_0_2___IKTrace_RigVMFunction_DebugRectangleNoSpace_Color__Const; // 0x590(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_2___IKTrace_RigVMFunction_DebugRectangleNoSpace_Scale__Const; // 0x5A0(0x4)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_EA4[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               IKTrace_0_2___IKTrace_Subtract_B__Const;           // 0x5A8(0x18)(Edit, BlueprintReadOnly, Net, EditFixedSize, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_Clamp_Minimum__Const;        // 0x5C0(0x18)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_Clamp_Maximum__Const;        // 0x5D8(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathTransformTransformVector_1_Location__Const; // 0x5F0(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__IKTrace_FootBase__Const;     // 0x608(0x18)(BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              IKTrace_0_2_1___IKTrace_GetTransform_Space__Const; // 0x620(0x1)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         IKTrace_0_2_1___IKTrace_GetTransform_bInitial__Const; // 0x621(0x1)(ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_EAE[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        IKTrace_0_2_1___IKTrace_RigUnit_GetTransform_Item__Const; // 0x624(0xC)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_2_1___IKTrace_Multiply_2_B__Const;       // 0x630(0x8)(Net, EditFixedSize, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_2_1___IKTrace_Multiply_1_B__Const;       // 0x638(0x8)(Edit, BlueprintReadOnly, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_Add_1_B__Const;            // 0x640(0x18)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_2_1___IKTrace_Multiply_B__Const;         // 0x658(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_Add_B__Const;              // 0x660(0x18)(BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          IKTrace_0_2_1___IKTrace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x678(0x10)(Edit, BlueprintReadOnly, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_2_1___IKTrace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x688(0x4)(ConstParm, Net, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_EB4[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            IKTrace_0_2_1___IKTrace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x690(0x60)(ConstParm, BlueprintVisible, ExportObject, Net, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         IKTrace_0_2_1___IKTrace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x6F0(0x1)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ETraceTypeQuery                   IKTrace_0_2_1___IKTrace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x6F1(0x1)(Edit, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_EB6[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        IKTrace_0_2_1___IKTrace_SphereTraceByTraceChannel_Radius__Const; // 0x6F4(0x4)(Edit, BlueprintVisible, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_RigVMFunction_MathQuaternionFromTwoVectors_1_A__Const; // 0x6F8(0x18)(Edit, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          IKTrace_0_2_1___IKTrace_RigVMFunction_DebugRectangleNoSpace_Color__Const; // 0x710(0x10)(Edit, ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_2_1___IKTrace_RigVMFunction_DebugRectangleNoSpace_Scale__Const; // 0x720(0x4)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_EBB[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               IKTrace_0_2_1___IKTrace_Subtract_B__Const;         // 0x728(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_Clamp_Minimum__Const;      // 0x740(0x18)(Edit, ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_Clamp_Maximum__Const;      // 0x758(0x18)(Edit, ConstParm, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathQuaternionFromTwoVectors_2_A__Const; // 0x770(0x18)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Clamp_4_Minimum__Const;               // 0x788(0x8)(ExportObject, BlueprintReadOnly, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Clamp_4_Maximum__Const;               // 0x790(0x8)(ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Clamp_4_2_Minimum__Const;             // 0x798(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Clamp_4_2_Maximum__Const;             // 0x7A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Scale_2_Factor__Const;                // 0x7A8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          RigVMModel___RigVMFunction_DebugLineNoSpace_1_Color__Const; // 0x7AC(0x10)(BlueprintVisible, ExportObject, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_DebugLineNoSpace_1_Thickness__Const; // 0x7BC(0x4)(ExportObject, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          RigVMModel___RigVMFunction_DebugLineNoSpace_1_1_Color__Const; // 0x7C0(0x10)(Edit, BlueprintVisible, ExportObject, Net, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Greater_5_B__Const;                   // 0x7D0(0x8)(BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___DISPATCH_RigVMDispatch_If_4_True__Const; // 0x7D8(0x18)(Edit, ConstParm, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__IKTrace_FootBase__Const;     // 0x7F0(0x18)(BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              IKTrace_1___IKTrace_GetTransform_Space__Const;     // 0x808(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         IKTrace_1___IKTrace_GetTransform_bInitial__Const;  // 0x809(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_EC6[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        IKTrace_1___IKTrace_RigUnit_GetTransform_Item__Const; // 0x80C(0xC)(ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_1___IKTrace_Multiply_2_B__Const;           // 0x818(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_1___IKTrace_Multiply_1_B__Const;           // 0x820(0x8)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_Add_1_B__Const;                // 0x828(0x18)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_1___IKTrace_Multiply_B__Const;             // 0x840(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_Add_B__Const;                  // 0x848(0x18)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          IKTrace_1___IKTrace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x860(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_1___IKTrace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x870(0x4)(Edit, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_ECD[0xC];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            IKTrace_1___IKTrace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x880(0x60)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         IKTrace_1___IKTrace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0x8E0(0x1)(ConstParm, BlueprintVisible, Net, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ETraceTypeQuery                   IKTrace_1___IKTrace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x8E1(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_ED1[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        IKTrace_1___IKTrace_SphereTraceByTraceChannel_Radius__Const; // 0x8E4(0x4)(Edit, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_RigVMFunction_MathQuaternionFromTwoVectors_1_A__Const; // 0x8E8(0x18)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          IKTrace_1___IKTrace_RigVMFunction_DebugRectangleNoSpace_Color__Const; // 0x900(0x10)(Edit, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_1___IKTrace_RigVMFunction_DebugRectangleNoSpace_Scale__Const; // 0x910(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_ED6[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               IKTrace_1___IKTrace_Subtract_B__Const;             // 0x918(0x18)(ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_Clamp_Minimum__Const;          // 0x930(0x18)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_Clamp_Maximum__Const;          // 0x948(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___DISPATCH_RigVMDispatch_If_9_True__Const; // 0x960(0x8)(BlueprintVisible, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__IKTrace_FootBase__Const;     // 0x968(0x18)(BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              IKTrace_2___IKTrace_GetTransform_Space__Const;     // 0x980(0x1)(BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         IKTrace_2___IKTrace_GetTransform_bInitial__Const;  // 0x981(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_EE0[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        IKTrace_2___IKTrace_RigUnit_GetTransform_Item__Const; // 0x984(0xC)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_2___IKTrace_Multiply_2_B__Const;           // 0x990(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_2___IKTrace_Multiply_1_B__Const;           // 0x998(0x8)(Edit, Parm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_Add_1_B__Const;                // 0x9A0(0x18)(ExportObject, Net, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_2___IKTrace_Multiply_B__Const;             // 0x9B8(0x8)(ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_Add_B__Const;                  // 0x9C0(0x18)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          IKTrace_2___IKTrace_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x9D8(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_2___IKTrace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x9E8(0x4)(BlueprintReadOnly, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_EE8[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            IKTrace_2___IKTrace_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x9F0(0x60)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         IKTrace_2___IKTrace_RigVMFunction_DebugLineNoSpace_bEnabled__Const; // 0xA50(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ETraceTypeQuery                   IKTrace_2___IKTrace_SphereTraceByTraceChannel_TraceChannel__Const; // 0xA51(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_EEF[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        IKTrace_2___IKTrace_SphereTraceByTraceChannel_Radius__Const; // 0xA54(0x4)(BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_RigVMFunction_MathQuaternionFromTwoVectors_1_A__Const; // 0xA58(0x18)(Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          IKTrace_2___IKTrace_RigVMFunction_DebugRectangleNoSpace_Color__Const; // 0xA70(0x10)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_2___IKTrace_RigVMFunction_DebugRectangleNoSpace_Scale__Const; // 0xA80(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_EF4[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               IKTrace_2___IKTrace_Subtract_B__Const;             // 0xA88(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_Clamp_Minimum__Const;          // 0xAA0(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_Clamp_Maximum__Const;          // 0xAB8(0x18)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_If_3_False__Const; // 0xAD0(0x4)(Edit, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_EF7[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Remap_3_TargetMinimum__Const;         // 0xAD8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_7_CriticalDamping__Const; // 0xAE0(0x4)(Edit, ConstParm, ExportObject, Net, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___CalculatePV_Thigh__Const;             // 0xAE4(0xC)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___CalculatePV_Foot__Const;              // 0xAF0(0xC)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_EF9[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RigVMModel___CalculatePV_PVLocalTranslation__Const; // 0xB00(0x18)(ConstParm, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_EFB[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            CalculatePV___CalculatePV_Multiply_A__Const;       // 0xB20(0x60)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              CalculatePV___CalculatePV_RigUnit_GetTransform_Space__Const; // 0xB80(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         CalculatePV___CalculatePV_RigUnit_GetTransform_bInitial__Const; // 0xB81(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F01[0x6];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               CalculatePV___CalculatePV_Add_7_B__Const;          // 0xB88(0x18)(Edit, BlueprintReadOnly, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigUnitDebugTransformMode        RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0xBA0(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F03[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        RigVMModel___CalculatePV_1_Thigh__Const;           // 0xBA4(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___CalculatePV_1_Foot__Const;            // 0xBB0(0xC)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F06[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RigVMModel___CalculatePV_1_PVLocalTranslation__Const; // 0xBC0(0x18)(BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F08[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            CalculatePV_1___CalculatePV_Multiply_A__Const;     // 0xBE0(0x60)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              CalculatePV_1___CalculatePV_RigUnit_GetTransform_Space__Const; // 0xC40(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         CalculatePV_1___CalculatePV_RigUnit_GetTransform_bInitial__Const; // 0xC41(0x1)(ConstParm, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F0C[0x6];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               CalculatePV_1___CalculatePV_Add_7_B__Const;        // 0xC48(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          RigVMModel___RigVMFunction_DebugLineNoSpace_Color__Const; // 0xC60(0x10)(BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Greater_4_B__Const;                   // 0xC70(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F0E[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 RigVMModel___DISPATCH_RigVMDispatch_If_11_10_True__Const; // 0xC80(0x20)(Edit, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___TwoBoneIKSimplePerItem_1_1_ItemB__Const; // 0xCA0(0xC)(OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F0F[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RigVMModel___TwoBoneIKSimplePerItem_1_1_PrimaryAxis__Const; // 0xCB0(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class EControlRigVectorKind             RigVMModel___TwoBoneIKSimplePerItem_1_1_PoleVectorKind__Const; // 0xCC8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F10[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        RigVMModel___TwoBoneIKSimplePerItem_1_1_PoleVectorSpace__Const; // 0xCCC(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___TwoBoneIKSimplePerItem_1_1_StretchStartRatio__Const; // 0xCD8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___TwoBoneIKSimplePerItem_1_1_StretchMaximumRatio__Const; // 0xCDC(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigUnit_TwoBoneIKSimple_DebugSettings RigVMModel___TwoBoneIKSimplePerItem_1_1_DebugSettings__Const; // 0xCE0(0x70)(BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___TwoBoneIKSimplePerItem_1_ItemB__Const; // 0xD50(0xC)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F14[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RigVMModel___TwoBoneIKSimplePerItem_1_PrimaryAxis__Const; // 0xD60(0x18)(Edit, BlueprintVisible, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___TwoBoneIKSimplePerItem_1_SecondaryAxis__Const; // 0xD78(0x18)(Edit, ConstParm, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)

	static class UClass* StaticClass();
	static class URigVMMemory_Literal* GetDefaultObj();

};

// 0x4160 (0x4188 - 0x28)
// RigVMMemoryStorageGeneratorClass Human_Male_TPV_LegIK_CtrlRig.RigVMMemory_Work
class URigVMMemory_Work : public URigVMMemoryStorage
{
public:
	struct FRigPose                              RigVMModel___HierarchyGetPoseItemArray_Pose;       // 0x28(0x70)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_1_Items__IO;        // 0x98(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Scale_4_Result;                       // 0xA8(0x18)(BlueprintVisible, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_11_Transform;    // 0xC0(0x60)(Edit, BlueprintVisible, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_11_CachedIndex;  // 0x120(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Scale_4_Value;                        // 0x130(0x18)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Scale_4_Factor;                       // 0x148(0x4)(Edit, EditFixedSize, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F33[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTranslation_3_CachedIndex; // 0x150(0x10)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Scale_4_1_Result;                     // 0x160(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F34[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_12_Transform;    // 0x180(0x60)(ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_12_CachedIndex;  // 0x1E0(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Scale_4_1_Value;                      // 0x1F0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Scale_4_1_Factor;                     // 0x208(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F36[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTranslation_4_CachedIndex; // 0x210(0x10)(BlueprintVisible, EditFixedSize, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_4_Transform;     // 0x220(0x60)(Edit, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_4_CachedIndex;   // 0x280(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigVMFunction_DebugRectangleNoSpace_1_Transform__IO; // 0x290(0x60)(BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Scale_Result;                         // 0x2F0(0x18)(BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Scale_Value__IO;                      // 0x308(0x18)(BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___DISPATCH_RigVMDispatch_If_11_1_Result; // 0x320(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___DISPATCH_RigVMDispatch_If_6_Result;   // 0x338(0x18)(Edit, Net, EditFixedSize, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___SpringInterp_4_Result;                // 0x350(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___DISPATCH_RigVMDispatch_If_8_Result;   // 0x368(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___Greater_2_Result;                     // 0x370(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F3E[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Absolute_Result;                      // 0x378(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Absolute_Value;                       // 0x380(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Absolute_1_Result;                    // 0x388(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Absolute_1_Value;                     // 0x390(0x8)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_4_Strength;              // 0x398(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F41[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RigVMModel___SpringInterp_4_Velocity;              // 0x3A0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FVector>                       RigVMModel___SpringInterp_4_SimulatedResult;       // 0x3B8(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FVectorSpringState>            RigVMModel___SpringInterp_4_SpringState;           // 0x3C8(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_18_Result;                        // 0x3D8(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_10_Transform;    // 0x3F0(0x60)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_10_CachedIndex;  // 0x450(0x10)(BlueprintVisible, BlueprintReadOnly, Net, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_18_A;                             // 0x460(0x18)(ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTranslation_2_CachedIndex; // 0x478(0x10)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F49[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_4_1_Transform;   // 0x490(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_4_1_CachedIndex; // 0x4F0(0x10)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigVMFunction_DebugRectangleNoSpace_1_1_Transform__IO; // 0x500(0x60)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_DebugLineNoSpace_2_B;   // 0x560(0x18)(ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_4_BlockToRun; // 0x578(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_If_11_2_Result; // 0x580(0x4)(Edit, ConstParm, ExportObject, Net, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_MathBoolToFloat_Result; // 0x584(0x4)(ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_5_Result;                // 0x588(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_5_Velocity;              // 0x58C(0x4)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<float>                                RigVMModel___SpringInterp_5_SimulatedResult;       // 0x590(0x10)(ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FFloatSpringState>             RigVMModel___SpringInterp_5_SpringState;           // 0x5A0(0x10)(Edit, ConstParm, ExportObject, EditFixedSize, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___Greater_Result;                       // 0x5B0(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F51[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Clamp_2_Result;                       // 0x5B8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Subtract_3_Result;                    // 0x5C0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Clamp_6_Result;                       // 0x5C8(0x8)(ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Divide_Result;                        // 0x5D0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Absolute_4_Result;                    // 0x5D8(0x8)(Edit, ConstParm, Net, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_18_Transform;    // 0x5E0(0x60)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_18_CachedIndex;  // 0x640(0x10)(ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Absolute_4_Value;                     // 0x650(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Maximum_Result;                       // 0x658(0x8)(Edit, BlueprintVisible, ExportObject, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Multiply_11_Result;                   // 0x660(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Absolute_3_Result;                    // 0x668(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_18_1_Transform;  // 0x670(0x60)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_18_1_CachedIndex; // 0x6D0(0x10)(BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Absolute_3_Value;                     // 0x6E0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___IKTrace_0_Hit;                        // 0x6E8(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F5F[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RigVMModel___IKTrace_0_HitLocation;                // 0x6F0(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___IKTrace_0_Offset;                     // 0x708(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___IKTrace_0_HitNormal;                  // 0x710(0x18)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathTransformTransformVector_2_1_Result; // 0x728(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_9_Transform;     // 0x740(0x60)(Edit, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_9_CachedIndex;   // 0x7A0(0x10)(Edit, ConstParm, ExportObject, Net, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigVMFunction_MathTransformTransformVector_2_1_Transform__IO; // 0x7B0(0x60)(Edit, ConstParm, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_Add_3_1_Result;                // 0x810(0x18)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_RigVMFunction_MathVectorMake_1_Result; // 0x828(0x18)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            IKTrace_0___IKTrace_GetTransform_Transform;        // 0x840(0x60)(ConstParm, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             IKTrace_0___IKTrace_GetTransform_CachedIndex;      // 0x8A0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0___IKTrace_RigVMFunction_MathVectorMake_1_X; // 0x8B0(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0___IKTrace_RigVMFunction_MathVectorMake_1_Y; // 0x8B4(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F6B[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            IKTrace_0___IKTrace_RigUnit_GetTransform_Transform; // 0x8C0(0x60)(Edit, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             IKTrace_0___IKTrace_RigUnit_GetTransform_CachedIndex; // 0x920(0x10)(Edit, ConstParm, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0___IKTrace_RigVMFunction_MathVectorMake_1_Z; // 0x930(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F6F[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalVariable__IKTrace_FootBase;                   // 0x938(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0___IKTrace_Multiply_1_Result;             // 0x950(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0___IKTrace_Multiply_2_1_Result;           // 0x958(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_Add_1_Result;                  // 0x960(0x18)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_Add_3_Result;                  // 0x978(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0___IKTrace_Multiply_Result;               // 0x990(0x8)(Edit, ExportObject, Net, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0___IKTrace_Multiply_2_Result;             // 0x998(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_Add_1_B__IO;                   // 0x9A0(0x18)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_Add_Result;                    // 0x9B8(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_Add_B__IO;                     // 0x9D0(0x18)(ConstParm, ExportObject, Net, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_SphereTraceByTraceChannel_HitNormal; // 0x9E8(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_SphereTraceByTraceChannel_HitLocation; // 0xA00(0x18)(Edit, Net, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FHitResult                            IKTrace_0___IKTrace_SphereTraceByTraceChannel_WorldSpaceHitResult; // 0xA18(0xF0)(BlueprintVisible, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F7F[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 IKTrace_0___IKTrace_RigVMFunction_MathQuaternionFromTwoVectors_1_Result; // 0xB10(0x20)(BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_From_World_1_Global;           // 0xB30(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_RigVMFunction_MathVectorMake_2_Result; // 0xB48(0x18)(ConstParm, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0___IKTrace_RigVMFunction_MathVectorMake_2_X; // 0xB60(0x4)(ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0___IKTrace_RigVMFunction_MathVectorMake_2_Y; // 0xB64(0x4)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0___IKTrace_RigVMFunction_MathVectorMake_2_Z; // 0xB68(0x4)(ConstParm, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F84[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            IKTrace_0___IKTrace_RigVMFunction_DebugRectangleNoSpace_Transform__IO; // 0xB70(0x60)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_DISPATCH_RigVMDispatch_If_Result; // 0xBD0(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_Subtract_1_Result;             // 0xBE8(0x18)(Edit, BlueprintVisible, Net, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_Add_2_Result;                  // 0xC00(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_Add_2_B__IO;                   // 0xC18(0x18)(Edit, ConstParm, EditFixedSize, Parm, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0___IKTrace_Clamp_Result;                  // 0xC30(0x18)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___IKTrace_0_1_Hit;                      // 0xC48(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F89[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RigVMModel___IKTrace_0_1_HitLocation;              // 0xC50(0x18)(ConstParm, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___IKTrace_0_1_Offset;                   // 0xC68(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___IKTrace_0_1_HitNormal;                // 0xC70(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathTransformTransformVector_2_Result; // 0xC88(0x18)(ConstParm, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigVMFunction_MathTransformTransformVector_2_Transform__IO; // 0xCA0(0x60)(Edit, ConstParm, Net, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_Add_3_1_Result;              // 0xD00(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_RigVMFunction_MathVectorMake_1_Result; // 0xD18(0x18)(ConstParm, ExportObject, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            IKTrace_0_1___IKTrace_GetTransform_Transform;      // 0xD30(0x60)(ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             IKTrace_0_1___IKTrace_GetTransform_CachedIndex;    // 0xD90(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_1___IKTrace_RigVMFunction_MathVectorMake_1_X; // 0xDA0(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_1___IKTrace_RigVMFunction_MathVectorMake_1_Y; // 0xDA4(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F91[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            IKTrace_0_1___IKTrace_RigUnit_GetTransform_Transform; // 0xDB0(0x60)(Edit, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             IKTrace_0_1___IKTrace_RigUnit_GetTransform_CachedIndex; // 0xE10(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_1___IKTrace_RigVMFunction_MathVectorMake_1_Z; // 0xE20(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F94[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalVariable__IKTrace_FootBase;                   // 0xE28(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_1___IKTrace_Multiply_1_Result;           // 0xE40(0x8)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_1___IKTrace_Multiply_2_1_Result;         // 0xE48(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_Add_1_Result;                // 0xE50(0x18)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_Add_3_Result;                // 0xE68(0x18)(Net, EditFixedSize, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_1___IKTrace_Multiply_Result;             // 0xE80(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_1___IKTrace_Multiply_2_Result;           // 0xE88(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_Add_1_B__IO;                 // 0xE90(0x18)(Edit, BlueprintVisible, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_Add_Result;                  // 0xEA8(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_Add_B__IO;                   // 0xEC0(0x18)(ExportObject, Net, EditFixedSize, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_SphereTraceByTraceChannel_HitNormal; // 0xED8(0x18)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_SphereTraceByTraceChannel_HitLocation; // 0xEF0(0x18)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FHitResult                            IKTrace_0_1___IKTrace_SphereTraceByTraceChannel_WorldSpaceHitResult; // 0xF08(0xF0)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F9E[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 IKTrace_0_1___IKTrace_RigVMFunction_MathQuaternionFromTwoVectors_1_Result; // 0x1000(0x20)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_From_World_1_Global;         // 0x1020(0x18)(Edit, BlueprintVisible, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_RigVMFunction_MathVectorMake_2_Result; // 0x1038(0x18)(ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_1___IKTrace_RigVMFunction_MathVectorMake_2_X; // 0x1050(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_1___IKTrace_RigVMFunction_MathVectorMake_2_Y; // 0x1054(0x4)(ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_1___IKTrace_RigVMFunction_MathVectorMake_2_Z; // 0x1058(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FA4[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            IKTrace_0_1___IKTrace_RigVMFunction_DebugRectangleNoSpace_Transform__IO; // 0x1060(0x60)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_DISPATCH_RigVMDispatch_If_Result; // 0x10C0(0x18)(ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_Subtract_1_Result;           // 0x10D8(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_Add_2_Result;                // 0x10F0(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_Add_2_B__IO;                 // 0x1108(0x18)(Edit, ConstParm, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_1___IKTrace_Clamp_Result;                // 0x1120(0x18)(OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___IKTrace_0_2_Hit;                      // 0x1138(0x1)(Edit, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FA7[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RigVMModel___IKTrace_0_2_HitLocation;              // 0x1140(0x18)(ConstParm, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___IKTrace_0_2_Offset;                   // 0x1158(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___IKTrace_0_2_HitNormal;                // 0x1160(0x18)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathTransformTransformVector_Result; // 0x1178(0x18)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigVMFunction_MathTransformTransformVector_Transform__IO; // 0x1190(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_Add_3_1_Result;              // 0x11F0(0x18)(BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_RigVMFunction_MathVectorMake_1_Result; // 0x1208(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            IKTrace_0_2___IKTrace_GetTransform_Transform;      // 0x1220(0x60)(Edit, ConstParm, BlueprintVisible, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             IKTrace_0_2___IKTrace_GetTransform_CachedIndex;    // 0x1280(0x10)(Edit, ConstParm, BlueprintVisible, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_2___IKTrace_RigVMFunction_MathVectorMake_1_X; // 0x1290(0x4)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_2___IKTrace_RigVMFunction_MathVectorMake_1_Y; // 0x1294(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FAD[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            IKTrace_0_2___IKTrace_RigUnit_GetTransform_Transform; // 0x12A0(0x60)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             IKTrace_0_2___IKTrace_RigUnit_GetTransform_CachedIndex; // 0x1300(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_2___IKTrace_RigVMFunction_MathVectorMake_1_Z; // 0x1310(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FB0[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalVariable__IKTrace_FootBase;                   // 0x1318(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_2___IKTrace_Multiply_1_Result;           // 0x1330(0x8)(ConstParm, ExportObject, Net, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_2___IKTrace_Multiply_2_1_Result;         // 0x1338(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_Add_1_Result;                // 0x1340(0x18)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_Add_3_Result;                // 0x1358(0x18)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_2___IKTrace_Multiply_Result;             // 0x1370(0x8)(ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_2___IKTrace_Multiply_2_Result;           // 0x1378(0x8)(ConstParm, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_Add_1_B__IO;                 // 0x1380(0x18)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_Add_Result;                  // 0x1398(0x18)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_Add_B__IO;                   // 0x13B0(0x18)(ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_SphereTraceByTraceChannel_HitNormal; // 0x13C8(0x18)(ConstParm, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_SphereTraceByTraceChannel_HitLocation; // 0x13E0(0x18)(ConstParm, BlueprintVisible, Net, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FHitResult                            IKTrace_0_2___IKTrace_SphereTraceByTraceChannel_WorldSpaceHitResult; // 0x13F8(0xF0)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FB4[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 IKTrace_0_2___IKTrace_RigVMFunction_MathQuaternionFromTwoVectors_1_Result; // 0x14F0(0x20)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_From_World_1_Global;         // 0x1510(0x18)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_RigVMFunction_MathVectorMake_2_Result; // 0x1528(0x18)(ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_2___IKTrace_RigVMFunction_MathVectorMake_2_X; // 0x1540(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_2___IKTrace_RigVMFunction_MathVectorMake_2_Y; // 0x1544(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_2___IKTrace_RigVMFunction_MathVectorMake_2_Z; // 0x1548(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FB8[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            IKTrace_0_2___IKTrace_RigVMFunction_DebugRectangleNoSpace_Transform__IO; // 0x1550(0x60)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_DISPATCH_RigVMDispatch_If_Result; // 0x15B0(0x18)(BlueprintVisible, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_Subtract_1_Result;           // 0x15C8(0x18)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_Add_2_Result;                // 0x15E0(0x18)(ConstParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_Add_2_B__IO;                 // 0x15F8(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2___IKTrace_Clamp_Result;                // 0x1610(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___IKTrace_0_2_1_Hit;                    // 0x1628(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FB9[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RigVMModel___IKTrace_0_2_1_HitLocation;            // 0x1630(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___IKTrace_0_2_1_Offset;                 // 0x1648(0x8)(BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___IKTrace_0_2_1_HitNormal;              // 0x1650(0x18)(ExportObject, Net, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathTransformTransformVector_1_Result; // 0x1668(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigVMFunction_MathTransformTransformVector_1_Transform__IO; // 0x1680(0x60)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_Add_3_1_Result;            // 0x16E0(0x18)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_RigVMFunction_MathVectorMake_1_Result; // 0x16F8(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            IKTrace_0_2_1___IKTrace_GetTransform_Transform;    // 0x1710(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             IKTrace_0_2_1___IKTrace_GetTransform_CachedIndex;  // 0x1770(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_2_1___IKTrace_RigVMFunction_MathVectorMake_1_X; // 0x1780(0x4)(ConstParm, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_2_1___IKTrace_RigVMFunction_MathVectorMake_1_Y; // 0x1784(0x4)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FBF[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            IKTrace_0_2_1___IKTrace_RigUnit_GetTransform_Transform; // 0x1790(0x60)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             IKTrace_0_2_1___IKTrace_RigUnit_GetTransform_CachedIndex; // 0x17F0(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_2_1___IKTrace_RigVMFunction_MathVectorMake_1_Z; // 0x1800(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FC2[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalVariable__IKTrace_FootBase;                   // 0x1808(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_2_1___IKTrace_Multiply_1_Result;         // 0x1820(0x8)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_2_1___IKTrace_Multiply_2_1_Result;       // 0x1828(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_Add_1_Result;              // 0x1830(0x18)(BlueprintVisible, ExportObject, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_Add_3_Result;              // 0x1848(0x18)(Edit, ExportObject, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_2_1___IKTrace_Multiply_Result;           // 0x1860(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_0_2_1___IKTrace_Multiply_2_Result;         // 0x1868(0x8)(ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_Add_1_B__IO;               // 0x1870(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_Add_Result;                // 0x1888(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_Add_B__IO;                 // 0x18A0(0x18)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_SphereTraceByTraceChannel_HitNormal; // 0x18B8(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_SphereTraceByTraceChannel_HitLocation; // 0x18D0(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FHitResult                            IKTrace_0_2_1___IKTrace_SphereTraceByTraceChannel_WorldSpaceHitResult; // 0x18E8(0xF0)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FCA[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 IKTrace_0_2_1___IKTrace_RigVMFunction_MathQuaternionFromTwoVectors_1_Result; // 0x19E0(0x20)(ConstParm, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_From_World_1_Global;       // 0x1A00(0x18)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_RigVMFunction_MathVectorMake_2_Result; // 0x1A18(0x18)(Edit, ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_2_1___IKTrace_RigVMFunction_MathVectorMake_2_X; // 0x1A30(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_2_1___IKTrace_RigVMFunction_MathVectorMake_2_Y; // 0x1A34(0x4)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_0_2_1___IKTrace_RigVMFunction_MathVectorMake_2_Z; // 0x1A38(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FCF[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            IKTrace_0_2_1___IKTrace_RigVMFunction_DebugRectangleNoSpace_Transform__IO; // 0x1A40(0x60)(BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_DISPATCH_RigVMDispatch_If_Result; // 0x1AA0(0x18)(Edit, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_Subtract_1_Result;         // 0x1AB8(0x18)(Edit, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_Add_2_Result;              // 0x1AD0(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_Add_2_B__IO;               // 0x1AE8(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_0_2_1___IKTrace_Clamp_Result;              // 0x1B00(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FD7[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___Cast_Result;                          // 0x1B20(0x60)(Edit, ConstParm, ExportObject, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FMatrix                               RigVMModel___RigVMFunction_MathMatrixFromVectors_Result; // 0x1B80(0x80)(ExportObject, Net, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Unit_1_Result;                        // 0x1C00(0x18)(Edit, ExportObject, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Subtract_Result;                      // 0x1C18(0x18)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Subtract_1_Result;                    // 0x1C30(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathVectorCross_Result; // 0x1C48(0x18)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Unit_Result;                          // 0x1C60(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FE0[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 RigVMModel___DISPATCH_RigVMDispatch_If_11_5_Result; // 0x1C80(0x20)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___To_World_1_World;                     // 0x1CA0(0x20)(BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___To_World_1_Value;                     // 0x1CC0(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___SpringInterpQuaternionV2_1_Result;    // 0x1CE0(0x20)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___SpringInterpQuaternionV2_1_AngularVelocity; // 0x1D00(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FQuat>                         RigVMModel___SpringInterpQuaternionV2_1_SimulatedResult; // 0x1D18(0x10)(BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FQuaternionSpringState>        RigVMModel___SpringInterpQuaternionV2_1_SpringState; // 0x1D28(0x10)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FE7[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionFromTwoVectors_2_Result; // 0x1D40(0x20)(Edit, ConstParm, Net, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Rotate_Vector_3_1_Result;             // 0x1D60(0x18)(BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FEA[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 RigVMModel___Rotate_Vector_3_1_Transform;          // 0x1D80(0x20)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathVectorMake_Result;  // 0x1DA0(0x18)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Clamp_4_Result;                       // 0x1DB8(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Rotate_Vector_3_Result;               // 0x1DC0(0x18)(BlueprintVisible, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FEC[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 RigVMModel___Inverse_Result;                       // 0x1DE0(0x20)(Edit, ConstParm, EditFixedSize, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathTransformTransformVector_1_1_Result; // 0x1E00(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FED[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 RigVMModel___From_World_1_Global;                  // 0x1E20(0x20)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigVMFunction_MathTransformTransformVector_1_1_Transform__IO; // 0x1E40(0x60)(ConstParm, BlueprintVisible, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Clamp_4_Value;                        // 0x1EA0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_MathVectorMake_X;       // 0x1EA8(0x4)(Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_MathVectorMake_Y;       // 0x1EAC(0x4)(Edit, ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Clamp_4_2_Result;                     // 0x1EB0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Clamp_4_2_Value;                      // 0x1EB8(0x8)(BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_MathVectorMake_Z;       // 0x1EC0(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FF2[0xC];                                      // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___Multiply_5_Result;                    // 0x1ED0(0x60)(ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_8_Transform;     // 0x1F30(0x60)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_8_CachedIndex;   // 0x1F90(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___Multiply_5_B__IO;                     // 0x1FA0(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigUnit_SetRotation_2_Value;          // 0x2000(0x20)(ConstParm, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigUnit_SetRotation_2_Weight;         // 0x2020(0x4)(Edit, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FF6[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_2_CachedIndex;    // 0x2028(0x10)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_DebugLineNoSpace_1_A;   // 0x2038(0x18)(Edit, ConstParm, ExportObject, Parm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_15_Result;                        // 0x2050(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Scale_2_Result;                       // 0x2068(0x18)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_15_1_Result;                      // 0x2080(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Scale_2_1_Result;                     // 0x2098(0x18)(Edit, ConstParm, ExportObject, Net, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___Less_3_Result;                        // 0x20B0(0x1)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___Greater_5_Result;                     // 0x20B1(0x1)(BlueprintVisible, Net, Parm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FFC[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_9_BlockToRun; // 0x20B4(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_FFE[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Multiply_12_Result;                   // 0x20C0(0x8)(ConstParm, Net, EditFixedSize, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_If_11_8_Result; // 0x20C8(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_7_1_1_Result;            // 0x20CC(0x4)(Edit, BlueprintVisible, EditFixedSize, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_7_1_1_Target;            // 0x20D0(0x4)(ConstParm, BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_7_1_1_Current;           // 0x20D4(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_7_1_1_Velocity;          // 0x20D8(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1001[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                RigVMModel___SpringInterp_7_1_1_SimulatedResult;   // 0x20E0(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FFloatSpringState>             RigVMModel___SpringInterp_7_1_1_SpringState;       // 0x20F0(0x10)(ConstParm, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_If_11_7_Result; // 0x2100(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_7_1_Result;              // 0x2104(0x4)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_7_1_Target;              // 0x2108(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_7_1_Current;             // 0x210C(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_7_1_Velocity;            // 0x2110(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1005[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                RigVMModel___SpringInterp_7_1_SimulatedResult;     // 0x2118(0x10)(BlueprintReadOnly, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FFloatSpringState>             RigVMModel___SpringInterp_7_1_SpringState;         // 0x2128(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_8_BlockToRun; // 0x2138(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_4_1_Result;                       // 0x2140(0x18)(ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1008[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_2_2_Transform;   // 0x2160(0x60)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_2_2_CachedIndex; // 0x21C0(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_4_1_A;                            // 0x21D0(0x18)(ExportObject, Net, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Minimum_5_1_Result;                   // 0x21E8(0x8)(ConstParm, ExportObject, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_4_1_B__IO;                        // 0x21F0(0x18)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTranslation_5_CachedIndex; // 0x2208(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Clamp_3_Result;                       // 0x2218(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___IKTrace_1_Hit;                        // 0x2220(0x1)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_100B[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RigVMModel___IKTrace_1_HitLocation;                // 0x2228(0x18)(ExportObject, EditFixedSize, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___IKTrace_1_Offset;                     // 0x2240(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___IKTrace_1_HitNormal;                  // 0x2248(0x18)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_9_Add_9_1_Result;                 // 0x2260(0x18)(ConstParm, Net, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_9_Add_9_Result;                   // 0x2278(0x18)(Edit, BlueprintVisible, Net, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Scale_3_Result;                       // 0x2290(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___DISPATCH_RigVMDispatch_If_4_Result;   // 0x22A8(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_Add_3_1_Result;                // 0x22C0(0x18)(Edit, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_RigVMFunction_MathVectorMake_1_Result; // 0x22D8(0x18)(ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            IKTrace_1___IKTrace_GetTransform_Transform;        // 0x22F0(0x60)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             IKTrace_1___IKTrace_GetTransform_CachedIndex;      // 0x2350(0x10)(Edit, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_1___IKTrace_RigVMFunction_MathVectorMake_1_X; // 0x2360(0x4)(ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_1___IKTrace_RigVMFunction_MathVectorMake_1_Y; // 0x2364(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1014[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            IKTrace_1___IKTrace_RigUnit_GetTransform_Transform; // 0x2370(0x60)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             IKTrace_1___IKTrace_RigUnit_GetTransform_CachedIndex; // 0x23D0(0x10)(BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_1___IKTrace_RigVMFunction_MathVectorMake_1_Z; // 0x23E0(0x4)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1017[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalVariable__IKTrace_FootBase;                   // 0x23E8(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_1___IKTrace_Multiply_1_Result;             // 0x2400(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_1___IKTrace_Multiply_2_1_Result;           // 0x2408(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_Add_1_Result;                  // 0x2410(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_Add_3_Result;                  // 0x2428(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_1___IKTrace_Multiply_Result;               // 0x2440(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_1___IKTrace_Multiply_2_Result;             // 0x2448(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_Add_1_B__IO;                   // 0x2450(0x18)(ConstParm, ExportObject, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_Add_Result;                    // 0x2468(0x18)(Edit, BlueprintReadOnly, Net, EditFixedSize, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_Add_B__IO;                     // 0x2480(0x18)(Edit, Net, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_SphereTraceByTraceChannel_HitNormal; // 0x2498(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_SphereTraceByTraceChannel_HitLocation; // 0x24B0(0x18)(ExportObject, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FHitResult                            IKTrace_1___IKTrace_SphereTraceByTraceChannel_WorldSpaceHitResult; // 0x24C8(0xF0)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_101C[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 IKTrace_1___IKTrace_RigVMFunction_MathQuaternionFromTwoVectors_1_Result; // 0x25C0(0x20)(Edit, BlueprintVisible, EditFixedSize, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_From_World_1_Global;           // 0x25E0(0x18)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_RigVMFunction_MathVectorMake_2_Result; // 0x25F8(0x18)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_1___IKTrace_RigVMFunction_MathVectorMake_2_X; // 0x2610(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_1___IKTrace_RigVMFunction_MathVectorMake_2_Y; // 0x2614(0x4)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_1___IKTrace_RigVMFunction_MathVectorMake_2_Z; // 0x2618(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_101E[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            IKTrace_1___IKTrace_RigVMFunction_DebugRectangleNoSpace_Transform__IO; // 0x2620(0x60)(OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_DISPATCH_RigVMDispatch_If_Result; // 0x2680(0x18)(Edit, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_Subtract_1_Result;             // 0x2698(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_Add_2_Result;                  // 0x26B0(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_Add_2_B__IO;                   // 0x26C8(0x18)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_1___IKTrace_Clamp_Result;                  // 0x26E0(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_If_10_Result;  // 0x26F8(0x4)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1027[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Multiply_7_Result;                    // 0x2700(0x8)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_If_10_True;    // 0x2708(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_1_Result;                // 0x270C(0x4)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_1_Target;                // 0x2710(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Multiply_9_Result;                    // 0x2714(0x4)(ConstParm, BlueprintVisible, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_If_7_Result;   // 0x2718(0x4)(Edit, ConstParm, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___Greater_1_Result;                     // 0x271C(0x1)(Edit, ExportObject, Net, Parm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_102D[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___DISPATCH_RigVMDispatch_If_9_Result;   // 0x2720(0x8)(ConstParm, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___Less_1_Result;                        // 0x2728(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_102F[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Absolute_2_Result;                    // 0x2730(0x8)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Subtract_4_Result;                    // 0x2738(0x8)(BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Multiply_9_B;                         // 0x2740(0x4)(BlueprintVisible, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_1_Current;               // 0x2744(0x4)(Edit, ConstParm, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_1_Velocity;              // 0x2748(0x4)(Edit, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1037[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                RigVMModel___SpringInterp_1_SimulatedResult;       // 0x2750(0x10)(ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FFloatSpringState>             RigVMModel___SpringInterp_1_SpringState;           // 0x2760(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___Inverse_1_Result;                     // 0x2770(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_3_Transform;     // 0x2790(0x60)(Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_3_CachedIndex;   // 0x27F0(0x10)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___Inverse_1_Value;                      // 0x2800(0x20)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___DISPATCH_RigVMDispatch_If_11_4_Result; // 0x2820(0x18)(BlueprintReadOnly, Parm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Rotate_Vector_Result;                 // 0x2838(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___SpringInterp_3_Result;                // 0x2850(0x18)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___SpringInterp_3_Velocity;              // 0x2868(0x18)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FVector>                       RigVMModel___SpringInterp_3_SimulatedResult;       // 0x2880(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FVectorSpringState>            RigVMModel___SpringInterp_3_SpringState;           // 0x2890(0x10)(Edit, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_Result;                           // 0x28A0(0x18)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_103F[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___GetTransform_2_Transform;             // 0x28C0(0x60)(ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___GetTransform_2_CachedIndex;           // 0x2920(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_A;                                // 0x2930(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_B__IO;                            // 0x2948(0x18)(BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___Multiply_2_Result;                    // 0x2960(0x20)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionFromTwoVectors_Result; // 0x2980(0x20)(Edit, ConstParm, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Rotate_Vector_2_Result;               // 0x29A0(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1044[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_3_1_Transform;   // 0x29C0(0x60)(ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_3_1_CachedIndex; // 0x2A20(0x10)(Edit, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___Rotate_Vector_2_Transform;            // 0x2A30(0x20)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___Multiply_2_B;                         // 0x2A50(0x20)(Edit, BlueprintVisible, Net, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___IKTrace_2_Hit;                        // 0x2A70(0x1)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1048[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RigVMModel___IKTrace_2_HitLocation;                // 0x2A78(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___IKTrace_2_Offset;                     // 0x2A90(0x8)(Edit, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___IKTrace_2_HitNormal;                  // 0x2A98(0x18)(Edit, Net, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_Add_3_1_Result;                // 0x2AB0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_RigVMFunction_MathVectorMake_1_Result; // 0x2AC8(0x18)(ExportObject, BlueprintReadOnly, Parm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            IKTrace_2___IKTrace_GetTransform_Transform;        // 0x2AE0(0x60)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             IKTrace_2___IKTrace_GetTransform_CachedIndex;      // 0x2B40(0x10)(Edit, ConstParm, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_2___IKTrace_RigVMFunction_MathVectorMake_1_X; // 0x2B50(0x4)(Edit, BlueprintVisible, EditFixedSize, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_2___IKTrace_RigVMFunction_MathVectorMake_1_Y; // 0x2B54(0x4)(Edit, BlueprintVisible, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_104C[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            IKTrace_2___IKTrace_RigUnit_GetTransform_Transform; // 0x2B60(0x60)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             IKTrace_2___IKTrace_RigUnit_GetTransform_CachedIndex; // 0x2BC0(0x10)(BlueprintVisible, Net, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_2___IKTrace_RigVMFunction_MathVectorMake_1_Z; // 0x2BD0(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1050[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalVariable__IKTrace_FootBase;                   // 0x2BD8(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_2___IKTrace_Multiply_1_Result;             // 0x2BF0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_2___IKTrace_Multiply_2_1_Result;           // 0x2BF8(0x8)(ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_Add_1_Result;                  // 0x2C00(0x18)(Edit, BlueprintVisible, Net, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_Add_3_Result;                  // 0x2C18(0x18)(Edit, ConstParm, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_2___IKTrace_Multiply_Result;               // 0x2C30(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       IKTrace_2___IKTrace_Multiply_2_Result;             // 0x2C38(0x8)(ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_Add_1_B__IO;                   // 0x2C40(0x18)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_Add_Result;                    // 0x2C58(0x18)(BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_Add_B__IO;                     // 0x2C70(0x18)(Edit, ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_SphereTraceByTraceChannel_HitNormal; // 0x2C88(0x18)(ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_SphereTraceByTraceChannel_HitLocation; // 0x2CA0(0x18)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FHitResult                            IKTrace_2___IKTrace_SphereTraceByTraceChannel_WorldSpaceHitResult; // 0x2CB8(0xF0)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_105D[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 IKTrace_2___IKTrace_RigVMFunction_MathQuaternionFromTwoVectors_1_Result; // 0x2DB0(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_From_World_1_Global;           // 0x2DD0(0x18)(ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_RigVMFunction_MathVectorMake_2_Result; // 0x2DE8(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_2___IKTrace_RigVMFunction_MathVectorMake_2_X; // 0x2E00(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_2___IKTrace_RigVMFunction_MathVectorMake_2_Y; // 0x2E04(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        IKTrace_2___IKTrace_RigVMFunction_MathVectorMake_2_Z; // 0x2E08(0x4)(Edit, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1065[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            IKTrace_2___IKTrace_RigVMFunction_DebugRectangleNoSpace_Transform__IO; // 0x2E10(0x60)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_DISPATCH_RigVMDispatch_If_Result; // 0x2E70(0x18)(Edit, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_Subtract_1_Result;             // 0x2E88(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_Add_2_Result;                  // 0x2EA0(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_Add_2_B__IO;                   // 0x2EB8(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               IKTrace_2___IKTrace_Clamp_Result;                  // 0x2ED0(0x18)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_If_10_1_Result; // 0x2EE8(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_106B[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Multiply_7_1_Result;                  // 0x2EF0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_If_10_1_True;  // 0x2EF8(0x4)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_1_1_Result;              // 0x2EFC(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_1_1_Target;              // 0x2F00(0x4)(Edit, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Multiply_10_Result;                   // 0x2F04(0x4)(ConstParm, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_If_7_1_Result; // 0x2F08(0x4)(BlueprintVisible, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___Greater_1_1_Result;                   // 0x2F0C(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1070[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___DISPATCH_RigVMDispatch_If_9_1_Result; // 0x2F10(0x8)(Edit, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___Less_1_1_Result;                      // 0x2F18(0x1)(Edit, BlueprintVisible, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1071[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Absolute_2_1_Result;                  // 0x2F20(0x8)(ConstParm, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Subtract_4_1_Result;                  // 0x2F28(0x8)(Edit, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Multiply_10_B;                        // 0x2F30(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_1_1_Current;             // 0x2F34(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_1_1_Velocity;            // 0x2F38(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1072[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                RigVMModel___SpringInterp_1_1_SimulatedResult;     // 0x2F40(0x10)(OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FFloatSpringState>             RigVMModel___SpringInterp_1_1_SpringState;         // 0x2F50(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___DISPATCH_RigVMDispatch_If_11_3_Result; // 0x2F60(0x18)(BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Rotate_Vector_1_Result;               // 0x2F78(0x18)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___SpringInterp_2_Result;                // 0x2F90(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___SpringInterp_2_Velocity;              // 0x2FA8(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FVector>                       RigVMModel___SpringInterp_2_SimulatedResult;       // 0x2FC0(0x10)(Edit, ConstParm, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FVectorSpringState>            RigVMModel___SpringInterp_2_SpringState;           // 0x2FD0(0x10)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_1_Result;                         // 0x2FE0(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1077[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___GetTransform_2_1_Transform;           // 0x3000(0x60)(Edit, ConstParm, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___GetTransform_2_1_CachedIndex;         // 0x3060(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_1_A;                              // 0x3070(0x18)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_1_B__IO;                          // 0x3088(0x18)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___Multiply_2_1_Result;                  // 0x30A0(0x20)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionFromTwoVectors_1_Result; // 0x30C0(0x20)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Rotate_Vector_2_1_Result;             // 0x30E0(0x18)(Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_107A[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 RigVMModel___Multiply_2_1_B;                       // 0x3100(0x20)(BlueprintVisible, ExportObject, Parm, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_If_11_Result;  // 0x3120(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_107E[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___DISPATCH_RigVMDispatch_If_2_Result;   // 0x3128(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_If_11_True;    // 0x3130(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_Result;                  // 0x3134(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_Target;                  // 0x3138(0x4)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_If_3_Result;   // 0x313C(0x4)(ConstParm, BlueprintVisible, ExportObject, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_Current;                 // 0x3140(0x4)(Net, EditFixedSize, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_Velocity;                // 0x3144(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<float>                                RigVMModel___SpringInterp_SimulatedResult;         // 0x3148(0x10)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FFloatSpringState>             RigVMModel___SpringInterp_SpringState;             // 0x3158(0x10)(Edit, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___Less_Result;                          // 0x3168(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1081[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Minimum_2_Result;                     // 0x3170(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Minimum_Result;                       // 0x3178(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Add_2_Result;                         // 0x3180(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___DISPATCH_RigVMDispatch_If_Result;     // 0x3188(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Minimum_1_Result;                     // 0x3190(0x8)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Add_2_1_Result;                       // 0x3198(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___DISPATCH_RigVMDispatch_If_1_Result;   // 0x31A0(0x8)(ConstParm, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Add_3_Result;                         // 0x31A8(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___Greater_3_Result;                     // 0x31B0(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1086[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Multiply_4_Result;                    // 0x31B8(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_6_BlockToRun; // 0x31C0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Minimum_4_Result;                     // 0x31C8(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_7_Result;                // 0x31CC(0x4)(ConstParm, ExportObject, EditFixedSize, Parm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_7_Target;                // 0x31D0(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_108A[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___Remap_3_Result;                       // 0x31D8(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_7_Strength;              // 0x31E0(0x4)(ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_7_Current;               // 0x31E4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_7_Velocity;              // 0x31E8(0x4)(ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1090[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                RigVMModel___SpringInterp_7_SimulatedResult;       // 0x31F0(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FFloatSpringState>             RigVMModel___SpringInterp_7_SpringState;           // 0x3200(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Add_11_Result;                        // 0x3210(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___Minimum_4_B;                          // 0x3218(0x4)(Edit, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_If_11_9_Result; // 0x321C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_8_1_Result;              // 0x3220(0x4)(ExportObject, Net, EditFixedSize, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_8_1_Current;             // 0x3224(0x4)(BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___SpringInterp_8_1_Velocity;            // 0x3228(0x4)(ConstParm, BlueprintReadOnly, Parm, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_109D[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                RigVMModel___SpringInterp_8_1_SimulatedResult;     // 0x3230(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FFloatSpringState>             RigVMModel___SpringInterp_8_1_SpringState;         // 0x3240(0x10)(ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_If_11_2_1_Result; // 0x3250(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___DISPATCH_RigVMDispatch_If_11_2_1_True; // 0x3254(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_5_BlockToRun; // 0x3258(0x8)(Edit, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___CalculatePV_Result;                   // 0x3260(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_10A2[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            CalculatePV___CalculatePV_Multiply_Result;         // 0x3280(0x60)(Edit, ConstParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            CalculatePV___CalculatePV_Multiply_A__IO;          // 0x32E0(0x60)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            CalculatePV___CalculatePV_RigUnit_GetTransform_Transform; // 0x3340(0x60)(ConstParm, BlueprintVisible, Net, Parm, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             CalculatePV___CalculatePV_RigUnit_GetTransform_CachedIndex; // 0x33A0(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               CalculatePV___CalculatePV_Add_7_A;                 // 0x33B0(0x18)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               CalculatePV___CalculatePV_Add_7_B__IO;             // 0x33C8(0x18)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Transform__IO; // 0x33E0(0x60)(ConstParm, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___CalculatePV_1_Result;                 // 0x3440(0x18)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_10A6[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            CalculatePV_1___CalculatePV_Multiply_Result;       // 0x3460(0x60)(ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            CalculatePV_1___CalculatePV_Multiply_A__IO;        // 0x34C0(0x60)(Edit, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            CalculatePV_1___CalculatePV_RigUnit_GetTransform_Transform; // 0x3520(0x60)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             CalculatePV_1___CalculatePV_RigUnit_GetTransform_CachedIndex; // 0x3580(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               CalculatePV_1___CalculatePV_Add_7_A;               // 0x3590(0x18)(BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               CalculatePV_1___CalculatePV_Add_7_B__IO;           // 0x35A8(0x18)(Edit, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_1_Transform__IO; // 0x35C0(0x60)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_4_Result;                         // 0x3620(0x18)(Edit, BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_10B2[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_2_Transform;     // 0x3640(0x60)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_2_CachedIndex;   // 0x36A0(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_4_A;                              // 0x36B0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Minimum_5_Result;                     // 0x36C8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___Add_4_B__IO;                          // 0x36D0(0x18)(ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_10B5[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigVMFunction_DebugRectangleNoSpace_Transform__IO; // 0x36F0(0x60)(BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_BlockToRun; // 0x3750(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTranslation_CachedIndex;   // 0x3758(0x10)(ConstParm, BlueprintVisible, Parm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         RigVMModel___Greater_4_Result;                     // 0x3768(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_10B9[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 RigVMModel___DISPATCH_RigVMDispatch_If_11_10_Result; // 0x3770(0x20)(ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___SpringInterpQuaternionV2_Result;      // 0x3790(0x20)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___SpringInterpQuaternionV2_AngularVelocity; // 0x37B0(0x18)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FQuat>                         RigVMModel___SpringInterpQuaternionV2_SimulatedResult; // 0x37C8(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FQuaternionSpringState>        RigVMModel___SpringInterpQuaternionV2_SpringState; // 0x37D8(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_10C1[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___Multiply_5_1_Result;                  // 0x37F0(0x60)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_8_1_Transform;   // 0x3850(0x60)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_8_1_CachedIndex; // 0x38B0(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___Multiply_5_1_B__IO;                   // 0x38C0(0x60)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 RigVMModel___RigUnit_SetRotation_2_1_Value;        // 0x3920(0x20)(BlueprintVisible, BlueprintReadOnly, Net, Parm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigUnit_SetRotation_2_1_Weight;       // 0x3940(0x4)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_10C8[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_2_1_CachedIndex;  // 0x3948(0x10)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_7_BlockToRun; // 0x3958(0x8)(ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_Result;                         // 0x3960(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Subtract_2_Result;                    // 0x3968(0x8)(BlueprintVisible, ExportObject, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Add_8_Result;                         // 0x3970(0x8)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Add_8_A;                              // 0x3978(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_2_1_2_Transform; // 0x3980(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_2_1_2_CachedIndex; // 0x39E0(0x10)(ConstParm, Net, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Subtract_2_B;                         // 0x39F0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Remap_1_Result;                       // 0x39F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Subtract_2_1_Result;                  // 0x3A00(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Add_8_1_Result;                       // 0x3A08(0x8)(ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Add_8_1_A;                            // 0x3A10(0x8)(BlueprintReadOnly, Net, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_10CE[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_2_1_2_1_Transform; // 0x3A20(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_2_1_2_1_CachedIndex; // 0x3A80(0x10)(ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       RigVMModel___Subtract_2_1_B;                       // 0x3A90(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x3A98(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_17_Transform;    // 0x3AA0(0x60)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_17_CachedIndex;  // 0x3B00(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___TwoBoneIKSimplePerItem_1_1_Effector__IO; // 0x3B10(0x60)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___TwoBoneIKSimplePerItem_1_1_Weight;    // 0x3B70(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_MathVectorDistance_Result; // 0x3B74(0x4)(ConstParm, ExportObject, Net, Parm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_10D5[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_13_Transform;    // 0x3B80(0x60)(ConstParm, BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_13_CachedIndex;  // 0x3BE0(0x10)(Edit, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathVectorDistance_A;   // 0x3BF0(0x18)(BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_10D7[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_6_Transform;     // 0x3C10(0x60)(Edit, BlueprintVisible, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_6_CachedIndex;   // 0x3C70(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathVectorDistance_B;   // 0x3C80(0x18)(BlueprintVisible, ExportObject, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_MathVectorDistance_1_Result; // 0x3C98(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_10D9[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_5_Transform;     // 0x3CA0(0x60)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_5_CachedIndex;   // 0x3D00(0x10)(Edit, BlueprintReadOnly, Net, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathVectorDistance_1_B; // 0x3D10(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___TwoBoneIKSimplePerItem_1_1_CachedItemAIndex; // 0x3D28(0x10)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___TwoBoneIKSimplePerItem_1_1_CachedItemBIndex; // 0x3D38(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___TwoBoneIKSimplePerItem_1_1_CachedEffectorItemIndex; // 0x3D48(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___TwoBoneIKSimplePerItem_1_1_CachedPoleVectorSpaceIndex; // 0x3D58(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_10DE[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_16_Transform;    // 0x3D70(0x60)(ConstParm, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_16_CachedIndex;  // 0x3DD0(0x10)(Edit, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___TwoBoneIKSimplePerItem_1_Effector__IO; // 0x3DE0(0x60)(Edit, ExportObject, BlueprintReadOnly, Net, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___TwoBoneIKSimplePerItem_1_Weight;      // 0x3E40(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_MathVectorDistance_2_Result; // 0x3E44(0x4)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_10E1[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_14_Transform;    // 0x3E50(0x60)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_14_CachedIndex;  // 0x3EB0(0x10)(Edit, BlueprintVisible, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathVectorDistance_2_A; // 0x3EC0(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_10E7[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_6_1_Transform;   // 0x3EE0(0x60)(ConstParm, BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_6_1_CachedIndex; // 0x3F40(0x10)(Edit, ConstParm, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathVectorDistance_2_B; // 0x3F50(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___RigVMFunction_MathVectorDistance_2_1_Result; // 0x3F68(0x4)(ConstParm, ExportObject, EditFixedSize, Parm, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_10EC[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___RigUnit_GetTransform_5_1_Transform;   // 0x3F70(0x60)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_5_1_CachedIndex; // 0x3FD0(0x10)(Edit, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___RigVMFunction_MathVectorDistance_2_1_B; // 0x3FE0(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___TwoBoneIKSimplePerItem_1_CachedItemAIndex; // 0x3FF8(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___TwoBoneIKSimplePerItem_1_CachedItemBIndex; // 0x4008(0x10)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___TwoBoneIKSimplePerItem_1_CachedEffectorItemIndex; // 0x4018(0x10)(Edit, ConstParm, ExportObject, Net, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___TwoBoneIKSimplePerItem_1_CachedPoleVectorSpaceIndex; // 0x4028(0x10)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_1_CachedIndex;    // 0x4038(0x10)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_CachedIndex;      // 0x4048(0x10)(BlueprintVisible, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___PoseLoop_Item;                        // 0x4058(0xC)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_10F6[0xC];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RigVMModel___PoseLoop_GlobalTransform;             // 0x4070(0x60)(ExportObject, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               RigVMModel___SetScale_Scale;                       // 0x40D0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___SetScale_CachedIndex;                 // 0x40E8(0x10)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  RigVMModel___PoseLoop_BlockToRun;                  // 0x40F8(0x8)(BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            RigVMModel___PoseLoop_LocalTransform;              // 0x4100(0x60)(ExportObject, Net, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___PoseLoop_CurveValue;                  // 0x4160(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	int32                                        RigVMModel___PoseLoop_Index;                       // 0x4164(0x4)(EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	int32                                        RigVMModel___PoseLoop_Count;                       // 0x4168(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        RigVMModel___PoseLoop_Ratio;                       // 0x416C(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_2_BlockToRun; // 0x4170(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_3_BlockToRun; // 0x4178(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_4_1_BlockToRun; // 0x4180(0x8)(Edit, ConstParm, Parm, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)

	static class UClass* StaticClass();
	static class URigVMMemory_Work* GetDefaultObj();

};

}


