#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x2DA (0x6D2 - 0x3F8)
// RigVMBlueprintGeneratedClass Human_GroundConform_CtrlRig.Human_GroundConform_CtrlRig_C
class UHuman_GroundConform_CtrlRig_C : public UControlRig
{
public:
	struct FRigPose                              Pose;                                              // 0x3F8(0x70)(ConstParm, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst)
	TArray<struct FPBIKEffector>                 IKEffectors;                                       // 0x468(0x10)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FVector>                       EffectorPos;                                       // 0x478(0x10)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<double>                               Settings_TraceRadii;                               // 0x488(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<double>                               Settings_TraceLengths;                             // 0x498(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<bool>                                 Settings_ConstrainLength;                          // 0x4A8(0x10)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	TArray<double>                               Settings_BendStiffness;                            // 0x4B8(0x10)(BlueprintVisible, ExportObject, Parm, ReturnParm, Config, EditConst, SubobjectReference)
	TArray<double>                               Settings_SpringDampingFactor;                      // 0x4C8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	TArray<double>                               Settings_SpringStrengthFactor;                     // 0x4D8(0x10)(BlueprintVisible, Parm, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	TArray<struct FPBIKBoneSetting>              PBIKBoneSettings;                                  // 0x4E8(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         bFoundCtrlParent;                                  // 0x4F8(0x1)(Edit, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1B7A[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TailAndNeck_RotationStiffness;                     // 0x4FC(0x4)(ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                SortedEffectorBones;                               // 0x500(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<int32>                                SortedRigElements_IndexArray;                      // 0x510(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                SortedParentBones;                                 // 0x520(0x10)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FQuat>                         EffectorRotations;                                 // 0x530(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FVector>                       TracePathPositions;                                // 0x540(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	bool                                         bBreakTracePath;                                   // 0x550(0x1)(Edit, BlueprintVisible, Net, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1B7D[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               MeshScale;                                         // 0x558(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	double                                       GroundConform_GravityFactor;                       // 0x570(0x8)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         GroundConform_IsBeingDragged;                      // 0x578(0x1)(BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         Swimming;                                          // 0x579(0x1)(ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         GroundConform_Motionless;                          // 0x57A(0x1)(Edit, BlueprintVisible, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B7F[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigPose                              PoseLastFrame;                                     // 0x580(0x70)(BlueprintReadOnly, Net, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         Interpolate;                                       // 0x5F0(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         IsFalling;                                         // 0x5F1(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst)
	uint8                                        Pad_1B81[0xE];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            RootControlTransform_LastFrame;                    // 0x600(0x60)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       DetectedNoMotion_LastFrame;                        // 0x660(0x8)(Edit, ConstParm, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1B83[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            HipTransform_LastFrame;                            // 0x670(0x60)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         Has_Initially_Updated_Bone_Distances;              // 0x6D0(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	bool                                         bHasDynamicBase_;                                  // 0x6D1(0x1)(ConstParm, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)

	static class UClass* StaticClass();
	static class UHuman_GroundConform_CtrlRig_C* GetDefaultObj();

};

// 0x146C (0x1494 - 0x28)
// RigVMMemoryStorageGeneratorClass Human_GroundConform_CtrlRig.RigVMMemory_Literal
class URigVMMemory_Literal : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_2_Item__Const;    // 0x28(0xC)(Edit, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              RigVMModel___RigUnit_SetRotation_2_Space__Const;   // 0x34(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         RigVMModel___RigUnit_SetRotation_2_bInitial__Const; // 0x35(0x1)(ExportObject, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_1B8F[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RigVMModel___RigVMFunction_MathQuaternionFromEuler_Euler__Const; // 0x38(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	enum class EEulerRotationOrder               RigVMModel___RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const; // 0x50(0x1)(ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1B91[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        RigVMModel___RigUnit_SetRotation_2_Weight__Const;  // 0x54(0x4)(ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         RigVMModel___RigUnit_SetRotation_2_bPropagateToChildren__Const; // 0x58(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1B92[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        RigVMModel___GroundConformForwardsSolve_DebugDrawThickness__Const; // 0x5C(0x4)(ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       RigVMModel___GroundConformForwardsSolve_DebugDrawScale__Const; // 0x60(0x8)(Edit, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	float                                        RigVMModel___GroundConformForwardsSolve_SpringStrength__Const; // 0x68(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1B94[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RigVMModel___GroundConformForwardsSolve_DampingFactor__Const; // 0x70(0x8)(ConstParm, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       RigVMModel___GroundConformForwardsSolve_CollisionRadiusFactor__Const; // 0x78(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___GroundConformForwardsSolve_Root_Bone__Const; // 0x80(0xC)(Edit, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        RigVMModel___GroundConformForwardsSolve_Hip_Bone__Const; // 0x8C(0xC)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	float                                        RigVMModel___GroundConformForwardsSolve_Effector_Rotation_Alpha__Const; // 0x98(0x4)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	float                                        RigVMModel___GroundConformForwardsSolve_Effector_Pin_Rotation__Const; // 0x9C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<double>                               RigVMModel___GroundConformForwardsSolve_TimingBias__Const; // 0xA0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       RigVMModel___GroundConformForwardsSolve_TimingBiasSpeed__Const; // 0xB0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	float                                        RigVMModel___GroundConformForwardsSolve_ForceSleepTimeLimit__Const; // 0xB8(0x4)(BlueprintVisible, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__GroundConformForwardsSolve_bNotAppliedCachedPose__Const; // 0xBC(0x1)(ExportObject, Net, EditFixedSize, OutParm, Config, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__GroundConformForwardsSolve_bComponentMotionDetected__Const; // 0xBD(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__GroundConformForwardsSolve_bTempMotionDetected__Const; // 0xBE(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_SetTransform_4_Space__Const; // 0xBF(0x1)(OutParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_SetTransform_4_bInitial__Const; // 0xC0(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, Transient, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_bInitial__Const; // 0xC1(0x1)(ExportObject, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1BB2[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_SetTransform_4_Weight__Const; // 0xC4(0x4)(Edit, ConstParm, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1BB3[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_To_World_Value__Const; // 0xD0(0x60)(BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	int32                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_2_1_Index__Const; // 0x130(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_4_Name__Const; // 0x134(0x8)(Edit, ExportObject, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_1_Name__Const; // 0x13C(0x8)(Edit, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_1_Value__Const; // 0x144(0x4)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_1_Item__Const; // 0x148(0xC)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_1_Name__Const; // 0x154(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_Name__Const; // 0x15C(0x8)(Edit, ConstParm, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	int32                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_1_Value__Const; // 0x164(0x4)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__CheckForAnimationMotion_CallGroundConform__Const; // 0x168(0x1)(ExportObject, Net, EditFixedSize, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__CheckForAnimationMotion_DetectedPoseDifference__Const; // 0x169(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BC0[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            LocalVariableDefault__CheckForAnimationMotion_To_World_World__Const; // 0x170(0x60)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, Transient, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              CheckForAnimationMotion___CheckForAnimationMotion_GetTransform_1_1_Space__Const; // 0x1D0(0x1)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_GetTransform_1_1_bInitial__Const; // 0x1D1(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	enum class ERigElementType                   CheckForAnimationMotion___CheckForAnimationMotion_HierarchyGetPoseItemArray_1_ElementType__Const; // 0x1D2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1BC3[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CheckForAnimationMotion___CheckForAnimationMotion_PoseGetDelta_RotationThreshold__Const; // 0x1D4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FRigElementKeyCollection              CheckForAnimationMotion___CheckForAnimationMotion_PoseGetDelta_ItemsToCompare__Const; // 0x1D8(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         LocalVariable__FunctionLibrary___CheckForAnimationMotion_VariableNode_1_Value__Const; // 0x1E8(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1BC5[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CheckForAnimationMotion___CheckForAnimationMotion_IsNearlyEqual_Tolerance__Const; // 0x1EC(0x4)(BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, Config, EditConst, SubobjectReference)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_2_Name__Const; // 0x1F0(0x8)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	int32                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Subtract_B__Const; // 0x1F8(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERigElementType                   GroundConformForwardsSolve___GroundConformForwardsSolve_HierarchyGetPoseItemArray_ElementType__Const; // 0x1FC(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_1BC7[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FRigElementKey>                GroundConformForwardsSolve___GroundConformForwardsSolve_HierarchyGetPoseItemArray_ItemsToGet__Const; // 0x200(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_VariableNode_1_Value__Const; // 0x210(0x1)(ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1BC9[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_2_Name__Const; // 0x214(0x8)(BlueprintVisible, Net, ReturnParm, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_Space__Const; // 0x21C(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_bInitial__Const; // 0x21D(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, EditConst, SubobjectReference)
	uint8                                        Pad_1BCA[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_Name__Const; // 0x220(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_Default__Const; // 0x228(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1BCB[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Minimum_1_B__Const; // 0x230(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_Name__Const; // 0x238(0x8)(BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_Default__Const; // 0x240(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_2_Name__Const; // 0x258(0x8)(Edit, ConstParm, BlueprintReadOnly, Parm, Transient, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_Name__Const; // 0x260(0x8)(BlueprintVisible, ExportObject, Net, ReturnParm, Config, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_Name__Const; // 0x268(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_Default__Const; // 0x270(0xC)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_1_Name__Const; // 0x27C(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_2_1_1_Name__Const; // 0x284(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_3_1_Name__Const; // 0x28C(0x8)(ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	uint8                                        Pad_1BFF[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LookAt_1_1___LookAt_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x298(0x18)(Edit, BlueprintReadOnly, Parm, ReturnParm, EditConst, SubobjectReference)
	float                                        LookAt_1_1___LookAt_Scale_Factor__Const;           // 0x2B0(0x4)(BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C01[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LookAt_1_1___LookAt_Rotate_Vector_1_Vector__Const; // 0x2B8(0x18)(Edit, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__MakeArrayFromStartToEndBone_ChildrenArray__Const; // 0x2D0(0x10)(ConstParm, Net, Parm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__MakeArrayFromStartToEndBone_ParentsArray__Const; // 0x2E0(0x10)(Edit, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__MakeArrayFromStartToEndBone_OutChain__Const; // 0x2F0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__MakeArrayFromStartToEndBone_ChainComplete__Const; // 0x300(0x1)(ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1C04[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_Prefix__Const; // 0x308(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_Enabled__Const; // 0x318(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C08[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_ScreenDuration__Const; // 0x31C(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FLinearColor                          MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_ScreenColor__Const; // 0x320(0x10)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_1_Prefix__Const; // 0x330(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_CollectionChildrenArray_bIncludeParent__Const; // 0x340(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, EditConst, SubobjectReference)
	enum class ERigElementType                   MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_CollectionChildrenArray_TypeToSearch__Const; // 0x341(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C18[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_Prefix__Const; // 0x348(0x10)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_1_Prefix__Const; // 0x358(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Config, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_2_Prefix__Const; // 0x368(0x10)(Edit, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_2_1_Prefix__Const; // 0x378(0x10)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_Prefix__Const; // 0x388(0x10)(Edit, ConstParm, BlueprintVisible, Net, Parm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_1_Prefix__Const; // 0x398(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__CalculateLengthOfElementChain_NewLocalVar__Const; // 0x3A8(0x10)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__CalculateLengthOfElementChain_MathIntEquals_Result__Const; // 0x3B8(0x1)(ExportObject, EditFixedSize, Parm, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C1C[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        LocalVariableDefault__CalculateLengthOfElementChain_numBones__Const; // 0x3BC(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, EditConst, SubobjectReference)
	float                                        LocalVariableDefault__CalculateLengthOfElementChain_currentDistance__Const; // 0x3C0(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        LocalVariableDefault__CalculateLengthOfElementChain_averageDistance__Const; // 0x3C4(0x4)(Edit, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	class FString                                CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_Prefix__Const; // 0x3C8(0x10)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_Enabled__Const; // 0x3D8(0x1)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C23[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_ScreenDuration__Const; // 0x3DC(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	struct FLinearColor                          CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_ScreenColor__Const; // 0x3E0(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntSub_1_B__Const; // 0x3F0(0x4)(ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        LocalVariable__FunctionLibrary___CalculateLengthOfElementChain_VariableNode_7_Value__Const; // 0x3F4(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, Transient, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_1_Space__Const; // 0x3F8(0x1)(ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1C27[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_Name__Const; // 0x3FC(0x8)(Edit, ConstParm, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	int32                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Index__Const; // 0x404(0x4)(ConstParm, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_Name__Const; // 0x408(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_5_Name__Const; // 0x410(0x8)(ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_Strength__Const; // 0x418(0x4)(ConstParm, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_1_Strength__Const; // 0x41C(0x4)(ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	int32                                        GroundConformForwardsSolve___GroundConformForwardsSolve_GroundConform_HitNotifyCheckFrame__Const; // 0x420(0x4)(BlueprintVisible, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C2E[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Multiply_B__Const; // 0x428(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__GroundConform_SphereTrace_bHit__Const; // 0x430(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__GroundConform_FirstSphereTrace_bHit__Const; // 0x431(0x1)(BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1C30[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        LocalVariableDefault__GroundConform_CurrentIndex__Const; // 0x434(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FRigElementKey                        LocalVariableDefault__GroundConform_CurrentElement__Const; // 0x438(0xC)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1C33[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FHitResult                            LocalVariableDefault__GroundConform_SphereTraceByTraceChannel_WorldSpaceHitResult__Const; // 0x448(0xF0)(ConstParm, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FVector>                       LocalVariableDefault__GroundConform_EffectorPositionCache__Const; // 0x538(0x10)(ConstParm, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__GroundConform_HasMotion__Const; // 0x548(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_1C3A[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LocalVariableDefault__GroundConform_CurrentElementGravity__Const; // 0x550(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__GroundConform_bShouldCheckHitNotify__Const; // 0x558(0x1)(ConstParm, Net, Parm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C3D[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        LocalVariableDefault__GroundConform_CurrentControl__Const; // 0x55C(0xC)(ConstParm, ExportObject, EditFixedSize, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__GroundConform_TargetPosition__Const; // 0x568(0x18)(Edit, ConstParm, BlueprintVisible, Parm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FQuat                                 LocalVariableDefault__GroundConform_TargetRotation__Const; // 0x580(0x20)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	struct FTransform                            LocalVariableDefault__GroundConform_ParentTransform__Const; // 0x5A0(0x60)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FTransform                            LocalVariableDefault__GroundConform_CurrentTransform__Const; // 0x600(0x60)(ConstParm, BlueprintVisible, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	float                                        LocalVariableDefault__GroundConform_DistanceToParent__Const; // 0x660(0x4)(ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1C42[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalVariableDefault__GroundConform_PreviousPosition__Const; // 0x668(0x18)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Config, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__GroundConform_Solver_Position__Const; // 0x680(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__GroundConform_If_4_Result__Const; // 0x698(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__GroundConform_TrueIn__Const; // 0x6B0(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__GroundConform_FalseIn__Const; // 0x6C8(0x18)(BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__GroundConform_BoolIn__Const; // 0x6E0(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C49[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FVector>                       LocalVariableDefault__GroundConform_TracePathPositions_Local__Const; // 0x6E8(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__GroundConform_bHasDynamicBase_LastFrame_Local__Const; // 0x6F8(0x1)(ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C4D[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalVariableDefault__GroundConform_TraceHitPosition_Local__Const; // 0x700(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__GroundConform_TraceCenter_Local__Const; // 0x718(0x18)(ConstParm, OutParm, Transient, EditConst, SubobjectReference)
	int32                                        GroundConform___GroundConform_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Index__Const; // 0x730(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_17_Name__Const; // 0x734(0x8)(Edit, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_17_Default__Const; // 0x73C(0x1)(ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C4E[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_9_Name__Const; // 0x740(0x8)(Edit, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         LocalVariable__FunctionLibrary___GroundConform_VariableNode_80_Value__Const; // 0x748(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C50[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        GroundConform___GroundConform_Subtract_9_B__Const; // 0x74C(0x4)(ConstParm, Net, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_Name__Const; // 0x750(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              GroundConform___GroundConform_GetTransform_3_Space__Const; // 0x758(0x1)(Net, Parm, EditConst, SubobjectReference)
	uint8                                        Pad_1C54[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_7_Name__Const; // 0x75C(0x8)(ConstParm, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0x764(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_2_Default__Const; // 0x76C(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_5_1_Name__Const; // 0x778(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_5_1_Default__Const; // 0x780(0xC)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C55[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConform___GroundConform_Add_2_B__Const;      // 0x790(0x8)(ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Clamp_2_Minimum__Const; // 0x798(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_Name__Const; // 0x7A0(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, Config, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_Default__Const; // 0x7A8(0x4)(Edit, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_2_Name__Const; // 0x7AC(0x8)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C58[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_4_Default__Const; // 0x7B8(0x18)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_7_Name__Const; // 0x7D0(0x8)(Edit, ConstParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_3_Add_3_B__Const; // 0x7D8(0x18)(ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_5_B__Const; // 0x7F0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FVector>                       GroundConform___GroundConform_ArrayAppend_Other__Const; // 0x7F8(0x10)(ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Add_9_A__Const;      // 0x808(0x8)(ConstParm, Net, EditFixedSize, OutParm, ReturnParm, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Add_9_1_A__Const;    // 0x810(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_4_3_B__Const; // 0x818(0x8)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	enum class ETraceTypeQuery                   GroundConform___GroundConform_SphereTraceByTraceChannel_TraceChannel__Const; // 0x820(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C62[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        GroundConform___GroundConform_ArrayGetAtIndex_8_1_1_Index__Const; // 0x824(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1C63[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 GroundConform___GroundConform_From_World_4_1_Value__Const; // 0x830(0x20)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Less_1_B__Const;     // 0x850(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	int32                                        MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x858(0x4)(Edit, ExportObject, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	class FName                                  MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_6_1_Name__Const; // 0x85C(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	struct FRigElementKey                        MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_6_1_Default__Const; // 0x864(0xC)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_14_Name__Const; // 0x870(0x8)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	class FName                                  LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0x878(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FTransform                            LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Default__Const; // 0x880(0x60)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, EditConst, SubobjectReference)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_6_True__Const; // 0x8E0(0x8)(Edit, ConstParm, BlueprintReadOnly, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_6_False__Const; // 0x8E8(0x8)(Edit, ConstParm, EditFixedSize, Config, EditConst, SubobjectReference)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_3_Multiply_3_1_B__Const; // 0x8F0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               ReorientBone___ReorientBone_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x8F8(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FName                                  ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0x910(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	class FName                                  ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Name__Const; // 0x918(0x8)(ConstParm, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Default__Const; // 0x920(0xC)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Name__Const; // 0x92C(0x8)(BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1C6C[0xC];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Default__Const; // 0x940(0x20)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Interpolate_1_1_B__Const; // 0x960(0x8)(Edit, BlueprintVisible, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Interpolate_1_2_A__Const; // 0x968(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Interpolate_1_2_B__Const; // 0x970(0x8)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	struct FVector                               LocalVariableDefault__Solver_PostZConstraint__Const; // 0x978(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	double                                       Solver___Solver_GreaterEqual_1_B__Const;           // 0x990(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, EditConst, SubobjectReference)
	double                                       Solver___Solver_Subtract_6_A__Const;               // 0x998(0x8)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, EditConst, SubobjectReference)
	double                                       Solver___Solver_Power_A__Const;                    // 0x9A0(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	double                                       Solver___Solver_Multiply_B__Const;                 // 0x9A8(0x8)(ConstParm, Net, Parm, OutParm, Config, EditConst, SubobjectReference)
	double                                       Solver___Solver_Clamp_2_1_Minimum__Const;          // 0x9B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	class FName                                  Solver___Solver_DISPATCH_RigDispatch_GetMetadata_Name__Const; // 0x9B8(0x8)(Edit, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	struct FVector                               Solver___Solver_DISPATCH_RigDispatch_GetMetadata_Default__Const; // 0x9C0(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       Solver___Solver_Multiply_7_Multiply_7_B__Const;    // 0x9D8(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	double                                       Solver___Solver_Remap_1_SourceMaximum__Const;      // 0x9E0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       Solver___Solver_DISPATCH_RigVMDispatch_If_True__Const; // 0x9E8(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       Solver___Solver_DISPATCH_RigVMDispatch_If_False__Const; // 0x9F0(0x8)(ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         Solver___Solver_Remap_1_bClamp__Const;             // 0x9F8(0x1)(ExportObject, Net, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C72[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        Solver___Solver_Multiply_1_1_B__Const;             // 0x9FC(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Transient, EditConst, SubobjectReference)
	double                                       Solver___Solver_Greater_3_B__Const;                // 0xA00(0x8)(ConstParm, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        Solver___Solver_Scale_2_1_Factor__Const;           // 0xA08(0x4)(Edit, BlueprintVisible, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C73[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Solver___Solver_Multiply_8_B__Const;               // 0xA10(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	int32                                        Solver___Solver_DISPATCH_RigDispatch_CoreEquals_B__Const; // 0xA18(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         Solver___Solver_If_2_Condition__Const;             // 0xA1C(0x1)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1C75[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  Solver___Solver_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0xA20(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1C77[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            Solver___Solver_DISPATCH_RigDispatch_GetMetadata_2_Default__Const; // 0xA30(0x60)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       Solver___Solver_Multiply_5_B__Const;               // 0xA90(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       Solver___Solver_Clamp_1_Maximum__Const;            // 0xA98(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        Solver___Solver_Interpolate_T__Const;              // 0xAA0(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	int32                                        ParentChainLengthConstraint___ParentChainLengthConstraint_DISPATCH_RigDispatch_CoreEquals_B__Const; // 0xAA4(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0xAA8(0x18)(ConstParm, Net, OutParm, Config, EditConst, SubobjectReference)
	class FName                                  ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0xAC0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FName                                  ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Name__Const; // 0xAC8(0x8)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	struct FRigElementKey                        ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Default__Const; // 0xAD0(0xC)(Edit, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FName                                  ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Name__Const; // 0xADC(0x8)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1C78[0xC];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Default__Const; // 0xAF0(0x20)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_SpringInterpQuaternionV2_Strength__Const; // 0xB10(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_SpringInterpQuaternionV2_CriticalDamping__Const; // 0xB14(0x4)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1C7A[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FPBIKEffector                         GroundConform___GroundConform_ArraySetAtIndex_Element__Const; // 0xB20(0x90)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FTransform                            GroundConform___GroundConform_Set_Transform_1_Value__Const; // 0xBB0(0x60)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FString                                GroundConform___GroundConform_DISPATCH_RigVMDispatch_Print_Prefix__Const; // 0xC10(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_DISPATCH_RigVMDispatch_Print_ScreenDuration__Const; // 0xC20(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	struct FLinearColor                          GroundConform___GroundConform_DISPATCH_RigVMDispatch_Print_ScreenColor__Const; // 0xC24(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FLinearColor                          GroundConform___GroundConform_DebugLineItemSpace_1_Color__Const; // 0xC34(0x10)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_1C7B[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_RigVMFunction_MathQuaternionFromTwoVectors_A__Const; // 0xC48(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FLinearColor                          GroundConform___GroundConform_DebugRectangleItemSpace_1_Color__Const; // 0xC60(0x10)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_8_B__Const; // 0xC70(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_8_1_B__Const; // 0xC78(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, Config, EditConst, SubobjectReference)
	struct FLinearColor                          GroundConform___GroundConform_DebugLineItemSpace_1_2_Color__Const; // 0xC80(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FLinearColor                          GroundConform___GroundConform_DebugLineItemSpace_1_1_Color__Const; // 0xC90(0x10)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_5_Name__Const; // 0xCA0(0x8)(ConstParm, Net, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_14_Name__Const; // 0xCA8(0x8)(Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_1_Name__Const; // 0xCB0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_If_5_True__Const;    // 0xCB8(0x8)(Edit, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_If_5_False__Const;   // 0xCC0(0x8)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FTransform>                    GroundConform___GroundConform_DrawTransforms_Transforms__Const; // 0xCC8(0x10)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_12_B__Const; // 0xCD8(0x8)(ConstParm, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_4_B__Const; // 0xCE0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	enum class ERigUnitDebugTransformMode        GroundConform___GroundConform_DrawTransforms_Mode__Const; // 0xCE8(0x1)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1C80[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          GroundConform___GroundConform_DrawTransforms_Color__Const; // 0xCEC(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1C82[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FTransform>                    LocalVariableDefault__DrawTransforms_the_transforms__Const; // 0xD00(0x10)(Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FTransform                            DrawTransforms___DrawTransforms_DebugTransformMutableItemSpace_WorldOffset__Const; // 0xD10(0x60)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, EditConst, SubobjectReference)
	bool                                         DrawTransforms___DrawTransforms_DebugTransformMutableItemSpace_bEnabled__Const; // 0xD70(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C84[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_4_Value__Const; // 0xD74(0x4)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_RigVMFunction_DebugArcNoSpace_MaximumDegrees__Const; // 0xD78(0x4)(Edit, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	int32                                        GroundConform___GroundConform_RigVMFunction_DebugArcNoSpace_Detail__Const; // 0xD7C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_RigVMFunction_MathQuaternionFromEuler_Euler__Const; // 0xD80(0x18)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	enum class EEulerRotationOrder               GroundConform___GroundConform_RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const; // 0xD98(0x1)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1C85[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          GroundConform___GroundConform_RigVMFunction_DebugArcNoSpace_1_Color__Const; // 0xD9C(0x10)(ConstParm, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_1C86[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Greater_B__Const; // 0xDB0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_5_Name__Const; // 0xDB8(0x8)(Edit, ConstParm, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_8_Name__Const; // 0xDC0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_Add_5_B__Const; // 0xDC8(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_Add_2_1_B__Const; // 0xDE0(0x18)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	enum class ETraceTypeQuery                   GroundConformForwardsSolve___GroundConformForwardsSolve_SphereTraceByTraceChannel_1_TraceChannel__Const; // 0xDF8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C88[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SphereTraceByTraceChannel_1_Radius__Const; // 0xDFC(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Scale_Factor__Const; // 0xE00(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Config, EditConst, SubobjectReference)
	struct FLinearColor                          GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_DebugLineNoSpace_1_Color__Const; // 0xE04(0x10)(BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_DebugLineNoSpace_1_Thickness__Const; // 0xE14(0x4)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_6_Default__Const; // 0xE18(0x18)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_9_Name__Const; // 0xE30(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	enum class ERigElementType                   RigVMModel___HierarchySetPoseItemArray_1_1_ElementType__Const; // 0xE38(0x1)(ExportObject, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              RigVMModel___HierarchySetPoseItemArray_1_1_Space__Const; // 0xE39(0x1)(ConstParm, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C8A[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FRigElementKey>                RigVMModel___HierarchySetPoseItemArray_1_1_ItemsToSet__Const; // 0xE40(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FName                                  RigVMModel___PBIK_1_Root__Const;                   // 0xE50(0x8)(Edit, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	TArray<struct FPBIKBoneSetting>              RigVMModel___PBIK_1_BoneSettings__Const;           // 0xE58(0x10)(BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<class FName>                          RigVMModel___PBIK_1_ExcludedBones__Const;          // 0xE68(0x10)(BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FPBIKSolverSettings                   RigVMModel___PBIK_1_Settings__Const;               // 0xE78(0x3C)(ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FPBIKDebug                            RigVMModel___PBIK_1_Debug__Const;                  // 0xEB4(0x8)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  RigVMModel___DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0xEBC(0x8)(BlueprintVisible, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	int32                                        RigVMModel___DISPATCH_RigDispatch_GetMetadata_2_Default__Const; // 0xEC4(0x4)(BlueprintReadOnly, Net, OutParm, Transient, Config, EditConst, SubobjectReference)
	enum class ERigElementType                   RigVMModel___HierarchyGetPoseItemArray_1_1_ElementType__Const; // 0xEC8(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C8C[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_Items__Const;       // 0xED0(0x10)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_1_Items__Const;     // 0xEE0(0x10)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FRigPoseElement>               LocalVariableDefault__GroundConform_Constructor_CalculateLengthOfChain_Bones__Const; // 0xEF0(0x10)(Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__SortRigElements_NewElements__Const; // 0xF00(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, EditConst, SubobjectReference)
	int32                                        LocalVariableDefault__SortRigElements_InsertIndex__Const; // 0xF10(0x4)(ConstParm, ExportObject, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	int32                                        LocalVariableDefault__SortRigElements_NewElementsNum__Const; // 0xF14(0x4)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__SortRigElements_ArrayIntersection_Result__Const; // 0xF18(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__SortRigElements_CollectionChildrenArray_Items__Const; // 0xF28(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__SortRigElements_bBreakLoop__Const; // 0xF38(0x1)(Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1C8F[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<int32>                                LocalVariableDefault__SortRigElements_SortedIndexArray__Const; // 0xF40(0x10)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	int32                                        LocalVariableDefault__SortRigElements_MainLoopIndex__Const; // 0xF50(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, Transient, EditConst, SubobjectReference)
	int32                                        LocalVariable__FunctionLibrary___SortRigElements_VariableNode_13_Value__Const; // 0xF54(0x4)(BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        SortRigElements___SortRigElements_DISPATCH_RigDispatch_CoreEquals_B__Const; // 0xF58(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	int32                                        SortRigElements___SortRigElements_ArrayInsert_1_1_Element__Const; // 0xF64(0x4)(ConstParm, EditFixedSize, Parm, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	bool                                         SortRigElements___SortRigElements_CollectionChildrenArray_bIncludeParent__Const; // 0xF68(0x1)(Edit, BlueprintVisible, Net, Parm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         SortRigElements___SortRigElements_CollectionChildrenArray_bRecursive__Const; // 0xF69(0x1)(ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	enum class ERigElementType                   SortRigElements___SortRigElements_CollectionChildrenArray_TypeToSearch__Const; // 0xF6A(0x1)(BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1C93[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        SortRigElements___SortRigElements_Add_B__Const;    // 0xF6C(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__SortByIndexArray_NewElements__Const; // 0xF70(0x10)(Edit, Net, OutParm, Transient, EditConst, SubobjectReference)
	int32                                        SortByIndexArray_1___SortByIndexArray_GreaterEqual_B__Const; // 0xF80(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C94[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<double>                               LocalVariableDefault__SortByIndexArrayFloat_NewElements__Const; // 0xF88(0x10)(BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	int32                                        SortByIndexArrayFloat___SortByIndexArrayFloat_GreaterEqual_B__Const; // 0xF98(0x4)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1C96[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<double>                               LocalVariableDefault__SortByIndexArrayFloat_NewElements__Const; // 0xFA0(0x10)(BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	int32                                        SortByIndexArrayFloat_1___SortByIndexArrayFloat_GreaterEqual_B__Const; // 0xFB0(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_1C97[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<bool>                                 LocalVariableDefault__SortByIndexArrayBoolean_NewElements__Const; // 0xFB8(0x10)(BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	int32                                        SortByIndexArrayBoolean___SortByIndexArrayBoolean_GreaterEqual_B__Const; // 0xFC8(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C9B[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<double>                               LocalVariableDefault__SortByIndexArrayFloat_NewElements__Const; // 0xFD0(0x10)(BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	int32                                        SortByIndexArrayFloat_1_1___SortByIndexArrayFloat_GreaterEqual_B__Const; // 0xFE0(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C9C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<double>                               LocalVariableDefault__SortByIndexArrayFloat_NewElements__Const; // 0xFE8(0x10)(BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	int32                                        SortByIndexArrayFloat_1_1_1___SortByIndexArrayFloat_GreaterEqual_B__Const; // 0xFF8(0x4)(Edit, ConstParm, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1C9D[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<double>                               LocalVariableDefault__SortByIndexArrayFloat_NewElements__Const; // 0x1000(0x10)(BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	int32                                        SortByIndexArrayFloat_0___SortByIndexArrayFloat_GreaterEqual_B__Const; // 0x1010(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_GetMetadata_4_1_Name__Const; // 0x1014(0x8)(ConstParm, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_GetMetadata_4_1_Default__Const; // 0x101C(0xC)(ConstParm, Net, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConform_Constructor_1___GroundConform_Constructor_If_1_False__Const; // 0x1028(0xC)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_Concat_1_B__Const; // 0x1034(0x8)(BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1CA0[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            GroundConform_Constructor_1___GroundConform_Constructor_SpawnControl_OffsetTransform__Const; // 0x1040(0x60)(Edit, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              GroundConform_Constructor_1___GroundConform_Constructor_GetTransform_Space__Const; // 0x10A0(0x1)(BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform_Constructor_1___GroundConform_Constructor_GetTransform_bInitial__Const; // 0x10A1(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, EditConst, SubobjectReference)
	uint8                                        Pad_1CA4[0xE];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigUnit_HierarchyAddControlTransform_Settings GroundConform_Constructor_1___GroundConform_Constructor_SpawnControl_Settings__Const; // 0x10B0(0xC0)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConform_Constructor_1___GroundConform_Constructor_Scale_Value__Const; // 0x1170(0x18)(BlueprintReadOnly, Net, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CA5[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FPBIKEffector                         GroundConform_Constructor_1___GroundConform_Constructor_ArrayAdd_Element__Const; // 0x1190(0x90)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_1_Name__Const; // 0x1220(0x8)(Edit, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConform_Constructor_1___GroundConform_Constructor_ArrayAdd_1_Element__Const; // 0x1228(0x18)(Edit, ExportObject, Net, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_3_Name__Const; // 0x1240(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1CA7[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 GroundConform_Constructor_1___GroundConform_Constructor_ArrayAdd_3_Element__Const; // 0x1250(0x20)(ConstParm, BlueprintVisible, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_5_Name__Const; // 0x1270(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_Name__Const; // 0x1278(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	bool                                         GroundConform_Constructor_1___GroundConform_Constructor_GetTransform_2_2_bInitial__Const; // 0x1280(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CAD[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_3_Name__Const; // 0x1284(0x8)(ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_2_1_Name__Const; // 0x128C(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_2_Name__Const; // 0x1294(0x8)(ExportObject, BlueprintReadOnly, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_1_Name__Const; // 0x129C(0x8)(Edit, ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_2_1_1_Name__Const; // 0x12A4(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_3_1_Name__Const; // 0x12AC(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CAE[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LookAt_1_1___LookAt_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x12B8(0x18)(Edit, BlueprintReadOnly, Parm, ReturnParm, EditConst, SubobjectReference)
	float                                        LookAt_1_1___LookAt_Scale_Factor__Const;           // 0x12D0(0x4)(BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CAF[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LookAt_1_1___LookAt_Rotate_Vector_1_Vector__Const; // 0x12D8(0x18)(Edit, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__MakeArrayFromStartToEndBone_ChildrenArray__Const; // 0x12F0(0x10)(ConstParm, Net, Parm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__MakeArrayFromStartToEndBone_ParentsArray__Const; // 0x1300(0x10)(Edit, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__MakeArrayFromStartToEndBone_OutChain__Const; // 0x1310(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__MakeArrayFromStartToEndBone_ChainComplete__Const; // 0x1320(0x1)(ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1CB3[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_Prefix__Const; // 0x1328(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_Enabled__Const; // 0x1338(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CB7[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_ScreenDuration__Const; // 0x133C(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FLinearColor                          MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_ScreenColor__Const; // 0x1340(0x10)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_1_Prefix__Const; // 0x1350(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_CollectionChildrenArray_bIncludeParent__Const; // 0x1360(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, EditConst, SubobjectReference)
	enum class ERigElementType                   MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_CollectionChildrenArray_TypeToSearch__Const; // 0x1361(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CBA[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_Prefix__Const; // 0x1368(0x10)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_1_Prefix__Const; // 0x1378(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Config, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_2_Prefix__Const; // 0x1388(0x10)(Edit, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_2_1_Prefix__Const; // 0x1398(0x10)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_Prefix__Const; // 0x13A8(0x10)(Edit, ConstParm, BlueprintVisible, Net, Parm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_1_Prefix__Const; // 0x13B8(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__CalculateLengthOfElementChain_NewLocalVar__Const; // 0x13C8(0x10)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         LocalVariableDefault__CalculateLengthOfElementChain_MathIntEquals_Result__Const; // 0x13D8(0x1)(ExportObject, EditFixedSize, Parm, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CBD[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        LocalVariableDefault__CalculateLengthOfElementChain_numBones__Const; // 0x13DC(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, EditConst, SubobjectReference)
	float                                        LocalVariableDefault__CalculateLengthOfElementChain_currentDistance__Const; // 0x13E0(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        LocalVariableDefault__CalculateLengthOfElementChain_averageDistance__Const; // 0x13E4(0x4)(Edit, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	class FString                                CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_Prefix__Const; // 0x13E8(0x10)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_Enabled__Const; // 0x13F8(0x1)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1CC2[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_ScreenDuration__Const; // 0x13FC(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	struct FLinearColor                          CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_ScreenColor__Const; // 0x1400(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntSub_1_B__Const; // 0x1410(0x4)(ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        LocalVariable__FunctionLibrary___CalculateLengthOfElementChain_VariableNode_7_Value__Const; // 0x1414(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, Transient, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_1_Space__Const; // 0x1418(0x1)(ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1CC5[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_Name__Const; // 0x141C(0x8)(ConstParm, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_GetMetadata_Default__Const; // 0x1424(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_4_Name__Const; // 0x1428(0x8)(BlueprintReadOnly, EditFixedSize, OutParm, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_4_1_Name__Const; // 0x1430(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_4_1_1_Name__Const; // 0x1438(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  SnapControlsToBoneElements___SnapControlsToBoneElements_DISPATCH_RigDispatch_GetMetadata_3_Name__Const; // 0x1440(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        SnapControlsToBoneElements___SnapControlsToBoneElements_DISPATCH_RigDispatch_GetMetadata_3_Default__Const; // 0x1448(0xC)(ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, EditConst, SubobjectReference)
	enum class ERigVMTransformSpace              SnapControlsToBoneElements___SnapControlsToBoneElements_Set_Transform_Space__Const; // 0x1454(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         SnapControlsToBoneElements___SnapControlsToBoneElements_Set_Transform_bInitial__Const; // 0x1455(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CCC[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        SnapControlsToBoneElements___SnapControlsToBoneElements_RigUnit_GetTransform_20_Item__Const; // 0x1458(0xC)(Edit, ConstParm, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	float                                        SnapControlsToBoneElements___SnapControlsToBoneElements_Set_Transform_Weight__Const; // 0x1464(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         SnapControlsToBoneElements___SnapControlsToBoneElements_Set_Transform_bPropagateToChildren__Const; // 0x1468(0x1)(EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CD1[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        SnapControlsToBoneElements___SnapControlsToBoneElements_Set_Transform_1_Item__Const; // 0x146C(0xC)(Edit, ExportObject, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariableDefault__InitConstrainLengthArray_NewArray__Const; // 0x1478(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	int32                                        InitConstrainLengthArray___InitConstrainLengthArray_Greater_B__Const; // 0x1488(0x4)(Edit, ExportObject, EditFixedSize, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	class FName                                  InitConstrainLengthArray___InitConstrainLengthArray_DISPATCH_RigDispatch_SetMetadata_6_Name__Const; // 0x148C(0x8)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)

	static class UClass* StaticClass();
	static class URigVMMemory_Literal* GetDefaultObj();

};

// 0x5D90 (0x5DB8 - 0x28)
// RigVMMemoryStorageGeneratorClass Human_GroundConform_CtrlRig.RigVMMemory_Work
class URigVMMemory_Work : public URigVMMemoryStorage
{
public:
	uint8                                        Pad_1CD7[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionFromEuler_Result; // 0x30(0x20)(Edit, ExportObject, Parm, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_2_CachedIndex;    // 0x50(0x10)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         RigVMModel___GroundConformForwardsSolve_DidNotApplyCachedPose; // 0x60(0x1)(Edit, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         RigVMModel___GroundConformForwardsSolve_Argument;  // 0x61(0x1)(Edit, ConstParm, Net, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1CD9[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Root_Control; // 0x64(0xC)(Edit, ConstParm, ExportObject, OutParm, ReturnParm, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Root_Bone; // 0x70(0xC)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Hip_Bone; // 0x7C(0xC)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Effector_Rotation_Alpha; // 0x88(0x4)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Effector_Strength_Alpha; // 0x8C(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Effector_Position_Alpha; // 0x90(0x4)(ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Effector_Pin_Rotation; // 0x94(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_EnableGroundConforming; // 0x98(0x4)(ConstParm, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CDC[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<double>                               GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_TimingBias; // 0xA0(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_TimingBiasSpeed; // 0xB0(0x8)(Edit, ConstParm, Net, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_ShowDebug; // 0xB8(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_IsFalling; // 0xB9(0x1)(ConstParm, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CE0[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_SleepPositionThreshold; // 0xC0(0x8)(ConstParm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Return_DidNotApplyCachedPose; // 0xC8(0x1)(Edit, ExportObject, Net, ZeroConstructor, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Return_Argument; // 0xC9(0x1)(BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1CE1[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_ForceSleepTimeLimit; // 0xCC(0x4)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_bNewDampRange; // 0xD0(0x1)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CE2[0xF];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_Multiply_1_Result; // 0xE0(0x60)(ConstParm, BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_Transform; // 0x140(0x60)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_CachedIndex; // 0x1A0(0x10)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_20_Transform; // 0x1B0(0x60)(Edit, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_20_CachedIndex; // 0x210(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_SetTransform_4_CachedIndex; // 0x220(0x10)(Edit, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolAnd_1_Result; // 0x230(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolNot_2_1_Result; // 0x231(0x1)(Edit, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolNot_Result; // 0x232(0x1)(BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x233(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CE3[0xC];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_To_World_World; // 0x240(0x60)(ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_4_Value; // 0x2A0(0x60)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_2_1_Element; // 0x300(0xC)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditConst, SubobjectReference)
	uint8                                        Pad_1CE5[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_4_Cache; // 0x310(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_4_Found; // 0x320(0x1)(Edit, ConstParm, BlueprintVisible, Net, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         LocalVariable__GroundConformForwardsSolve_bComponentMotionDetected; // 0x321(0x1)(ConstParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CE6[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_6_Cache; // 0x328(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_6_Success; // 0x338(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_1CE8[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_Element; // 0x33C(0xC)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_1_Cache; // 0x348(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_1_Success; // 0x358(0x1)(ConstParm, ExportObject, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CEA[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_1_Cache; // 0x360(0x10)(ExportObject, EditFixedSize, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_1_Success; // 0x370(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1CEB[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_Value; // 0x374(0x4)(ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_Cache; // 0x378(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_Found; // 0x388(0x1)(Edit, BlueprintVisible, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolAnd_3_Result; // 0x389(0x1)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Less_1_Result; // 0x38A(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Greater_2_1_Result; // 0x38B(0x1)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_Timeline_1_1_Time; // 0x38C(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<float>                                GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_Timeline_1_1_AccumulatedValue; // 0x390(0x10)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, Config, EditConst, SubobjectReference)
	TArray<bool>                                 GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_Timeline_1_1_bIsInitialized; // 0x3A0(0x10)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_Cache; // 0x3B0(0x10)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Add_1_Result; // 0x3C0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_GetDeltaTime_1_Result; // 0x3C4(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_Success; // 0x3C8(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CED[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_ControlFlowBranch_3_BlockToRun; // 0x3CC(0x8)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_ControlFlowBranch_2_BlockToRun; // 0x3D4(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, DisableEditOnTemplate, EditConst, SubobjectReference)
	int32                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_Value; // 0x3DC(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_Cache; // 0x3E0(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_Found; // 0x3F0(0x1)(Edit, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_LessEqual_Result; // 0x3F1(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, EditConst, SubobjectReference)
	uint8                                        Pad_1CEF[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_1_Cache; // 0x3F8(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_1_Success; // 0x408(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_CheckForAnimationMotion_ShouldCallGroundConform; // 0x409(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CF0[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_CheckForAnimationMotion_DetectedNoMotion; // 0x410(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CF1[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_CheckForAnimationMotion_RootControlTransform; // 0x420(0x60)(BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_CheckForAnimationMotion_HipTransform; // 0x480(0x60)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_CheckForAnimationMotion_Position_Threshold; // 0x4E0(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolNot_2_Result; // 0x4E4(0x1)(Edit, ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CF3[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        CheckForAnimationMotion___CheckForAnimationMotion_Entry_Root_Control; // 0x4E8(0xC)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FRigElementKey                        CheckForAnimationMotion___CheckForAnimationMotion_Entry_Hip_Bone; // 0x4F4(0xC)(Edit, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FTransform                            CheckForAnimationMotion___CheckForAnimationMotion_Entry_HipTransformLastFrame; // 0x500(0x60)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FTransform                            CheckForAnimationMotion___CheckForAnimationMotion_Return_HipTransform; // 0x560(0x60)(ConstParm, BlueprintVisible, Net, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        CheckForAnimationMotion___CheckForAnimationMotion_Entry_Position_Threshold; // 0x5C0(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_Entry_NotOnPlatform; // 0x5C4(0x1)(Edit, BlueprintReadOnly, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CF5[0xB];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            CheckForAnimationMotion___CheckForAnimationMotion_To_World_World; // 0x5D0(0x60)(ConstParm, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FTransform                            CheckForAnimationMotion___CheckForAnimationMotion_GetTransform_1_1_Transform; // 0x630(0x60)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             CheckForAnimationMotion___CheckForAnimationMotion_GetTransform_1_1_CachedIndex; // 0x690(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         LocalVariable__CheckForAnimationMotion_DetectedPoseDifference; // 0x6A0(0x1)(ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolNot_Result; // 0x6A1(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_PoseGetDelta_PosesAreEqual; // 0x6A2(0x1)(Edit, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CF7[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigPose                              CheckForAnimationMotion___CheckForAnimationMotion_HierarchyGetPoseItemArray_1_Pose; // 0x6A8(0x70)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	struct FRigElementKeyCollection              CheckForAnimationMotion___CheckForAnimationMotion_PoseGetDelta_ItemsToCompare__IO; // 0x718(0x10)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	struct FRigElementKeyCollection              CheckForAnimationMotion___CheckForAnimationMotion_PoseGetDelta_ItemsWithDelta; // 0x728(0x10)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  CheckForAnimationMotion___CheckForAnimationMotion_Branch_BlockToRun; // 0x738(0x8)(Edit, EditFixedSize, Parm, OutParm, Config, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolOr_MathBoolOr_1_Result; // 0x740(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolOr_MathBoolOr_Result; // 0x741(0x1)(ExportObject, Net, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x742(0x1)(ConstParm, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CF9[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             CheckForAnimationMotion___CheckForAnimationMotion_GetTransform_1_CachedIndex; // 0x748(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_RigVMFunction_MathBoolAnd_Result; // 0x758(0x1)(Edit, ConstParm, BlueprintVisible, Net, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolNot_1_Result; // 0x759(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_IsNearlyEqual_Result; // 0x75A(0x1)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1CFB[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               CheckForAnimationMotion___CheckForAnimationMotion_IsNearlyEqual_A; // 0x760(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               CheckForAnimationMotion___CheckForAnimationMotion_IsNearlyEqual_B; // 0x778(0x18)(Edit, ConstParm, BlueprintReadOnly, Parm, Transient, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolOr_1_MathBoolOr_1_1_Result; // 0x790(0x1)(Edit, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolOr_1_MathBoolOr_1_Result; // 0x791(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1CFD[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CheckForAnimationMotion___CheckForAnimationMotion_Cast_Result; // 0x794(0x4)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolNot_4_Result; // 0x798(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_1CFF[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_2_Cache; // 0x7A0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_2_Success; // 0x7B0(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D01[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_2_Element; // 0x7B4(0xC)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_Cache; // 0x7C0(0x10)(BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_2_Value; // 0x7D0(0x4)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_1D03[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_2_Cache; // 0x7D8(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_2_Found; // 0x7E8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_Success; // 0x7E9(0x1)(Net, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D05[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_Cache; // 0x7F0(0x10)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	int32                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Subtract_Result; // 0x800(0x4)(Edit, ConstParm, BlueprintVisible, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_Success; // 0x804(0x1)(BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D06[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_Branch_1_BlockToRun; // 0x808(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, EditConst, SubobjectReference)
	struct FRigPose                              GroundConformForwardsSolve___GroundConformForwardsSolve_HierarchyGetPoseItemArray_Pose; // 0x810(0x70)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_MathBoolOr_1_Result; // 0x880(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolAnd_Result; // 0x881(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_1_Value; // 0x882(0x1)(Edit, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D08[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_1_Cache; // 0x888(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_1_Found; // 0x898(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Less_Result; // 0x899(0x1)(Edit, BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D09[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_1_Value; // 0x89C(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_1_Element; // 0x8A0(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D0A[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_1_Cache; // 0x8B0(0x10)(Edit, Net, Parm, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_1_Found; // 0x8C0(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_MathBoolNot_1_Result; // 0x8C1(0x1)(Edit, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D0B[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ArrayIterator_Element; // 0x8C4(0xC)(Edit, ConstParm, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_2_Cache; // 0x8D0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Divide_Result; // 0x8E0(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D0C[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_Transform; // 0x8F0(0x60)(ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_CachedIndex; // 0x950(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, EditConst, SubobjectReference)
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Divide_A; // 0x960(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D0E[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_1_2_2_Transform; // 0x970(0x60)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_1_2_2_CachedIndex; // 0x9D0(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Divide_B; // 0x9E0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_2_Value; // 0x9E8(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_2_Success; // 0x9EC(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Greater_Result; // 0x9ED(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D10[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArrayGetNum_Num; // 0x9F0(0x4)(Edit, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	int32                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ArrayIterator_Index; // 0x9F4(0x4)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, Transient, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_2_3_Multiply_2_3_1_Result; // 0x9F8(0x4)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_2_3_Multiply_2_3_Result; // 0x9FC(0x4)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_Value; // 0xA00(0x4)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D11[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_Cache; // 0xA08(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_Found; // 0xA18(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D12[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_Value; // 0xA1C(0x4)(Edit, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_Cache; // 0xA20(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_Found; // 0xA30(0x1)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D13[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Divide_1_Result; // 0xA38(0x8)(BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Minimum_1_Result; // 0xA40(0x8)(Edit, ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Minimum_1_A; // 0xA48(0x8)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_Value; // 0xA50(0x18)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_Cache; // 0xA68(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_Found; // 0xA78(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D16[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Divide_1_B; // 0xA80(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, ReturnParm, Transient, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_2_3_Multiply_2_3_1_B; // 0xA88(0x4)(ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_1D17[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArraySetAtIndex_Element; // 0xA90(0x8)(ConstParm, BlueprintVisible, Parm, OutParm, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0xA98(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Greater_1_Result; // 0xAA0(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D19[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArrayGetNum_1_Num; // 0xAA4(0x4)(ConstParm, BlueprintVisible, EditFixedSize, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_2_1_Result; // 0xAA8(0x4)(ConstParm, ExportObject, Net, Transient, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_2_Value; // 0xAAC(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_2_Cache; // 0xAB0(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_2_Found; // 0xAC0(0x1)(Edit, ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D1B[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_1_Value; // 0xAC4(0x4)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_1_Cache; // 0xAC8(0x10)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_1_Found; // 0xAD8(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D1E[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArraySetAtIndex_1_Element; // 0xAE0(0x8)(Edit, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_RigVMFunction_ControlFlowBranch_1_1_BlockToRun; // 0xAE8(0x8)(ConstParm, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_Cache; // 0xAF0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_MathVectorDistance_2_Result; // 0xB00(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D20[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_2_Result; // 0xB08(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_2_2_Transform; // 0xB20(0x60)(ExportObject, BlueprintReadOnly, Net, OutParm, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_2_2_CachedIndex; // 0xB80(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_2_A; // 0xB90(0x18)(BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_1_1_Result; // 0xBA8(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, Transient, Config, EditConst, SubobjectReference)
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_1_2_Transform; // 0xBC0(0x60)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_Value; // 0xC20(0xC)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D23[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_Cache; // 0xC30(0x10)(Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_Found; // 0xC40(0x1)(Edit, BlueprintReadOnly, Net, OutParm, ZeroConstructor, EditConst, SubobjectReference)
	uint8                                        Pad_1D24[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_1_2_CachedIndex; // 0xC48(0x10)(Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_1_1_A; // 0xC58(0x18)(Edit, BlueprintVisible, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_Success; // 0xC70(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D26[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_1_Value; // 0xC74(0xC)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_1_Cache; // 0xC80(0x10)(Edit, ConstParm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_1_Found; // 0xC90(0x1)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D27[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_1_Cache; // 0xC98(0x10)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_MathVectorDistance_2_1_Result; // 0xCA8(0x4)(Edit, ConstParm, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D28[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_Result; // 0xCB0(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D2A[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_2_2_1_Transform; // 0xCD0(0x60)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_2_2_1_CachedIndex; // 0xD30(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_A; // 0xD40(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_1_Result; // 0xD58(0x18)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_1_2_1_Transform; // 0xD70(0x60)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_2_Value; // 0xDD0(0xC)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D2F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_2_Cache; // 0xDE0(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_If_Result; // 0xDF0(0xC)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ItemExists_Exists; // 0xDFC(0x1)(Edit, ExportObject, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D31[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_HierarchyGetParent_2_Parent; // 0xE00(0xC)(Edit, Net, EditFixedSize, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_1D33[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_HierarchyGetParent_2_CachedChild; // 0xE10(0x10)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_HierarchyGetParent_2_CachedParent; // 0xE20(0x10)(ConstParm, ExportObject, EditFixedSize, OutParm, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ItemExists_CachedIndex; // 0xE30(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_2_Found; // 0xE40(0x1)(BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D35[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_1_2_1_CachedIndex; // 0xE48(0x10)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_1_B; // 0xE58(0x18)(Edit, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_1_Success; // 0xE70(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D36[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_2_1_1_Cache; // 0xE78(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, Transient, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_2_1_1_Success; // 0xE88(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D37[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_1_Value; // 0xE8C(0xC)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_1_Cache; // 0xE98(0x10)(BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_1_Found; // 0xEA8(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D3A[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_3_1_Cache; // 0xEB0(0x10)(BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	struct FQuat                                 Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_11_Result; // 0xEC0(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	struct FQuat                                 Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Inverse_1_Result; // 0xEE0(0x20)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Transient, Config, EditConst, SubobjectReference)
	struct FQuat                                 Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_LookAt_1_1_Rotation; // 0xF00(0x20)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_3_1_1_Transform; // 0xF20(0x60)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_3_1_1_CachedIndex; // 0xF80(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FQuat                                 Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_LookAt_1_1_CurrentRotation; // 0xF90(0x20)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_LookAt_1_1_Position; // 0xFB0(0x18)(ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D3B[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_3_1_Transform; // 0xFD0(0x60)(ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_3_1_CachedIndex; // 0x1030(0x10)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_LookAt_1_1_ParentPosition; // 0x1040(0x18)(Edit, ConstParm, BlueprintVisible, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         LookAt_1_1___LookAt_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x1058(0x1)(DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D3C[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            LookAt_1_1___LookAt_Cast_Result;                   // 0x1060(0x60)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FMatrix                               LookAt_1_1___LookAt_MathMatrixFromVectors_1_Result; // 0x10C0(0x80)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               LookAt_1_1___LookAt_Unit_Result;                   // 0x1140(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FVector                               LookAt_1_1___LookAt_Scale_Result;                  // 0x1158(0x18)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               LookAt_1_1___LookAt_Subtract_Result;               // 0x1170(0x18)(Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               LookAt_1_1___LookAt_MathVectorCross_1_1_Result;    // 0x1188(0x18)(ConstParm, ExportObject, OutParm, Config, EditConst, SubobjectReference)
	struct FVector                               LookAt_1_1___LookAt_Rotate_Vector_1_Result;        // 0x11A0(0x18)(ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               LookAt_1_1___LookAt_MathVectorCross_1_1_1_Result;  // 0x11B8(0x18)(BlueprintVisible, Parm, ReturnParm, Transient, EditConst, SubobjectReference)
	struct FQuat                                 LookAt_1_1___LookAt_If_True;                       // 0x11D0(0x20)(Edit, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_3_1_Success; // 0x11F0(0x1)(Edit, ExportObject, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x11F1(0x1)(ConstParm, BlueprintVisible, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D3E[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_HierarchyGetParent_Parent; // 0x11F4(0xC)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_HierarchyGetParent_CachedChild; // 0x1200(0x10)(ConstParm, BlueprintVisible, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_HierarchyGetParent_CachedParent; // 0x1210(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, Config, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_MakeArrayFromStartToEndBone_Chain; // 0x1220(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, Transient, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_CollectionChildrenArray_Items; // 0x1230(0x10)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariable__MakeArrayFromStartToEndBone_ChildrenArray; // 0x1240(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayGetNum_Num; // 0x1250(0x4)(ExportObject, Net, EditFixedSize, ZeroConstructor, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D3F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FRigElementKey>                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_HierarchyGetParentsItemArray_Parents; // 0x1258(0x10)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_HierarchyGetParentsItemArray_CachedChild; // 0x1268(0x10)(Edit, ConstParm, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FRigElementKeyCollection>      MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_HierarchyGetParentsItemArray_CachedParents; // 0x1278(0x10)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<struct FRigElementKey>                LocalVariable__MakeArrayFromStartToEndBone_ParentsArray; // 0x1288(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayGetNum_1_Num; // 0x1298(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         LocalVariable__MakeArrayFromStartToEndBone_ChainComplete; // 0x129C(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Transient, Config, EditConst, SubobjectReference)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_MathBoolNot_Result; // 0x129D(0x1)(Edit, Net, Parm, OutParm, ReturnParm, EditConst, SubobjectReference)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayFind_Success; // 0x129E(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D42[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_Element; // 0x12A0(0xC)(ExportObject, Net, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayFind_Index; // 0x12AC(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayAdd_Index; // 0x12B0(0x4)(Edit, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_2_Value; // 0x12B4(0x8)(Edit, ConstParm, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_CoreEquals_Result; // 0x12BC(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D45[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_Branch_1_BlockToRun; // 0x12C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_Branch_BlockToRun; // 0x12C8(0x8)(Edit, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_Branch_2_BlockToRun; // 0x12D0(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_Index; // 0x12D8(0x4)(Edit, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_Count; // 0x12DC(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_Ratio; // 0x12E0(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_BlockToRun; // 0x12E4(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_Element; // 0x12EC(0xC)(Edit, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_Value; // 0x12F8(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_Index; // 0x1300(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_Count; // 0x1304(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_Ratio; // 0x1308(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_BlockToRun; // 0x130C(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_1_Element; // 0x1314(0xC)(ConstParm, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_1_Value; // 0x1320(0x8)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, Transient, EditConst, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_1_Index; // 0x1328(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_1_Count; // 0x132C(0x4)(ConstParm, EditFixedSize, OutParm, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_1_Ratio; // 0x1330(0x4)(Edit, ConstParm, BlueprintVisible, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_1_BlockToRun; // 0x1334(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_CalculateLengthOfElementChain_Length; // 0x133C(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Config, EditConst, SubobjectReference)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayGetNum_1_Num; // 0x1340(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntSub_1_Result; // 0x1344(0x4)(Edit, ConstParm, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	int32                                        LocalVariable__CalculateLengthOfElementChain_numBones; // 0x1348(0x4)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathBoolNot_Result; // 0x134C(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_CoreEquals_Result; // 0x134D(0x1)(Edit, ConstParm, ExportObject, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D4D[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayIterator_Index; // 0x1350(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntSub_Result; // 0x1354(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayIterator_Count; // 0x1358(0x4)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathFloatAdd_Result; // 0x135C(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathVectorDistance_Result; // 0x1360(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D4F[0xC];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_1_Transform; // 0x1370(0x60)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayIterator_Element; // 0x13D0(0xC)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_1D50[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_1_CachedIndex; // 0x13E0(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathVectorDistance_A; // 0x13F0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D51[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_Transform; // 0x1410(0x60)(BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayGetAtIndex_Element; // 0x1470(0xC)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntAdd_Result; // 0x147C(0x4)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_CachedIndex; // 0x1480(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	struct FVector                               CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathVectorDistance_B; // 0x1490(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FName                                  CalculateLengthOfElementChain___CalculateLengthOfElementChain_Branch_BlockToRun; // 0x14A8(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayIterator_Ratio; // 0x14B0(0x4)(Edit, ConstParm, EditFixedSize, Parm, Config, EditConst, SubobjectReference)
	class FName                                  CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayIterator_BlockToRun; // 0x14B4(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathFloatDiv_Result; // 0x14BC(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntToFloat_Result; // 0x14C0(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	float                                        LocalVariable__CalculateLengthOfElementChain_averageDistance; // 0x14C4(0x4)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_Cache; // 0x14C8(0x10)(Edit, ConstParm, BlueprintVisible, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_Success; // 0x14D8(0x1)(ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D53[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_Cache; // 0x14E0(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_Value; // 0x14F0(0x4)(BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D55[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_Cache; // 0x14F8(0x10)(BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_Found; // 0x1508(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_Success; // 0x1509(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D56[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Branch_1_BlockToRun; // 0x150C(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Config, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Branch_BlockToRun; // 0x1514(0x8)(ConstParm, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, SubobjectReference)
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x151C(0xC)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_Cache; // 0x1528(0x10)(Edit, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_Success; // 0x1538(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D57[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_5_Cache; // 0x1540(0x10)(ConstParm, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_5_Success; // 0x1550(0x1)(BlueprintVisible, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D58[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ArrayIterator_Count; // 0x1554(0x4)(ConstParm, BlueprintReadOnly, ZeroConstructor, Config, EditConst, SubobjectReference)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ArrayIterator_Ratio; // 0x1558(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, Transient, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ArrayIterator_BlockToRun; // 0x155C(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x1564(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D59[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                GroundConformForwardsSolve___GroundConformForwardsSolve_GroundConform_TraceRadiiArray; // 0x1570(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	TArray<float>                                GroundConformForwardsSolve___GroundConformForwardsSolve_GroundConform_InBendStiffness; // 0x1580(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_If_1_Result; // 0x1590(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Minimum_Result; // 0x1598(0x8)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Cast_Result; // 0x15A0(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_MathBoolNot_Result; // 0x15A4(0x1)(Edit, ConstParm, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D5B[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Minimum_A; // 0x15A8(0x8)(Edit, BlueprintReadOnly, EditFixedSize, Parm, Config, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Cast_2_Result; // 0x15B0(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_MathBoolNot_2_Result; // 0x15B4(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D5C[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Minimum_B; // 0x15B8(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_Result; // 0x15C0(0x4)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_Target; // 0x15C4(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_Velocity; // 0x15C8(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D5D[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_SimulatedResult; // 0x15D0(0x10)(BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FFloatSpringState>             GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_SpringState; // 0x15E0(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_If_1_True; // 0x15F0(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_GroundConform_Motionless; // 0x15F8(0x1)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D5F[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_If_2_Result; // 0x15FC(0x4)(Edit, ConstParm, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Cast_1_Result; // 0x1600(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_1_Result; // 0x1604(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Transient, Config, EditConst, SubobjectReference)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_1_Velocity; // 0x1608(0x4)(Edit, BlueprintReadOnly, Net, OutParm, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_1D61[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_1_SimulatedResult; // 0x1610(0x10)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, Transient, EditConst, SubobjectReference)
	TArray<struct FFloatSpringState>             GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_1_SpringState; // 0x1620(0x10)(ConstParm, BlueprintVisible, Net, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_GroundConform_GroundConformProgressIn; // 0x1630(0x8)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Multiply_Result; // 0x1638(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_Entry_Effector_Rotation_Alpha; // 0x1640(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_Entry_Effector_Strength_Alpha; // 0x1644(0x4)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_Entry_Effector_Position_Alpha; // 0x1648(0x4)(Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_Entry_Effector_Pin_Rotation; // 0x164C(0x4)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_Entry_Effector_Pull_Chain_Alpha; // 0x1650(0x4)(Edit, BlueprintVisible, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_Entry_SwimmingDragAmount; // 0x1654(0x4)(Edit, ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Entry_GroundConformProgressIn; // 0x1658(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	TArray<double>                               GroundConform___GroundConform_Entry_TimingBias;    // 0x1660(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Entry_TimingBiasSpeed; // 0x1670(0x8)(ConstParm, ExportObject, Net, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_Entry_WasMotionless; // 0x1678(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_1D65[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        GroundConform___GroundConform_Entry_HitNotifyCheckFrame; // 0x167C(0x4)(Edit, ConstParm, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_Entry_TransformBones; // 0x1680(0x1)(ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_Entry_ShowDebug;     // 0x1681(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D66[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConform___GroundConform_Entry_SleepPositionThreshold; // 0x1688(0x8)(EditFixedSize, Parm, OutParm, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_Entry_bNewDampRange; // 0x1690(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_17_Value; // 0x1691(0x1)(EditFixedSize, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D68[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        GroundConform___GroundConform_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Element; // 0x1694(0xC)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_17_Cache; // 0x16A0(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_17_Found; // 0x16B0(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         LocalVariable__GroundConform_bHasDynamicBase_LastFrame_Local; // 0x16B1(0x1)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_MathBoolNot_5_Result; // 0x16B2(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         LocalVariable__GroundConform_HasMotion;            // 0x16B3(0x1)(ConstParm, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D6B[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FVector>                       GroundConform___GroundConform_ArrayClone_Clone;    // 0x16B8(0x10)(BlueprintVisible, Net, ReturnParm, Config, EditConst, SubobjectReference)
	TArray<struct FVector>                       LocalVariable__GroundConform_EffectorPositionCache; // 0x16C8(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConform___GroundConform_ArrayGetAtIndex_14_Element; // 0x16D8(0xC)(Edit, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	int32                                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_9_Value; // 0x16E4(0x4)(Edit, ConstParm, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_9_Cache; // 0x16E8(0x10)(ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_9_Found; // 0x16F8(0x1)(Edit, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_LessEqual_2_Result;  // 0x16F9(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Parm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D6C[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_1_1_Cache; // 0x1700(0x10)(Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_1_1_Success; // 0x1710(0x1)(Net, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         LocalVariable__GroundConform_bShouldCheckHitNotify; // 0x1711(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D6F[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_6_Cache; // 0x1718(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	int32                                        GroundConform___GroundConform_Subtract_9_Result;   // 0x1728(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_6_Success; // 0x172C(0x1)(ExportObject, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D70[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  GroundConform___GroundConform_Branch_1_1_BlockToRun; // 0x1730(0x8)(Edit, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConform___GroundConform_ArrayIterator_1_1_Element; // 0x1738(0xC)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_1D71[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_Cache; // 0x1748(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D72[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            GroundConform___GroundConform_GetTransform_3_Transform; // 0x1760(0x60)(Edit, ConstParm, ExportObject, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_GetTransform_3_CachedIndex; // 0x17C0(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_Value; // 0x17D0(0x18)(ConstParm, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_Success; // 0x17E8(0x1)(ConstParm, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D74[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_7_Cache; // 0x17F0(0x10)(Edit, ConstParm, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FQuat                                 GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_7_Value; // 0x1800(0x20)(ConstParm, ExportObject, Net, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_7_Success; // 0x1820(0x1)(ConstParm, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D77[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        GroundConform___GroundConform_ArrayIterator_1_1_Index; // 0x1824(0x4)(ConstParm, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	int32                                        GroundConform___GroundConform_ArrayIterator_1_1_Count; // 0x1828(0x4)(EditFixedSize, OutParm, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_ArrayIterator_1_1_Ratio; // 0x182C(0x4)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_ArrayIterator_1_1_BlockToRun; // 0x1830(0x8)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	int32                                        GroundConform___GroundConform_ArrayIterator_1_Index; // 0x1838(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	int32                                        LocalVariable__GroundConform_CurrentIndex;         // 0x183C(0x4)(ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConform___GroundConform_ArrayIterator_1_Element; // 0x1840(0xC)(ConstParm, Net, EditFixedSize, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FRigElementKey                        LocalVariable__GroundConform_CurrentElement;       // 0x184C(0xC)(ConstParm, ExportObject, Parm, OutParm, ReturnParm, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_2_Value; // 0x1858(0xC)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D7B[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_2_Cache; // 0x1868(0x10)(Edit, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_2_Found; // 0x1878(0x1)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D7C[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRigElementKey                        LocalVariable__GroundConform_CurrentControl;       // 0x187C(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D7D[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            GroundConform___GroundConform_GetTransform_5_2_Transform; // 0x1890(0x60)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_GetTransform_5_2_CachedIndex; // 0x18F0(0x10)(ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	struct FTransform                            LocalVariable__GroundConform_CurrentTransform;     // 0x1900(0x60)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FTransform                            GroundConform___GroundConform_GetTransform_2_Transform; // 0x1960(0x60)(ConstParm, BlueprintVisible, ExportObject, Net, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FRigElementKey                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_5_1_Value; // 0x19C0(0xC)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D7F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_5_1_Cache; // 0x19D0(0x10)(Edit, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_5_1_Found; // 0x19E0(0x1)(Edit, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D82[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_GetTransform_2_CachedIndex; // 0x19E8(0x10)(ExportObject, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D85[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            LocalVariable__GroundConform_ParentTransform;      // 0x1A00(0x60)(ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_10_Result;  // 0x1A60(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Clamp_1_Result;      // 0x1A68(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Subtract_8_Result;   // 0x1A70(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Add_2_Result;        // 0x1A78(0x8)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_13_1_Result; // 0x1A80(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_15_Result;  // 0x1A88(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_13_Result;  // 0x1A90(0x8)(ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Clamp_2_Result;      // 0x1A98(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_ArrayGetAtIndex_15_Element; // 0x1AA0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       LocalVariable__GroundConform_CurrentElementGravity; // 0x1AA8(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_If_16_Result;        // 0x1AB0(0x4)(BlueprintVisible, ExportObject, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_ArrayGetAtIndex_9_1_1_Element; // 0x1AB4(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D87[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_Value; // 0x1AB8(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D88[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_Cache; // 0x1AC0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_Found; // 0x1AD0(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D89[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_2_Value; // 0x1AD4(0x4)(Edit, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_2_Cache; // 0x1AD8(0x10)(ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_2_Found; // 0x1AE8(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D8A[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        LocalVariable__GroundConform_DistanceToParent;     // 0x1AEC(0x4)(ConstParm, ExportObject, Parm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_5_Result;        // 0x1AF0(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_4_Value; // 0x1B08(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_4_Cache; // 0x1B20(0x10)(Edit, ExportObject, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_4_Found; // 0x1B30(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D8F[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_7_Value; // 0x1B38(0x18)(ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_7_Cache; // 0x1B50(0x10)(Edit, ConstParm, Net, ZeroConstructor, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_7_Found; // 0x1B60(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D91[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalVariable__GroundConform_TraceCenter_Local;    // 0x1B68(0x18)(Edit, BlueprintReadOnly, Net, Parm, ReturnParm, Config, EditConst, SubobjectReference)
	TArray<struct FVector>                       LocalVariable__GroundConform_TracePathPositions_Local; // 0x1B80(0x10)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_3_1_Add_3_1_Result; // 0x1B90(0x18)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_3_1_Add_3_Result; // 0x1BA8(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_8_Result;        // 0x1BC0(0x18)(Edit, BlueprintReadOnly, Parm, OutParm, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_2_Result;   // 0x1BD8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_5_Result;   // 0x1BE0(0x8)(ConstParm, BlueprintVisible, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_If_18_Result;        // 0x1BE8(0x4)(Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_MathBoolAnd_2_MathBoolAnd_2_1_Result; // 0x1BEC(0x1)(ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_MathBoolAnd_2_MathBoolAnd_2_Result; // 0x1BED(0x1)(ConstParm, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_12_Found; // 0x1BEE(0x1)(Edit, BlueprintVisible, ExportObject, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D93[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_12_Cache; // 0x1BF0(0x10)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_12_Value; // 0x1C00(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_CoreNotEquals_1_Result; // 0x1C04(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1D94[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConform___GroundConform_ArrayGetAtIndex_6_Element; // 0x1C08(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_If_18_False;         // 0x1C10(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D96[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConform___GroundConform_Multiply_5_A;        // 0x1C18(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_3_1_Add_3_B;     // 0x1C20(0x18)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_If_1_Result;         // 0x1C38(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_3_Add_3_1_Result; // 0x1C50(0x18)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_3_Add_3_Result;  // 0x1C68(0x18)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_4_2_Result; // 0x1C80(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_4_2_A;      // 0x1C88(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_DISPATCH_RigVMDispatch_If_1_Result; // 0x1C90(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_ArrayGetAtIndex_9_1_1_1_Element; // 0x1C98(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D97[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConform___GroundConform_Add_9_Result;        // 0x1CA0(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Add_9_1_Result;      // 0x1CA8(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_3_Add_3_B;       // 0x1CB0(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Interpolate_Result;  // 0x1CC8(0x18)(BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_6_Result;        // 0x1CE0(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigVMDispatch_If_Result; // 0x1CF8(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_CoreNotEquals_1_1_Result; // 0x1D10(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D9D[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigVMDispatch_If_True; // 0x1D18(0x18)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_4_3_Result; // 0x1D30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, OutParm, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_4_3_A;      // 0x1D38(0x8)(ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_6_B__IO;         // 0x1D40(0x18)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_Interpolate_T;       // 0x1D58(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D9E[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FVector>                       GroundConform___GroundConform_ArrayAppend_Other__IO; // 0x1D60(0x10)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         LocalVariable__GroundConform_FirstSphereTrace_bHit; // 0x1D70(0x1)(ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         LocalVariable__GroundConform_SphereTrace_bHit;     // 0x1D71(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1D9F[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_8_1_Element; // 0x1D78(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_SphereTraceByTraceChannel_bHit; // 0x1D90(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1DA0[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_8_Element; // 0x1D98(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_ArrayGetAtIndex_2_1_Element; // 0x1DB0(0x4)(BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1DA1[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_SphereTraceByTraceChannel_HitLocation; // 0x1DB8(0x18)(ConstParm, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_SphereTraceByTraceChannel_HitNormal; // 0x1DD0(0x18)(ExportObject, Net, EditFixedSize, Parm, Config, EditConst, SubobjectReference)
	struct FHitResult                            GroundConform___GroundConform_SphereTraceByTraceChannel_WorldSpaceHitResult; // 0x1DE8(0xF0)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	struct FHitResult                            GroundConform___GroundConform_SphereTraceByTraceChannel_1_WorldSpaceHitResult; // 0x1ED8(0xF0)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_8_1_1_Element; // 0x1FC8(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_ArrayGetAtIndex_2_Element; // 0x1FE0(0x4)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_SphereTraceByTraceChannel_1_bHit; // 0x1FE4(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1DA3[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_SphereTraceByTraceChannel_1_HitLocation; // 0x1FE8(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_SphereTraceByTraceChannel_1_HitNormal; // 0x2000(0x18)(ConstParm, BlueprintVisible, OutParm, ZeroConstructor, Config, EditConst, SubobjectReference)
	struct FHitResult                            GroundConform___GroundConform_If_17_Result;        // 0x2018(0xF0)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FHitResult                            LocalVariable__GroundConform_SphereTraceByTraceChannel_WorldSpaceHitResult; // 0x2108(0xF0)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_MathBoolOr_Result;   // 0x21F8(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1DA5[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_If_2_3_Result;       // 0x2200(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_From_World_3_Global; // 0x2218(0x18)(Edit, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_From_World_3_Value__IO; // 0x2230(0x18)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_If_11_Result;        // 0x2248(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_From_World_3_1_Global; // 0x2260(0x18)(BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_From_World_3_1_Value__IO; // 0x2278(0x18)(ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               LocalVariable__GroundConform_TraceHitPosition_Local; // 0x2290(0x18)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_MinDistanceToParentConstraint_Result; // 0x22A8(0x18)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_4_Result;        // 0x22C0(0x18)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigVMDispatch_If_2_Result; // 0x22D8(0x18)(Edit, ConstParm, BlueprintVisible, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_RigVMFunction_MathBoolAnd_1_Result; // 0x22F0(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_Less_1_Result;       // 0x22F1(0x1)(Edit, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DA7[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_Rotate_Vector_1_Result; // 0x22F8(0x18)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FQuat                                 GroundConform___GroundConform_From_World_4_1_Global; // 0x2310(0x20)(BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_10_1_Result;     // 0x2330(0x18)(Edit, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_Add_10_1_A__IO;      // 0x2348(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Less_1_A;            // 0x2360(0x8)(ConstParm, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_DISPATCH_RigVMDispatch_CoreEquals_2_Result; // 0x2368(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1DAA[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GroundConform___GroundConform_DISPATCH_RigVMDispatch_CoreEquals_2_A; // 0x236C(0x4)(ConstParm, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_ArrayGetAtIndex_2_2_1_Element; // 0x2370(0x4)(Edit, Parm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1DAB[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GroundConform___GroundConform_MinDistanceToParentConstraint_Radius; // 0x2378(0x8)(Edit, Net, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	TArray<double>                               GroundConform___GroundConform_MinDistanceToParentConstraint_TraceRadii; // 0x2380(0x10)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         MinDistanceToParentConstraint___MinDistanceToParentConstraint_MathBoolAnd_Result; // 0x2390(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x2391(0x1)(Edit, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         MinDistanceToParentConstraint___MinDistanceToParentConstraint_Less_Result; // 0x2392(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1DAD[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MinDistanceToParentConstraint___MinDistanceToParentConstraint_MathVectorLength_Result; // 0x2394(0x4)(Edit, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               MinDistanceToParentConstraint___MinDistanceToParentConstraint_Subtract_Result; // 0x2398(0x18)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               MinDistanceToParentConstraint___MinDistanceToParentConstraint_Subtract_B; // 0x23B0(0x18)(ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       MinDistanceToParentConstraint___MinDistanceToParentConstraint_Less_A; // 0x23C8(0x8)(ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Transient, EditConst, SubobjectReference)
	double                                       MinDistanceToParentConstraint___MinDistanceToParentConstraint_Multiply_Result; // 0x23D0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       MinDistanceToParentConstraint___MinDistanceToParentConstraint_Add_Result; // 0x23D8(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       MinDistanceToParentConstraint___MinDistanceToParentConstraint_ArrayGetAtIndex_Element; // 0x23E0(0x8)(BlueprintVisible, OutParm, Transient, Config, EditConst, SubobjectReference)
	int32                                        MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_14_Value; // 0x23E8(0x4)(Edit, ConstParm, BlueprintVisible, Parm, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FRigElementKey                        MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_6_1_Value; // 0x23EC(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_6_1_Cache; // 0x23F8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_6_1_Found; // 0x2408(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1DAF[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_14_Cache; // 0x2410(0x10)(ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_14_Found; // 0x2420(0x1)(Edit, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_1DB0[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               MinDistanceToParentConstraint___MinDistanceToParentConstraint_Add_1_Result; // 0x2428(0x18)(Edit, ConstParm, EditFixedSize, Parm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               MinDistanceToParentConstraint___MinDistanceToParentConstraint_Scale_1_Result; // 0x2440(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               MinDistanceToParentConstraint___MinDistanceToParentConstraint_Unit_1_Result; // 0x2458(0x18)(Edit, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        MinDistanceToParentConstraint___MinDistanceToParentConstraint_Scale_1_Factor; // 0x2470(0x4)(ConstParm, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1DB1[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalVariable__GroundConform_FalseIn;              // 0x2478(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_If_13_Result;        // 0x2490(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_LocalBendConstraint_Optimized_1_TranslationOut; // 0x24A8(0x18)(BlueprintVisible, Net, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_DistanceToParentConstraint_Result; // 0x24C0(0x18)(Edit, BlueprintVisible, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_DistanceToParentConstraint_ParentPosition; // 0x24D8(0x18)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_DistanceToParentConstraint_ParentDistanceIn; // 0x24F0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               DistanceToParentConstraint___DistanceToParentConstraint_Scale_1_Result; // 0x24F8(0x18)(BlueprintReadOnly, EditFixedSize, OutParm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               DistanceToParentConstraint___DistanceToParentConstraint_Unit_1_Result; // 0x2510(0x18)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               DistanceToParentConstraint___DistanceToParentConstraint_Subtract_1_Result; // 0x2528(0x18)(BlueprintReadOnly, Net, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	float                                        DistanceToParentConstraint___DistanceToParentConstraint_Scale_1_Factor; // 0x2540(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	float                                        GroundConform___GroundConform_ArrayGetAtIndex_7_Element; // 0x2544(0x4)(ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_LocalBendConstraint_Optimized_1_Target; // 0x2548(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FQuat                                 GroundConform___GroundConform_LocalBendConstraint_Optimized_1_DefaultRotation; // 0x2560(0x20)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_LocalBendConstraint_Optimized_1_ParentDistanceIn; // 0x2580(0x8)(BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1DB3[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTransform                            LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Make_Absolute_1_2_Global; // 0x2590(0x60)(Edit, ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FTransform                            LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Value; // 0x25F0(0x60)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Cache; // 0x2650(0x10)(Edit, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FTransform                            LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Default__IO; // 0x2660(0x60)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Found; // 0x26C0(0x1)(ExportObject, BlueprintReadOnly, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1DB4[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DistanceToParentConstraint_Result; // 0x26C8(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Interpolate_2_Result; // 0x26E0(0x18)(Edit, ConstParm, Net, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	float                                        LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_1_Result; // 0x26F8(0x4)(Edit, BlueprintVisible, ExportObject, Net, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1DB5[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_2_Result; // 0x2700(0x8)(BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_6_Result; // 0x2708(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, EditConst, SubobjectReference)
	bool                                         LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_MathBoolAnd_1_Result; // 0x2710(0x1)(Edit, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Less_Result; // 0x2711(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_1DB6[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Less_A; // 0x2718(0x8)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Less_B; // 0x2720(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_2_B; // 0x2728(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Transient, EditConst, SubobjectReference)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_3_Multiply_3_2_Result; // 0x2730(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, EditConst, SubobjectReference)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_3_Multiply_3_1_Result; // 0x2738(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, EditConst, SubobjectReference)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_3_Multiply_3_Result; // 0x2740(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_GetDeltaTime_Result; // 0x2748(0x4)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1DB9[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_3_Multiply_3_B; // 0x2750(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_1_True; // 0x2758(0x4)(BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	float                                        LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_1_False; // 0x275C(0x4)(Edit, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DistanceToParentConstraint_ParentPosition; // 0x2760(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Config, EditConst, SubobjectReference)
	struct FVector                               DistanceToParentConstraint___DistanceToParentConstraint_Scale_1_Result; // 0x2778(0x18)(BlueprintReadOnly, EditFixedSize, OutParm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               DistanceToParentConstraint___DistanceToParentConstraint_Unit_1_Result; // 0x2790(0x18)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               DistanceToParentConstraint___DistanceToParentConstraint_Subtract_1_Result; // 0x27A8(0x18)(BlueprintReadOnly, Net, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	float                                        DistanceToParentConstraint___DistanceToParentConstraint_Scale_1_Factor; // 0x27C0(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1DBC[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               LocalVariable__GroundConform_TrueIn;               // 0x27C8(0x18)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_ArrayGetAtIndex_9_Element; // 0x27E0(0x1)(ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         LocalVariable__GroundConform_BoolIn;               // 0x27E1(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1DBF[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_If_4_Result;         // 0x27E8(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	struct FVector                               LocalVariable__GroundConform_If_4_Result;          // 0x2800(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               LocalVariable__GroundConform_TargetPosition;       // 0x2818(0x18)(BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_MathBoolAnd_Result;  // 0x2830(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_Greater_1_Result;    // 0x2831(0x1)(Edit, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1DC1[0xE];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 GroundConform___GroundConform_If_12_Result;        // 0x2840(0x20)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	struct FQuat                                 GroundConform___GroundConform_ReorientBone_Result; // 0x2860(0x20)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_ReorientBone_ParentPosition; // 0x2880(0x18)(Edit, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	uint8                                        Pad_1DC2[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 ReorientBone___ReorientBone_If_16_Result;          // 0x28A0(0x20)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         ReorientBone___ReorientBone_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x28C0(0x1)(BlueprintVisible, BlueprintReadOnly, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1DC3[0xF];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 ReorientBone___ReorientBone_Multiply_Multiply_1_Result; // 0x28D0(0x20)(Edit, ConstParm, BlueprintReadOnly, Parm, Config, EditConst, SubobjectReference)
	struct FQuat                                 ReorientBone___ReorientBone_Multiply_Multiply_Result; // 0x28F0(0x20)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	struct FQuat                                 ReorientBone___ReorientBone_Unit_3_Result;         // 0x2910(0x20)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FQuat                                 ReorientBone___ReorientBone_MathQuaternionFromAxisAndAngle_Result; // 0x2930(0x20)(ConstParm, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               ReorientBone___ReorientBone_Unit_2_Result;         // 0x2950(0x18)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               ReorientBone___ReorientBone_MathVectorCross_Result; // 0x2968(0x18)(Edit, ExportObject, Net, EditFixedSize, Parm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               ReorientBone___ReorientBone_Unit_1_Result;         // 0x2980(0x18)(ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               ReorientBone___ReorientBone_Subtract_1_Result;     // 0x2998(0x18)(BlueprintVisible, Net, Parm, OutParm, EditConst, SubobjectReference)
	struct FVector                               ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Value; // 0x29B0(0x18)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Cache; // 0x29C8(0x10)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Found; // 0x29D8(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1DC4[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_1_Value; // 0x29E0(0x18)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	struct FRigElementKey                        ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Value; // 0x29F8(0xC)(ConstParm, ExportObject, Parm, ZeroConstructor, EditConst, SubobjectReference)
	uint8                                        Pad_1DC5[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Cache; // 0x2A08(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Transient, EditConst, SubobjectReference)
	bool                                         ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Found; // 0x2A18(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1DC6[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCachedRigElement>             ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_1_Cache; // 0x2A20(0x10)(BlueprintVisible, Parm, OutParm, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_1_Found; // 0x2A30(0x1)(BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1DC7[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               ReorientBone___ReorientBone_Unit_Result;           // 0x2A38(0x18)(Edit, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               ReorientBone___ReorientBone_Subtract_Result;       // 0x2A50(0x18)(BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	double                                       ReorientBone___ReorientBone_Acos_Result;           // 0x2A68(0x8)(Edit, ConstParm, BlueprintVisible, ReturnParm, EditConst, SubobjectReference)
	float                                        ReorientBone___ReorientBone_Dot___Result;          // 0x2A70(0x4)(BlueprintVisible, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1DC8[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       ReorientBone___ReorientBone_Acos_Value;            // 0x2A78(0x8)(ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        ReorientBone___ReorientBone_MathQuaternionFromAxisAndAngle_Angle; // 0x2A80(0x4)(BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1DC9[0xC];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Value; // 0x2A90(0x20)(ExportObject, BlueprintReadOnly, Net, ReturnParm, Transient, EditConst, SubobjectReference)
	TArray<struct FCachedRigElement>             ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Cache; // 0x2AB0(0x10)(Edit, BlueprintVisible, ReturnParm, Config, EditConst, SubobjectReference)
	bool                                         ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Found; // 0x2AC0(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1DCC[0xF];                                     // Fixing Size After Last Property  > TateDumper <
	struct FQuat                                 ReorientBone___ReorientBone_If_16_False;           // 0x2AD0(0x20)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FQuat                                 GroundConform___GroundConform_If_12_False;         // 0x2AF0(0x20)(EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FQuat                                 LocalVariable__GroundConform_TargetRotation;       // 0x2B10(0x20)(Edit, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_RigVMFunction_MathBoolOr_Result; // 0x2B30(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_RigVMFunction_MathBoolAnd_Result; // 0x2B31(0x1)(Edit, ConstParm, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_RigVMFunction_MathBoolNot_Result; // 0x2B32(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         GroundConform___GroundConform_IsNearlyEqual_Result; // 0x2B33(0x1)(Edit, Net, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1DCE[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_16_Element; // 0x2B38(0x18)(BlueprintVisible, Net, EditFixedSize, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_ToWorldCustom_1_Result; // 0x2B50(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               ToWorldCustom_1___ToWorldCustom_To_World_1_1_World; // 0x2B68(0x18)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, Transient, EditConst, SubobjectReference)
	class FName                                  GroundConform___GroundConform_Branch_11_BlockToRun; // 0x2B80(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_Element; // 0x2B88(0x18)(ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               LocalVariable__GroundConform_PreviousPosition;     // 0x2BA0(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               GroundConform___GroundConform_ToWorldCustom_Result; // 0x2BB8(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	struct FVector                               ToWorldCustom___ToWorldCustom_To_World_1_1_World;  // 0x2BD0(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_1_Result;   // 0x2BE8(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_1_A;        // 0x2BF0(0x8)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_ArrayGetAtIndex_10_Element; // 0x2BF8(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, SubobjectReference)
	double                                       GroundConform___GroundConform_Multiply_3_Result;   // 0x2C00(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, Config, EditConst, SubobjectReference)
