#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x2A0 (0xA08 - 0x768)
// WidgetBlueprintGeneratedClass MainMinimapUI_ASA.MainMinimapUI_ASA_C
class UMainMinimapUI_ASA_C : public UMinimapSubMenuUI
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x768(0x8)(Edit, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, SubobjectReference)
	class UCustomButtonWidget*                   BeforeCachedMap;                                   // 0x770(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UHorizontalBox*                        BG;                                                // 0x778(0x8)(Edit, ConstParm, ExportObject, Net, Parm, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UBorder*                               BorderExtMinimap;                                  // 0x780(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, EditConst, InstancedReference, SubobjectReference)
	class UBorder*                               BorderMinimap;                                     // 0x788(0x8)(Edit, ConstParm, Net, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UHorizontalBox*                        ButtonShowHide;                                    // 0x790(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	class UCanvasPanel*                          CanvasExternalMinimap;                             // 0x798(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	class UCanvasPanel*                          CanvasInternalMinimap;                             // 0x7A0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UCanvasPanel*                          CanvasMinimap;                                     // 0x7A8(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, EditConst, InstancedReference, SubobjectReference)
	class UHorizontalBox*                        ChangeMapBox;                                      // 0x7B0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   ClearTracking;                                     // 0x7B8(0x8)(ConstParm, BlueprintVisible, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	class UTextBlock*                            CurrentLat;                                        // 0x7C0(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UTextBlock*                            CurrentLong;                                       // 0x7C8(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UImage*                                CursorImage;                                       // 0x7D0(0x8)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UBorder*                               ExternalBorder;                                    // 0x7D8(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UImage*                                Image;                                             // 0x7E0(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance)
	class UImage*                                Image_117;                                         // 0x7E8(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, Interp, NonTransactional, NoDestructor, AutoWeak)
	class UHorizontalBox*                        LatLongBox;                                        // 0x7F0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UImage*                                LeftRightCursorLastPos;                            // 0x7F8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, EditConst, InstancedReference, SubobjectReference)
	class UCanvasPanel*                          MainCanvas;                                        // 0x800(0x8)(BlueprintReadOnly, Net, EditFixedSize, ReturnParm, EditConst, SubobjectReference)
	class UOverlay*                              MainLeftCoords;                                    // 0x808(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UOverlay*                              MainTopCoords;                                     // 0x810(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UTextBlock*                            MapSelector;                                       // 0x818(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, EditConst, InstancedReference, SubobjectReference)
	class UBorder*                               MinimapBorder;                                     // 0x820(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	class UMinimapWidget_ASA_C*                  MiniMapUi;                                         // 0x828(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   NextCachedMap;                                     // 0x830(0x8)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	class UTextBlock*                            NextPing_1;                                        // 0x838(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference, Interp)
	class UOverlay*                              OverlayAligment;                                   // 0x840(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UOverlay*                              OverlayCanvas;                                     // 0x848(0x8)(Edit, Net, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   ShowDeathsButton;                                  // 0x850(0x8)(BlueprintVisible, Net, Parm, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   ShowDinosButtons;                                  // 0x858(0x8)(Edit, ConstParm, Net, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   ShowPingsButton;                                   // 0x860(0x8)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   ShowPlayersButton;                                 // 0x868(0x8)(ConstParm, ExportObject, Parm, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   ShowWaypointsButton;                               // 0x870(0x8)(EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UImage*                                TopBottomCursorLastPos;                            // 0x878(0x8)(Edit, ConstParm, Net, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   WaypointButtons;                                   // 0x880(0x8)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	class UHorizontalBox*                        ZoomBox;                                           // 0x888(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UTextBlock*                            ZoomText;                                          // 0x890(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, EditConst, InstancedReference, SubobjectReference)
	double                                       MaxZoom;                                           // 0x898(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       MinZoom;                                           // 0x8A0(0x8)(Edit, ConstParm, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       CurrentZoom;                                       // 0x8A8(0x8)(Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector2D                             MouseCursorLocation;                               // 0x8B0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	double                                       OriginalZoomDistance;                              // 0x8C0(0x8)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	class FString                                ZoomTextString;                                    // 0x8C8(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	struct FVector2D                             OriginalMapSize;                                   // 0x8D8(0x10)(ConstParm, ExportObject, BlueprintReadOnly, EditConst, InstancedReference, SubobjectReference)
	double                                       MultiplySpeedMoveMinimap;                          // 0x8E8(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	struct FVector2D                             MaxMapMovement;                                    // 0x8F0(0x10)(ConstParm, BlueprintReadOnly, Net, Parm, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                MapMarkerSettingsClass;                            // 0x900(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	struct FVector2D                             CurrentCoord;                                      // 0x908(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         CanDragMinimap;                                    // 0x918(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         GamepadZoomIn;                                     // 0x919(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         GamepadZoomOut;                                    // 0x91A(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_532C[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	class UMapMarkerSettingsWidget_ASA_C*        MarkSettings;                                      // 0x920(0x8)(BlueprintReadOnly, EditFixedSize, Parm, EditConst, InstancedReference, SubobjectReference)
	enum class ETeamPingType                     NextPinType;                                       // 0x928(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_532D[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector2D                             MouseMinimapCoords;                                // 0x930(0x10)(ConstParm, BlueprintVisible, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	struct FLinearColor                          ColorLegendSelected;                               // 0x940(0x10)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	struct FLinearColor                          ColorLegendUnselected;                             // 0x950(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	class UPingSelectorOnMap_C*                  PingSelector;                                      // 0x960(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	struct FVector2D                             LastPingLocation;                                  // 0x968(0x10)(BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	struct FVector2D                             MapBorderScale;                                    // 0x978(0x10)(ConstParm, ExportObject, Net, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         CanShowBeds;                                       // 0x988(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         IsSpawnUI;                                         // 0x989(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_532E[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          MinimapBorderColor;                                // 0x98C(0x10)(Edit, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FLinearColor                          MinimapExtBorderColor;                             // 0x99C(0x10)(Edit, BlueprintVisible, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	struct FLinearColor                          MainCenterMapBorderColor;                          // 0x9AC(0x10)(Edit, ExportObject, Net, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_532F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            Zoom;                                              // 0x9C0(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	class FString                                Message_TextNoTribe;                               // 0x9D0(0x10)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, EditConst, InstancedReference, SubobjectReference)
	struct FVector2D                             ButtonsLegndPosition;                              // 0x9E0(0x10)(Edit, ExportObject, Net, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	double                                       GamepadZoomSpeed;                                  // 0x9F0(0x8)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	double                                       GamepadMovementSpeed;                              // 0x9F8(0x8)(Edit, BlueprintReadOnly, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	double                                       MouseZoomSpeed;                                    // 0xA00(0x8)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UMainMinimapUI_ASA_C* GetDefaultObj();

	void TimerWaitDoubleClickMap();
	int32 OpenSetupNewWaypoint(class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AShooterPlayerController** K2Node_DynamicCast_AsShooter_Player_Controller, bool* K2Node_DynamicCast_bSuccess);
	bool OnGamepadButtonDownEvent(struct FGeometry* MyGeometry, const struct FControllerEvent& ControllerEvent, bool* CallFunc_EqualEqual_KeyKey_ReturnValue, struct FEventReply* CallFunc_Handled_ReturnValue);
