#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x368 (0x698 - 0x330)
// WidgetBlueprintGeneratedClass NinjaLiveGUI.NinjaLiveGUI_C
class UNinjaLiveGUI_C : public UPrimalUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x330(0x8)(Edit, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, SubobjectReference)
	class UWidgetAnimation*                      BlinkingText1;                                     // 0x338(0x8)(ConstParm, EditFixedSize, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero01_SpinBox_BrushSize;                          // 0x340(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero02_SpinBox_BrushDensity;                       // 0x348(0x8)(BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero03_SpinBox_BrushHardness;                      // 0x350(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero04_SpinBox_BrushNoise;                         // 0x358(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero05_SpinBox_BrushRnd;                           // 0x360(0x8)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero06_SpinBox_BrushPersist;                       // 0x368(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	class UCheckBox*                             Zero07_Checkbox_BrushInvert;                       // 0x370(0x8)(BlueprintVisible, Net, EditFixedSize, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero08_SpinBox_BrushDrag;                          // 0x378(0x8)(BlueprintVisible, Net, Parm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero09_SpinBox_BrushPuncture;                      // 0x380(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero10_SpinBox_SimFeedback;                        // 0x388(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class UButton*                               Zero11_Button_SimClear;                            // 0x390(0x8)(Edit, ConstParm, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero12_SpinBox_SimSpeed;                           // 0x398(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero13_SpinBox_SimTurbulence;                      // 0x3A0(0x8)(Edit, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero14_SpinBox_VeloAmp;                            // 0x3A8(0x8)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero15_SpinBox_VeloOffsetX;                        // 0x3B0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero16_SpinBox_VeloOffsetY;                        // 0x3B8(0x8)(Edit, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero17_SpinBox_VeloAmpNoise;                       // 0x3C0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero18_SpinBox_VeloDirNoise;                       // 0x3C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero19_SpinBox_VeloDirNoiseSize;                   // 0x3D0(0x8)(BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero20_SpinBox_VeloDirNoiseOffs;                   // 0x3D8(0x8)(ConstParm, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class UComboBoxString*                       Zero21_ComboBox_VeloFromBitmap;                    // 0x3E0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero22_SpinBox_VeloRotate;                         // 0x3E8(0x8)(ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero23_SpinBox_VeloOffset;                         // 0x3F0(0x8)(BlueprintVisible, Net, Parm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero24_SpinBox_VeloTile;                           // 0x3F8(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class UBorder*                               Zero24b_Border_Warning_VelocityFromBitmap;         // 0x400(0x8)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero25_SimareaMoFx;                                // 0x408(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero25_SimareaMoOffset;                            // 0x410(0x8)(ConstParm, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class UComboBoxString*                       Zero26_ComboBox_DensFromBitmap;                    // 0x418(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class UBorder*                               Zero26b_Border_Warning_DensityFromBitmap;          // 0x420(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero27_SpinBox_DensityOffsetX;                     // 0x428(0x8)(Edit, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero28_SpinBox_DensityOffsetY;                     // 0x430(0x8)(ExportObject, Parm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero29_SpinBox_DensityTile;                        // 0x438(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class UComboBoxString*                       Zero30_ComboBox_DensFromMaterial;                  // 0x440(0x8)(Edit, BlueprintVisible, Net, OutParm, Config, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero31_SpinBox_DensityFieldAmp;                    // 0x448(0x8)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero32_SpinBox_DensityFieldAmpNois;                // 0x450(0x8)(Edit, ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero33_SpinBox_DensityFieldAmpNoisOfs;             // 0x458(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero34_SpinBox_DensityFieldAmpNoisTile;            // 0x460(0x8)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero35_SpinBox_BouncyEdges;                        // 0x468(0x8)(ConstParm, BlueprintReadOnly, Net, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero36_SpinBox_SimEdgeFadePow;                     // 0x470(0x8)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	class USpinBox*                              Zero37_SpinBox_SimEdgeFadeWidth;                   // 0x478(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	class UComboBoxString*                       Zero38_ComboBox_OutputMaterial;                    // 0x480(0x8)(ConstParm, ExportObject, Net, OutParm, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	class UButton*                               Zero39_Button_SavePaintBuffer;                     // 0x488(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class UButton*                               Zero40_Button_SaveSimBuffer;                       // 0x490(0x8)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	class UTextBlock*                            Zero41_TextBlock_MetaInfo;                         // 0x498(0x8)(BlueprintReadOnly, Parm, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	class UBorder*                               Border;                                            // 0x4A0(0x8)(ConstParm, ExportObject, ReturnParm, Config, GlobalConfig)
	class UBorder*                               Main0_StatusBorder;                                // 0x4A8(0x8)(Edit, Parm, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	class UButton*                               Main1_Button_Minimize;                             // 0x4B0(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Transient, EditConst, InstancedReference, SubobjectReference)
	class UCheckBox*                             Main2_TooltipCheckBox;                             // 0x4B8(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class UButton*                               Main3_Button_CloseProgram;                         // 0x4C0(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class UComboBoxString*                       Main4_ComboBox_MainMenu;                           // 0x4C8(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	class UComboBoxString*                       Main5_ComboBox_Presets;                            // 0x4D0(0x8)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class UButton*                               Main6_Button_OverWritePreset;                      // 0x4D8(0x8)(Edit, ConstParm, BlueprintVisible, Net, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	class UButton*                               Main7_Button_DuplicatePreset;                      // 0x4E0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	class UImage*                                MenuFrame1;                                        // 0x4E8(0x8)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class UImage*                                MenuFrame2;                                        // 0x4F0(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Transient, EditConst, InstancedReference, SubobjectReference)
	class UImage*                                MenuFrame3;                                        // 0x4F8(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	class UMultiLineEditableText*                MultiLineEditableText_MetaData;                    // 0x500(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, Config, EditConst, InstancedReference, SubobjectReference)
	class UNamedSlot*                            NamedSlot_empty;                                   // 0x508(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class UNamedSlot*                            NamedSlot_FluidNinja;                              // 0x510(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	class UTextBlock*                            TextBlock_BRUSH;                                   // 0x518(0x8)(Edit, EditFixedSize, ZeroConstructor, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	class UTextBlock*                            TextBlock_FIELDS;                                  // 0x520(0x8)(ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	class UTextBlock*                            TextBlock_SIM;                                     // 0x528(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class UButton*                               UE5SaveWarningImageButton;                         // 0x530(0x8)(ConstParm, ExportObject, Config, EditConst, InstancedReference, SubobjectReference)
	class FString                                SelectedProjectItem;                               // 0x538(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class FString                                SelectedPresetItem;                                // 0x548(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	class FString                                SelectedPresetItemTemp;                            // 0x558(0x10)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class FString                                NullString;                                        // 0x568(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, Transient, EditConst, InstancedReference, SubobjectReference)
	class FString                                DefaultSelection;                                  // 0x578(0x10)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class UNamedSlot*>                    ArrayOfWidgets;                                    // 0x588(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        Counter;                                           // 0x598(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, Config, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	int32                                        SelectedActorIndex;                                // 0x59C(0x4)(Edit, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         PresetsDetected;                                   // 0x5A0(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5A12[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnSelectionChanged;                                // 0x5A8(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Config)
	FMulticastInlineDelegateProperty_            OnPresetSelectionChanged;                          // 0x5B8(0x10)(ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, GlobalConfig)
	FMulticastInlineDelegateProperty_            OnPresetSave;                                      // 0x5C8(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	double                                       Timer;                                             // 0x5D8(0x8)(ConstParm, Net, Parm, OutParm, ZeroConstructor)
	double                                       TimerTemp;                                         // 0x5E0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         NinjaBaseArraysConstructed;                        // 0x5E8(0x1)(ExportObject, Parm, OutParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         PresetSaveOverWriteFlag;                           // 0x5E9(0x1)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5A13[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class FName>                          TempVarOfParticleTemplatePackages;                 // 0x5F0(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempVarOfDensityTemplatePackages;                  // 0x600(0x10)(ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempVarOfVelocityTemplatePackages;                 // 0x610(0x10)(BlueprintVisible, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempVarOfOutputMaterials;                          // 0x620(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FString>                        ArrayOfPresetNamesUnsorted;                        // 0x630(0x10)(Edit, ConstParm, BlueprintVisible, Net, OutParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FString>                        ArrayOfPresetNamesSorted;                          // 0x640(0x10)(Edit, ExportObject, Net, EditFixedSize, Parm, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         SaveBasicAtlasPlayer;                              // 0x650(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         SaveBasicFlowPlayer;                               // 0x651(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         NinjaViewPortToolsVisibilityFlag;                  // 0x652(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5A14[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnDensityMapSave;                                  // 0x658(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         SystemOn;                                          // 0x668(0x1)(Edit, ConstParm, ExportObject, Parm, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         RecordingStarted;                                  // 0x669(0x1)(OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5A15[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        TempVecfieldIndex;                                 // 0x66C(0x4)(ExportObject, Net, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnPresetDuplicated;                                // 0x670(0x10)(Edit, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         ForcePreferredPreset;                              // 0x680(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5A16[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class AActor*                                SelectedActor;                                     // 0x688(0x8)(ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig, InstancedReference, SubobjectReference)
	class UNinjaLiveComponent_C*                 SelectedActorComponent;                            // 0x690(0x8)(ConstParm, Net, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UNinjaLiveGUI_C* GetDefaultObj();

	class ANinjaLive_C* GetSelectedActor(class ANinjaLive_PresetManager_C* CallFunc_Array_Get_Item, class AActor* CallFunc_Array_Get_Item_1, bool* K2Node_DynamicCast_bSuccess);
	void BndEvt__ComboBoxString_89_K2Node_ComponentBoundEvent_2_OnOpeningEvent__DelegateSignature();
	enum class ESelectInfo BndEvt__ComboBoxString_89_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem);
	void Construct();
	bool PreConstruct();
	enum class ESelectInfo BndEvt__ComboBox_Presets_K2Node_ComponentBoundEvent_36_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem);
