#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xF08 (0xFC0 - 0xB8)
// BlueprintGeneratedClass NinjaLiveComponent.NinjaLiveComponent_C
class UNinjaLiveComponent_C : public UNinjaLiveBaseComponent
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xB8(0x8)(Edit, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, SubobjectReference)
	bool                                         ComponentActivatedByPawnProximity;                 // 0xC0(0x1)(Edit, BlueprintVisible, Net, Parm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         DisableComponent;                                  // 0xC1(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	bool                                         BeginPlaySupressed;                                // 0xC2(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	bool                                         InitDone;                                          // 0xC3(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	bool                                         MaterialInstacesDone;                              // 0xC4(0x1)(Edit, BlueprintVisible, Net, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         AutoConnectToMemoryPoolMinusIFMinusFound;          // 0xC5(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	bool                                         MemPoolManagerDetected;                            // 0xC6(0x1)(ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         PoolManagerOverridesLocalSettings;                 // 0xC7(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        ResolutionX;                                       // 0xC8(0x4)(ConstParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        ResolutionY;                                       // 0xCC(0x4)(Edit, ExportObject, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class FString                                PreferredTraceChannelName;                         // 0xD0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	enum class ETraceTypeQuery                   TraceChannel;                                      // 0xE0(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	enum class ECollisionChannel                 CollisionChannel;                                  // 0xE1(0x1)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         TraceChannelsSet;                                  // 0xE2(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	enum class ESimPrecision_Enum                SimPrecision;                                      // 0xE3(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	bool                                         UsePressureSolver1__DefaultIs2_;                   // 0xE4(0x1)(BlueprintReadOnly, Net, OutParm, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F03[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        PressureSolver1_MaxIterations;                     // 0xE8(0x4)(Edit, ExportObject, Parm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        PressureSolver2_MaxIterations;                     // 0xEC(0x4)(BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       PressureSolver2_KernelReduction;                   // 0xF0(0x8)(Edit, BlueprintVisible, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        MaxSamplingFPS;                                    // 0xF8(0x4)(Edit, ConstParm, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        MinSamplingFPS;                                    // 0xFC(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         HalfResPressureAndDivergenceBuffers;               // 0x100(0x1)(BlueprintVisible, ExportObject, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         ShowDebugMessagesMinusTraceChannels;               // 0x101(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         ShowDebugMessagesMinusMemoryManagement;            // 0x102(0x1)(Edit, ExportObject, BlueprintReadOnly, Parm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         ShowDebugMessagesMinusCollisionAndTracing;         // 0x103(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         ShowDebugMessagesMinusLODInitial;                  // 0x104(0x1)(ConstParm, BlueprintReadOnly, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         ShowDebugMessagesMinusLODRuntime;                  // 0x105(0x1)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         ShowDebugMessagesMinusInterfaceControl;            // 0x106(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         ShowDebugMessagesMinusRenderTargetExport;          // 0x107(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         ShowWarningMinusNumberOfBonesToTrack;              // 0x108(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         VisualizeCustomTraceSource;                        // 0x109(0x1)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         SaveDebugMessagesToDefaultLog;                     // 0x10A(0x1)(Edit, ConstParm, BlueprintVisible, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F04[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       DebugMessagesLifetime;                             // 0x110(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	class UStaticMeshComponent*                  TraceMeshComponent;                                // 0x118(0x8)(ExportObject, BlueprintReadOnly, Net, Parm, Transient, EditConst, InstancedReference, SubobjectReference)
	int32                                        SamplingFPS;                                       // 0x120(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F05[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       TickRateCustom;                                    // 0x128(0x8)(BlueprintVisible, ExportObject, Net, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         LOD1MinusReduceSimQuality;                         // 0x130(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         LOD2MinusReduceSamplingFPS;                        // 0x131(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F06[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LODMinusFarBound;                                  // 0x138(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	double                                       LODMinusNearBound;                                 // 0x140(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	int32                                        LODMinusSteps;                                     // 0x148(0x4)(BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F07[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LODMinusStepRange;                                 // 0x150(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<double>                               LODMinusStepsArray;                                // 0x158(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        SimPrecisionIndex;                                 // 0x168(0x4)(BlueprintReadOnly, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F08[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       MemConsumption;                                    // 0x170(0x8)(ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        MapLengthTmp;                                      // 0x178(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F09[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UMaterialInstance*                     InactiveGrayMaterial;                              // 0x180(0x8)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            ComponentRePlayEvent;                              // 0x188(0x10)(EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            ComponentBroadcastMemConsumption;                  // 0x198(0x10)(ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         PawnInsideActivationBounds;                        // 0x1A8(0x1)(Edit, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F0A[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UDataTable*                            LoadedDataTable;                                   // 0x1B0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class FString                                LoadedDatatablePath;                               // 0x1B8(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TMap<class FString, double>                  PresetMap;                                         // 0x1C8(0x50)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class FString                                ActualPreset;                                      // 0x218(0x10)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class UDataTable*                            DefaultPreset;                                     // 0x228(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          PresetSearchPaths;                                 // 0x230(0x10)(Edit, ConstParm, Net, EditFixedSize, Parm, Config, EditConst, InstancedReference, SubobjectReference)
	class FName                                  PresetNameFilterCriteria;                          // 0x240(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         TraceMeshInvisible;                                // 0x248(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F0B[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        OutputMaterialSelected;                            // 0x24C(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<class UMaterialInterface*>            OutputMaterials;                                   // 0x250(0x10)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         ForceAutoLoadPreset;                               // 0x260(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F0C[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class FString>                        RenderTargetsList;                                 // 0x268(0x10)(Edit, BlueprintVisible, ExportObject, OutParm, Config, EditConst, InstancedReference, SubobjectReference)
	TMap<class FString, class UTextureRenderTarget2D*> RenderTargetsMap;                                  // 0x278(0x50)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class UMaterialInstanceDynamic*              MI_Advection;                                      // 0x2C8(0x8)(Edit, BlueprintVisible, EditFixedSize, DisableEditOnTemplate, Config, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	class UMaterialInstanceDynamic*              MI_Divergence;                                     // 0x2D0(0x8)(BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst)
	class UMaterialInstanceDynamic*              MI_PressureCycle1;                                 // 0x2D8(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	class UMaterialInstanceDynamic*              MI_PressureCycle2;                                 // 0x2E0(0x8)(ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       VeloStrength;                                      // 0x2E8(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       VeloOffsetX;                                       // 0x2F0(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       VeloOffsetY;                                       // 0x2F8(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       VeloRotate;                                        // 0x300(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       VeloAmpNoise;                                      // 0x308(0x8)(Edit, ConstParm, Net, EditFixedSize, OutParm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       VeloDirNoise;                                      // 0x310(0x8)(ExportObject, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       Speed;                                             // 0x318(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  Apply1stOutMatToActorsWithTag;                     // 0x320(0x8)(Edit, ExportObject, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	class FName                                  Apply1stOutMatToComponentsWithTag;                 // 0x328(0x8)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	class FName                                  FeedTaggedActorNiagaraComponent;                   // 0x330(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         Make1stOutputAvailableFor2ndOutput;                // 0x338(0x1)(Edit, ConstParm, EditFixedSize, Parm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         Make1stOutputAvailableForNiagara;                  // 0x339(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         MakePressureAvailableForNiagara;                   // 0x33A(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F0D[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        SecondaryOutputMaterialSelected;                   // 0x33C(0x4)(ConstParm, BlueprintReadOnly, Parm, OutParm, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<class UMaterialInterface*>            SecondaryOutputMaterials;                          // 0x340(0x10)(Edit, Net, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	class FName                                  Apply2ndOutMatToActorsWithTag;                     // 0x350(0x8)(ConstParm, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	class FName                                  Apply2ndOutMatToComponentsWithTag;                 // 0x358(0x8)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        TertiaryOutputMaterialSelected;                    // 0x360(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F0E[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class UMaterialInterface*>            TertiaryOutputMaterials;                           // 0x368(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	class FName                                  Apply3rdOutMatToActorsWithTag;                     // 0x378(0x8)(ConstParm, BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	class FName                                  Apply3rdOutMatToComponentsWithTag;                 // 0x380(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         UseRenderTargetAsInput;                            // 0x388(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F0F[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UTextureRenderTarget*                  InputRenderTarget;                                 // 0x390(0x8)(BlueprintVisible, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         RGBMinusInputMaterial;                             // 0x398(0x1)(Edit, EditFixedSize, OutParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         InputMaterialClamp;                                // 0x399(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F10[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        InputMaterialSelected;                             // 0x39C(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class UMaterialInterface*>            InputMaterials;                                    // 0x3A0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         SimAreaClamp;                                      // 0x3B0(0x1)(Edit, ConstParm, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         ShowMouseCursor;                                   // 0x3B1(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F11[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Divergence;                                        // 0x3B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       InputFeedback;                                     // 0x3C0(0x8)(BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       FlowFeedback;                                      // 0x3C8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       VeloFromSimAreaMotion;                             // 0x3D0(0x8)(Edit, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	double                                       OffsetFromSimAreaMotion;                           // 0x3D8(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	double                                       VeloFromBrushMotion;                               // 0x3E0(0x8)(ConstParm, Net, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       BrushSize;                                         // 0x3E8(0x8)(ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       BrushStrength;                                     // 0x3F0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, Config, GlobalConfig, InstancedReference, SubobjectReference)
	double                                       BrushStrengthTemp1;                                // 0x3F8(0x8)(Edit, ExportObject, Net, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         EraserMode;                                        // 0x400(0x1)(Edit, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F12[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       BrushHardness;                                     // 0x408(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                ParticleTemplate;                                  // 0x410(0x10)(Edit, ConstParm, BlueprintVisible, Net, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	class FString                                DensityTemplate;                                   // 0x420(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, Transient, EditConst, InstancedReference, SubobjectReference)
	class FString                                VelocityTemplate;                                  // 0x430(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	class FString                                MetaData;                                          // 0x440(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, GlobalConfig)
	double                                       BrushPuncture;                                     // 0x450(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UMaterialInstanceDynamic*              MI_CollisionPainterDot;                            // 0x458(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	class UMaterialInstanceDynamic*              MI_CollisionPainterLine;                           // 0x460(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, Config, EditConst, InstancedReference, SubobjectReference)
	class UMaterialInstanceDynamic*              MI_CollisionPainterOffset;                         // 0x468(0x8)(ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	class UMaterialInstanceDynamic*              MI_CompositeAndGradient;                           // 0x470(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, DisableEditOnInstance, DuplicateTransient)
	class UMaterialInstanceDynamic*              MI_Output;                                         // 0x478(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class UMaterialInstanceDynamic*              MI_SecondaryOutput;                                // 0x480(0x8)(ConstParm, BlueprintVisible, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	class UMaterialInstanceDynamic*              MI_TertiaryOutput;                                 // 0x488(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	class UMaterialInstanceDynamic*              MI_Null;                                           // 0x490(0x8)(ExportObject, Parm, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	class UMaterialInterface*                    NullMaterial;                                      // 0x498(0x8)(BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	class FName                                  NullName;                                          // 0x4A0(0x8)(Edit, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	class FString                                NullString;                                        // 0x4A8(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, Transient, EditConst, InstancedReference, SubobjectReference)
	class UTexture2D*                            VelocityInput;                                     // 0x4B8(0x8)(BlueprintVisible, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class UTexture2D*                            DensityInput;                                      // 0x4C0(0x8)(ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         FlipRenderTargetsForMobile;                        // 0x4C8(0x1)(BlueprintVisible, Net, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         SelfServiceMinusIFMinusPoolEmpty;                  // 0x4C9(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F13[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class UBoxComponent*                         ActivationVolume;                                  // 0x4D0(0x8)(Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	bool                                         AutonomousMode;                                    // 0x4D8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         AbsPathForVelocityTemplate;                        // 0x4D9(0x1)(BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         AbsPathForDensityTemplate;                         // 0x4DA(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F14[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	TMap<int32, class UPrimitiveComponent*>      SkeletalMeshMinusTempArrayMinusPairs;              // 0x4E0(0x50)(ConstParm, ExportObject, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class UPrimitiveComponent*>           OverlappingComponents;                             // 0x530(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	TArray<class USkeletalMeshComponent*>        ContinuousInteractionSkeletalComponent;            // 0x540(0x10)(Edit, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<bool>                                 ListOfAvailableTempArrays;                         // 0x550(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class UPrimitiveComponent*                   OverlappingSkeletalMesh;                           // 0x560(0x8)(BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	class FName                                  OverlappingBone;                                   // 0x568(0x8)(Edit, ConstParm, Net, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               Position1_3D;                                      // 0x570(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               LastPosition1_3D;                                  // 0x588(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       TraceMeshSizeCoeff;                                // 0x5A0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       OverlappingMeshSizeCoeff;                          // 0x5A8(0x8)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	class UPrimitiveComponent*                   OverlappingComponent;                              // 0x5B0(0x8)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        TouchLookupIndex;                                  // 0x5B8(0x4)(Edit, Net, EditFixedSize, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F15[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FLinearColor>                  LastPosition3_2D;                                  // 0x5C0(0x10)(Edit, ConstParm, Net, EditFixedSize, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	struct FLinearColor                          LastPosition2_2D;                                  // 0x5D0(0x10)(BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         MousePass;                                         // 0x5E0(0x1)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F16[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          Position2_2D;                                      // 0x5E4(0x10)(ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F17[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FLinearColor>                  Position3_2D;                                      // 0x5F8(0x10)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        PosDataType;                                       // 0x608(0x4)(ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         ShowVelocityDebugCone;                             // 0x60C(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         IgnoreInterfaceCommands;                           // 0x60D(0x1)(BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         DisableAndNotTickBlock;                            // 0x60E(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F18[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       InputFeedbackInterface;                            // 0x610(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       BrushStrengthTemp2;                                // 0x618(0x8)(ConstParm, ExportObject, Parm, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         TickBlocker;                                       // 0x620(0x1)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F19[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        FluidSolver1Iterations;                            // 0x624(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<class AActor*>                        NinjaLIVETraceExclude;                             // 0x628(0x10)(Net, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       DeltaSeconds;                                      // 0x638(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         UseUnrealNativeEventTick;                          // 0x640(0x1)(BlueprintReadOnly, Net, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         SingleInput;                                       // 0x641(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         Touch;                                             // 0x642(0x1)(BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_5F1A[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LODMinusCheckFrequency;                            // 0x648(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         PauseSimWhenNotVisible;                            // 0x650(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F1B[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       WaitBeforePause;                                   // 0x658(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         MousePressed;                                      // 0x660(0x1)(Edit, ConstParm, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	bool                                         ContinuousInteractionWithOwnerActor;               // 0x661(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F1C[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          Position1_2D;                                      // 0x664(0x10)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F1D[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       TimeSinceLastClick;                                // 0x678(0x8)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         Position1_3D_Static;                               // 0x680(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F1E[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       TimeSinceLastCollision;                            // 0x688(0x8)(Edit, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       TimeCounter;                                       // 0x690(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         Overlap1;                                          // 0x698(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F1F[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            ComponentShutdownEvent;                            // 0x6A0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<enum class EObjectTypeQuery>          ContinuousInteractionInclusiveObjType;             // 0x6B0(0x10)(Edit, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          ContinuousInteractionComponentNamesExact;          // 0x6C0(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          ContinuousInteractionBoneNamesExact;               // 0x6D0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          ContinuousInteractionBoneNamesExactTemp;           // 0x6E0(0x10)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         SingleTargetMode;                                  // 0x6F0(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	enum class ESingleObjectType_Enum            SingleTargetType;                                  // 0x6F1(0x1)(ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F20[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        SingleTargetModeSkeletalMeshIndex;                 // 0x6F4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         SingleTargetMoveSetSimSpeed;                       // 0x6F8(0x1)(Edit, Net, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F21[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SpeedInfluenceFactor;                              // 0x700(0x8)(Edit, ConstParm, EditFixedSize, OutParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       ClampMaxVelocity;                                  // 0x708(0x8)(Parm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         CameraFacingTraceMesh;                             // 0x710(0x1)(BlueprintReadOnly, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         OverlapBasedInteraction;                           // 0x711(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, Transient, EditConst, InstancedReference, SubobjectReference)
	enum class EUserInput_Enum                   UserInputBasedInteraction;                         // 0x712(0x1)(Edit, EditFixedSize, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         BrushScaledInverselyByTraceMeshSize;               // 0x713(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         BrushScaledByInteractingObjSize;                   // 0x714(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         UseObjBoundsInsteadOfSize;                         // 0x715(0x1)(BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F22[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       GlobalBrushScale;                                  // 0x718(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	double                                       UserInputBrushScale;                               // 0x720(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       PrimitiveObjBrushScale;                            // 0x728(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       SkeletalMeshBrushScale;                            // 0x730(0x8)(Edit, ConstParm, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         CameraFacing_LockYMinusAxis;                       // 0x738(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         UseLegacyCameraFacing;                             // 0x739(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F23[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        TraceMeshTranslucentSortPrio;                      // 0x73C(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        TraceMeshQueryCounter;                             // 0x740(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F24[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LimitUnrealNativeEventTick;                        // 0x748(0x8)(Edit, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         GlobalVeloTempCondition;                           // 0x750(0x1)(BlueprintVisible, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F25[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               TracePositionTemp;                                 // 0x758(0x18)(Edit, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               LastTracePositionTemp;                             // 0x770(0x18)(ConstParm, EditFixedSize, Parm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       SimEdgeBouncyness;                                 // 0x788(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       FadeDensityAtSimEdge;                              // 0x790(0x8)(ConstParm, BlueprintReadOnly, OutParm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       EdgeMaskWidth;                                     // 0x798(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       VeloDirNoiseSize;                                  // 0x7A0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       VeloDirNoiseSpeed;                                 // 0x7A8(0x8)(ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         UseInputMaterials;                                 // 0x7B0(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F26[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       DensityTxtScale;                                   // 0x7B8(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       DensityTxtOffsetX;                                 // 0x7C0(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       DensityTxtOffsetY;                                 // 0x7C8(0x8)(ConstParm, Net, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       BrushNoise;                                        // 0x7D0(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         BrushNoiseInWorldSpace;                            // 0x7D8(0x1)(Edit, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F27[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       BrushDensityNoiseScale;                            // 0x7E0(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       BrushDensityNoiseFreq;                             // 0x7E8(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       BrushVelocityNoiseScale;                           // 0x7F0(0x8)(ConstParm, BlueprintVisible, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       BrushVelocityNoiseFreq;                            // 0x7F8(0x8)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	struct FRotator                              TraceMeshInitialRotation;                          // 0x800(0x18)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         EnableRayMarching;                                 // 0x818(0x1)(ConstParm, BlueprintVisible, Parm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F28[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class AActor*                                LightDirectionProvider;                            // 0x820(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         LightDirectionSourceIsRotation_NOT_Pos;            // 0x828(0x1)(Net, Parm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         DistanceBasedLightAttenuation;                     // 0x829(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F29[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       AttenuationPower;                                  // 0x830(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       PointLightMovementMultiplier;                      // 0x838(0x8)(Edit, ConstParm, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         TwoSidedShading;                                   // 0x840(0x1)(Edit, ConstParm, ExportObject, Net, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F2A[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       TwoSideBlendPow;                                   // 0x848(0x8)(Edit, ConstParm, Net, Parm, OutParm, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       Facing;                                            // 0x850(0x8)(Edit, Net, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               OffsetLightVector;                                 // 0x858(0x18)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         ForceManualSunPosition;                            // 0x870(0x1)(Edit, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F2B[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SunLatitude;                                       // 0x878(0x8)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       SunLongitude;                                      // 0x880(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       SunHeight;                                         // 0x888(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         ShowLightDirectionVector__Yellow_;                 // 0x890(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         ShowNiagaraSysUpvector__Red_;                      // 0x891(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         ShowFacingPlane;                                   // 0x892(0x1)(Edit, ConstParm, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         PrintFacing;                                       // 0x893(0x1)(Edit, Net, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F2C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       VeloInputTile;                                     // 0x898(0x8)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       VeloInputOffsetSpeed;                              // 0x8A0(0x8)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       DensityTxtMult;                                    // 0x8A8(0x8)(ConstParm, ExportObject, Net, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       DensityInputNoiseAmp;                              // 0x8B0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	double                                       DensityInputNoiseOffset;                           // 0x8B8(0x8)(ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	double                                       DensityInputNoiseTile;                             // 0x8C0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	class UMaterialParameterCollection*          SetInternalParamsToMaterialParamCollection;        // 0x8C8(0x8)(Parm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         DrawInternalRenderTargetToExternal;                // 0x8D0(0x1)(ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F2D[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<enum class ERenderTargetList>         InternalRenderTargetsToExport;                     // 0x8D8(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<class UTextureRenderTarget2D*>        ExternalRenderTargets;                             // 0x8E8(0x10)(ExportObject, Net, Parm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	class UTexture*                              CollisionMask;                                     // 0x8F8(0x8)(Edit, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance)
	bool                                         CollisionMaskIsNonDefault;                         // 0x900(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F2E[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class ASceneCapture2D*                       InputSceneCaptureCamera;                           // 0x908(0x8)(EditFixedSize, Parm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	class UMediaPlayer*                          InputMediaPlayer;                                  // 0x910(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	class UMediaTexture*                         MediaTexture;                                      // 0x918(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
	class UFileMediaSource*                      InputMediaSource;                                  // 0x920(0x8)(Edit, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       InputMediaLoopLength;                              // 0x928(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         RandomizeNoiseOffsets;                             // 0x930(0x1)(Edit, ConstParm, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F2F[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        OverlapCounter;                                    // 0x934(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         RandomizeDensityTextureOffset;                     // 0x938(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F30[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UTexture2D*                            OverwritePresetDensityInput;                       // 0x940(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	class UTexture2D*                            OverwritePresetVelocityInput;                      // 0x948(0x8)(ExportObject, Net, OutParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       BrushRnd;                                          // 0x950(0x8)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	double                                       SimSpeedAdjustmentLatency;                         // 0x958(0x8)(BlueprintReadOnly, Parm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       SpeedTemp;                                         // 0x960(0x8)(Edit, BlueprintVisible, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         StopUsingPainterCanvasWhenIdle;                    // 0x968(0x1)(Edit, Net, Parm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F31[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        Experimental_PSolver2KernelIndexOffset;            // 0x96C(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       Experimental_PressureFeedback;                     // 0x970(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         TraceMeshIsAlsoInteractionVolume;                  // 0x978(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F32[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class FName>                          TempArray0;                                        // 0x980(0x10)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray1;                                        // 0x990(0x10)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray2;                                        // 0x9A0(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray3;                                        // 0x9B0(0x10)(Edit, ConstParm, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray4;                                        // 0x9C0(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray5;                                        // 0x9D0(0x10)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray6;                                        // 0x9E0(0x10)(ConstParm, BlueprintVisible, Parm, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray7;                                        // 0x9F0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray8;                                        // 0xA00(0x10)(BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray9;                                        // 0xA10(0x10)(Edit, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray10;                                       // 0xA20(0x10)(Edit, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray11;                                       // 0xA30(0x10)(Edit, ConstParm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray12;                                       // 0xA40(0x10)(ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray13;                                       // 0xA50(0x10)(Edit, BlueprintVisible, EditFixedSize, Parm, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray14;                                       // 0xA60(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray15;                                       // 0xA70(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray16;                                       // 0xA80(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray17;                                       // 0xA90(0x10)(ConstParm, Net, EditFixedSize, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray18;                                       // 0xAA0(0x10)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray19;                                       // 0xAB0(0x10)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray20;                                       // 0xAC0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         UseCustomTraceSource;                              // 0xAD0(0x1)(Edit, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F33[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               CustomTraceSourcePosition;                         // 0xAD8(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray21;                                       // 0xAF0(0x10)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray22;                                       // 0xB00(0x10)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray23;                                       // 0xB10(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray24;                                       // 0xB20(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray25;                                       // 0xB30(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray26;                                       // 0xB40(0x10)(ExportObject, OutParm, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray27;                                       // 0xB50(0x10)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray28;                                       // 0xB60(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray29;                                       // 0xB70(0x10)(BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray30;                                       // 0xB80(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray31;                                       // 0xB90(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray32;                                       // 0xBA0(0x10)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray33;                                       // 0xBB0(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray34;                                       // 0xBC0(0x10)(BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray35;                                       // 0xBD0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray36;                                       // 0xBE0(0x10)(Edit, ExportObject, Net, EditFixedSize, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray37;                                       // 0xBF0(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray38;                                       // 0xC00(0x10)(Edit, ConstParm, Parm, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          TempArray39;                                       // 0xC10(0x10)(Edit, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	double                                       DampenBrushBelowThisVelocity;                      // 0xC20(0x8)(BlueprintVisible, EditFixedSize, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         DampenIgnoresStaticMeshes;                         // 0xC28(0x1)(Edit, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F34[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       DampenBrushFactor;                                 // 0xC30(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       BrushVelocityPow;                                  // 0xC38(0x8)(ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       SimAreaMotionEffectsBrushPuncture;                 // 0xC40(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        LODLevel;                                          // 0xC48(0x4)(ExportObject, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         AllowAbsoluteBlackDensity;                         // 0xC4C(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F35[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               TraceMeshPos;                                      // 0xC50(0x18)(Edit, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FVector                               TraceMeshLastPos;                                  // 0xC68(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       PressureEdgeMasking;                               // 0xC80(0x8)(Edit, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class UMaterialInterface*>            CoreSimMaterials;                                  // 0xC88(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               TraceMeshDeltaPos;                                 // 0xC98(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               NullVector;                                        // 0xCB0(0x18)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         InteractionVolumeIsPresent;                        // 0xCC8(0x1)(Net, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F36[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               TraceMeshPosInitialLocal;                          // 0xCD0(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               TraceMeshPosInitialFractionalPart;                 // 0xCE8(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               TraceMeshPosInitialWorld;                          // 0xD00(0x18)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        QuantizerStepSize;                                 // 0xD18(0x4)(BlueprintReadOnly, Net, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F37[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               TraceMeshParentPos;                                // 0xD20(0x18)(ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               TraceMeshParentLastPos;                            // 0xD38(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	enum class EQuantizerMode                    TraceMeshMovingInWorldSpace;                       // 0xD50(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	enum class EQuantizerAxisIgnore              MovementNotQuantizedToStepsOnAxis;                 // 0xD51(0x1)(ConstParm, BlueprintVisible, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         SecondaryMaterialsPresent;                         // 0xD52(0x1)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	enum class EQuantizerAxisIgnore              MovementIsLockedOnThisAxis;                        // 0xD53(0x1)(Edit, Net, Parm, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         ForceTraceMeshToCustomVerticalPos;                 // 0xD54(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F38[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       ForceTraceMeshVerticalPosition;                    // 0xD58(0x8)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         EnablePaintBufferOffsetInWorldSpace;               // 0xD60(0x1)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         SimplePainterMode;                                 // 0xD61(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F39[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class UBoxComponent*                         InteractionVolume;                                 // 0xD68(0x8)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         NiagaraSystemsPresent;                             // 0xD70(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F3A[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class UNiagaraComponent*>             NiagaraSystemsToDrive;                             // 0xD78(0x10)(Edit, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       Exp_PressureFeedbackComponent;                     // 0xD88(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       Exp_DivergenceFeedbackComponent;                   // 0xD90(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         Force8bitSimplePainterBuffers;                     // 0xD98(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         Force8bitOutputBuffer;                             // 0xD99(0x1)(Edit, ConstParm, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F3B[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class UPrimitiveComponent*                   SingleTarget;                                      // 0xDA0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         UE5EAFLAG;                                         // 0xDA8(0x1)(Edit, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         Force2xResolutionOutputBuffer;                     // 0xDA9(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         ForceMaxSamplingFPSMinusToNiagara;                 // 0xDAA(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         MaterialCollectionPresent;                         // 0xDAB(0x1)(ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F3C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            WorldSpaceOffset;                                  // 0xDB0(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         TertiaryMaterialsPresent;                          // 0xDC0(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         SupressUE51TextureSmearing;                        // 0xDC1(0x1)(ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F3D[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class ANinjaLive_MemoryPoolManager_C*        Memory_Pool_Manager;                               // 0xDC8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         ASA_Use_Compute_Draw;                              // 0xDD0(0x1)(Edit, ExportObject, Parm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         UsePrimalFluidInteractionStruct;                   // 0xDD1(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         EnablePrimalTick;                                  // 0xDD2(0x1)(ExportObject, Net, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         HadInteractionsLastFrame;                          // 0xDD3(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F3E[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UTextureRenderTarget2D*                RT_foam_advected;                                  // 0xDD8(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	class UMaterialInstanceDynamic*              MID_advect_texture;                                // 0xDE0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Config, EditConst, InstancedReference, SubobjectReference)
	class UMaterialInstanceDynamic*              MID_RT_copy;                                       // 0xDE8(0x8)(Edit, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	class UTexture*                              T_init_color_to_advect;                            // 0xDF0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	class UMaterialInstanceDynamic*              MID_foam_generate;                                 // 0xDF8(0x8)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	class UTextureRenderTarget2D*                RT_foam;                                           // 0xE00(0x8)(BlueprintVisible, Net, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         Enable_Foam_Advect;                                // 0xE08(0x1)(Edit, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_5F3F[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                Visualize_RT_name__on_MIC_RT_vizualize_;           // 0xE10(0x10)(EditFixedSize, OutParm, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FVector>                       ASA_Positions;                                     // 0xE20(0x10)(Edit, OutParm, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FVector>                       ASA_Last_Positions;                                // 0xE30(0x10)(Edit, ConstParm, BlueprintVisible, OutParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	class UTextureRenderTarget2D*                RT_FI_sources;                                     // 0xE40(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, InstancedReference, SubobjectReference)
	class UMaterialInstanceDynamic*              MID_FI_sources_inject;                             // 0xE48(0x8)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	class APrimalFoliageSolver*                  PrimalFoliageActor;                                // 0xE50(0x8)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       ASA_Max_Distance_Per_Second;                       // 0xE58(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<class UMaterialInstanceDynamic*>      ASA_MI_All;                                        // 0xE60(0x10)(Edit, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	struct FGlobalMaterialParamOverrides         ASA_Water_Interaction_Globals;                     // 0xE70(0xF0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	class UMaterialInterface*                    ASA_GDF_Material;                                  // 0xF60(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	class UMaterialInstanceDynamic*              MID_GDF;                                           // 0xF68(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, EditConst, InstancedReference, SubobjectReference)
	TMap<class FName, class FString>             NinjaRTLookup;                                     // 0xF70(0x50)(ExportObject, Net, EditFixedSize, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UNinjaLiveComponent_C* GetDefaultObj();

	bool ASA_GDF_add_to_MIDs(TArray<class UMaterialInstanceDynamic*>* Mids, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, class UMaterialInstanceDynamic* CallFunc_Array_Get_Item, const class FString& Temp_string_Variable);
	class UMaterialInstanceDynamic* ASA_GDF_init_MIDs();
	void ASA_GDF_init_RTs(class UTextureRenderTarget2D** Temp_object_Variable, const class FString& Temp_string_Variable);
