#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x541 (0xD21 - 0x7E0)
// WidgetBlueprintGeneratedClass OptionsMenu.OptionsMenu_C
class UOptionsMenu_C : public UUI_OptionsMenu
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x7E0(0x8)(Edit, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, SubobjectReference)
	class UWidgetAnimation*                      Close;                                             // 0x7E8(0x8)(ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst)
	class UWidgetAnimation*                      Open;                                              // 0x7F0(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, Transient, Config, EditConst)
	class UKeyInputWidget*                       AccessInventory;                                   // 0x7F8(0x8)(ConstParm, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UCheckBox*                             AllowCrosshairCheckbox;                            // 0x800(0x8)(ExportObject, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             AllowHitMarkersCheckbox;                           // 0x808(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       AltFire;                                           // 0x810(0x8)(Edit, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class USlider*                               AmbientSoundVolumeSlider;                          // 0x818(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UComboBoxString*                       AntiAliasingComboBox;                              // 0x820(0x8)(Net, Parm, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class USlider*                               AudioVolumeSlider;                                 // 0x828(0x8)(EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig)
	class UImage*                                BG;                                                // 0x830(0x8)(Edit, ConstParm, ExportObject, Net, Parm, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             BloomCheckbox;                                     // 0x838(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       CallAggressive;                                    // 0x840(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       CallAttackTarget;                                  // 0x848(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       CallFollow;                                        // 0x850(0x8)(BlueprintReadOnly, Net, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       CallFollowOne;                                     // 0x858(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       CallNeutral;                                       // 0x860(0x8)(ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       CallPassive;                                       // 0x868(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       CallStay;                                          // 0x870(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       CallStayOne;                                       // 0x878(0x8)(ConstParm, BlueprintVisible, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UCheckBox*                             CameraBobCheckbox;                                 // 0x880(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class USlider*                               CameraShakeScaleSlider;                            // 0x888(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCustomButtonWidget*                   CancelButton;                                      // 0x890(0x8)(BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       CharacterActionWheel;                              // 0x898(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class USlider*                               CharacterVolumeSlider;                             // 0x8A0(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             ChatBubblesCheckbox;                               // 0x8A8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             ChatShowSteamNameCheckbox;                         // 0x8B0(0x8)(ConstParm, ExportObject, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             ChatShowTribeNameCheckbox;                         // 0x8B8(0x8)(Edit, ConstParm, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UComboBoxString*                       ClientNetSpeedComboBox;                            // 0x8C0(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UButton*                               CloseGamepadControlsButton;                        // 0x8C8(0x8)(BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             ColorizedItemNamesCheckbox;                        // 0x8D0(0x8)(BlueprintVisible, Net, Parm, ZeroConstructor, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UImage*                                ControlsImage;                                     // 0x8D8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UImage*                                CreatureBottomBorder;                              // 0x8E0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, EditConst, GlobalConfig, SubobjectReference)
	class UImage*                                CreatureTopBorder;                                 // 0x8E8(0x8)(Net, EditFixedSize, OutParm, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       Crouch;                                            // 0x8F0(0x8)(EditFixedSize, Parm, DisableEditOnTemplate, Config, GlobalConfig)
	class UCheckBox*                             DisableSubtitlesCheckbox;                          // 0x8F8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             DistanceFieldShadowingCheckbox;                    // 0x900(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       Drag;                                              // 0x908(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance)
	class UKeyInputWidget*                       DropItem;                                          // 0x910(0x8)(ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             DynamicTessCheckbox;                               // 0x918(0x8)(ConstParm, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       EmoteKey1;                                         // 0x920(0x8)(Edit, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       EmoteKey2;                                         // 0x928(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UCheckBox*                             EnableBloodEffectsCheckbox;                        // 0x930(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UButton*                               EnableHMDButton;                                   // 0x938(0x8)(ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             FilmGrainCheckbox;                                 // 0x940(0x8)(Edit, ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       Fire;                                              // 0x948(0x8)(Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UCheckBox*                             FirstPersonRidingCheckbox;                         // 0x950(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             FloatingNamesCheckbox;                             // 0x958(0x8)(Edit, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       ForceCraftButton;                                  // 0x960(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UCheckBox*                             ForceTPVCameraOffsetCheckbox;                      // 0x968(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class USlider*                               FOVSlider;                                         // 0x970(0x8)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UImage*                                FrontOverlayAdditive;                              // 0x978(0x8)(ConstParm, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UButton*                               GamepadControlsButton;                             // 0x980(0x8)(ConstParm, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UImage*                                GamepadImage;                                      // 0x988(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class USlider*                               GammaCorrectionSlider;                             // 0x990(0x8)(ExportObject, Net, OutParm, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       GiveDefaultWeapon;                                 // 0x998(0x8)(Edit, ConstParm, Net, OutParm, DisableEditOnTemplate, Transient, GlobalConfig)
	class UComboBoxString*                       GraphicsQualityComboBox;                           // 0x9A0(0x8)(ConstParm, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UBorder*                               GraphicsQualityHelpTooltip;                        // 0x9A8(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class USlider*                               GroundClutterDensitySlider;                        // 0x9B0(0x8)(Edit, ExportObject, Parm, OutParm, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UEditableTextBox*                      HeightTextBox;                                     // 0x9B8(0x8)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             HideFloatingPlayerNamesCheckbox;                   // 0x9C0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             HideGamepadItemSelectionModifierCheckbox;          // 0x9C8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             HideServerInfoCheckbox;                            // 0x9D0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             HighQualityMaterialsCheckbox;                      // 0x9D8(0x8)(Parm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             HighQualitySurfacesCheckbox;                       // 0x9E0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             HighQualityVFXCheckbox;                            // 0x9E8(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UImage*                                Image_0;                                           // 0x9F0(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, RepNotify)
	class UImage*                                Image_1;                                           // 0x9F8(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, Interp)
	class UImage*                                Image_8;                                           // 0xA00(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, RepNotify, EditorOnly)
	class UImage*                                Image_11;                                          // 0xA08(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, NonTransactional, EditorOnly)
	class UImage*                                Image_43;                                          // 0xA10(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, NonTransactional, EditorOnly)
	class UImage*                                Image_92;                                          // 0xA18(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, RepNotify, NonTransactional, EditorOnly, NoDestructor, AutoWeak)
	class UImage*                                Image_241;                                         // 0xA20(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, Interp, NoDestructor, AutoWeak, ContainsInstancedReference)
	class UImage*                                Image_242;                                         // 0xA28(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, RepNotify, Interp, NoDestructor, AutoWeak, ContainsInstancedReference)
	class UImage*                                Image_256;                                         // 0xA30(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, RepNotify, AssetRegistrySearchable)
	class UImage*                                Image_265;                                         // 0xA38(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, Interp, EditorOnly, AssetRegistrySearchable)
	class UImage*                                Image_269;                                         // 0xA40(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, Interp, NonTransactional, EditorOnly, AssetRegistrySearchable)
	class UImage*                                Image_276;                                         // 0xA48(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, RepNotify, NonTransactional, NoDestructor, AssetRegistrySearchable)
	class UImage*                                Image_320;                                         // 0xA50(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, RepNotify, AutoWeak, AssetRegistrySearchable)
	class UImage*                                Image_487;                                         // 0xA58(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditorOnly, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	class UImage*                                Image_488;                                         // 0xA60(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, RepNotify, EditorOnly, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable)
	class UImage*                                Image_551;                                         // 0xA68(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditorOnly, SimpleDisplay)
	class UImage*                                Image_609;                                         // 0xA70(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, Interp, AutoWeak, SimpleDisplay)
	class UImage*                                Image_921;                                         // 0xA78(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, Interp, EditorOnly, NoDestructor, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay)
	class UImage*                                Image_922;                                         // 0xA80(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, RepNotify, Interp, EditorOnly, NoDestructor, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay)
	class UImage*                                Image_1544;                                        // 0xA88(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, RepNotify, EditorOnly, SimpleDisplay, AdvancedDisplay)
	class UImage*                                Image_1545;                                        // 0xA90(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, Interp, EditorOnly, SimpleDisplay, AdvancedDisplay)
	class UCheckBox*                             InvertMouse;                                       // 0xA98(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig)
	class UCheckBox*                             JoinNotificationsCheckbox;                         // 0xAA0(0x8)(ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       Jump;                                              // 0xAA8(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, DisableEditOnTemplate, Config, GlobalConfig)
	class UCheckBox*                             LightShaftsCheckbox;                               // 0xAB0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class USlider*                               LODScalarSlider;                                   // 0xAB8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       LookDown;                                          // 0xAC0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class USlider*                               LookLeftRightSensitivitySlider;                    // 0xAC8(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       LookUp;                                            // 0xAD0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class USlider*                               LookUpDownSensitivitySlider;                       // 0xAD8(0x8)(Edit, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       MoveBackward;                                      // 0xAE0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       MoveForward;                                       // 0xAE8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst)
	class USlider*                               MusicSlider;                                       // 0xAF0(0x8)(ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             NoTooltipDelayCheckbox;                            // 0xAF8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       OpenMapMarkers;                                    // 0xB00(0x8)(Edit, BlueprintVisible, ExportObject, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   OpenModShopButton;                                 // 0xB08(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       OrbitCam;                                          // 0xB10(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance)
	class UKeyInputWidget*                       OrbitCamToggle;                                    // 0xB18(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, GlobalConfig)
	class UCheckBox*                             PlayActionWheelClickSoundCheckbox;                 // 0xB20(0x8)(ConstParm, BlueprintVisible, ExportObject, Parm, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       Poop;                                              // 0xB28(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, Transient, Config, GlobalConfig)
	class UComboBoxString*                       PostProcessingComboBox;                            // 0xB30(0x8)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       Prone;                                             // 0xB38(0x8)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, GlobalConfig)
	class UKeyInputWidget*                       PushToTalk;                                        // 0xB40(0x8)(Edit, ConstParm, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UCheckBox*                             QuickToggleItemNamesCheckbox;                      // 0xB48(0x8)(Edit, ConstParm, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       Reload;                                            // 0xB50(0x8)(Edit, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UButton*                               RepositionHMDViewButton;                           // 0xB58(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCustomButtonWidget*                   ResetButton;                                       // 0xB60(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, GlobalConfig, SubobjectReference)
	class UCustomButtonWidget*                   ResetIntroCinematicsButton;                        // 0xB68(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UButton*                               ResetTutorials;                                    // 0xB70(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, GlobalConfig)
	class USlider*                               ResolutionScaleSlider;                             // 0xB78(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UComboBoxString*                       ResolutionsComboBox;                               // 0xB80(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       Run;                                               // 0xB88(0x8)(ConstParm, BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	class UKeyInputWidget*                       RunToggle;                                         // 0xB90(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class USlider*                               SFXSlider;                                         // 0xB98(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UComboBoxString*                       ShadowsComboBox;                                   // 0xBA0(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             ShowBiomeWallsCheckbox;                            // 0xBA8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             ShowChatCheckbox;                                  // 0xBB0(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       ShowExtendedInfo;                                  // 0xBB8(0x8)(Edit, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       ShowLocalChat;                                     // 0xBC0(0x8)(Edit, ConstParm, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       ShowMyCraftables;                                  // 0xBC8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       ShowMyInventory;                                   // 0xBD0(0x8)(Edit, ConstParm, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       ShowTribeChat;                                     // 0xBD8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       ShowTribeManager;                                  // 0xBE0(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UCheckBox*                             SSAOCheckbox;                                      // 0xBE8(0x8)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             StatusNotificationMessagesCheckbox;                // 0xBF0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       StrafeLeft;                                        // 0xBF8(0x8)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       StrafeRight;                                       // 0xC00(0x8)(Edit, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       Targeting;                                         // 0xC08(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UCheckBox*                             TemperatureFCheckbox;                              // 0xC10(0x8)(ConstParm, BlueprintVisible, Net, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UComboBoxString*                       TerrainShadowComboBox;                             // 0xC18(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UComboBoxString*                       TexturesComboBox;                                  // 0xC20(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       ToggleAutoChat;                                    // 0xC28(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       ToggleConsole;                                     // 0xC30(0x8)(Edit, ConstParm, OutParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             ToggleExtendedHUDInfoCheckbox;                     // 0xC38(0x8)(Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       ToggleHUDHidden;                                   // 0xC40(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       ToggleMap;                                         // 0xC48(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UCheckBox*                             ToggleToTalkCheckBox;                              // 0xC50(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCheckBox*                             TorporEffectCheckbox;                              // 0xC58(0x8)(Edit, ConstParm, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class USlider*                               TrueSkyQualitySlider;                              // 0xC60(0x8)(EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       TurnLeft;                                          // 0xC68(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       TurnRight;                                         // 0xC70(0x8)(Edit, BlueprintReadOnly, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       Use;                                               // 0xC78(0x8)(Edit, ExportObject, ZeroConstructor, ReturnParm, GlobalConfig)
	class UCheckBox*                             UseDFAOCheckbox;                                   // 0xC80(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       UseItem1;                                          // 0xC88(0x8)(Edit, BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       UseItem10;                                         // 0xC90(0x8)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       UseItem2;                                          // 0xC98(0x8)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       UseItem3;                                          // 0xCA0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       UseItem4;                                          // 0xCA8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       UseItem5;                                          // 0xCB0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       UseItem6;                                          // 0xCB8(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       UseItem7;                                          // 0xCC0(0x8)(Edit, ConstParm, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       UseItem8;                                          // 0xCC8(0x8)(ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UKeyInputWidget*                       UseItem9;                                          // 0xCD0(0x8)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UCheckBox*                             VibrationCheckbox;                                 // 0xCD8(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UComboBoxString*                       ViewDistanceComboBox;                              // 0xCE0(0x8)(ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class USlider*                               VoiceSlider;                                       // 0xCE8(0x8)(BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       WeaponAccessory;                                   // 0xCF0(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, InstancedReference, SubobjectReference)
	class UEditableTextBox*                      WidthTextBox;                                      // 0xCF8(0x8)(BlueprintVisible, EditFixedSize, Parm, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UComboBoxString*                       WindowModeComboBox;                                // 0xD00(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UComboBoxString*                       WorldTileBufferComboBox;                           // 0xD08(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UKeyInputWidget*                       ZoomIn;                                            // 0xD10(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, Transient, Config, GlobalConfig)
	class UKeyInputWidget*                       ZoomOut;                                           // 0xD18(0x8)(Net, Parm, OutParm, ReturnParm, Transient, Config, GlobalConfig)
	bool                                         GraphicsToolTipIsVisible;                          // 0xD20(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, SubobjectReference)

	static class UClass* StaticClass();
	static class UOptionsMenu_C* GetDefaultObj();

	enum class ESelectInfo BndEvt__AntiAliasingComboBox_K2Node_ComponentBoundEvent_13_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem);
	enum class ESelectInfo BndEvt__PostProcessingComboBox_K2Node_ComponentBoundEvent_20_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem);
	enum class ESelectInfo BndEvt__ShadowsComboBox_K2Node_ComponentBoundEvent_28_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem);
