#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1B1 (0x2B11 - 0x2960)
// BlueprintGeneratedClass PlayerPawnTest.PlayerPawnTest_C
class APlayerPawnTest_C : public AShooterCharacter
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x2960(0x8)(Edit, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, SubobjectReference)
	class USkeletalMeshComponent*                SecondaryImplantTPVSkeletalMesh;                   // 0x2968(0x8)(Net, OutParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class USkeletalMeshComponent*                ImplantTPVSkeletalMesh;                            // 0x2970(0x8)(Edit, ConstParm, BlueprintVisible, Net, Parm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_RightFoot_FI;    // 0x2978(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_LeftFoot_FI;     // 0x2980(0x8)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_Torso_FI;        // 0x2988(0x8)(ExportObject, BlueprintReadOnly, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_RightFoot;       // 0x2990(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_LeftFoot;        // 0x2998(0x8)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_RightArm;        // 0x29A0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base1_Head;           // 0x29A8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base1_LeftArm;        // 0x29B0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_Torso;           // 0x29B8(0x8)(Edit, ConstParm, Parm, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class UNS_DinoFootprint_BP_C*                NS_DinoFootprint_BP;                               // 0x29C0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_HandR_FPV;       // 0x29C8(0x8)(Edit, BlueprintReadOnly, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_HandL_FPV;       // 0x29D0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_TorsoFPV;        // 0x29D8(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class USkeletalMeshComponent*                SecondaryMesh1P;                                   // 0x29E0(0x8)(Edit, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class USphereComponent*                      StasisComponent;                                   // 0x29E8(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance)
	class UPrimalInventoryComponent*             PrimalInventory1;                                  // 0x29F0(0x8)(BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        NumAscensions;                                     // 0x29F8(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_3C7A[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<TSoftObjectPtr<class USkeletalMesh>>  AscensionMeshesFPV;                                // 0x2A00(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<TSoftObjectPtr<class UStaticMesh>>    AscensionMeshesTPV;                                // 0x2A10(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<class UClass*>                        AlphaAscensionEngrams;                             // 0x2A20(0x10)(BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        NumAscensionsAb;                                   // 0x2A30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_3C7C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<TSoftObjectPtr<class UStaticMesh>>    AscensionMeshesTPV_Ab;                             // 0x2A38(0x10)(Edit, BlueprintVisible, Net, EditFixedSize, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<TSoftObjectPtr<class USkeletalMesh>>  AscensionMeshesFPV_Ab;                             // 0x2A48(0x10)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class FName                                  TestAscensionBossNameTag;                          // 0x2A58(0x8)(ConstParm, Net, EditFixedSize, OutParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<TSoftObjectPtr<class UStaticMesh>>    AscensionMeshesTPV_Ext;                            // 0x2A60(0x10)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<TSoftObjectPtr<class USkeletalMesh>>  AscensionMeshesFPV_Ext;                            // 0x2A70(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        NumAscensionsExt;                                  // 0x2A80(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_3C7F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class AActor*                                CurrentDome;                                       // 0x2A88(0x8)(ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class FString                                Current_Cruise_Missile_Message;                    // 0x2A90(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        NumChibiLevelUps;                                  // 0x2AA0(0x4)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        NumAscensionsGenesis;                              // 0x2AA4(0x4)(Edit, ExportObject, Net, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        NumAscensionsGen2;                                 // 0x2AA8(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         bUnlockedAllExplorerNotes;                         // 0x2AAC(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         bHasSetupMeshes;                                   // 0x2AAD(0x1)(Edit, BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_3C81[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<int32>                                RestrictedLevelsBasedOnUnobtainedGeneralizedAchievementTags; // 0x2AB0(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<class FName>                          GeneralizedUnlockedAchievementTags;                // 0x2AC0(0x10)(Edit, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, Config, DisableEditOnInstance, SubobjectReference)
	int32                                        NumAscensionsScorched;                             // 0x2AD0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_3C82[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<TSoftObjectPtr<class USkeletalMesh>>  AscensionSkeletalMeshesTPV;                        // 0x2AD8(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<TSoftObjectPtr<class USkeletalMesh>>  AscensionSkeletalMeshesTPV_Ext;                    // 0x2AE8(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<TSoftObjectPtr<class USkeletalMesh>>  AscensionSkeletalMeshesTPV_AB;                     // 0x2AF8(0x10)(ConstParm, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         bIsCheatAscending;                                 // 0x2B08(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_3C83[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        LastAscendIndex;                                   // 0x2B0C(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         bLastAscendWasImmediate;                           // 0x2B10(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)

	static class UClass* StaticClass();
	static class APlayerPawnTest_C* GetDefaultObj();

	bool BPOverrideCameraDesiredPivotLocation(struct FVector* CurrentCameraPivotLocation, struct FVector* DesiredCameraPivotLocation);
	struct FLinearColor GetFXBloodColor();
	void DisableFluidInteraction();
	void EnableFluidInteraction();
	void AssignAssetsFromVoiceCollection(class UPDA_VoiceCollection_C* K2Node_DynamicCast_AsPDA_Voice_Collection, bool* K2Node_DynamicCast_bSuccess);
	struct FRotator BPOverrideCameraDesiredPivotRotation(struct FRotator* CurrentCameraPivotRotation, struct FRotator* DesiredCameraPivotRotation, float* CallFunc_BreakRotator_Roll, float* CallFunc_BreakRotator_Pitch, float* CallFunc_BreakRotator_Yaw);
	bool BPOverrideCameraDesiredPivotOffset(struct FVector* DesiredCameraOffset);
	bool BPOverrideCameraPivotLocationInterpParams(struct FPrimalCameraPivotZInterpOverrides* PivotZInterpOverrides, struct FPrimalCameraInterpParams* LastInterpParamsX, struct FPrimalCameraInterpParams* LastInterpParamsY, struct FPrimalCameraInterpParams* LastInterpParamsZ, struct FPrimalCameraInterpParams* OutInterpParamsX, struct FPrimalCameraInterpParams* OutInterpParamsY, struct FPrimalCameraInterpParams* OutInterpParamsZ);
	bool BPOverrideCameraArmLengthInterpParams(struct FPrimalCameraInterpParams* OutInterpParams);
	double BPOverrideCameraArmLength(float CurrentCameraArmLength, float DesiredCameraArmLength);
	bool DontCreateAnyMoreSpawnUIs();
	class AShooterHUD* GetShooterHud(class AShooterPlayerController** K2Node_DynamicCast_AsShooter_Player_Controller, bool* K2Node_DynamicCast_bSuccess);
	void SetGeneralizedUnlockedAchievementTags(const TArray<class FName>& GeneralizedUnlockedAchievementTags);
	bool HasEquipToHideImplant(bool ShouldHideImplant, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, bool Temp_bool_True_if_break_was_hit_Variable, class UPrimalItem* CallFunc_Array_Get_Item);
	void BPSetupFirstPersonHandsMesh();
	bool SetupMeshes(int32 CallFunc_GetNumMaterials_ReturnValue, TSoftObjectPtr<class USkeletalMesh> CallFunc_Array_Get_Item, int32 CallFunc_Subtract_IntInt_ReturnValue, int32* Temp_int_Variable, bool* CallFunc_Greater_IntInt_ReturnValue, bool* CallFunc_Greater_IntInt_ReturnValue_1, TSoftObjectPtr<class USkeletalMesh> CallFunc_Array_Get_Item_1, class UMaterialInterface** CallFunc_GetMaterial_ReturnValue, int32 CallFunc_GetNumMaterials_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue_1, bool CallFunc_LessEqual_IntInt_ReturnValue, int32* Temp_int_Variable_1, bool* CallFunc_Greater_IntInt_ReturnValue_2, int32 CallFunc_GetNumMaterials_ReturnValue_2, int32 CallFunc_Subtract_IntInt_ReturnValue_2, int32* Temp_int_Variable_2, class UMaterialInterface** CallFunc_GetMaterial_ReturnValue_1, bool CallFunc_LessEqual_IntInt_ReturnValue_1, int32* Temp_int_Variable_3, int32* Temp_int_Variable_4, TSoftObjectPtr<class USkeletalMesh> CallFunc_Array_Get_Item_2, bool* CallFunc_HasEquipToHideImplant_ShouldHideImplant, class UWorld** CallFunc_K2_GetWorld_ReturnValue, class FName* CallFunc_GetObjectName_ReturnValue, TSoftObjectPtr<class USkeletalMesh> CallFunc_Array_Get_Item_3, bool* CallFunc_Greater_IntInt_ReturnValue_3, class UMaterialInterface** CallFunc_GetMaterial_ReturnValue_2, int32 CallFunc_GetNumMaterials_ReturnValue_3, int32 CallFunc_Subtract_IntInt_ReturnValue_3, bool CallFunc_LessEqual_IntInt_ReturnValue_2, bool* CallFunc_Greater_IntInt_ReturnValue_4, bool* CallFunc_Greater_IntInt_ReturnValue_5, class UMaterialInterface** CallFunc_GetMaterial_ReturnValue_3, int32 CallFunc_GetNumMaterials_ReturnValue_4, int32 CallFunc_Subtract_IntInt_ReturnValue_4, bool CallFunc_LessEqual_IntInt_ReturnValue_3, bool* CallFunc_Greater_IntInt_ReturnValue_6, TSoftObjectPtr<class USkeletalMesh> CallFunc_Array_Get_Item_4, int32* Temp_int_Variable_5, class UMaterialInterface** CallFunc_GetMaterial_ReturnValue_4, bool CallFunc_LessEqual_IntInt_ReturnValue_4, TSoftObjectPtr<class USkeletalMesh> CallFunc_Array_Get_Item_5, class UMaterialInterface** CallFunc_GetMaterial_ReturnValue_5, int32 CallFunc_GetNumMaterials_ReturnValue_5, int32 CallFunc_Subtract_IntInt_ReturnValue_5, bool CallFunc_LessEqual_IntInt_ReturnValue_5);
	bool BPUnlockedAllExplorerNotes();
	int32 GetTheNumChibiLevelUps();
	int32 SetNumChibiLevelUps(bool* CallFunc_EqualEqual_IntInt_ReturnValue);
	class AGameModeBase* BPGetPlayerHexagonCount(int32* Ret_val, class FString* CallFunc_LinkedPlayerIDString_ReturnValue, enum class ENetworkModeResult* CallFunc_IsRunningOnServer_OutNetworkMode, class AShooterGameMode* K2Node_DynamicCast_AsShooter_Game_Mode, bool* K2Node_DynamicCast_bSuccess, bool K2Node_SwitchEnum_CmpSuccess, class UPrimalPlayerData* CallFunc_GetPlayerData_ReturnValue, class UPrimalPlayerDataBP_Base_C* K2Node_DynamicCast_AsPrimal_Player_Data_BP_Base, bool* K2Node_DynamicCast_bSuccess_1);
	class AGameModeBase* BPSetPlayerHexagonCount(bool* Ret_val, class UWorld** CallFunc_K2_GetWorld_ReturnValue, class FString* CallFunc_LinkedPlayerIDString_ReturnValue, class AShooterGameMode* K2Node_DynamicCast_AsShooter_Game_Mode, bool* K2Node_DynamicCast_bSuccess, class UPrimalPlayerData* CallFunc_GetPlayerData_ReturnValue, enum class ENetworkModeResult* CallFunc_IsRunningOnServer_OutNetworkMode, class UPrimalPlayerDataBP_Base_C* K2Node_DynamicCast_AsPrimal_Player_Data_BP_Base, bool* K2Node_DynamicCast_bSuccess_1, bool K2Node_SwitchEnum_CmpSuccess);
	int32 BPGetShowDebugAnimationComponents(bool Temp_bool_Variable, bool* CallFunc_IsFirstPerson_ReturnValue, bool* CallFunc_IsFirstPerson_ReturnValue_1, class USkeletalMeshComponent* K2Node_Select_Default);
	float BPGetOverrideCameraInterpSpeed(float DefaultTPVCameraSpeedInterpolationMultiplier, float DefaultTPVOffsetInterpSpeed, float TPVCameraSpeedInterpolationMultiplier, float* TPVOffsetInterpSpeed, double LocalDefaultTPVOffsetInterpSpeed);
	class USoundCue* ShowHUDNotification(struct FLinearColor* Color);
	void TrySpawnMound();
	double TrySpawnMoundEx();
	class USkeletalMeshComponent* BPSetFirstPersonMasterPoseComponent();
	class AGameModeBase* DefeatedBoss(class APrimalDinoCharacter* BossCharacter, class FName* BossTag, int32 BossDifficulty, class UWorld** CallFunc_K2_GetWorld_ReturnValue, class AShooterPlayerController** K2Node_DynamicCast_AsShooter_Player_Controller, bool* K2Node_DynamicCast_bSuccess, class FString* CallFunc_LinkedPlayerIDString_ReturnValue, class AShooterGameMode* K2Node_DynamicCast_AsShooter_Game_Mode, bool* K2Node_DynamicCast_bSuccess_1, class UPrimalPlayerData* CallFunc_GetPlayerData_ReturnValue, class UPrimalPlayerDataBP_Base_C* K2Node_DynamicCast_AsPrimal_Player_Data_BP_Base, bool* K2Node_DynamicCast_bSuccess_2);
	class AController* ServerAscend(int32* DifficultyIndex, bool* bImmediateAscend, bool bSuppressAchievements, bool* bIsCheatAscend, int32 Temp_int_Array_Index_Variable, bool* CallFunc_GreaterEqual_IntInt_ReturnValue, bool* CallFunc_IsListenServer_ReturnValue, const class FString& Temp_string_Variable, const class FString& Temp_string_Variable_1, const class FString& Temp_string_Variable_2, int32* Temp_int_Variable, int32 Temp_int_Loop_Counter_Variable, const class FString& K2Node_Select_Default, class AController** CallFunc_GetCharacterController_ReturnValue, class UWorld* CallFunc_GetPrimaryWorld_ReturnValue, class AShooterPlayerController** K2Node_DynamicCast_AsShooter_Player_Controller, bool* K2Node_DynamicCast_bSuccess, class AWorldSettings* CallFunc_GetWorldSettings_ReturnValue, class APrimalWorldSettings* K2Node_DynamicCast_AsPrimal_World_Settings, bool* K2Node_DynamicCast_bSuccess_1, bool* CallFunc_GreaterEqual_IntInt_ReturnValue_1, class UClass* CallFunc_Array_Get_Item, bool* K2Node_DynamicCast_bSuccess_2, class AShooterGameMode* K2Node_DynamicCast_AsShooter_Game_Mode, bool* K2Node_DynamicCast_bSuccess_3, class AShooterGameMode* K2Node_DynamicCast_AsShooter_Game_Mode_1, bool* K2Node_DynamicCast_bSuccess_4, float CallFunc_GetServerSettingsFloat_OutFloat, bool* CallFunc_GetServerSettingsFloat_ReturnValue, float CallFunc_GetServerSettingsFloat_OutFloat_1, bool* CallFunc_GetServerSettingsFloat_ReturnValue_1, float CallFunc_GetServerSettingsFloat_OutFloat_2, bool* CallFunc_GetServerSettingsFloat_ReturnValue_2, class FString* CallFunc_LinkedPlayerIDString_ReturnValue, class UPrimalPlayerData* CallFunc_GetPlayerData_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue, class UPrimalPlayerDataBP_Base_C* K2Node_DynamicCast_AsPrimal_Player_Data_BP_Base, bool* K2Node_DynamicCast_bSuccess_5, class UWorld** CallFunc_K2_GetWorld_ReturnValue, class AShooterPlayerController** K2Node_DynamicCast_AsShooter_Player_Controller_1, bool* K2Node_DynamicCast_bSuccess_6, bool CallFunc_IsLocalController_ReturnValue, double CallFunc_MakeVector_Z_ImplicitCast, double CallFunc_MakeVector_Y_ImplicitCast, double CallFunc_MakeVector_X_ImplicitCast);
	class FString PlayerCommand(const class FString& TheCommand, class FString* RetVal, class FString* CallFunc_PlayerCommand_ReturnValue, bool K2Node_SwitchString_CmpSuccess);
	void UserConstructionScript();
	void ReceiveBeginPlay();
	int32 NetClientAscend(bool* bImmediateAscend, bool* bIsCheatAscend);
	class USoundCue* ClientShowHUDNotification(struct FLinearColor* Color);
	void NetClientPreLoadAcension();
	class APrimalCharacter* BPSpawnAttackerDamageImpactFX(class FName* SocketName);
	void AscensionCheck();
	double ExecuteUbergraph_PlayerPawnTest(int32* EntryPoint, bool Temp_bool_Variable, class UWorld** CallFunc_K2_GetWorld_ReturnValue, class UShooterGameUserSettings* CallFunc_GetUserSettings_ReturnValue, class AShooterPlayerController** K2Node_DynamicCast_AsShooter_Player_Controller, bool* K2Node_DynamicCast_bSuccess, class UFinalCreditsUI_C* CallFunc_Create_ReturnValue, const struct FLinearColor& K2Node_CustomEvent_Color, double K2Node_CustomEvent_LifetimeSeconds, double* K2Node_CustomEvent_DisplayScale, class USoundCue** K2Node_CustomEvent_SoundToPlay, class AShooterPlayerController** K2Node_DynamicCast_AsShooter_Player_Controller_1, bool* K2Node_DynamicCast_bSuccess_1, class UWorld** CallFunc_K2_GetWorld_ReturnValue_1, bool* CallFunc_IsShipping_ReturnValue, class FString* CallFunc_BPGetPrimaryMapName_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue, class FName* K2Node_Event_SocketName, class APrimalCharacter** K2Node_Event_VictimChar, const struct FLinearColor& CallFunc_GetFXBloodColor_ReturnValue, double CallFunc_SelectFloat_ReturnValue, bool Temp_bool_Variable_1, int32* Temp_int_Variable, bool Temp_bool_Variable_2, bool* CallFunc_IsLocallyControlled_ReturnValue, bool* CallFunc_IsFirstPerson_ReturnValue, class USceneComponent* K2Node_Select_Default, class USceneComponent* K2Node_Select_Default_1, double CallFunc_SelectFloat_ReturnValue_1, class USceneComponent* K2Node_Select_Default_2, class UNiagaraComponent** CallFunc_SpawnSystemAttached_ReturnValue, int32 CallFunc_Max_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const struct FLinearColor& K2Node_Select_Default_3, class AShooterPlayerController** K2Node_DynamicCast_AsShooter_Player_Controller_2, bool* K2Node_DynamicCast_bSuccess_2, float* CallFunc_BPAddHUDNotification_DisplayTime_ImplicitCast, float CallFunc_BPAddHUDNotification_DisplayScale_ImplicitCast, double CallFunc_SelectFloat_A_ImplicitCast, double CallFunc_SelectFloat_A_ImplicitCast_1, float* CallFunc_SetVariableFloat_InValue_ImplicitCast);
};

}


