#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xD0 (0xFB0 - 0xEE0)
// BlueprintGeneratedClass PrimalItem_StartingNote.PrimalItem_StartingNote_C
class UPrimalItem_StartingNote_C : public UPrimalItem_Note_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xEE0(0x8)(Edit, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, SubobjectReference)
	TArray<class UTexture2D*>                    AscensionIcons;                                    // 0xEE8(0x10)(Edit, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class FString                                LocalCustomItemDesc;                               // 0xEF8(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<class FString>                        DifficultyStrings;                                 // 0xF08(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<class FString>                        BossStrings;                                       // 0xF18(0x10)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<struct FArrayOfStrings>               BossPostStrings;                                   // 0xF28(0x10)(Edit, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class UTexture2D*                            LocalItemIcon;                                     // 0xF38(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<class UTexture2D*>                    LocalAscensionIcons;                               // 0xF40(0x10)(ConstParm, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<class UTexture2D*>                    SecondaryAscensionIcons;                           // 0xF50(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class UTexture2D*                            SecondaryIcon;                                     // 0xF60(0x8)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, Config, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	TArray<class UTexture2D*>                    TertiaryAscensionIcons;                            // 0xF68(0x10)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class UTexture2D*                            TertiaryIcon;                                      // 0xF78(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	TArray<class UTexture2D*>                    QuaternaryAscensionIcons;                          // 0xF80(0x10)(Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	class UTexture2D*                            QuaternaryIcon;                                    // 0xF90(0x8)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	bool                                         bResetHighlightTime;                               // 0xF98(0x1)(Edit, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_4822[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       HighlightStartTime;                                // 0xFA0(0x8)(BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	double                                       HighlightTimeToEnableRespawn;                      // 0xFA8(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)

	static class UClass* StaticClass();
	static class UPrimalItem_StartingNote_C* GetDefaultObj();

	bool BPCanUse(bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1, class AActor* CallFunc_GetOwner_ReturnValue, class AShooterCharacter* K2Node_DynamicCast_AsShooter_Character, bool* K2Node_DynamicCast_bSuccess, bool* CallFunc_IsLocallyControlled_ReturnValue, double CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast);
	bool BPDrawItemIcon(struct FVector2D* ItemCanvasScale, bool* bItemEnabled, struct FLinearColor* TheTintColor, bool Temp_bool_Variable, const struct FVector2D& CallFunc_Multiply_Vector2DFloat_ReturnValue, const struct FVector2D& CallFunc_Multiply_Vector2DFloat_ReturnValue_1, const struct FVector2D& CallFunc_Multiply_Vector2DFloat_ReturnValue_2, struct FVector2D* CallFunc_MakeVector2D_ReturnValue, const struct FVector2D& CallFunc_Multiply_Vector2DFloat_ReturnValue_3, struct FVector2D* CallFunc_MakeVector2D_ReturnValue_1, class UTexture2D* K2Node_Select_Default);
	bool BPGetItemIcon(class AShooterPlayerController** ForPC, bool Temp_bool_Variable, class UTexture2D* K2Node_Select_Default);
	bool IsLocalImplant(class AShooterPlayerController** ForPC, class FString* CallFunc_LinkedPlayerIDString_ReturnValue, const struct FCustomItemData& CallFunc_GetCustomItemData_OutData, bool CallFunc_GetCustomItemData_ReturnValue, const class FString& CallFunc_Array_Get_Item, bool CallFunc_EqualEqual_StrStr_ReturnValue);
	class FString BPGetItemName(class AShooterPlayerController** ForPC, bool Temp_bool_Variable, bool CallFunc_IsLocalImplant_IsLocal, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& K2Node_Select_Default);
	bool Get_Survival_Quotient_String(TArray<double>* SurvData, class FString* RetVal, int32* Temp_int_Variable, double CallFunc_Array_Get_Item, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, bool* CallFunc_Greater_IntInt_ReturnValue, const struct FArrayOfStrings& CallFunc_Array_Get_Item_1, const class FString& CallFunc_Array_Get_Item_2, int32 CallFunc_Len_ReturnValue, const class FString& CallFunc_Array_Get_Item_3, bool* CallFunc_Greater_IntInt_ReturnValue_1, const class FString& CallFunc_Array_Get_Item_4, const class FString& CallFunc_Concat_StrStr_ReturnValue, bool* CallFunc_Greater_IntInt_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, const class FString& CallFunc_Array_Get_Item_5, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, int32 CallFunc_Len_ReturnValue_1, bool* CallFunc_EqualEqual_IntInt_ReturnValue);
	float BPGetItemDescription(class AShooterPlayerController** ForPC, double FloatCastVar, class FString* SecondaryString, bool CallFunc_Less_DoubleDouble_ReturnValue, double CallFunc_GetPersistentTimeInSeconds_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, class AShooterCharacter* K2Node_DynamicCast_AsShooter_Character, bool* K2Node_DynamicCast_bSuccess, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class AShooterGameState** K2Node_DynamicCast_AsShooter_Game_State, bool* K2Node_DynamicCast_bSuccess_1, bool* K2Node_DynamicCast_bSuccess_2, double CallFunc_Multiply_DoubleFloat_ReturnValue, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue, int32 CallFunc_Max_ReturnValue, bool CallFunc_Less_DoubleDouble_ReturnValue_1, struct FFormatArgumentData* K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>* K2Node_MakeArray_Array, double CallFunc_Multiply_DoubleFloat_ReturnValue_1, int32 CallFunc_Round_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, double CallFunc_Multiply_DoubleFloat_ReturnValue_2, struct FFormatArgumentData* K2Node_MakeStruct_FormatArgumentData_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, TArray<struct FFormatArgumentData>* K2Node_MakeArray_Array_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, class AActor* CallFunc_GetOwner_ReturnValue_1, class APlayerPawnTest_C* K2Node_DynamicCast_AsPlayer_Pawn_Test, bool* K2Node_DynamicCast_bSuccess_3, struct FFormatArgumentData* K2Node_MakeStruct_FormatArgumentData_2, struct FFormatArgumentData* K2Node_MakeStruct_FormatArgumentData_3, struct FFormatArgumentData* K2Node_MakeStruct_FormatArgumentData_4, TArray<struct FFormatArgumentData>* K2Node_MakeArray_Array_2, TArray<struct FFormatArgumentData>* K2Node_MakeArray_Array_3, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, double CallFunc_Less_DoubleDouble_A_ImplicitCast);
	double BPPreInitializeItem(const class FString& Temp_string_Variable, const class FString& Temp_string_Variable_1, int32* Temp_int_Variable, const class FString& Temp_string_Variable_2, const class FString& Temp_string_Variable_3, const class FString& Temp_string_Variable_4, const class FString& Temp_string_Variable_5, bool Temp_bool_Variable, int32* Temp_int_Variable_1, class FText* Temp_text_Variable, class FText* Temp_text_Variable_1, class FText* Temp_text_Variable_2, class FText* Temp_text_Variable_3, class FText* Temp_text_Variable_4, bool Temp_bool_Variable_1, const class FString& Temp_string_Variable_6, const class FString& Temp_string_Variable_7, int32* Temp_int_Variable_2, const class FString& Temp_string_Variable_8, const class FString& Temp_string_Variable_9, const class FString& Temp_string_Variable_10, const class FString& Temp_string_Variable_11, bool Temp_bool_True_if_break_was_hit_Variable, int32 Temp_int_Array_Index_Variable, const class FString& Temp_string_Variable_12, const class FString& Temp_string_Variable_13, int32* Temp_int_Variable_3, const class FString& K2Node_Select_Default, bool CallFunc_IsOfficialServer_ReturnValue, int32 Temp_int_Loop_Counter_Variable, TArray<class FName>* K2Node_MakeArray_Array, TArray<class UClass*>* K2Node_MakeArray_Array_1, bool CallFunc_HasCustomItemData_ReturnValue, TArray<class UObject*>* K2Node_MakeArray_Array_2, const struct FCustomItemData& CallFunc_GetCustomItemData_OutData, bool CallFunc_GetCustomItemData_ReturnValue, class UPrimalInventoryComponent* CallFunc_GetInitializeItemOwnerInventory_ReturnValue, float CallFunc_Array_Get_Item, class UTexture2D* CallFunc_Array_Get_Item_1, class UPrimalItem* CallFunc_Array_Get_Item_2, bool CallFunc_RemoveItem_ReturnValue, class UObject* K2Node_Select_Default_1, class AActor* CallFunc_GetOwner_ReturnValue, float CallFunc_Array_Get_Item_3, class APlayerPawnTest_C* K2Node_DynamicCast_AsPlayer_Pawn_Test, bool* K2Node_DynamicCast_bSuccess, class AShooterPlayerController* CallFunc_GetSpawnedForController_ReturnValue, class UTexture2D* CallFunc_Array_Get_Item_4, bool* K2Node_DynamicCast_bSuccess_1, class FString* CallFunc_LinkedPlayerIDString_ReturnValue, class UPrimalPlayerDataBP_Base_C* K2Node_DynamicCast_AsPrimal_Player_Data_BP_Base, bool* K2Node_DynamicCast_bSuccess_2, float CallFunc_Array_Get_Item_5, const class FString& K2Node_Select_Default_2, TArray<class FString>* K2Node_MakeArray_Array_3, struct FCustomItemData* K2Node_MakeStruct_CustomItemData, float CallFunc_Array_Get_Item_6, float CallFunc_Array_Get_Item_7, class UTexture2D* CallFunc_Array_Get_Item_8, const class FString& K2Node_Select_Default_3, class UTexture2D* CallFunc_Array_Get_Item_9, const class FString& K2Node_Select_Default_4, const class FString& CallFunc_Concat_StrStr_ReturnValue, class UTexture2D* CallFunc_Array_Get_Item_10, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, class FText K2Node_Select_Default_5, struct FFormatArgumentData* K2Node_MakeStruct_FormatArgumentData, const class FString& CallFunc_Array_Get_Item_11, struct FFormatArgumentData* K2Node_MakeStruct_FormatArgumentData_1, const class FString& CallFunc_Array_Get_Item_12, struct FFormatArgumentData* K2Node_MakeStruct_FormatArgumentData_2, const class FString& CallFunc_Array_Get_Item_13, struct FFormatArgumentData* K2Node_MakeStruct_FormatArgumentData_3, struct FFormatArgumentData* K2Node_MakeStruct_FormatArgumentData_4, TArray<struct FFormatArgumentData>* K2Node_MakeArray_Array_4, TArray<float>* K2Node_MakeStruct_CustomDataFloats_ImplicitCast);
	void BlueprintUsed();
	void BPOnUpdatedItemContextMenu();
	double ExecuteUbergraph_PrimalItem_StartingNote(int32* EntryPoint, bool CallFunc_Less_DoubleDouble_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, class AShooterCharacter* K2Node_DynamicCast_AsShooter_Character, bool* K2Node_DynamicCast_bSuccess);
};

}


