#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xD0 (0xF80 - 0xEB0)
// BlueprintGeneratedClass PrimalItem_StartingNote.PrimalItem_StartingNote_C
class UPrimalItem_StartingNote_C : public UPrimalItem_Note_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xEB0(0x8)(BlueprintVisible, ExportObject, EditFixedSize, DisableEditOnInstance, SubobjectReference)
	TArray<class UTexture2D*>                    AscensionIcons;                                    // 0xEB8(0x10)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FString                                LocalCustomItemDesc;                               // 0xEC8(0x10)(ConstParm, BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class FString>                        DifficultyStrings;                                 // 0xED8(0x10)(ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class FString>                        BossStrings;                                       // 0xEE8(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<struct FArrayOfStrings>               BossPostStrings;                                   // 0xEF8(0x10)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class UTexture2D*                            LocalItemIcon;                                     // 0xF08(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class UTexture2D*>                    LocalAscensionIcons;                               // 0xF10(0x10)(Edit, ConstParm, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class UTexture2D*>                    SecondaryAscensionIcons;                           // 0xF20(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class UTexture2D*                            SecondaryIcon;                                     // 0xF30(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, InstancedReference, SubobjectReference)
	TArray<class UTexture2D*>                    TertiaryAscensionIcons;                            // 0xF38(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class UTexture2D*                            TertiaryIcon;                                      // 0xF48(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	TArray<class UTexture2D*>                    QuaternaryAscensionIcons;                          // 0xF50(0x10)(Edit, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class UTexture2D*                            QuaternaryIcon;                                    // 0xF60(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         bResetHighlightTime;                               // 0xF68(0x1)(ConstParm, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_43E4[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       HighlightStartTime;                                // 0xF70(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	double                                       HighlightTimeToEnableRespawn;                      // 0xF78(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)

	static class UClass* StaticClass();
	static class UPrimalItem_StartingNote_C* GetDefaultObj();

	bool BPCanUse(bool bIgnoreCooldown, bool CallFunc_BPCanUse_ReturnValue, bool* CallFunc_GreaterEqual_DoubleDouble_ReturnValue, bool* CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, bool* CallFunc_IsValid_ReturnValue, class AActor** CallFunc_GetOwner_ReturnValue, class AShooterCharacter* K2Node_DynamicCast_AsShooter_Character, bool* K2Node_DynamicCast_bSuccess, bool CallFunc_BPCanImplantSuicide_ReturnValue, double* CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast);
	bool BPDrawItemIcon(const struct FVector2D& ItemCanvasScale, bool bItemEnabled, const struct FLinearColor& TheTintColor, bool Temp_bool_Variable, struct FVector2D* CallFunc_Multiply_Vector2DFloat_ReturnValue, double CallFunc_BreakVector2D_X, double CallFunc_BreakVector2D_Y, double CallFunc_BreakVector2D_X_1, double CallFunc_BreakVector2D_Y_1, struct FVector2D* CallFunc_Multiply_Vector2DFloat_ReturnValue_1, double CallFunc_BreakVector2D_X_2, double CallFunc_BreakVector2D_Y_2, double CallFunc_BreakVector2D_X_3, double CallFunc_BreakVector2D_Y_3, struct FVector2D* CallFunc_Multiply_Vector2DFloat_ReturnValue_2, double CallFunc_BreakVector2D_X_4, double CallFunc_BreakVector2D_Y_4, struct FVector2D* CallFunc_Multiply_Vector2DFloat_ReturnValue_3, bool* CallFunc_IsValid_ReturnValue, bool* CallFunc_IsValid_ReturnValue_1, bool* CallFunc_IsValid_ReturnValue_2, class UTexture2D** K2Node_Select_Default);
	bool BPGetItemIcon(bool Temp_bool_Variable, class UTexture2D** K2Node_Select_Default);
	bool IsLocalImplant(bool bRetVal, bool* CallFunc_IsValid_ReturnValue, bool* CallFunc_IsValid_ReturnValue_1, struct FCustomItemData* CallFunc_GetCustomItemData_OutData, bool* CallFunc_GetCustomItemData_ReturnValue, class FString* CallFunc_Array_Get_Item);
	class FString BPGetItemName(const class FString& ItemNameIn, bool Temp_bool_Variable, bool* CallFunc_IsLocalImplant_IsLocal, const class FString& CallFunc_Concat_StrStr_ReturnValue, class FString* K2Node_Select_Default);
	bool Get_Survival_Quotient_String(int32* Temp_int_Variable, int32* CallFunc_Array_Length_ReturnValue, double* CallFunc_Array_Get_Item, int32 CallFunc_FFloor_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, struct FArrayOfStrings* CallFunc_Array_Get_Item_1, class FString* CallFunc_Array_Get_Item_2, int32* CallFunc_Len_ReturnValue, class FString* CallFunc_Array_Get_Item_3, class FString* CallFunc_Array_Get_Item_4, int32* CallFunc_Array_Length_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, class FString* CallFunc_Array_Get_Item_5, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, int32* CallFunc_Len_ReturnValue_1);
	TArray<struct FFormatArgumentData> BPGetItemDescription(const class FString& InDescription, bool bGetLongDescription, double* CallFunc_GetPersistentTimeInSeconds_ReturnValue, bool* CallFunc_IsValid_ReturnValue, class AActor** CallFunc_GetOwner_ReturnValue, class AShooterCharacter* K2Node_DynamicCast_AsShooter_Character, bool* K2Node_DynamicCast_bSuccess, class AGameStateBase** CallFunc_GetGameState_ReturnValue, bool CallFunc_BPCanImplantSuicide_ReturnValue, bool* K2Node_DynamicCast_bSuccess_1, class AShooterPlayerState** K2Node_DynamicCast_AsShooter_Player_State, bool* K2Node_DynamicCast_bSuccess_2, double CallFunc_Multiply_DoubleFloat_ReturnValue, double* CallFunc_Add_DoubleFloat_ReturnValue, int32 CallFunc_FFloor_ReturnValue, bool* CallFunc_GreaterEqual_DoubleDouble_ReturnValue, const class FString& CallFunc_BPFormatAsTime_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class FText CallFunc_Format_ReturnValue, double CallFunc_Multiply_DoubleFloat_ReturnValue_1, const class FString& CallFunc_Conv_TextToString_ReturnValue, int32 CallFunc_Round_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, double CallFunc_Multiply_DoubleFloat_ReturnValue_2, const class FString& CallFunc_Conv_DoubleToString_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, class FText CallFunc_Format_ReturnValue_1, const class FString& CallFunc_Conv_TextToString_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, bool* CallFunc_IsValid_ReturnValue_1, class AActor** CallFunc_GetOwner_ReturnValue_1, bool* K2Node_DynamicCast_bSuccess_3, int32 CallFunc_Add_IntInt_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue_1, class FText CallFunc_Format_ReturnValue_2, class FText CallFunc_Format_ReturnValue_3, const class FString& CallFunc_Conv_TextToString_ReturnValue_2, const class FString& CallFunc_Conv_TextToString_ReturnValue_3, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, double* CallFunc_Greater_DoubleDouble_A_ImplicitCast, double CallFunc_Add_DoubleFloat_A_ImplicitCast, float* CallFunc_Subtract_DoubleFloat_B_ImplicitCast, float* CallFunc_Add_DoubleFloat_B_ImplicitCast, double* CallFunc_Less_DoubleDouble_A_ImplicitCast);
	TArray<float> BPPreInitializeItem(class UWorld* OptionalInitWorld, bool* CallFunc_IsValid_ReturnValue, bool* CallFunc_IsValid_ReturnValue_1, int32* Temp_int_Variable, bool Temp_bool_Variable, int32* Temp_int_Variable_1, bool Temp_bool_Variable_1, int32* Temp_int_Variable_2, int32* Temp_int_Variable_3, class FString* K2Node_Select_Default, bool* CallFunc_IsOfficialServer_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool* CallFunc_HasCustomItemData_ReturnValue, struct FCustomItemData* CallFunc_GetCustomItemData_OutData, bool* CallFunc_GetCustomItemData_ReturnValue, class UPrimalInventoryComponent** CallFunc_GetInitializeItemOwnerInventory_ReturnValue, float* CallFunc_Array_Get_Item, bool* CallFunc_IsValid_ReturnValue_2, int32 CallFunc_FFloor_ReturnValue, class UTexture2D** CallFunc_Array_Get_Item_1, class UPrimalItem** CallFunc_Array_Get_Item_2, int32* CallFunc_Array_Length_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool* CallFunc_RemoveItem_ReturnValue, bool CallFunc_NotEqual_ObjectObject_ReturnValue, class UClass* CallFunc_GetObjectClass_ReturnValue, bool* CallFunc_IsValid_ReturnValue_3, bool CallFunc_EqualEqual_ClassClass_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_2, bool* CallFunc_IsValid_ReturnValue_4, bool CallFunc_BooleanAND_ReturnValue_3, class UObject** K2Node_Select_Default_1, class AActor** CallFunc_GetOwner_ReturnValue, float* CallFunc_Array_Get_Item_3, bool* K2Node_DynamicCast_bSuccess, int32 CallFunc_FFloor_ReturnValue_1, class AShooterPlayerController** CallFunc_GetSpawnedForController_ReturnValue, class UTexture2D** CallFunc_Array_Get_Item_4, class AShooterPlayerState** K2Node_DynamicCast_AsShooter_Player_State, bool* K2Node_DynamicCast_bSuccess_1, bool* K2Node_DynamicCast_bSuccess_2, float* CallFunc_Array_Get_Item_5, class FString* K2Node_Select_Default_2, class FString* CallFunc_SelectString_ReturnValue, float* CallFunc_Array_Get_Item_6, float* CallFunc_Array_Get_Item_7, int32 CallFunc_FFloor_ReturnValue_2, int32 CallFunc_FFloor_ReturnValue_3, class UTexture2D** CallFunc_Array_Get_Item_8, class FString* K2Node_Select_Default_3, int32* CallFunc_SelectInt_ReturnValue, class UTexture2D** CallFunc_Array_Get_Item_9, class FString* K2Node_Select_Default_4, const class FString& CallFunc_Concat_StrStr_ReturnValue, class UTexture2D** CallFunc_Array_Get_Item_10, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, class FText* K2Node_Select_Default_5, const class FString& CallFunc_Get_Survival_Quotient_String_OutString, class FText CallFunc_Conv_StringToText_ReturnValue, class FString* CallFunc_Array_Get_Item_11, class FText CallFunc_Conv_StringToText_ReturnValue_1, class FString* CallFunc_Array_Get_Item_12, class FText CallFunc_Conv_StringToText_ReturnValue_2, class FString* CallFunc_Array_Get_Item_13, class FText CallFunc_Conv_StringToText_ReturnValue_3, class FText CallFunc_Format_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue, TArray<double>* CallFunc_Get_Survival_Quotient_String_SurvData_ImplicitCast, double CallFunc_FFloor_A_ImplicitCast, double CallFunc_FFloor_A_ImplicitCast_1, double* CallFunc_Greater_DoubleDouble_A_ImplicitCast, double* CallFunc_Greater_DoubleDouble_A_ImplicitCast_1, double CallFunc_FFloor_A_ImplicitCast_2, double CallFunc_FFloor_A_ImplicitCast_3);
	void BlueprintUsed();
	void BPOnUpdatedItemContextMenu();
	double ExecuteUbergraph_PrimalItem_StartingNote(bool CallFunc_CanUse_ReturnValue, bool* CallFunc_IsValid_ReturnValue, class AActor** CallFunc_GetOwner_ReturnValue, class AShooterCharacter* K2Node_DynamicCast_AsShooter_Character, bool* K2Node_DynamicCast_bSuccess);
};

}


