#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xE8 (0xE8 - 0x0)
// UserDefinedStruct S_CC_Settings.S_CC_Settings
struct FS_CC_Settings
{
public:
	double                                       FatMinusBelly_19_1C8A717C4214A88DFF4C3A97E29D93D5; // 0x0(0x8)(EditFixedSize, Parm, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       FatMinusButt_21_D0A372A24D6A89B2E66AF1AC014F2352;  // 0x8(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       FatMinusChest_22_56991F1D433AC23929251088909EC6D5; // 0x10(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       BackMinusBack_25_8A57D7C64955D624BE2D83A253581FA5; // 0x18(0x8)(Edit, ExportObject, Net, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       BackMinusNeck_26_B7E2FA2F43DA54FC8B19A1A2F68333F6; // 0x20(0x8)(Edit, EditFixedSize, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       BackMinusTrapezies_28_CEB4AEBC45F31268C3170EBBD00DC2D2; // 0x28(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       ArmMinusBicep_30_AC2BB293428ACCD42712CD939BE6B798; // 0x30(0x8)(ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       ArmMinusDeltoid_31_0F618E7A41CE45C0CBA3CD8D27A4C2FE; // 0x38(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       ArmMinusForearm_32_5782D886432E2F41987C51B65BB8B80E; // 0x40(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       ArmMinusTricep_33_E832ADD2411A396B1293B7897F5876CA; // 0x48(0x8)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       ChestMinusAbs_34_D10B89E74D8E9DBDB753689665680328; // 0x50(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       ChestMinusObliques_35_8167436E41B71B1EFDBE6DAC72A8E96A; // 0x58(0x8)(Edit, ConstParm, ExportObject, Parm, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       ChestMinusPectorals_36_0783D21948193AEE1CB357AA3C2C9B69; // 0x60(0x8)(Edit, BlueprintVisible, Net, Parm, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       LegsMinusAdductors_37_5000345C4DC553C7154AB29FB61EE0D4; // 0x68(0x8)(Edit, ConstParm, BlueprintVisible, OutParm, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       LegsMinusCalves_38_B4A1E93547D9ACFC1F1F9A8C38AFB17A; // 0x70(0x8)(Edit, Net, OutParm, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       LegsMinusGlutes_39_0D0254874ECE0A3B50B8ED989F9CEF07; // 0x78(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       LegsMinusHamstring_41_D38A1F0D4500F7D6515478B3316BCFD5; // 0x80(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       LegsMinusLats_46_545C9EB942201C5E29F388A53F898362; // 0x88(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       LegsMinusQuads_47_52D0FDF346AB6618DAEE2299400B6CB5; // 0x90(0x8)(Edit, BlueprintVisible, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  ArmorTierMinusSet_50_D2486C6841F3F77F4A1B32BA0E74A6FB; // 0x98(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  ArmorTierMinusArms_52_495E1530451E06A503F43484DD491175; // 0xA0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  ArmorTierMinusBoots_54_73B88B02418F411C37BCA9A5899C3452; // 0xA8(0x8)(ConstParm, Net, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  ArmorTierMinusChest_60_1950BA37488B9714F56E1BBB262795EB; // 0xB0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  ArmorTierMinusHelmet_56_04686FD24F30F5E7E54A1BB1AD3410F6; // 0xB8(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  ArmorTierMinusLeggings_58_4CB17C944AB88C18379DC089519139EF; // 0xC0(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          SkinMinusTone_63_968F15304C3B65A1D048D39ABB6E538C; // 0xC8(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FVector2D                             SkinMinus2DSliderCoord_66_CB7ED6EC4FD8FD788BA6C1A2FB65CBA6; // 0xD8(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

}


