#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xB0 (0x790 - 0x6E0)
// Class ShooterGame.CustomCanvasWidget
class UCustomCanvasWidget : public UButton
{
public:
	uint8                                        Pad_B19[0x48];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bOverrideScreenCanvasProjection;                   // 0x728(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIgnoreParentAlpha;                                // 0x729(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B1A[0x6];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnDraggedObject;                                   // 0x730(0x10)(BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B1B[0x50];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCustomCanvasWidget* GetDefaultObj();

};

// 0x148 (0x8D8 - 0x790)
// Class ShooterGame.DataListEntryButton
class UDataListEntryButton : public UCustomCanvasWidget
{
public:
	uint8                                        Pad_B1D[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                DisplayString;                                     // 0x7A0(0x10)(BlueprintVisible, Parm, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                AdditionalDisplayString;                           // 0x7B0(0x10)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class FName                                  ContextMenuAnchorName;                             // 0x7C0(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UTexture2D*                            ItemIcon;                                          // 0x7C8(0x8)(Edit, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FLinearColor                          ForegroundColor;                                   // 0x7D0(0x10)(BlueprintVisible, Net, ReturnParm, Config, DisableEditOnInstance)
	bool                                         bUseSelectedBackgroundColor;                       // 0x7E0(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B1E[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          SelectedBackgroundColor;                           // 0x7E4(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	uint8                                        Pad_B1F[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	class UTexture2D*                            AltHighlightBGTexture;                             // 0x7F8(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        NameOffset;                                        // 0x800(0x4)(ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bClickable;                                        // 0x804(0x1)(ConstParm, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bEnabled;                                          // 0x805(0x1)(Edit, BlueprintVisible, ExportObject, Net, OutParm, Transient, EditConst, GlobalConfig)
	bool                                         bUseDisplayString;                                 // 0x806(0x1)(ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B20[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          DisplayStringColor;                                // 0x808(0x10)(ConstParm, BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector2D                             DisplayStringOffset;                               // 0x818(0x10)(Edit, ConstParm, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        TextDisplayStringSize;                             // 0x828(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B21[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector2D                             DisplayStringScale;                                // 0x830(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisplayStringCenterX;                             // 0x840(0x1)(Edit, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisplayStringCenterY;                             // 0x841(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bSetIndexPlusOneToDisplayString;                   // 0x842(0x1)(BlueprintVisible, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAllowClickingWhenNoEntry;                         // 0x843(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B22[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	class UFont*                                 DisplayStringFont;                                 // 0x848(0x8)(BlueprintVisible, ExportObject, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UTexture2D*                            SelectedIcon;                                      // 0x850(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, DuplicateTransient)
	struct FLinearColor                          DisabledColor;                                     // 0x858(0x10)(BlueprintVisible, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FLinearColor                          TintColorOverride;                                 // 0x868(0x10)(ConstParm, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDataListAutomaticallyOverrideText : 1;            // Mask: 0x1, PropSize: 0x10x878(0x1)(ExportObject, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDataListAutomaticallyOverrideEnabled : 1;         // Mask: 0x2, PropSize: 0x10x878(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bWrapText : 1;                                     // Mask: 0x4, PropSize: 0x10x878(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUseDataProviderCustomColor : 1;                   // Mask: 0x8, PropSize: 0x10x878(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bOverrideTintColor : 1;                            // Mask: 0x10, PropSize: 0x10x878(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bShowDisplayStringWhenHasItem : 1;                 // Mask: 0x20, PropSize: 0x10x878(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUseCustomTextColor : 1;                           // Mask: 0x40, PropSize: 0x10x878(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bSelected : 1;                                     // Mask: 0x80, PropSize: 0x10x878(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, Transient, GlobalConfig, SubobjectReference)
	uint8                                        bForceDraggingDisabled : 1;                        // Mask: 0x1, PropSize: 0x10x879(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDraggable : 1;                                    // Mask: 0x2, PropSize: 0x10x879(0x1)(ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_82 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bAllowExtraIcon : 1;                               // Mask: 0x10, PropSize: 0x10x879(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bToggleButton : 1;                                 // Mask: 0x20, PropSize: 0x10x879(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_83 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_B26[0x16];                                     // Fixing Size After Last Property  > TateDumper <
	class UTexture2D*                            OverrideDisabledIcon;                              // 0x890(0x8)(BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector2D                             WrappedTextSpacingAdjust;                          // 0x898(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B27[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FColor                                OverridenTextColor;                                // 0x8B0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bHasEngram;                                        // 0x8B4(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bKnownEngram;                                      // 0x8B5(0x1)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bOverrideStlye;                                    // 0x8B6(0x1)(Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B29[0x11];                                     // Fixing Size After Last Property  > TateDumper <
	class UMaterialInstanceDynamic*              MyIconMat;                                         // 0x8C8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UMenuAnchor*                           ContextMenuAnchor;                                 // 0x8D0(0x8)(BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UDataListEntryButton* GetDefaultObj();

	void OnGetContextMenuContent(class UWidget** ReturnValue);
	void GetStringValue(class FString* ReturnValue);
	void GetOverridenStringValue(class FString* ReturnValue);
	class UWidget* ClickedSecondaryButton();
	class UWidget* ClickedButton();
};

// 0x58 (0x930 - 0x8D8)
// Class ShooterGame.AdminPlayerInfoEntryButton
class UAdminPlayerInfoEntryButton : public UDataListEntryButton
{
public:
	uint8                                        bIsCustom : 1;                                     // Mask: 0x1, PropSize: 0x10x8D8(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_84 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_B30[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	class FString                                PlayerName;                                        // 0x8E0(0x10)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	class FString                                SteamPlayerName;                                   // 0x8F0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class FString                                LinkedPlayerID;                                    // 0x900(0x10)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	bool                                         bCenterDisplayName;                                // 0x910(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B32[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          DisplayStringSelectedColor;                        // 0x914(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B33[0xC];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAdminPlayerInfoEntryButton* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class ShooterGame.AhoCorasickMatch
class UAhoCorasickMatch : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAhoCorasickMatch* GetDefaultObj();

	bool SearchWords(const TArray<class FString>& OutKeys);
	struct FAhoCorasickMatcher AddWords();
};

// 0x20 (0x4E8 - 0x4C8)
// Class ShooterGame.AIAttackCoordinator
class AAIAttackCoordinator : public AActor
{
public:
	int32                                        MaxAttackersPerTarget;                             // 0x4C8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        UpdateInterval;                                    // 0x4CC(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	TArray<TWeakObjectPtr<class APrimalDinoAIController>> Attackers;                                         // 0x4D0(0x10)(Edit, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B44[0x8];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class AAIAttackCoordinator* GetDefaultObj();

	TArray<class APrimalDinoAIController*> UpdateAttackGroup();
	void RemoveAttacker(class APrimalDinoAIController** Controller);
	void GetNumAttackersWithPriorityForTarget(class AActor* Target, int32* ReturnValue);
	void GetNumAttackersForTarget(class AActor* Target, int32* ReturnValue);
	void ClearAllAttackers();
	void CalculateAttackerPriorityWeight(class APrimalDinoAIController* Attacker, float* ReturnValue);
	void AddAttackerCharacter(class APrimalDinoCharacter** Character);
	void AddAttacker(class APrimalDinoAIController** Controller);
};

// 0xC0 (0xE8 - 0x28)
// Class ShooterGame.AllClustersInventory
class UAllClustersInventory : public UObject
{
public:
	uint8                                        Pad_B5B[0xC0];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAllClustersInventory* GetDefaultObj();

	class FString OnFinishedSaveForChangingItems(bool Success);
	bool OnFinishedReadLockForCreateLock(bool Success);
	TArray<struct FItemNetInfo> OnFinishedLoadForChangingItems(bool Success);
	class FString OnFinishedCreateLockForChangingItems(bool Success);
	class FString OnFinishedClearLockForChangingItems(bool Success);
};

// 0x38 (0x910 - 0x8D8)
// Class ShooterGame.AllPaintingsEntryButton
class UAllPaintingsEntryButton : public UDataListEntryButton
{
public:
	class FString                                Filename;                                          // 0x8D8(0x10)(Edit, ExportObject, Net, EditFixedSize, OutParm, ReturnParm)
	class FString                                FilePath;                                          // 0x8E8(0x10)(ConstParm, BlueprintVisible, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FLinearColor                          DisplayStringSelectedColor;                        // 0x8F8(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B61[0x8];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAllPaintingsEntryButton* GetDefaultObj();

};

// 0x48 (0x920 - 0x8D8)
// Class ShooterGame.AllPlayersEntryButton
class UAllPlayersEntryButton : public UDataListEntryButton
{
public:
	class FString                                PlayerName;                                        // 0x8D8(0x10)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	class FString                                TribeName;                                         // 0x8E8(0x10)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	uint64                                       PlayerID;                                          // 0x8F8(0x8)(ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint64                                       TargetingTeamID;                                   // 0x900(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	class AShooterCharacter*                     CurrentCharachter;                                 // 0x908(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FLinearColor                          DisplayStringSelectedColor;                        // 0x910(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UAllPlayersEntryButton* GetDefaultObj();

};

// 0xC8 (0x410 - 0x348)
// Class ShooterGame.AnimInstance_DinoBlueprintBase
class UAnimInstance_DinoBlueprintBase : public UAnimInstance
{
public:
	bool                                         bAllowNativeAnimations;                            // 0x348(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableBlueprint;                                 // 0x349(0x1)(BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B66[0x6];                                      // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              RootRotationOffset;                                // 0x350(0x18)(ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	struct FVector                               RootLocationOffset;                                // 0x368(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bSkipAnimGraph;                                    // 0x380(0x1)(ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B69[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        MovementAnimRate;                                  // 0x384(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MovementAnimRatePower;                             // 0x388(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MinMovementAnimRate;                               // 0x38C(0x4)(ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MaxMovementAnimRate;                               // 0x390(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MovingAnimSpeedTreshold;                           // 0x394(0x4)(BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsMoving;                                         // 0x398(0x1)(ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseAimOffset;                                     // 0x399(0x1)(ConstParm, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B6B[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        AimPitch;                                          // 0x39C(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        AimYaw;                                            // 0x3A0(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseBlinking;                                      // 0x3A4(0x1)(ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B6E[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        BlinkBlend;                                        // 0x3A8(0x4)(BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseTurning;                                       // 0x3AC(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseTurnInPlaceAnimation;                          // 0x3AD(0x1)(ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B70[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        TurningEnabledBlendTime;                           // 0x3B0(0x4)(Edit, ConstParm, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        TurningDisabledBlendTime;                          // 0x3B4(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        TurningDirectionBlendTime;                         // 0x3B8(0x4)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MinTurnRateForTurnAnimation;                       // 0x3BC(0x4)(Edit, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsTurning;                                        // 0x3C0(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bTurningRight;                                     // 0x3C1(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseSwimming;                                      // 0x3C2(0x1)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B74[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        SwimmingMovingAnimSpeedThreshold;                  // 0x3C4(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsSwimming;                                       // 0x3C8(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseRunning;                                       // 0x3C9(0x1)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseRunningMovementAnimRate;                       // 0x3CA(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B75[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        RunningMovementAnimRate;                           // 0x3CC(0x4)(Edit, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsRunning;                                        // 0x3D0(0x1)(Edit, ConstParm, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseSleepingAnim;                                  // 0x3D1(0x1)(ConstParm, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B79[0x6];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SleepingAnimTranslationOffset;                     // 0x3D8(0x18)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsSleeping;                                       // 0x3F0(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	bool                                         bUseFalling;                                       // 0x3F1(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B7A[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        FallingAnimPlayRate;                               // 0x3F4(0x4)(Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        FallingBlendInTime;                                // 0x3F8(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        FallingBlendOutTime;                               // 0x3FC(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsFalling;                                        // 0x400(0x1)(Edit, BlueprintVisible, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B7C[0xF];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimInstance_DinoBlueprintBase* GetDefaultObj();

};

// 0xE8 (0x430 - 0x348)
// Class ShooterGame.AnimInstance_DinoRootBoneName
class UAnimInstance_DinoRootBoneName : public UAnimInstance
{
public:
	bool                                         bAllowNativeAnimations;                            // 0x348(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableBlueprint;                                 // 0x349(0x1)(BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B84[0x6];                                      // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              RootRotationOffset;                                // 0x350(0x18)(ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	struct FVector                               RootLocationOffset;                                // 0x368(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        IKAlpha;                                           // 0x380(0x4)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableIK;                                        // 0x384(0x1)(BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableIKWhenFalling;                             // 0x385(0x1)(OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bSleepingEnableIK;                                 // 0x386(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bSkipAnimGraph;                                    // 0x387(0x1)(ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MovementAnimRate;                                  // 0x388(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MovementAnimRatePower;                             // 0x38C(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MinMovementAnimRate;                               // 0x390(0x4)(ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MaxMovementAnimRate;                               // 0x394(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MovingAnimSpeedTreshold;                           // 0x398(0x4)(BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MovingBlendInTime;                                 // 0x39C(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MovingBlendOutTime;                                // 0x3A0(0x4)(ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsMoving;                                         // 0x3A4(0x1)(ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseAimOffset;                                     // 0x3A5(0x1)(ConstParm, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B90[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        AimPitch;                                          // 0x3A8(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        AimYaw;                                            // 0x3AC(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        AimOffsetPitchScale;                               // 0x3B0(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        AimOffsetYawScale;                                 // 0x3B4(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseAlignGround;                                   // 0x3B8(0x1)(BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B93[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        AlignGroundAlpha;                                  // 0x3BC(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseBlinking;                                      // 0x3C0(0x1)(ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B95[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        BlinkBlend;                                        // 0x3C4(0x4)(BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseTurning;                                       // 0x3C8(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseTurnInPlaceAnimation;                          // 0x3C9(0x1)(ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B96[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        TurningEnabledBlendTime;                           // 0x3CC(0x4)(Edit, ConstParm, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        TurningDisabledBlendTime;                          // 0x3D0(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        TurningDirectionBlendTime;                         // 0x3D4(0x4)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MinTurnRateForTurnAnimation;                       // 0x3D8(0x4)(Edit, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsTurning;                                        // 0x3DC(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bTurningRight;                                     // 0x3DD(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseSwimming;                                      // 0x3DE(0x1)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B97[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        SwimmingMovingAnimSpeedThreshold;                  // 0x3E0(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsSwimming;                                       // 0x3E4(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseRunning;                                       // 0x3E5(0x1)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseRunningMovementAnimRate;                       // 0x3E6(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B9A[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        RunningMovementAnimRate;                           // 0x3E8(0x4)(Edit, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        RunningBlendInTime;                                // 0x3EC(0x4)(Edit, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        RunningBlendOutTime;                               // 0x3F0(0x4)(ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsRunning;                                        // 0x3F4(0x1)(Edit, ConstParm, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseSleepingAnim;                                  // 0x3F5(0x1)(ConstParm, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B9B[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SleepingAnimTranslationOffset;                     // 0x3F8(0x18)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsSleeping;                                       // 0x410(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	bool                                         bUseFalling;                                       // 0x411(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B9C[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        FallingAnimPlayRate;                               // 0x414(0x4)(Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        FallingBlendInTime;                                // 0x418(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        FallingBlendOutTime;                               // 0x41C(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsFalling;                                        // 0x420(0x1)(Edit, BlueprintVisible, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B9F[0xF];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimInstance_DinoRootBoneName* GetDefaultObj();

};

// 0x158 (0x4A0 - 0x348)
// Class ShooterGame.AnimInstance_DinoRootTransform
class UAnimInstance_DinoRootTransform : public UAnimInstance
{
public:
	bool                                         bAllowNativeAnimations;                            // 0x348(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableBlueprint;                                 // 0x349(0x1)(BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_BA4[0x6];                                      // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              RootRotationOffset;                                // 0x350(0x18)(ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	struct FVector                               RootLocationOffset;                                // 0x368(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FTransform                            RootOffsetTransform;                               // 0x380(0x60)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bSkipAnimGraph;                                    // 0x3E0(0x1)(ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_BA6[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        MovementAnimRate;                                  // 0x3E4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MovementAnimRatePower;                             // 0x3E8(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MinimumMovementSpeed;                              // 0x3EC(0x4)(Edit, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MovingBlendInTime;                                 // 0x3F0(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MovingBlendOutTime;                                // 0x3F4(0x4)(ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsMoving;                                         // 0x3F8(0x1)(ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_BAB[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        MinimumMovementSpeedFlying;                        // 0x3FC(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        FlyingMoveBlendIn;                                 // 0x400(0x4)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        FlyingMoveBlendOut;                                // 0x404(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsFlying;                                         // 0x408(0x1)(Edit, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseFlyingOffset;                                  // 0x409(0x1)(ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_BAE[0x6];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FlyingOffset;                                      // 0x410(0x18)(Edit, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               CurrentFlyingOffset;                               // 0x428(0x18)(ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               LandedOffset;                                      // 0x440(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseAimOffset;                                     // 0x458(0x1)(ConstParm, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_BB1[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        AimPitch;                                          // 0x45C(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        AimYaw;                                            // 0x460(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        AimOffsetPitchScale;                               // 0x464(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        AimOffsetYawScale;                                 // 0x468(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseBlinking;                                      // 0x46C(0x1)(ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_BB3[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        BlinkBlend;                                        // 0x470(0x4)(BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseTurning;                                       // 0x474(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_BB4[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        TurningEnabledBlendTime;                           // 0x478(0x4)(Edit, ConstParm, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        TurningDisabledBlendTime;                          // 0x47C(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        TurningDirectionBlendTime;                         // 0x480(0x4)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MinTurnRateForTurnAnimation;                       // 0x484(0x4)(Edit, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsTurning;                                        // 0x488(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bTurningRight;                                     // 0x489(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseRunning;                                       // 0x48A(0x1)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsRunning;                                        // 0x48B(0x1)(Edit, ConstParm, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseSleepingAnim;                                  // 0x48C(0x1)(ConstParm, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsSleeping;                                       // 0x48D(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	bool                                         bUseFalling;                                       // 0x48E(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_BBF[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        FallingAnimPlayRate;                               // 0x490(0x4)(Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        FallingBlendInTime;                                // 0x494(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        FallingBlendOutTime;                               // 0x498(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsFalling;                                        // 0x49C(0x1)(Edit, BlueprintVisible, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseMounted;                                       // 0x49D(0x1)(ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsMounted;                                        // 0x49E(0x1)(ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_BC5[0x1];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimInstance_DinoRootTransform* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class ShooterGame.AnimNotifyState_Custom
class UAnimNotifyState_Custom : public UAnimNotifyState
{
public:
	class FName                                  EventName;                                         // 0x30(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         bSendNotifyToWeapon;                               // 0x38(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bSendNotifyToArmorSlot;                            // 0x39(0x1)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	enum class EPrimalEquipmentType              ArmorSlotToSendNotify;                             // 0x3A(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_BCF[0x5];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimNotifyState_Custom* GetDefaultObj();

};

// 0x18 (0x58 - 0x40)
// Class ShooterGame.AnimNotify_CustomEvent
class UAnimNotify_CustomEvent : public UAnimNotify
{
public:
	class FName                                  EventName;                                         // 0x40(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         bSendNotifyToWeapon;                               // 0x48(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bSendNotifyToArmorSlot;                            // 0x49(0x1)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	enum class EPrimalEquipmentType              ArmorSlotToSendNotify;                             // 0x4A(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bLockHeadPositionNormalized;                       // 0x4B(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        TimeToLockHeadPosition;                            // 0x4C(0x4)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUnlockHeadPositionNormalized;                     // 0x50(0x1)(ConstParm, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_BD3[0x7];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimNotify_CustomEvent* GetDefaultObj();

};

// 0x38 (0x78 - 0x40)
// Class ShooterGame.AnimNotify_PlayCameraShake
class UAnimNotify_PlayCameraShake : public UAnimNotify
{
public:
	float                                        PercentChanceToPlay;                               // 0x40(0x4)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_BD5[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	class UClass*                                TheCameraShake;                                    // 0x48(0x8)(ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        InnerRadius;                                       // 0x50(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        OuterRadius;                                       // 0x54(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        Falloff;                                           // 0x58(0x4)(Edit, ConstParm, EditFixedSize, Parm, OutParm, Config, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bOrientShakeTowardsEpicenter;                      // 0x5C(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_BD6[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        ShakeScale;                                        // 0x60(0x4)(Edit, BlueprintVisible, Parm, ZeroConstructor, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_BD7[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	class FString                                AttachName;                                        // 0x68(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UAnimNotify_PlayCameraShake* GetDefaultObj();

};

// 0x10 (0x120 - 0x110)
// Class ShooterGame.AnimNotify_PlayParticleEffectCustom
class UAnimNotify_PlayParticleEffectCustom : public UAnimNotify_PlayParticleEffect
{
public:
	class FName                                  AttachedComponentTag;                              // 0x110(0x8)(Net, Parm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_BDC[0x8];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimNotify_PlayParticleEffectCustom* GetDefaultObj();

};

// 0x10 (0x50 - 0x40)
// Class ShooterGame.AnimNotify_StopSound
class UAnimNotify_StopSound : public UAnimNotify
{
public:
	class USoundBase*                            SoundToStop;                                       // 0x40(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	float                                        FadeOutTime;                                       // 0x48(0x4)(BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_BDE[0x4];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimNotify_StopSound* GetDefaultObj();

};

// 0x98 (0xC0 - 0x28)
// Class ShooterGame.AntiDupeTransactionLog
class UAntiDupeTransactionLog : public UObject
{
public:
	class UWorld*                                CurrentWorld;                                      // 0x28(0x8)(Edit, ConstParm, ExportObject, Net, Parm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_BDF[0x90];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAntiDupeTransactionLog* GetDefaultObj();

};

// 0x30 (0x58 - 0x28)
// Class ShooterGame.ArkCloudInventoryData
class UArkCloudInventoryData : public UObject
{
public:
	struct FArkInventoryData                     MyArkData;                                         // 0x28(0x30)(ConstParm, BlueprintReadOnly, Net, Parm, Transient, Config, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UArkCloudInventoryData* GetDefaultObj();

};

// 0x18 (0x4E0 - 0x4C8)
// Class ShooterGame.BaseBoxTrigger
class ABaseBoxTrigger : public AActor
{
public:
	class USceneComponent*                       SceneComp;                                         // 0x4C8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UBoxComponent*                         TriggerBox;                                        // 0x4D0(0x8)(Edit, ConstParm, Net, Parm, OutParm, DisableEditOnInstance, GlobalConfig)
	uint8                                        bUseBPOnTriggerBeginOverlap : 1;                   // Mask: 0x1, PropSize: 0x10x4D8(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUseBPOnTriggerEndOverlap : 1;                     // Mask: 0x2, PropSize: 0x10x4D8(0x1)(EditFixedSize, Parm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_C06[0x7];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class ABaseBoxTrigger* GetDefaultObj();

	void OnTriggerEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	struct FHitResult OnTriggerBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep);
	void IsCharacterTouchingTrigger(class APrimalCharacter** Character, bool* ReturnValue);
	void GetAllCharactersTouchingTrigger(const TArray<class APrimalCharacter*>& OutCharacters);
	void BPOnTriggerEndOverlap(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	struct FHitResult BPOnTriggerBeginOverlap(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep);
};

// 0x40 (0xB38 - 0xAF8)
// Class ShooterGame.BasePlayerController
class ABasePlayerController : public APrimalPlayerController
{
public:
	uint8                                        Pad_C21[0x28];                                     // Fixing Size After Last Property  > TateDumper <
	class UUI_CustomOverlay*                     CustomCursor;                                      // 0xB20(0x8)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_C22[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	bool                                         bIsGamepadActive;                                  // 0xB30(0x1)(Edit, EditFixedSize, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	uint8                                        Pad_C24[0x7];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class ABasePlayerController* GetDefaultObj();

	bool SimulateInputKey(const struct FKey& Key);
	void ServerCheat(const class FString& Msg);
	void Say(const class FString& Msg);
	void ClientStartOnlineGame();
	struct FRotator ClientSetSpectatorCamera();
	int32 ClientSendRoundEndEvent(bool* bIsWinner);
	void ClientGameStarted();
	void ClientEndOnlineGame();
};

// 0x10 (0x330 - 0x320)
// Class ShooterGame.PrimalUserWidget
class UPrimalUserWidget : public UUserWidget
{
public:
	uint8                                        Pad_C51[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        ViewportZOrder;                                    // 0x328(0x4)(BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	float                                        DPIScaler;                                         // 0x32C(0x4)(ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)

	static class UClass* StaticClass();
	static class UPrimalUserWidget* GetDefaultObj();

	void WidgetRemovedFromViewport();
	void WidgetAddedToViewport();
	void StopAnimationByString(class FString* Name);
	void SetZOrderInViewport(int32* ZOrder);
	void PlayAnimationByString(class FString* Name, bool* ReturnValue);
	bool OnWidgetGamepadActiveChangedBP();
	class UFont* NumCharactersThatFit(class FString* ReturnValue);
	void HandleVirtualBack(bool* ReturnValue);
	struct FKey HandleKeyUp(bool* ReturnValue);
	void GetOverrideHighligteableWidgetBP(class UWidget** ReturnValue);
	struct FBPNetExecParams ExecuteCommandForPrimalUI();
	struct FBPNetExecParams BPExecutedCommandForPrimalUI();
};

// 0x428 (0x758 - 0x330)
// Class ShooterGame.PrimalUI
class UPrimalUI : public UPrimalUserWidget
{
public:
	uint8                                        Pad_CD2[0x4C];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bCaptureMouseInput;                                // 0x37C(0x1)(ExportObject, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPreventGamepadDpadNavegation;                     // 0x37D(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bForceVirtualCursorEnabled;                        // 0x37E(0x1)(ConstParm, ExportObject, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsClosing;                                        // 0x37F(0x1)(BlueprintVisible, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bWantsPrimalItemNotifications;                     // 0x380(0x1)(BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_CD6[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	class UClass*                                DefaultToolTipWidget;                              // 0x388(0x8)(Edit, ExportObject, Net, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bEscapeClosesMenu;                                 // 0x390(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bEscapeOpensPauseMenu;                             // 0x391(0x1)(Edit, ConstParm, BlueprintReadOnly, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bSpecialRightOpensPauseMenu;                       // 0x392(0x1)(BlueprintVisible, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bMenuSupportSlomo;                                 // 0x393(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bClickClosesMenu;                                  // 0x394(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsGameplayUI;                                     // 0x395(0x1)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsTopUI;                                          // 0x396(0x1)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	enum class EHighlightStartingPoint           HighlightStartPointType;                           // 0x397(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                ConfirmationDialogUITemplate;                      // 0x398(0x8)(ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                XBoxFooterUITemplate;                              // 0x3A0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bShowCancelIcon;                                   // 0x3A8(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bShowAcceptIcon;                                   // 0x3A9(0x1)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bShowLStickIcon;                                   // 0x3AA(0x1)(ConstParm, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bShowRStickIcon;                                   // 0x3AB(0x1)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bShowBumpersIcon;                                  // 0x3AC(0x1)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bShowStartBtnIcon;                                 // 0x3AD(0x1)(ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bShowLTBtnIcon;                                    // 0x3AE(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bShowRTBtnIcon;                                    // 0x3AF(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bShowFaceBtnLeftIcon;                              // 0x3B0(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bShowFaceBtnTopIcon;                               // 0x3B1(0x1)(Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bShowFaceBtnRightIcon;                             // 0x3B2(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bShowFaceBtnBottomIcon;                            // 0x3B3(0x1)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bShowLeftShoulderBtnIcon;                          // 0x3B4(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bShowXBoxFooter;                                   // 0x3B5(0x1)(ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIgnoreUIScaling;                                  // 0x3B6(0x1)(Edit, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bCloseOnPlayerDie;                                 // 0x3B7(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        SplitscreenDPIScaler;                              // 0x3B8(0x4)(BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bForceFullscreenVirtualCursor;                     // 0x3BC(0x1)(BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bConstrainVirtualCursor;                           // 0x3BD(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDoExtraDataListButtonPanelFilteringChecks;        // 0x3BE(0x1)(Edit, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_CDF[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	class FName                                  DefaultHighlightWidgetOverrideName;                // 0x3C0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bShouldValidateInputOnRemove;                      // 0x3C8(0x1)(EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         ShouldStretchMainScreenWhenHandheld;               // 0x3C9(0x1)(Edit, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         WasInHandheldMode;                                 // 0x3CA(0x1)(Edit, ConstParm, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_CE2[0x5];                                      // Fixing Size After Last Property  > TateDumper <
	struct FAnchors                              OriginalUnStretchedAnchors;                        // 0x3D0(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FMargin                               OriginalUnstretchedSize;                           // 0x3F0(0x10)(ExportObject, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector2D                             OriginalSizeBoxUnstretchedSize;                    // 0x400(0x10)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FAnchors                              StretchedHandheldAnchors;                          // 0x410(0x20)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FMargin                               StretchedHandheldSize;                             // 0x430(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector2D                             SizeBoxHandheldSize;                               // 0x440(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        VirtualCursorFrames;                               // 0x450(0x4)(Edit, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_CE6[0x4C];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        AnalogDeltaX;                                      // 0x4A0(0x4)(ConstParm, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        AnalogDeltaY;                                      // 0x4A4(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_CEB[0x1C0];                                    // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            HTTPGetResponseEvent;                              // 0x668(0x10)(BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	TWeakObjectPtr<class APrimalStructureItemContainer> ItemContainer;                                     // 0x678(0x8)(ExportObject, Net, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bCachedIsGamepadActive;                            // 0x680(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_CED[0xD3];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         OverrideButtonSounds;                              // 0x754(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_CEE[0x3];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UPrimalUI* GetDefaultObj();

	bool UsingProController(bool* ReturnValue);
	enum class EDLCSelector ShowDLCConfirmationDialog(class UUI_GenericConfirmationDialog** ReturnValue);
	bool ShowConfirmationDialogBP(const class FString& MessageText);
	void SetInputMode();
	bool SetHighlightedWidget();
	void ResetAllScrollBars();
	void RemovedFromViewport();
	bool ProcessSplitscreen();
	class UWorld* PlayHapticEffect(struct FVector* Location);
	class FString OpenTheStoreDLCPage();
	void OnMouseButtonDownEvent(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent, struct FEventReply* ReturnValue);
	void OnKeyUpEvent(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyboardEvent, struct FEventReply* ReturnValue);
	void OnKeyDownEvent(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyboardEvent, struct FEventReply* ReturnValue);
	void OnGamepadButtonDownEvent(const struct FGeometry& MyGeometry, struct FControllerEvent* ControllerEvent, struct FEventReply* ReturnValue);
	bool OnGamepadActiveChangedBP();
	bool OnGamepadActiveChanged();
	void OnDLCConfirmationDialogClosed(bool* bAccept);
	class UWidget* OnCreateCredits();
	void OnConfirmationDialogClosedBP(bool* bAccept);
	void OnConfirmationDialogClosed(bool* bAccept);
	void MainMenuEscapePressed();
	void IsRightTriggerDown(bool* ReturnValue);
	void IsLeftTriggerDown(bool* ReturnValue);
	class FString HTTPGetString();
	void HandleDockedModeChanges();
	void GetWidgetToScaleForHandheld(class UWidget** ReturnValue);
	void GetSizeboxForExtraHandheldScaling(class USizeBox** ReturnValue);
	void GetShooterHud(class AShooterHUD** ReturnValue);
	void GetPlayerState(class AShooterPlayerState** ReturnValue);
	void GetPC(class AShooterPlayerController** ReturnValue);
	void GetPawn(class APrimalCharacter** ReturnValue);
	void GetOpenComboBox(class UComboBoxString** ReturnValue);
	void FixHighlights();
	struct FVector2D DoExtraScalingForSplitscreen();
	void CloseWithAnimation();
	class UWidget* ClickedSecondaryButton();
	class UWidget* ClickedButton();
	bool CheckGamepadActiveChanged();
	struct FSlateColor ChangeChildrenTextColorBP(class UPanelWidget* Parent, bool* Recursive);
	void BPVirtualCursorinit();
	void BPReleasedVirtualAccept();
	bool BPProcessSplitscreenAndAddToViewport();
	void BPHighlightWidgetOnStart(bool* ReturnValue);
	bool BPHandleDockedModeChange();
	struct FKey BPGamepadReleased(bool* ReturnValue);
	void BPEscapeClosed(bool* ReturnValue);
	void BPCycleHighlighted(bool* ReturnValue);
	float BPControlHighlighted();
	void AddedToViewport();
};

// 0x0 (0x758 - 0x758)
// Class ShooterGame.BaseSelectableButtonWidget
class UBaseSelectableButtonWidget : public UPrimalUI
{
public:

	static class UClass* StaticClass();
	static class UBaseSelectableButtonWidget* GetDefaultObj();

	bool BPSetSelected();
	void BPIsSelected(bool* ReturnValue);
	void BPGetButton(class UCustomButtonWidget** ReturnValue);
};

// 0x8A0 (0xE50 - 0x5B0)
// Class ShooterGame.ShooterGameState
class AShooterGameState : public AGameState
{
public:
	uint8                                        Pad_E64[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        NumNPC;                                            // 0x5C0(0x4)(Edit, ConstParm, Net, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        NumHibernatedNPC;                                  // 0x5C4(0x4)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        NPCActiveCountTamed;                               // 0x5C8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        NumActiveNPC;                                      // 0x5CC(0x4)(ExportObject, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        NumDeadNPC;                                        // 0x5D0(0x4)(ConstParm, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        NumPlayerActors;                                   // 0x5D4(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        NumPlayerConnected;                                // 0x5D8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bServerUseLocalizedChat;                           // 0x5DC(0x1)(ConstParm, Net, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_E69[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        LocalizedChatRadius;                               // 0x5E0(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        LocalizedChatRadiusUnconsiousScale;                // 0x5E4(0x4)(Edit, BlueprintVisible, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        ServerFramerate;                                   // 0x5E8(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_E6B[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	class FString                                NewStructureDestructionTag;                        // 0x5F0(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	int32                                        DayNumber;                                         // 0x600(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, ReturnParm, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	float                                        DayTime;                                           // 0x604(0x4)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	double                                       NetworkTime;                                       // 0x608(0x8)(ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint32                                       TimeUTC;                                           // 0x610(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	int32                                        NetUTC;                                            // 0x614(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsOfficialServer;                                 // 0x618(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsListenServer;                                   // 0x619(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsDediServer;                                     // 0x61A(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsServerRunningOnConsole;                         // 0x61B(0x1)(BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsArkTributeAvailable;                            // 0x61C(0x1)(BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsArkDownloadsAllowed;                            // 0x61D(0x1)(ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAllowThirdPersonPlayer;                           // 0x61E(0x1)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bServerHardcore;                                   // 0x61F(0x1)(ConstParm, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bServerPVE;                                        // 0x620(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAutoPvE;                                          // 0x621(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bServerCrosshair;                                  // 0x622(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bServerForceNoHUD;                                 // 0x623(0x1)(BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bFlyerPlatformAllowUnalignedDinoBasing;            // 0x624(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bMapPlayerLocation;                                // 0x625(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPvEDisableFriendlyFire;                           // 0x626(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPvEAllowTribeWar;                                 // 0x627(0x1)(Edit, Net, EditFixedSize, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bPvEAllowTribeWarCancel;                           // 0x628(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bEnablePvPGamma;                                   // 0x629(0x1)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPreventDroppedItemPhysics;                        // 0x62A(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisablePvEGamma;                                  // 0x62B(0x1)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	int32                                        NumTamedDinos;                                     // 0x62C(0x4)(Edit, BlueprintVisible, Net, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	int32                                        MaxStructuresInRange;                              // 0x630(0x4)(BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	float                                        DayCycleSpeedScale;                                // 0x634(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        DayTimeSpeedScale;                                 // 0x638(0x4)(BlueprintVisible, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        NightTimeSpeedScale;                               // 0x63C(0x4)(ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	int32                                        StartTimeHour;                                     // 0x640(0x4)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        PvEStructureDecayPeriodMultiplier;                 // 0x644(0x4)(Edit, ConstParm, BlueprintVisible, Net, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        PvEDinoDecayPeriodMultiplier;                      // 0x648(0x4)(Edit, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        PerPlatformMaxStructuresMultiplier;                // 0x64C(0x4)(ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        ImplantSuicideCD;                                  // 0x650(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         bDisableStructureDecayPvE;                         // 0x654(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableDinoDecayPvE;                              // 0x655(0x1)(BlueprintVisible, ExportObject, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAllowCaveBuildingPvE;                             // 0x656(0x1)(OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAllowCaveBuildingPvP;                             // 0x657(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPreventDownloadSurvivors;                         // 0x658(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bReachedPlatformStructureLimit;                    // 0x659(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAdminLogging;                                     // 0x65A(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPvPStructureDecay;                                // 0x65B(0x1)(BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPreventDownloadDinos;                             // 0x65C(0x1)(ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPreventDownloadItems;                             // 0x65D(0x1)(BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPreventUploadDinos;                               // 0x65E(0x1)(Edit, Net, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPreventUploadItems;                               // 0x65F(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPreventUploadSurvivors;                           // 0x660(0x1)(Edit, ExportObject, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPreventMateBoost;                                 // 0x661(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPreventStructurePainting;                         // 0x662(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAllowCharacterCreation;                           // 0x663(0x1)(BlueprintVisible, Net, EditFixedSize, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAllowSpawnPointSelection;                         // 0x664(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_E87[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        MaxTamedDinos;                                     // 0x668(0x4)(EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         bDisableSpawnAnimations;                           // 0x66C(0x1)(Edit, ExportObject, EditFixedSize, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_E8A[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	class FString                                PlayerListString;                                  // 0x670(0x10)(EditFixedSize, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnPlayerListPopulated;                             // 0x680(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	float                                        GlobalSpoilingTimeMultiplier;                      // 0x690(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        GlobalItemDecompositionTimeMultiplier;             // 0x694(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	int32                                        MaxNumberOfPlayersInTribe;                         // 0x698(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	float                                        TribeSlotReuseCooldown;                            // 0x69C(0x4)(ExportObject, Net, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	float                                        GlobalCorpseDecompositionTimeMultiplier;           // 0x6A0(0x4)(ConstParm, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        EggHatchSpeedMultiplier;                           // 0x6A4(0x4)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	class FName                                  ActiveEvent;                                       // 0x6A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         bAllowPaintingWithoutResources;                    // 0x6B0(0x1)(ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bEnableExtraStructurePreventionVolumes;            // 0x6B1(0x1)(BlueprintVisible, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_E93[0x6];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<struct FItemCraftingCostOverride>     OverrideItemCraftingCosts;                         // 0x6B8(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FItemMaxItemQuantityOverride>  OverrideItemMaxQuantity;                           // 0x6C8(0x10)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         DisableRailgunPVP;                                 // 0x6D8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_E99[0xA7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       PrivateNetworkTime;                                // 0x780(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	double                                       LastServerSaveTime;                                // 0x788(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	float                                        ServerSaveInterval;                                // 0x790(0x4)(Edit, EditFixedSize, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	float                                        TribeNameChangeCooldown;                           // 0x794(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        PlatformSaddleBuildAreaBoundsMultiplier;           // 0x798(0x4)(BlueprintVisible, Net, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         bAlwaysAllowStructurePickup;                       // 0x79C(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_E9E[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        StructurePickupTimeAfterPlacement;                 // 0x7A0(0x4)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        StructurePickupHoldDuration;                       // 0x7A4(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         bAllowHideDamageSourceFromLogs;                    // 0x7A8(0x1)(ConstParm, Net, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_EA2[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<struct FClassMultiplier>              DinoClassSpeedMultipliers;                         // 0x7B0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              TamedDinoClassSpeedMultipliers;                    // 0x7C0(0x10)(BlueprintVisible, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bRiderDinoCollision;                               // 0x7D0(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_EA7[0x1F];                                     // Fixing Size After Last Property  > TateDumper <
	class UAudioComponent*                       DynamicMusicAudioComponent;                        // 0x7F0(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, EditConst, InstancedReference, SubobjectReference)
	class UAudioComponent*                       DynamicMusicAudioComponent2;                       // 0x7F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_EA9[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FLevelExperienceRamp>          LevelExperienceRampOverrides;                      // 0x810(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FEngramEntryOverride>          OverrideEngramEntries;                             // 0x820(0x10)(Edit, EditFixedSize, OutParm, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                CustomGameUITemplate;                              // 0x830(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, EditConst, InstancedReference, SubobjectReference)
	TArray<class FString>                        PreventDinoTameClassNames;                         // 0x838(0x10)(ExportObject, Net, OutParm, EditConst, InstancedReference, SubobjectReference)
	float                                        ListenServerTetherDistanceMultiplier;              // 0x848(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_EAD[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	class FString                                PGMapName;                                         // 0x850(0x10)(ConstParm, Net, OutParm, EditConst, InstancedReference, SubobjectReference)
	TArray<int32>                                SupportedSpawnRegions;                             // 0x860(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, EditConst, InstancedReference, SubobjectReference)
	class UPaintingCache*                        PaintingCache;                                     // 0x870(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, GlobalConfig)
	class USoundBase*                            StaticOverrideMusic;                               // 0x878(0x8)(Edit, ConstParm, ExportObject, OutParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bEnableDeathTeamSpectator;                         // 0x880(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_EB3[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               PlayerFloatingHUDOffset;                           // 0x888(0x18)(BlueprintReadOnly, Net, EditFixedSize, Parm, EditConst, InstancedReference, SubobjectReference)
	float                                        PlayerFloatingHUDOffsetScreenY;                    // 0x8A0(0x4)(Net, EditFixedSize, Parm, EditConst, InstancedReference, SubobjectReference)
	float                                        StructureDamageRepairCooldown;                     // 0x8A4(0x4)(ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bForceAllStructureLocking;                         // 0x8A8(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAllowCustomRecipes;                               // 0x8A9(0x1)(Edit, ConstParm, EditFixedSize, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bAllowRaidDinoFeeding;                             // 0x8AA(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_EBB[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        CustomRecipeEffectivenessMultiplier;               // 0x8AC(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	float                                        CustomRecipeSkillMultiplier;                       // 0x8B0(0x4)(ConstParm, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	uint8                                        Pad_EBE[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	class USoundBase*                            OverrideAreaMusic;                                 // 0x8B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               OverrideAreaMusicPosition;                         // 0x8C0(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, EditConst, InstancedReference, SubobjectReference)
	float                                        OverrideAreaMusicRange;                            // 0x8D8(0x4)(ConstParm, Net, Parm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAllowUnclaimDinos;                                // 0x8DC(0x1)(ExportObject, BlueprintReadOnly, Parm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_EC2[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        FloatingHUDRange;                                  // 0x8E0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, EditConst, InstancedReference, SubobjectReference)
	float                                        FloatingChatRange;                                 // 0x8E4(0x4)(Edit, BlueprintVisible, Parm, EditConst, InstancedReference, SubobjectReference)
	int32                                        ExtinctionEventTimeInterval;                       // 0x8E8(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, EditConst, InstancedReference, SubobjectReference)
	float                                        RTSModeNumSelectableDinosScale;                    // 0x8EC(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, EditConst, InstancedReference, SubobjectReference)
	float                                        RTSMaxRangeFromPlayerCharacterScale;               // 0x8F0(0x4)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, EditConst, InstancedReference, SubobjectReference)
	float                                        ExtinctionEventPercent;                            // 0x8F4(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, EditConst, InstancedReference, SubobjectReference)
	int32                                        ExtinctionEventSecondsRemaining;                   // 0x8F8(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDoExtinctionEvent;                                // 0x8FC(0x1)(BlueprintVisible, ExportObject, Net, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_ECB[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        DestroyTamesOverLevelClamp;                        // 0x900(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_ECE[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<struct FInventoryComponentDefaultItemsAppend> InventoryComponentAppends;                         // 0x908(0x10)(BlueprintReadOnly, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPreventOfflinePvP;                                // 0x918(0x1)(ConstParm, BlueprintVisible, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPvPDinoDecay;                                     // 0x919(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAllowUnclaimDinosConfig;                          // 0x91A(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bForceUseInventoryAppends;                         // 0x91B(0x1)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bOverideStructurePlatformPrevention;               // 0x91C(0x1)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_ED6[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        ItemStackSizeMultiplier;                           // 0x920(0x4)(ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_ED9[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<int32>                                PreventOfflinePvPLiveTeams;                        // 0x928(0x10)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<int32>                                PreventOfflinePvPExpiringTeams;                    // 0x938(0x10)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<float>                                PreventOfflinePvPExpiringTimes;                    // 0x948(0x10)(ConstParm, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_EDC[0xA0];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bAllowAnyoneBabyImprintCuddle;                     // 0x9F8(0x1)(ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableImprintDinoBuff;                           // 0x9F9(0x1)(Edit, BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_EDE[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        MaxPersonalTamedDinos;                             // 0x9FC(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_EDF[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                ClusterId;                                         // 0xA18(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_EE0[0x30];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                ServerSessionName;                                 // 0xA58(0x10)(Edit, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPreventTribeAlliances;                            // 0xA68(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_EE1[0x19];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bServerUseDinoList;                                // 0xA82(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPvEAllowStructuresAtSupplyDrops;                  // 0xA83(0x1)(ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAllowForceNetUpdate;                              // 0xA84(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_EF6[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        MinimumDinoReuploadInterval;                       // 0xA88(0x4)(ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        HairGrowthSpeedMultiplier;                         // 0xA8C(0x4)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        DinoHairGrowthSpeedMultiplier;                     // 0xA90(0x4)(ConstParm, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        FastDecayInterval;                                 // 0xA94(0x4)(OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class FString                                CachedSessionOwnerId;                              // 0xA98(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        OxygenSwimSpeedStatMultiplier;                     // 0xAA8(0x4)(BlueprintVisible, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_EFA[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnHTTPGetResponse;                                 // 0xAB0(0x10)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnHTTPPostResponse;                                // 0xAC0(0x10)(Edit, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAllowMultipleAttachedC4;                          // 0xAD0(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bCrossARKAllowForeignDinoDownloads;                // 0xAD1(0x1)(ConstParm, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_EFD[0x16];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bUseCorpseLocator;                                 // 0xAE8(0x1)(Edit, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bEnablePlayerMoveThroughSleeping;                  // 0xAE9(0x1)(Edit, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bEnablePlayerMoveThroughAlly;                      // 0xAEA(0x1)(ConstParm, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableStructurePlacementCollision;               // 0xAEB(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bUseSingleplayerSettings;                          // 0xAEC(0x1)(Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bAllowPlatformSaddleMultiFloors;                   // 0xAED(0x1)(Edit, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bPreventSpawnAnimations;                           // 0xAEE(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F06[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        MaxAlliancesPerTribe;                              // 0xAF0(0x4)(ConstParm, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        MaxTribesPerAlliance;                              // 0xAF4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsLegacyServer;                                   // 0xAF8(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableDinoDecayClaiming;                         // 0xAF9(0x1)(ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F09[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        MaxTamedDinos_SoftTameLimit_CountdownForDeletionDuration; // 0xAFC(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	int32                                        MaxTamedDinos_SoftTameLimit_NumTamedDinos_UnderLimit; // 0xB00(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        MaxTamedDinos_SoftTameLimit_NumTamedDinos_OverLimit; // 0xB04(0x4)(ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         MaxTamedDinos_SoftTameLimit_HasDoneInitialSearch;  // 0xB08(0x1)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F0D[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	class FName                                  UseStructurePreventionVolumeTag;                   // 0xB0C(0x8)(ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        MaxStructuresInSmallRadius;                        // 0xB14(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        RadiusStructuresInSmallRadius;                     // 0xB18(0x4)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseTameLimitForStructuresOnly;                    // 0xB1C(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableWirelessCrafting;                          // 0xB1D(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableWirelessCraftingForDinos;                  // 0xB1E(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableWirelessCraftingForPlayers;                // 0xB1F(0x1)(ConstParm, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableWirelessCraftingForStructures;             // 0xB20(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F24[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        WirelessCraftingRangeOverride;                     // 0xB24(0x4)(ConstParm, BlueprintVisible, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F25[0xC];                                      // Fixing Size After Last Property  > TateDumper <
	bool                                         bLimitTurretsInRange;                              // 0xB34(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F27[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        LimitTurretsRange;                                 // 0xB38(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        LimitTurretsNum;                                   // 0xB3C(0x4)(ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        LimitGeneratorsNum;                                // 0xB40(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        LimitGeneratorsRange;                              // 0xB44(0x4)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        CropPlotStackLimit;                                // 0xB48(0x4)(Edit, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisablePhotoMode;                                 // 0xB4C(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bDisableTekLegsBoost;                              // 0xB4D(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F2C[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        PhotoModeRangeLimit;                               // 0xB50(0x4)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bForceAllowAllStructures;                          // 0xB54(0x1)(Edit, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bShowCreativeMode;                                 // 0xB55(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	uint8                                        Pad_F2D[0x22];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        PassiveTameIntervalMultiplier;                     // 0xB78(0x4)(Edit, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F2F[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<class UClass*>                        UniqueDinos;                                       // 0xB80(0x10)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<class FName>                          ActiveMissionTags;                                 // 0xB90(0x10)(BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint32                                       MinimumUniqueDownloadInterval;                     // 0xBA0(0x4)(OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint32                                       MaximumUniqueDownloadInterval;                     // 0xBA4(0x4)(BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIgnoreStructuresPreventionVolumes;                // 0xBA8(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPreventOutOfTribePinCodeUse;                      // 0xBA9(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F35[0x6];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<struct FDinoDownloadData>             UniqueDownloads;                                   // 0xBB0(0x10)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FDataSet>                      GameDataSets;                                      // 0xBC0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UPrimalWorldSettingsEventOverrides*    ActiveEventOverrides;                              // 0xBD0(0x8)(BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIgnoreLimitMaxStructuresInRangeTypeFlag;          // 0xBD8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F3B[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<struct FMassTeleportData>             MassTeleportQueue;                                 // 0xBE0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F3E[0x70];                                     // Fixing Size After Last Property  > TateDumper <
	TMap<class FName, class UDataLayerInstance*> DataLayerMap;                                      // 0xC60(0x50)(Edit, BlueprintVisible, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAllowLowGravitySpin;                              // 0xCB0(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F3F[0x17];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnDinoDownloaded;                                  // 0xCC8(0x10)(Edit, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnDinoUploaded;                                    // 0xCD8(0x10)(Edit, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FWorldBuffPersistantData>      WorldBuffPersistantDatas;                          // 0xCE8(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        TurretCopySettingsCooldown;                        // 0xCF8(0x4)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        BaseHexagonRewardMultiplier;                       // 0xCFC(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        HexagonRewardMultiplier;                           // 0xD00(0x4)(ConstParm, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        HexagonCostMultiplier;                             // 0xD04(0x4)(ConstParm, BlueprintVisible, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableHexagonStore;                              // 0xD08(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bHexStoreAllowOnlyEngramTradeOption;               // 0xD09(0x1)(ExportObject, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAllowSpeedLeveling;                               // 0xD0A(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bAllowFlyerSpeedLeveling;                          // 0xD0B(0x1)(ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	uint8                                        Pad_F46[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<class FString>                        PreventBreedingForClassNames;                      // 0xD10(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        LiveTuningReplicatedChunkSize;                     // 0xD20(0x4)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F47[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<class FString>                        LiveTuningOverloadChunks;                          // 0xD28(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F48[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<class FString>                        PreventTransferForClassNames;                      // 0xD40(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        EnvironmentIndex;                                  // 0xD50(0x4)(BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        NextEnvironmentIndex;                              // 0xD54(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FColor                                FloatingPlatformProfileNameColor;                  // 0xD58(0x4)(ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FColor                                FloatingNameColor;                                 // 0xD5C(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       NextMutagenTime;                                   // 0xD60(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        OverrideMaxExperiencePointsPlayer;                 // 0xD68(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	int32                                        OverrideMaxExperiencePointsDino;                   // 0xD6C(0x4)(BlueprintVisible, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	TArray<int32>                                DeferredExplorerNoteUnlockQueue;                   // 0xD70(0x10)(BlueprintVisible, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableCustomFoldersInTributeInventories;         // 0xD80(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F4F[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<TWeakObjectPtr<class AActor>>         ForcedRelevantPOIActors;                           // 0xD88(0x10)(Edit, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableRailgunPVP;                                // 0xD98(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F52[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        MinimumTimebetweeninventoryRetrieval;              // 0xD9C(0x4)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        WildFollowerSpawnChanceMultiplier;                 // 0xDA0(0x4)(ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        WildFollowerSpawnCountMultiplier;                  // 0xDA4(0x4)(Edit, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableDinoItemBlacklist;                         // 0xDA8(0x1)(Edit, ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAllowCryoFridgeOnSaddle;                          // 0xDA9(0x1)(ConstParm, BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F53[0x56];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       RealtimeThrottledTickTimeAmount;                   // 0xE00(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F54[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bCharacterPaintingOnlySameTeam : 1;                // Mask: 0x1, PropSize: 0x10xE0C(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_9B : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_F59[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<struct FNetChangeDefaultPropertyValue> CurrentDefaultPropertyValueUpdates;                // 0xE10(0x10)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_F5A[0x30];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class AShooterGameState* GetDefaultObj();

	struct FTeleportDestination StartMassTeleport(class AActor** InitiatingActor, const TArray<class AActor*>& TeleportActors, class UClass* BuffToApply, float TeleportDuration, float TeleportRadius, bool bTeleportingSnapsToGround, bool bMaintainRotation, bool* ReturnValue);
	class AActor* ShouldMassTeleportMoveActor(const struct FMassTeleportData& WithMassTeleportData, bool* ReturnValue);
	void SetNextEnvironmentIndex(int32 NewNextEnvironmentIndex);
	void SetEnvironmentIndex(int32 NewEnvironmentIndex);
	void RemoveRelevantPOIActor(class AActor** POI);
	void QueueExplorerNoteForDeferredUnlock(int32 ExplorerNoteIndex);
	void PrintCDODebugForChar(class APrimalCharacter* ReferenceChar);
	void PrintCDODebug(class APrimalCharacter* ReferenceChar, struct FCDODebugData* CDODebugData);
	void PrepareActorForMassTeleport(class AActor* PrepareActor, const struct FMassTeleportData& WithMassTeleportData);
	void OnRep_SupportedSpawnRegions();
	void OnRep_ReplicateLocalizedChatRadius();
	void OnRep_ReplicateLiveTuningOverloadChunks();
	void OnRep_CurrentDefaultPropertyValueUpdates();
	void OnNewClassInitialized(class UClass* ForClass);
	void OnHUDNotification(const struct FHUDNotification& Notification, bool* ReturnValue);
	void NetUpdateOfflinePvPLiveTeams(const TArray<int32>& NewPreventOfflinePvPLiveTeams);
	void NetUpdateOfflinePvPExpiringTeams(const TArray<int32>& NewPreventOfflinePvPExpiringTeams, const TArray<float>& NewPreventOfflinePvPExpiringTimes);
	class FName NetSpawnFoliageVFXActorAtLocationAndDoFoliageInteraction(class UClass** AnActorClass, struct FVector_NetQuantize* AtLocation, const struct FRotator_NetQuantize& AtRotation, class AActor** EffectOwnerToIgnore, float* MaxRangeToReplicate, bool* bOnlySendToEffectOwner, bool IsSimpleFoliageInteraction, const struct FVector& FoliageOrigin_ImpactPoint, const struct FVector& TraceEndpoint);
	float NetAddFloatingText(struct FVector* AtLocation, class FString* FloatingTextString, struct FColor* FloatingTextColor, float* TextLifeSpan, struct FVector* TextVelocity, float* MinScale, float* FadeInTime, int32 OnlySendToTeamID);
	int32 NetAddFloatingDamageText(struct FVector* AtLocation, int32 FromTeamID, int32 OnlySendToTeamID);
	void Multi_SpawnCosmeticActor(class UClass* SpawnActorOfClass, struct FVector* SpawnAtLocation, struct FRotator* SpawnWithRotation);
	void LoadedWorld();
	void IsValidMassTeleportData(struct FMassTeleportData* CheckData, bool* ReturnValue);
	void IsUniqueDinoAlreadySpawned(TSoftClassPtr<class APrimalDinoCharacter>* UniqueDino, bool* ReturnValue);
	void IsTeamIDInvincible(int32* TargetingTeamID, bool* bInvincibleOnlyWhenOffline, bool* ReturnValue);
	void IsMassTeleportInProgress(class AActor** InitiatingActor, bool* ReturnValue);
	void IsEngramClassHidden(class UClass** ForItemClass, bool* ReturnValue);
	class FString HTTPPostRequest();
	class FString HTTPGetRequest();
	void HandleInitializedGameState();
	void GetStartTimeHour(int32* ReturnValue);
	void GetOfflineDamagePreventionTime(int32* TargetingTeamID, float* ReturnValue);
	void GetNetworkTimeDelta(class AShooterGameState* GameState, double* NetTime, bool* bTimeUntil, double* ReturnValue);
	void GetItemMaxQuantityOverride(class UClass* ForClass, struct FMaxItemQuantityOverride* OutMaxQuantity, bool* ReturnValue);
	void GetIniArray(class FString* SectionName, TArray<struct FGameIniData>* ReturnValue);
	void GetGamePhase(enum class EGamePhase* ReturnValue);
	void GetDayTimeString(class FString* ReturnValue);
	void GetDayCycleSpeed(float* ReturnValue);
	void GetCleanServerSessionName(class FString* ReturnValue);
	void ForceStartMatch(bool* PreventFinishTheMatch, bool* UseQuetzalBus);
	void DisplayWelcomeUI();
	class FName CDOGetPrintStringForObjectProperty(class UObject** TheObject, class FString* OutString, bool* ReturnValue);
	void CDOGetPrintStringForObjectProperties(class UObject** TheObject, TArray<class FName>* PropertyNames, class FString* OutString, bool* ReturnValue);
	void CancelMassTeleport(class AActor** WithInitiatingActor, bool* ReturnValue);
	void BPPreGameplaySetup();
	class FName BPNetSpawnActorAtLocation(class UClass** AnActorClass, struct FVector* AtLocation, const struct FRotator& AtRotation, class AActor** EffectOwnerToIgnore, float* MaxRangeToReplicate, bool* bOnlySendToEffectOwner);
	class AShooterHUD* BPDrawGameStateHUD();
	void BaseSpawnBuffAndAttachToCharacter(class UClass** Buff, class APrimalCharacter** PrimalCharacter, float* ExperiencePoints, class APrimalBuff** ReturnValue);
	struct FVector BaseProjectWorldToScreenPosition(class APlayerController** ThePC, struct FVector2D* ReturnValue);
	void BaseIsTribeID(int32 TeamID, bool* ReturnValue);
	void BaseGetCustomActors(class FName* SearchCustomTag, class ACustomActorList** ReturnValue);
	void BaseGetAllShooterControllers(TArray<class AShooterPlayerController*>* ReturnValue);
	void BaseGetAllShooterCharactersOfTeam(int32* KillerTeam, TArray<class AShooterCharacter*>* ReturnValue);
	void BaseGetAllShooterCharacters(TArray<class AShooterCharacter*>* ReturnValue);
	void BaseGetAllDinoCharactersOfTeam(int32* KillerTeam, TArray<class APrimalDinoCharacter*>* ReturnValue);
	class AShooterHUD* BaseDrawTileOnCanvas(class UTexture** Tex, float X, float Y, float* XL, float* YL, float* U, float* V, float* UL, float* VL, struct FColor* DrawColor);
	void AllowDownloadDino(TSoftClassPtr<class APrimalDinoCharacter>* TheDinoClass, bool* ReturnValue);
	void AllowDinoTame(class APrimalDinoCharacter** DinoChar, class AShooterPlayerController* ForPC, bool* ReturnValue);
	void AllowDinoClassTame(class UClass** DinoCharClass, class AShooterPlayerController* ForPC, bool* ReturnValue);
	void AddTokens(int32 Quantity, int32* byTribe);
	void AddRelevantPOIActor(class AActor** POI);
	float AddFloatingText(struct FVector* AtLocation, class FString* FloatingTextString, struct FColor* FloatingTextColor, float* TextLifeSpan, struct FVector* TextVelocity, float* MinScale, float* FadeInTime);
};

// 0x0 (0xE50 - 0xE50)
// Class ShooterGame.BattleGameState
class ABattleGameState : public AShooterGameState
{
public:

	static class UClass* StaticClass();
	static class ABattleGameState* GetDefaultObj();

};

// 0xD8 (0x770 - 0x698)
// Class ShooterGame.BeamWeaponComponent
class UBeamWeaponComponent : public UPrimitiveComponent
{
public:
	class UParticleSystem*                       ParticleSystemTemplate;                            // 0x698(0x8)(ConstParm, BlueprintVisible, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UParticleSystem*                       ChargeupParticleSystemTemplate;                    // 0x6A0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UParticleSystem*                       BurstWhenFiredSystemTemplate;                      // 0x6A8(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UParticleSystem*                       ImpactSystemTemplate;                              // 0x6B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        Duration;                                          // 0x6B8(0x4)(ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        DamageRadius;                                      // 0x6BC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                DamageType;                                        // 0x6C0(0x8)(ExportObject, Parm, OutParm, Transient, GlobalConfig)
	float                                        DamageDelay;                                       // 0x6C8(0x4)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        BaseDamage;                                        // 0x6CC(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        Length;                                            // 0x6D0(0x4)(ConstParm, BlueprintVisible, Net, ReturnParm)
	bool                                         IsPenetrating;                                     // 0x6D4(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_10CF[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TargetTrackingSpeed;                               // 0x6D8(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         UseOwnerForward;                                   // 0x6DC(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_10D6[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        Offset;                                            // 0x6E0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst)
	float                                        ChargeupTime;                                      // 0x6E4(0x4)(Edit, ConstParm, ExportObject, Net, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         WhenChargingWaitForCallToFire;                     // 0x6E8(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         DeactivateChargeupOnFiring;                        // 0x6E9(0x1)(Edit, BlueprintVisible, ExportObject, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_10D9[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            BeamStoppedFiringEvent;                            // 0x6F0(0x10)(Edit, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	TWeakObjectPtr<class AActor>                 BeamTarget;                                        // 0x700(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UParticleSystemComponent*              ParticleComp;                                      // 0x708(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UParticleSystemComponent*              ChargeUpComp;                                      // 0x710(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UParticleSystemComponent*              ImpactComp;                                        // 0x718(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_10DC[0x50];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UBeamWeaponComponent* GetDefaultObj();

	void UpdateBeamVisuals();
	void StopFiring();
	void StartFiring();
	void StartCharging();
	void SetTarget(class AActor* Target);
	void GetTarget(class AActor** ReturnValue);
	void GetParticleSystem(class UParticleSystemComponent** ReturnValue);
	void GetLastStoppedFiringTime(double* ReturnValue);
	void GetIsFiring(bool* ReturnValue);
	void GetIsCharging(bool* ReturnValue);
	void GetImpactParticleSystem(class UParticleSystemComponent** ReturnValue);
	void GetChargeupParticleSystem(class UParticleSystemComponent** ReturnValue);
	void GetBeamEndLocation(struct FVector* ReturnValue);
};

// 0x30 (0xE8 - 0xB8)
// Class ShooterGame.BeamWeaponController
class UBeamWeaponController : public UActorComponent
{
public:
	TArray<struct FComponentReference>           BeamWeapons;                                       // 0xB8(0x10)(Edit, ConstParm, BlueprintVisible, Net, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            BeamStoppedFiringEvent;                            // 0xC8(0x10)(Edit, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            BeamsStoppedFiringEvent;                           // 0xD8(0x10)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UBeamWeaponController* GetDefaultObj();

	void StopFiringBeams();
	void StartChargingBeams(bool* ReturnValue);
	void StartChargingBeam(bool* ReturnValue);
	class UBeamWeaponComponent* OnBeamStoppedFiringHandler();
	void GetBeamWeaponComponents(TArray<class UBeamWeaponComponent*>* ReturnValue);
	void FireBeams(bool* ReturnValue);
	void FireBeam(bool* ReturnValue);
};

// 0x10 (0x768 - 0x758)
// Class ShooterGame.BinocularsWidgetUI
class UBinocularsWidgetUI : public UPrimalUI
{
public:
	class FName                                  GamepadUnlockButtonName;                           // 0x758(0x8)(Edit, BlueprintReadOnly, Net, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_119C[0x8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UBinocularsWidgetUI* GetDefaultObj();

	class APrimalCharacter* GetDinoParentClass(class UClass** ReturnValue);
	enum class EPrimalCharacterStatusValue GetCharUsesStat(bool* ReturnValue);
	class APrimalCharacter* GetCharTorpidMaxStatus(float* ReturnValue);
	class APrimalCharacter* GetCharTorpidCurrentStatus(float* ReturnValue);
	enum class EPrimalCharacterStatusValue GetCharNumStatPointsString(class FString* ReturnValue);
	class APrimalCharacter* GetCharHealthMaxStatus(float* ReturnValue);
	class APrimalCharacter* GetCharHealthCurrentStatus(float* ReturnValue);
};

// 0x90 (0x558 - 0x4C8)
// Class ShooterGame.BiomeZoneSettings
class ABiomeZoneSettings : public AActor
{
public:
	class FString                                BiomeZoneName;                                     // 0x4C8(0x10)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        FinalTemperatureMultiplier;                        // 0x4D8(0x4)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        FinalTemperatureExponent;                          // 0x4DC(0x4)(BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        FinalTemperatureAddition;                          // 0x4E0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        PreOffsetTemperatureMultiplier;                    // 0x4E4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        PreOffsetTemperatureExponent;                      // 0x4E8(0x4)(Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        PreOffsetTemperatureAddition;                      // 0x4EC(0x4)(Edit, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        AboveTemperatureOffsetThreshold;                   // 0x4F0(0x4)(EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        AboveTemperatureOffsetMultiplier;                  // 0x4F4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        AboveTemperatureOffsetExponent;                    // 0x4F8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        BelowTemperatureOffsetThreshold;                   // 0x4FC(0x4)(ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        BelowTemperatureOffsetMultiplier;                  // 0x500(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        BelowTemperatureOffsetExponent;                    // 0x504(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        AbsoluteTemperatureOverride;                       // 0x508(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bPreventCrops : 1;                                 // Mask: 0x1, PropSize: 0x10x50C(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_B0 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_11AC[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        EggRangeMaximumNumberOverride;                     // 0x510(0x4)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        EggMaximumNumberOverride;                          // 0x514(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        EggChanceToSpawnOverride;                          // 0x518(0x4)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        EggIntervalUnstasisChanceToSpawnOverride;          // 0x51C(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	TArray<class UClass*>                        OverrideEggLimitsDinoClasses;                      // 0x520(0x10)(ExportObject, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        BiomeZonePriority;                                 // 0x530(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        MaxMultiplier;                                     // 0x534(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicDay;                            // 0x538(0x8)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicNight;                          // 0x540(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicDay_Heavy;                      // 0x548(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicNight_Heavy;                    // 0x550(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class ABiomeZoneSettings* GetDefaultObj();

};

// 0x1B8 (0x6D0 - 0x518)
// Class ShooterGame.BiomeZoneVolume
class ABiomeZoneVolume : public AVolume
{
public:
	class FString                                BiomeZoneName;                                     // 0x518(0x10)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	enum class EBiomeZone                        BiomeZone;                                         // 0x528(0x1)(Net, Parm, DisableEditOnTemplate, InstancedReference, SubobjectReference)
	uint8                                        Pad_128D[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        FinalTemperatureMultiplier;                        // 0x52C(0x4)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        FinalTemperatureExponent;                          // 0x530(0x4)(BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        FinalTemperatureAddition;                          // 0x534(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        PreOffsetTemperatureMultiplier;                    // 0x538(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        PreOffsetTemperatureExponent;                      // 0x53C(0x4)(Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        PreOffsetTemperatureAddition;                      // 0x540(0x4)(Edit, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        AboveTemperatureOffsetThreshold;                   // 0x544(0x4)(EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        AboveTemperatureOffsetMultiplier;                  // 0x548(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        AboveTemperatureOffsetExponent;                    // 0x54C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        BelowTemperatureOffsetThreshold;                   // 0x550(0x4)(ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        BelowTemperatureOffsetMultiplier;                  // 0x554(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        BelowTemperatureOffsetExponent;                    // 0x558(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        AbsoluteTemperatureOverride;                       // 0x55C(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        AbsoluteMaxTemperature;                            // 0x560(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	float                                        AbsoluteMinTemperature;                            // 0x564(0x4)(ConstParm, BlueprintReadOnly, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bPreventCrops : 1;                                 // Mask: 0x1, PropSize: 0x10x568(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bIsOutside : 1;                                    // Mask: 0x2, PropSize: 0x10x568(0x1)(BlueprintVisible, ExportObject, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bRemoveBuffWhenLeavingVolume : 1;                  // Mask: 0x4, PropSize: 0x10x568(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_B7 : 5;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1299[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        EggRangeMaximumNumberOverride;                     // 0x56C(0x4)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        EggMaximumNumberOverride;                          // 0x570(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        EggChanceToSpawnOverride;                          // 0x574(0x4)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        EggIntervalUnstasisChanceToSpawnOverride;          // 0x578(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_129F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class UClass*>                        OverrideEggLimitsDinoClasses;                      // 0x580(0x10)(ExportObject, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        BiomeZonePriority;                                 // 0x590(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        MaxMultiplier;                                     // 0x594(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        AbsoluteWindOverride;                              // 0x598(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        PreOffsetWindMultiplier;                           // 0x59C(0x4)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        PreOffsetWindExponent;                             // 0x5A0(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        PreOffsetWindAddition;                             // 0x5A4(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        AboveWindOffsetThreshold;                          // 0x5A8(0x4)(EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        AboveWindOffsetMultiplier;                         // 0x5AC(0x4)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        AboveWindOffsetExponent;                           // 0x5B0(0x4)(Edit, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        BelowWindOffsetThreshold;                          // 0x5B4(0x4)(ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        BelowWindOffsetMultiplier;                         // 0x5B8(0x4)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        BelowWindOffsetExponent;                           // 0x5BC(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        FinalWindMultiplier;                               // 0x5C0(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        FinalWindExponent;                                 // 0x5C4(0x4)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        FinalWindAddition;                                 // 0x5C8(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_12A3[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                BiomeCustomDatas;                                  // 0x5D0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        StatusAdjustmentRateMultipliersPositive[0xC];      // 0x5E0(0x30)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        StatusAdjustmentRateMultipliersNegative[0xC];      // 0x610(0x30)(Edit, ConstParm, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bOnlyApplyAdjustmentRateValuesOutdoors;            // 0x640(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bStatusAdjustRateValues;                           // 0x641(0x1)(ConstParm, ExportObject, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableDayTransitionSounds;                       // 0x642(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_12A5[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	TSoftClassPtr<class APrimalBuff>             BuffToGive;                                        // 0x648(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	TSoftClassPtr<class APrimalBuff>             BuffToPreventActiveUse;                            // 0x678(0x30)(Edit, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicDay;                            // 0x6A8(0x8)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicDay_Heavy;                      // 0x6B0(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicNight;                          // 0x6B8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicNight_Heavy;                    // 0x6C0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class USoundBase*                            ForceMusicInBiome;                                 // 0x6C8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class ABiomeZoneVolume* GetDefaultObj();

	class AActor* OnEndOverlap(class AActor** Actor);
	class AActor* OnBeginOverlap(class AActor** Actor);
	bool IsPointUnderwater(class UWorld* ForWorld, bool* ReturnValue);
	struct FVector IsPointInVacuumBase(class UWorld* ForWorld, bool* ReturnValue);
	bool GetWaterVolumeAtPoint(class UWorld* ForWorld, class APhysicsVolume** ReturnValue);
	bool GetPhysicsVolumeAtLocation(class UWorld* ForWorld, class APhysicsVolume** ReturnValue);
	class UWorld* GetBiomeZoneVolume(struct FVector* Location, class ABiomeZoneVolume** ReturnValue);
	class UWorld* GetAllBiomeZones(TArray<class ABiomeZoneVolume*>* BiomeZones);
};

// 0x0 (0x28 - 0x28)
// Class ShooterGame.BiomeZoneVolumeEffectUtility
class UBiomeZoneVolumeEffectUtility : public UObject
{
public:

	static class UClass* StaticClass();
	static class UBiomeZoneVolumeEffectUtility* GetDefaultObj();

	class AActor* SpawnRelevantEffect(struct FVector* Location, bool bIsImpactActor);
	class UWorld* SpawnImpactEffect(const struct FHitResult& HitResult, const struct FBiomeZoneImpactEffect& ImpactEffect, class AActor** Owner, class AActor** ReturnValue);
	class AActor* GetRelevantEffect(const struct FVector& ForLocation, bool bIsImpactActor, struct FBiomeZoneVolumeEffect* ReturnValue);
};

// 0x8 (0xA0 - 0x98)
// Class ShooterGame.BTService_FindTarget
class UBTService_FindTarget : public UBTService_BlackboardBase
{
public:
	bool                                         bDontSet;                                          // 0x98(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_12D7[0x7];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UBTService_FindTarget* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class ShooterGame.BTService_UpdateAggro
class UBTService_UpdateAggro : public UBTService
{
public:

	static class UClass* StaticClass();
	static class UBTService_UpdateAggro* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class ShooterGame.BTTask_AttackTarget
class UBTTask_AttackTarget : public UBTTaskNode
{
public:

	static class UClass* StaticClass();
	static class UBTTask_AttackTarget* GetDefaultObj();

};

// 0x38 (0xD0 - 0x98)
// Class ShooterGame.BTTask_GetRandomWanderDestination
class UBTTask_GetRandomWanderDestination : public UBTTask_BlackboardBase
{
public:
	struct FVector                               LocOverride;                                       // 0x98(0x18)(ConstParm, EditFixedSize, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	float                                        RandomOffsetMultiplier;                            // 0xB0(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseRandomNegativeXDir;                            // 0xB4(0x1)(ConstParm, ExportObject, Net, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	bool                                         bOrientRandOffsetByRotation;                       // 0xB5(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_12DF[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              OrientRandOffsetByRotation;                        // 0xB8(0x18)(Edit, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UBTTask_GetRandomWanderDestination* GetDefaultObj();

};

// 0x0 (0xD0 - 0xD0)
// Class ShooterGame.BTTask_RotateToFaceBBEntryWithGrab
class UBTTask_RotateToFaceBBEntryWithGrab : public UBTTask_RotateToFaceBBEntry
{
public:

	static class UClass* StaticClass();
	static class UBTTask_RotateToFaceBBEntryWithGrab* GetDefaultObj();

};

// 0x0 (0x758 - 0x758)
// Class ShooterGame.BuildingUI
class UBuildingUI : public UPrimalUI
{
public:

	static class UClass* StaticClass();
	static class UBuildingUI* GetDefaultObj();

	void GetStructurePlacer(class APrimalStructurePlacer** ReturnValue);
	void GetStructureIcon(class APrimalStructure** Structure, class UTexture2D** ReturnValue);
};

// 0x8 (0x38 - 0x30)
// Class ShooterGame.CachedDB
class UCachedDB : public UDataAsset
{
public:
	bool                                         bForceRepopulateAll;                               // 0x30(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_12FE[0x7];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCachedDB* GetDefaultObj();

	void PopulateDBFromEditor();
	void PopulateDB(const TArray<struct FAssetData>& CustomAssetList);
};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.ShooterWeaponDB
class UShooterWeaponDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class AShooterWeapon>, struct FShooterWeaponDBEntry> CachedWeaponData;                                  // 0x38(0x50)(ExportObject, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UShooterWeaponDB* GetDefaultObj();

};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.PrimalDinoDB
class UPrimalDinoDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class APrimalDinoCharacter>, struct FPrimalDinoDBEntry> CachedDinoData;                                    // 0x38(0x50)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UPrimalDinoDB* GetDefaultObj();

};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.PrimalStructureDB
class UPrimalStructureDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class APrimalStructure>, struct FPrimalStructureDBEntry> CachedStructureData;                               // 0x38(0x50)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UPrimalStructureDB* GetDefaultObj();

};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.PrimalInventoryDB
class UPrimalInventoryDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class UPrimalInventoryComponent>, struct FPrimalInventoryDBEntry> CachedInventoryData;                               // 0x38(0x50)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UPrimalInventoryDB* GetDefaultObj();

};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.PrimalMissionDB
class UPrimalMissionDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class AMissionType>, struct FPrimalMissionDBEntry> CachedMissionData;                                 // 0x38(0x50)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UPrimalMissionDB* GetDefaultObj();

};

// 0x0 (0x80 - 0x80)
// Class ShooterGame.GenerateCacheDBForModsCommandlet
class UGenerateCacheDBForModsCommandlet : public UCommandlet
{
public:

	static class UClass* StaticClass();
	static class UGenerateCacheDBForModsCommandlet* GetDefaultObj();

};

// 0x8 (0x50 - 0x48)
// Class ShooterGame.CameraModifier_Climbing
class UCameraModifier_Climbing : public UCameraModifier
{
public:
	class AShooterWeapon_Climb*                  OwningWeapon;                                      // 0x48(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UCameraModifier_Climbing* GetDefaultObj();

};

// 0x28 (0x50 - 0x28)
// Class ShooterGame.CDOLiveUpdateData
class UCDOLiveUpdateData : public UObject
{
public:
	TArray<struct FNetChangeDefaultPropertyValue> CDOLiveUpdates;                                    // 0x28(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	struct FCDODebugData                         CDODebugData;                                      // 0x38(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UCDOLiveUpdateData* GetDefaultObj();

};

// 0x30 (0x360 - 0x330)
// Class ShooterGame.CharacterViewPanelWidget
class UCharacterViewPanelWidget : public UPrimalUserWidget
{
public:
	class FString                                PreviewWidgetName;                                 // 0x330(0x10)(Edit, ConstParm, Parm, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_132F[0x20];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCharacterViewPanelWidget* GetDefaultObj();

	void RefreshPreviewWidget();
};

// 0x38 (0x910 - 0x8D8)
// Class ShooterGame.CheatFunctionInfoEntryButton
class UCheatFunctionInfoEntryButton : public UDataListEntryButton
{
public:
	uint8                                        bIsCustom : 1;                                     // Mask: 0x1, PropSize: 0x10x8D8(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_B9 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1332[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                FunctionName;                                      // 0x8E0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	bool                                         bCenterDisplayName;                                // 0x8F0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1337[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          DisplayStringSelectedColor;                        // 0x8F4(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        FolderNameTextClipOffset;                          // 0x904(0x4)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1339[0x8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCheatFunctionInfoEntryButton* GetDefaultObj();

};

// 0x548 (0xA10 - 0x4C8)
// Class ShooterGame.PointOfInterestActor
class APointOfInterestActor : public AActor
{
public:
	uint8                                        Pad_1353[0x10];                                    // Fixing Size After Last Property  > TateDumper <
	class USceneComponent*                       PointRootComp;                                     // 0x4D8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class USphereComponent*                      PointUseSphereComp;                                // 0x4E0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class UTextRenderComponent*                  PointTextComp;                                     // 0x4E8(0x8)(Edit, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class UTextRenderComponent*                  PointTitleTextComp;                                // 0x4F0(0x8)(Edit, ConstParm, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1358[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FPointOfInterestData                  MyPointOfInterestData;                             // 0x500(0x1E0)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	struct FPointOfInterestCompanionBehavior     MyPointOfInterestCompanionBehavior;                // 0x6E0(0x300)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               UseSphereLocOffset;                                // 0x9E0(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	float                                        UseSphereRadius;                                   // 0x9F8(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	float                                        TitleTextZOffset;                                  // 0x9FC(0x4)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bHasBeenViewed : 1;                                // Mask: 0x1, PropSize: 0x10xA00(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, Config, InstancedReference, SubobjectReference)
	uint8                                        bSyncWithPointManager : 1;                         // Mask: 0x2, PropSize: 0x10xA00(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bPreventViewMultiUseEntry : 1;                     // Mask: 0x4, PropSize: 0x10xA00(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDebugPointActor_Persistent : 1;                   // Mask: 0x8, PropSize: 0x10xA00(0x1)(EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDebugPointActor_Single : 1;                       // Mask: 0x10, PropSize: 0x10xA00(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDebugPointActor_ClearDebugLines : 1;              // Mask: 0x20, PropSize: 0x10xA00(0x1)(ConstParm, Net, Parm, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_BA : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_135E[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class APointOfInterestManagerList*           MyPointManager;                                    // 0xA08(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class APointOfInterestActor* GetDefaultObj();

	void RefreshPointData();
	void IsPointOfInterestValid(bool* ReturnValue);
	void GetMyPointOfInterestData(struct FPointOfInterestData* ReturnValue);
	void GetMyPointOfInterestCompanionBehavior(struct FPointOfInterestCompanionBehavior* ReturnValue);
};

// 0x60 (0xA70 - 0xA10)
// Class ShooterGame.CompanionEventTrigger
class ACompanionEventTrigger : public APointOfInterestActor
{
public:
	class UBoxComponent*                         BoxTriggerComp;                                    // 0xA10(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class UTextRenderComponent*                  EventTitleTextComp;                                // 0xA18(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	struct FCompanionEventData                   MyEventData;                                       // 0xA20(0x50)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class ACompanionEventTrigger* GetDefaultObj();

	class AActor* OnEndOverlap(class AActor** Actor);
	class AActor* OnBeginOverlap(class AActor** Actor);
};

// 0x18 (0x770 - 0x758)
// Class ShooterGame.ConsoleCommandButtonWidget
class UConsoleCommandButtonWidget : public UBaseSelectableButtonWidget
{
public:
	uint8                                        Pad_136F[0x18];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UConsoleCommandButtonWidget* GetDefaultObj();

};

// 0x58 (0x388 - 0x330)
// Class ShooterGame.ContextMenu
class UContextMenu : public UPrimalUserWidget
{
public:
	FDelegateProperty_                           OnPopulateMenu;                                    // 0x330(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	FDelegateProperty_                           OnPopulateMenuCustom;                              // 0x340(0x10)(ConstParm, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnActiveItemChanged;                               // 0x350(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	class FName                                  CustomName;                                        // 0x360(0x8)(Edit, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1389[0x20];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UContextMenu* GetDefaultObj();

	class UContextMenuItem* SetActiveItem();
	class FName PopulateContextMenuCustom__DelegateSignature(class UContextMenu* ContextMenu);
	void PopulateContextMenu__DelegateSignature(class UContextMenu* ContextMenu);
	void GetActiveItem(class UContextMenuItem** ReturnValue);
	bool CloseMenu();
	class UContextMenuItem* ActiveMenuItemChanged__DelegateSignature();
};

// 0xF0 (0x420 - 0x330)
// Class ShooterGame.ContextMenuItem
class UContextMenuItem : public UPrimalUserWidget
{
public:
	FDelegateProperty_                           OnGetMenuContentEvent;                             // 0x330(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	FDelegateProperty_                           OnGetMenuContentEventCustom;                       // 0x340(0x10)(ConstParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnExecuteMainAction;                               // 0x350(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnExecuteMainActionCustom;                         // 0x360(0x10)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	class FName                                  SubmenuMenuAnchorName;                             // 0x370(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	class FName                                  SubmenuIndicatorName;                              // 0x378(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	class FName                                  ShortcutKeyWidgetName;                             // 0x380(0x8)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	class FName                                  SwitchName;                                        // 0x388(0x8)(EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	class FName                                  SwitchContainerName;                               // 0x390(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	enum class EUContextMenuItemSwitchMode       SwitchType;                                        // 0x398(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	bool                                         IsSwitchedOn;                                      // 0x399(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	uint8                                        Pad_13D4[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  CustomName;                                        // 0x39C(0x8)(Edit, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	uint8                                        Pad_13D8[0x7C];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UContextMenuItem* GetDefaultObj();

	void SetSubmenuEnabled(bool* bEnabled);
	int32 SetShortcutKey(const struct FKey& Key);
	void SetJustification(enum class ETextJustify Value);
	class FText SetCaption();
	void OnGetContextMenuContent(class UWidget** ReturnValue);
	class FName OnButtonClickedEventObjectCustom__DelegateSignature(class UContextMenuItem* ContextMenuItem);
	void OnButtonClickedEventObject__DelegateSignature(class UContextMenuItem* ContextMenuItem);
	void OnButtonClicked();
	class UContextMenuItem* OnActiveMenuItemChanged(class UContextMenu* ContextMenu);
	void GetSubmenuEnabled(bool* ReturnValue);
	class FName GetSubmenuContentCustom__DelegateSignature(class UContextMenuItem* ContextMenuItem, class UContextMenu** ReturnValue);
	void GetSubmenuContent__DelegateSignature(class UContextMenuItem* ContextMenuItem, class UContextMenu** ReturnValue);
	void GetJustification(enum class ETextJustify* ReturnValue);
	void GetCaption(class FText* ReturnValue);
};

// 0x18 (0x438 - 0x420)
// Class ShooterGame.ContextMenuItem_Sort
class UContextMenuItem_Sort : public UContextMenuItem
{
public:
	class FName                                  SorDirSwitcherName;                                // 0x420(0x8)(Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_13DF[0x10];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UContextMenuItem_Sort* GetDefaultObj();

};

// 0x38 (0x458 - 0x420)
// Class ShooterGame.ContextMenuItem_Spinner
class UContextMenuItem_Spinner : public UContextMenuItem
{
public:
	FMulticastInlineDelegateProperty_            OnValueCommitted;                                  // 0x420(0x10)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1403[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        MinValue;                                          // 0x434(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	int32                                        MaxValue;                                          // 0x438(0x4)(ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1406[0x1C];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UContextMenuItem_Spinner* GetDefaultObj();

	int32 SetValue();
	int32 SetMinValue();
	int32 SetMaxValue();
	int32 OnSpinnerValueCommitedEvent__DelegateSignature(enum class ETextCommit CommitMethod);
	class FText HandleOnTextCommited(enum class ETextCommit CommitMethod);
	class FText HandleOnTextChanged();
	void HandleOnButtonIncreaseClicked();
	void HandleOnButtonDecreaseClicked();
	void GetValue(int32* ReturnValue);
	void GetMinValue(int32* ReturnValue);
	void GetMaxValue(int32* ReturnValue);
};

// 0x20 (0x3A8 - 0x388)
// Class ShooterGame.ContextMenu_DinoGroupEntry
class UContextMenu_DinoGroupEntry : public UContextMenu
{
public:
	class UClass*                                ItemClass_SimpleButton;                            // 0x388(0x8)(ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                ItemClass_SimpleCaption;                           // 0x390(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                ItemClass_Spinner;                                 // 0x398(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                SubmenuClass;                                      // 0x3A0(0x8)(ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UContextMenu_DinoGroupEntry* GetDefaultObj();

	void PopulateRootMenu(class UContextMenu* ContextMenu);
	class UContextMenuItem* HandleActionSetGroup();
	class UContextMenuItem* HandleActionRemoveDino();
	class UContextMenuItem* HandleActionRemoveClass();
};

// 0x8 (0x390 - 0x388)
// Class ShooterGame.ContextMenu_InventorySort
class UContextMenu_InventorySort : public UContextMenu
{
public:
	class UClass*                                ItemClass_SortButton;                              // 0x388(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UContextMenu_InventorySort* GetDefaultObj();

	void PopulateRootMenu(class UContextMenu* ContextMenu);
	class UContextMenuItem* HandleActionWeight();
	class UContextMenuItem* HandleActionUnsort();
	class UContextMenuItem* HandleActionType();
	class UContextMenuItem* HandleActionSpoilTimer();
	class UContextMenuItem* HandleActionAlphabetical();
};

// 0x50 (0x3D8 - 0x388)
// Class ShooterGame.ContextMenu_PrimalItem
class UContextMenu_PrimalItem : public UContextMenu
{
public:
	class UClass*                                ItemClass_SimpleButton;                            // 0x388(0x8)(ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                ItemClass_SimpleCaption;                           // 0x390(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                ItemClass_Spinner;                                 // 0x398(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                SubmenuClass;                                      // 0x3A0(0x8)(ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_14D1[0x10];                                    // Fixing Size After Last Property  > TateDumper <
	int32                                        SplitAmountValue;                                  // 0x3B8(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	int32                                        SplitAmountMax;                                    // 0x3BC(0x4)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	int32                                        CraftAmountValue;                                  // 0x3C0(0x4)(ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	int32                                        CraftAmountMax;                                    // 0x3C4(0x4)(ConstParm, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	int32                                        CraftQuantityValue;                                // 0x3C8(0x4)(ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	int32                                        CraftQuantityMax;                                  // 0x3CC(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bIsFreeCraftingMode : 1;                           // Mask: 0x1, PropSize: 0x10x3D0(0x1)(BlueprintVisible, Net, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_14D4[0x7];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UContextMenu_PrimalItem* GetDefaultObj();

	void PopulateSubmenuSplitStack(class UContextMenu* ContextMenu);
	void PopulateSubmenuSplitAmount(class UContextMenu* ContextMenu);
	void PopulateSubmenuRemove(class UContextMenu* ContextMenu);
	class FName PopulateSubmenuCustom(class UContextMenu* ContextMenu);
	void PopulateSubmenuCraftAmount(class UContextMenu* ContextMenu);
	void PopulateRootMenu(class UContextMenu* ContextMenu);
	void PopulateFolderMenu(class UContextMenu* ContextMenu);
	void PopulateCraftMenu(class UContextMenu* ContextMenu);
	int32 HandleSplitAmountValueCommit(enum class ETextCommit CommitMethod);
	void HandleOnGetSubmenuSplitStackContent(class UContextMenuItem* MenuItem, class UContextMenu** ReturnValue);
	void HandleOnGetSubmenuSplitAmountContent(class UContextMenuItem* MenuItem, class UContextMenu** ReturnValue);
	void HandleOnGetSubmenuRemoveContent(class UContextMenuItem* MenuItem, class UContextMenu** ReturnValue);
	class FName HandleOnGetSubmenuCustomContent(class UContextMenuItem* MenuItem, class UContextMenu** ReturnValue);
	void HandleOnGetSubmenuCraftContent(class UContextMenuItem* MenuItem, class UContextMenu** ReturnValue);
	void HandleOnGetSubmenuCraftAmountContent(class UContextMenuItem* MenuItem, class UContextMenu** ReturnValue);
	int32 HandleCraftAmountValueCommit(enum class ETextCommit CommitMethod);
	class UContextMenuItem* HandleActionUse();
	class UContextMenuItem* HandleActionUnequip();
	class UContextMenuItem* HandleActionTransfer();
	class UContextMenuItem* HandleActionTrack();
	class UContextMenuItem* HandleActionSplitOne();
	class UContextMenuItem* HandleActionSplitHalf();
	class UContextMenuItem* HandleActionSplitAmount();
	class UContextMenuItem* HandleActionSplitAll();
	class UContextMenuItem* HandleActionSetCraftQuantity();
	class UContextMenuItem* HandleActionRepair();
	class UContextMenuItem* HandleActionRenameFolder();
	class UContextMenuItem* HandleActionRemoveSkin();
	class UContextMenuItem* HandleActionRemoveAmmo();
	class UContextMenuItem* HandleActionRemoveAccessory();
	class UContextMenuItem* HandleActionFavorite();
	class UContextMenuItem* HandleActionFastInventoryInFolder();
	class UContextMenuItem* HandleActionEquipAllInFolder();
	class UContextMenuItem* HandleActionEquip();
	class UContextMenuItem* HandleActionDiscard();
	class UContextMenuItem* HandleActionDeleteFolder();
	class FName HandleActionCustom();
	class UContextMenuItem* HandleActionCraftOne();
	class UContextMenuItem* HandleActionCraftAmount();
	class UContextMenuItem* HandleActionCraftAll();
	void BPUpdateCanUse();
};

// 0x8 (0x4F0 - 0x4E8)
// Class ShooterGame.CorruptedAvatarAttackCoordinator
class ACorruptedAvatarAttackCoordinator : public AAIAttackCoordinator
{
public:
	uint8                                        Pad_14E0[0x8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class ACorruptedAvatarAttackCoordinator* GetDefaultObj();

};

// 0xB0 (0xE8 - 0x38)
// Class ShooterGame.CursorSettings
class UCursorSettings : public UDeveloperSettings
{
public:
	struct FRuntimeFloatCurve                    AnalogCursorAccelerationCurve;                     // 0x38(0x88)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MaxAnalogCursorSpeed;                              // 0xC0(0x4)(ExportObject, Parm, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MaxAnalogCursorSpeedWhenHovered;                   // 0xC4(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        AnalogCursorDragCoefficient;                       // 0xC8(0x4)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        AnalogCursorDragCoefficientWhenHovered;            // 0xCC(0x4)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MinAnalogCursorSpeed;                              // 0xD0(0x4)(Edit, ExportObject, EditFixedSize, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        AnalogCursorDeadZone;                              // 0xD4(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        AnalogCursorAccelerationMultiplier;                // 0xD8(0x4)(BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        AnalogCursorSize;                                  // 0xDC(0x4)(Edit, ConstParm, Net, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bUseEngineAnalogCursor;                            // 0xE0(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAnalogCursorNoAcceleration;                       // 0xE1(0x1)(ExportObject, OutParm, ZeroConstructor, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_14EA[0x6];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCursorSettings* GetDefaultObj();

};

// 0x18 (0x4E0 - 0x4C8)
// Class ShooterGame.CustomActorList
class ACustomActorList : public AInfo
{
public:
	TArray<class AActor*>                        ActorList;                                         // 0x4C8(0x10)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_14F1[0x8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class ACustomActorList* GetDefaultObj();

	void DestroyActors();
};

// 0x60 (0x740 - 0x6E0)
// Class ShooterGame.CustomButtonWidget
class UCustomButtonWidget : public UButton
{
public:
	struct FCustomButtonWidgetStyle              ExtendedWidgetStyle;                               // 0x6E0(0x48)(BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	bool                                         IsToggleButton;                                    // 0x728(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	bool                                         IsToggledOn;                                       // 0x729(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1503[0x16];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCustomButtonWidget* GetDefaultObj();

	void SetToggledState(bool IsToggled);
	void SetIsToggleButton(bool IsToggle);
	void GetToggledState(bool* ReturnValue);
	void GetIsToggleButton(bool* ReturnValue);
	void BPSetToggledState(bool IsToggled);
};

// 0x39D0 (0x3FA0 - 0x5D0)
// Class ShooterGame.ShooterGameMode
class AShooterGameMode : public APrimalGameMode
{
public:
	uint8                                        Pad_1772[0x108];                                   // Fixing Size After Last Property  > TateDumper <
	class FString                                BanFileName;                                       // 0x6D8(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1774[0x188];                                   // Fixing Size After Last Property  > TateDumper <
	class UShooterCheatManager*                  ServerCheatManager;                                // 0x870(0x8)(BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	float                                        ForceLoadWorldSeconds;                             // 0x878(0x4)(BlueprintVisible, Net, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1777[0x1C];                                    // Fixing Size After Last Property  > TateDumper <
	class URCONServer*                           RCONSocket;                                        // 0x898(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class FString                                PlayersJoinNoCheckFilename;                        // 0x8A0(0x10)(BlueprintReadOnly, Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class FString                                PlayersExclusiveCheckFilename;                     // 0x8B0(0x10)(Parm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class UShooterCheatManager*                  GlobalCommandsCheatManager;                        // 0x8C0(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_177A[0x10];                                    // Fixing Size After Last Property  > TateDumper <
	class FString                                CheckGlobalEnablesURL;                             // 0x8D8(0x10)(ConstParm, BlueprintVisible, Net, EditFixedSize, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class UDatabase_LoginData*                   Database_LoginDataRef;                             // 0x8E8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class UDatabase_PubSub_GeneralNotifications* PubSub_GeneralNotificationsRef;                    // 0x8F0(0x8)(ConstParm, ExportObject, EditFixedSize, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_177E[0x88];                                    // Fixing Size After Last Property  > TateDumper <
	TMap<int32, uint64>                          PlayersIds;                                        // 0x980(0x50)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TMap<uint64, int32>                          SteamIds;                                          // 0x9D0(0x50)(BlueprintReadOnly, Net, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1780[0x50];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bGlobalDisableLoginLockCheck;                      // 0xA70(0x1)(Edit, Net, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	bool                                         bTempDisableLoginLockCheck;                        // 0xA71(0x1)(Edit, ConstParm, BlueprintReadOnly, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1782[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                MyServerId;                                        // 0xA78(0x10)(Edit, BlueprintVisible, ExportObject, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1784[0x70];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<struct FTribeData>                    TribesData;                                        // 0xAF8(0x10)(Edit, ConstParm, BlueprintVisible, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<class APrimalDinoCharacter*>          ActivelyTamingDinos;                               // 0xB08(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAutoCreateNewPlayerData;                          // 0xB18(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1785[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        DifficultyValue;                                   // 0xB20(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        DifficultyValueMin;                                // 0xB24(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        DifficultyValueMax;                                // 0xB28(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        ProximityRadius;                                   // 0xB2C(0x4)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        ProximityRadiusUnconsiousScale;                    // 0xB30(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1786[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                CheatClass;                                        // 0xB38(0x8)(Edit, ConstParm, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsOfficialServer;                                 // 0xB40(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsCurrentlySavingWorld;                           // 0xB41(0x1)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1788[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bIsConsoleUnOfficialPCServer;                      // 0xB43(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bServerAllowArkDownload;                           // 0xB44(0x1)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_178A[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bAlwaysNotifyPlayerLeft;                           // 0xB47(0x1)(Edit, ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAlwaysNotifyPlayerJoined;                         // 0xB48(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bServerHardcore;                                   // 0xB49(0x1)(ConstParm, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_178B[0x33];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bEnableCryoSicknessPVE;                            // 0xB7D(0x1)(Edit, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_178D[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CryopodNerfDamageMult;                             // 0xB80(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        CryopodNerfDuration;                               // 0xB84(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bEnableMeshBitingProtection;                       // 0xB88(0x1)(Edit, ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1791[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CryopodNerfIncomingDamageMultPercent;              // 0xB8C(0x4)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1792[0x48];                                    // Fixing Size After Last Property  > TateDumper <
	float                                        ResourcesRespawnPeriodMultiplier;                  // 0xBD8(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        KickIdlePlayersPeriod;                             // 0xBDC(0x4)(Edit, BlueprintVisible, Net, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        MateBoostEffectMultiplier;                         // 0xBE0(0x4)(ConstParm, Net, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        AutoSavePeriodMinutes;                             // 0xBE4(0x4)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        XPMultiplier;                                      // 0xBE8(0x4)(Edit, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	class FName                                  ActiveEvent;                                       // 0xBEC(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        TribeNameChangeCooldown;                           // 0xBF4(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        PlatformSaddleBuildAreaBoundsMultiplier;           // 0xBF8(0x4)(BlueprintVisible, Net, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         bAlwaysAllowStructurePickup;                       // 0xBFC(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1799[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        StructurePickupTimeAfterPlacement;                 // 0xC00(0x4)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        StructurePickupHoldDuration;                       // 0xC04(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         bAllowHideDamageSourceFromLogs;                    // 0xC08(0x1)(ConstParm, Net, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_179B[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        KillXPMultiplier;                                  // 0xC0C(0x4)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	float                                        HarvestXPMultiplier;                               // 0xC10(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	float                                        CraftXPMultiplier;                                 // 0xC14(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	float                                        GenericXPMultiplier;                               // 0xC18(0x4)(ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	float                                        SpecialXPMultiplier;                               // 0xC1C(0x4)(Edit, ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	float                                        AlphaKillXPMultiplier;                             // 0xC20(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	float                                        CaveKillXPMultiplier;                              // 0xC24(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	float                                        WildKillXPMultiplier;                              // 0xC28(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	float                                        BossKillXPMultiplier;                              // 0xC2C(0x4)(BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	float                                        TamedKillXPMultiplier;                             // 0xC30(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	float                                        UnclaimedKillXPMultiplier;                         // 0xC34(0x4)(Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	float                                        ExplorerNoteXPMultiplier;                          // 0xC38(0x4)(Edit, ConstParm, Net, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	uint8                                        Pad_17A5[0x84];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<class UPrimalPlayerData*>             PlayerDatas;                                       // 0xCC0(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17A6[0xE];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bForceRespawnDinos;                                // 0xCDE(0x1)(Edit, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17A7[0x29];                                    // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnCharacterPossessedByPlayer;                      // 0xD08(0x10)(ConstParm, OutParm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnCharacterUnpossessedByPlayer;                    // 0xD18(0x10)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnShooterCharacterSpawned;                         // 0xD28(0x10)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnShooterCharacterDied;                            // 0xD38(0x10)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnMissionTriggerBeginOverlap;                      // 0xD48(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config, GlobalConfig)
	FMulticastInlineDelegateProperty_            OnMissionTriggerEndOverlap;                        // 0xD58(0x10)(Edit, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, Config, GlobalConfig)
	float                                        TamedDinoDamageMultiplier;                         // 0xD68(0x4)(ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        DinoDamageMultiplier;                              // 0xD6C(0x4)(Edit, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        PlayerDamageMultiplier;                            // 0xD70(0x4)(BlueprintVisible, Net, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        StructureDamageMultiplier;                         // 0xD74(0x4)(BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        PlayerResistanceMultiplier;                        // 0xD78(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        DinoResistanceMultiplier;                          // 0xD7C(0x4)(BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        TamedDinoResistanceMultiplier;                     // 0xD80(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        StructureResistanceMultiplier;                     // 0xD84(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	bool                                         bJoinInProgressGamesAsSpectator;                   // 0xD88(0x1)(Edit, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17B0[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TamingSpeedMultiplier;                             // 0xD8C(0x4)(BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        HarvestAmountMultiplier;                           // 0xD90(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        HarvestHealthMultiplier;                           // 0xD94(0x4)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        PlayerCharacterWaterDrainMultiplier;               // 0xD98(0x4)(Edit, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        PlayerCharacterFoodDrainMultiplier;                // 0xD9C(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        DinoCharacterFoodDrainMultiplier;                  // 0xDA0(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        RaidDinoCharacterFoodDrainMultiplier;              // 0xDA4(0x4)(ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        PlayerCharacterStaminaDrainMultiplier;             // 0xDA8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        DinoCharacterStaminaDrainMultiplier;               // 0xDAC(0x4)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        PlayerCharacterHealthRecoveryMultiplier;           // 0xDB0(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        DinoCharacterHealthRecoveryMultiplier;             // 0xDB4(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	float                                        CarnivoreNaturalTargetingRangeMultiplier;          // 0xDB8(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        CarnivorePlayerAggroMultiplier;                    // 0xDBC(0x4)(BlueprintVisible, Parm, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        HerbivoreNaturalTargetingRangeMultiplier;          // 0xDC0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        HerbivorePlayerAggroMultiplier;                    // 0xDC4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         AIForceTargetPlayers;                              // 0xDC8(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         AIForceOverlapCheck;                               // 0xDC9(0x1)(Edit, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17B5[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bDisableSaveLoad;                                  // 0xDD0(0x1)(EditFixedSize, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableXP;                                        // 0xDD1(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bDisableDynamicMusic;                              // 0xDD2(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17B6[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FLevelExperienceRamp>          LevelExperienceRampOverrides;                      // 0xDD8(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, EditConst, InstancedReference, SubobjectReference)
	TArray<int32>                                OverridePlayerLevelEngramPoints;                   // 0xDE8(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	TArray<int32>                                ExcludeItemIndices;                                // 0xDF8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FEngramEntryOverride>          OverrideEngramEntries;                             // 0xE08(0x10)(Edit, EditFixedSize, OutParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FEngramEntryOverride>          OverrideNamedEngramEntries;                        // 0xE18(0x10)(ConstParm, BlueprintVisible, ZeroConstructor, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FEngramEntryAutoUnlock>        EngramEntryAutoUnlocks;                            // 0xE28(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	TArray<class FString>                        PreventDinoTameClassNames;                         // 0xE38(0x10)(ExportObject, Net, OutParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              DinoClassStaminaMultipliers;                       // 0xE48(0x10)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              TamedDinoClassStaminaMultipliers;                  // 0xE58(0x10)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              DinoClassSpeedMultipliers;                         // 0xE68(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              TamedDinoClassSpeedMultipliers;                    // 0xE78(0x10)(BlueprintVisible, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FDinoSpawnWeightMultiplier>    DinoSpawnWeightMultipliers;                        // 0xE88(0x10)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              DinoClassResistanceMultipliers;                    // 0xE98(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              TamedDinoClassResistanceMultipliers;               // 0xEA8(0x10)(Edit, ExportObject, Net, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              DinoClassDamageMultipliers;                        // 0xEB8(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              TamedDinoClassDamageMultipliers;                   // 0xEC8(0x10)(ConstParm, ExportObject, Parm, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              HarvestResourceItemAmountClassMultipliers;         // 0xED8(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FClassNameReplacement>         NPCReplacements;                                   // 0xEE8(0x10)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        PvPZoneStructureDamageMultiplier;                  // 0xEF8(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bOnlyAllowSpecifiedEngrams;                        // 0xEFC(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17BE[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        OverrideMaxExperiencePointsPlayer;                 // 0xF00(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	int32                                        OverrideMaxExperiencePointsDino;                   // 0xF04(0x4)(BlueprintVisible, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	float                                        GlobalSpoilingTimeMultiplier;                      // 0xF08(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        GlobalItemDecompositionTimeMultiplier;             // 0xF0C(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        GlobalCorpseDecompositionTimeMultiplier;           // 0xF10(0x4)(ConstParm, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        MaxFallSpeedMultiplier;                            // 0xF14(0x4)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAutoPvETimer;                                     // 0xF18(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bAutoPvEUseSystemTime;                             // 0xF19(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	uint8                                        Pad_17C3[0xA];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        AutoPvEStartTimeSeconds;                           // 0xF24(0x4)(Edit, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	float                                        AutoPvEStopTimeSeconds;                            // 0xF28(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	uint8                                        Pad_17C5[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class AHibernationManager*                   HibernationManager;                                // 0xF30(0x8)(Edit, BlueprintReadOnly, ReturnParm, Transient, GlobalConfig)
	int32                                        TributeItemExpirationSeconds;                      // 0xF38(0x4)(ConstParm, EditFixedSize, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        TributeDinoExpirationSeconds;                      // 0xF3C(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        TributeCharacterExpirationSeconds;                 // 0xF40(0x4)(Edit, Net, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17C7[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        MaxTributeItems;                                   // 0xF4C(0x4)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        MaxTributeDinos;                                   // 0xF50(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        MaxTributeCharacters;                              // 0xF54(0x4)(BlueprintVisible, OutParm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIncreasePvPRespawnInterval;                       // 0xF58(0x1)(Edit, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	uint8                                        Pad_17CA[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        IncreasePvPRespawnIntervalCheckPeriod;             // 0xF5C(0x4)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        IncreasePvPRespawnIntervalMultiplier;              // 0xF60(0x4)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        IncreasePvPRespawnIntervalBaseAmount;              // 0xF64(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        ResourceNoReplenishRadiusStructures;               // 0xF68(0x4)(Edit, ConstParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        ResourceNoReplenishRadiusPlayers;                  // 0xF6C(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        CropGrowthSpeedMultiplier;                         // 0xF70(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        LayEggIntervalMultiplier;                          // 0xF74(0x4)(BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        PoopIntervalMultiplier;                            // 0xF78(0x4)(Edit, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        CropDecaySpeedMultiplier;                          // 0xF7C(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bAllowChatFromDeadNonAdmins;                       // 0xF80(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bAllowDisablingSpectator;                          // 0xF81(0x1)(ExportObject, Net, EditFixedSize, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPvEDisableFriendlyFire;                           // 0xF82(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bFlyerPlatformAllowUnalignedDinoBasing;            // 0xF83(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bAllowUnclaimDinos;                                // 0xF84(0x1)(ExportObject, BlueprintReadOnly, Parm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17CF[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        MaxPerTribePlatformSaddleStructureLimit;           // 0xF88(0x4)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        MaxPlatformSaddleStructureLimit;                   // 0xF8C(0x4)(ConstParm, EditFixedSize, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        MaxDinoBaseLevel;                                  // 0xF90(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        MaxNumberOfPlayersInTribe;                         // 0xF94(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	float                                        TribeSlotReuseCooldown;                            // 0xF98(0x4)(ExportObject, Net, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	float                                        MatingIntervalMultiplier;                          // 0xF9C(0x4)(ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        EggHatchSpeedMultiplier;                           // 0xFA0(0x4)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	float                                        BabyMatureSpeedMultiplier;                         // 0xFA4(0x4)(Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	float                                        BabyFoodConsumptionSpeedMultiplier;                // 0xFA8(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	uint8                                        Pad_17D7[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        PerLevelStatsMultiplier_Player[0xC];               // 0xFB0(0x30)(Edit, ExportObject, Net, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        PerLevelStatsMultiplier_DinoTamed[0xC];            // 0xFE0(0x30)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        PerLevelStatsMultiplier_DinoTamed_Add[0xC];        // 0x1010(0x30)(Edit, ConstParm, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        PerLevelStatsMultiplier_DinoTamed_Affinity[0xC];   // 0x1040(0x30)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	float                                        PerLevelStatsMultiplier_DinoWild[0xC];             // 0x1070(0x30)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        MutagenLevelBoost[0xC];                            // 0x10A0(0x30)(ConstParm, BlueprintReadOnly, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        MutagenLevelBoost_Bred[0xC];                       // 0x10D0(0x30)(ConstParm, BlueprintVisible, EditFixedSize, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        ItemStatClamps[0x8];                               // 0x1100(0x20)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        MaxGateFrameOnSaddles;                             // 0x1120(0x4)(ConstParm, BlueprintReadOnly, Net, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	int32                                        MaxHexagonsPerCharacter;                           // 0x1124(0x4)(Edit, BlueprintVisible, Net, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bCustomGameModeAllowSpectatorJoinAfterMatchStart;  // 0x1128(0x1)(BlueprintVisible, ExportObject, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17E1[0x1107];                                  // Fixing Size After Last Property  > TateDumper <
	bool                                         bGameplayLogEnabled;                               // 0x2230(0x1)(Edit, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bServerGameLogEnabled;                             // 0x2231(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17E4[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                BonusSupplyCrateItemClass;                         // 0x2238(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	float                                        BonusSupplyCrateItemGiveInterval;                  // 0x2240(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	float                                        StructureDamageRepairCooldown;                     // 0x2244(0x4)(ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        CustomRecipeEffectivenessMultiplier;               // 0x2248(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	float                                        CustomRecipeSkillMultiplier;                       // 0x224C(0x4)(ConstParm, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	class FString                                BonusSupplyCrateItemString;                        // 0x2250(0x10)(ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         MaxDifficulty;                                     // 0x2260(0x1)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bPvEAllowTribeWar;                                 // 0x2261(0x1)(Edit, Net, EditFixedSize, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bPvEAllowTribeWarCancel;                           // 0x2262(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bAllowCustomRecipes;                               // 0x2263(0x1)(Edit, ConstParm, EditFixedSize, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bPassiveDefensesDamageRiderlessDinos;              // 0x2264(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, DuplicateTransient)
	uint8                                        Pad_17EA[0xB];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bEnableDeathTeamSpectator;                         // 0x2270(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bTribeStoreCharacterConfiguration;                 // 0x2271(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17EC[0xF6];                                    // Fixing Size After Last Property  > TateDumper <
	int32                                        MaxTribeLogs;                                      // 0x2368(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17ED[0x1C];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bDisableFriendlyFire;                              // 0x2388(0x1)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bAllowInactiveTribes;                              // 0x2389(0x1)(BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bForceMapPlayerLocation;                           // 0x238A(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17EF[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        DinoHarvestingDamageMultiplier;                    // 0x238C(0x4)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	float                                        PlayerHarvestingDamageMultiplier;                  // 0x2390(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	float                                        DinoTurretDamageMultiplier;                        // 0x2394(0x4)(Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bDisableLootCrates;                                // 0x2398(0x1)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	uint8                                        Pad_17F2[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        ExtinctionEventTimeInterval;                       // 0x239C(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17F3[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	uint32                                       NextExtinctionEventUTC;                            // 0x23A4(0x4)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17F5[0x1C];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bUseCharacterTracker;                              // 0x23C4(0x1)(Parm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bShowFloatingDamageText;                           // 0x23C5(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17F8[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        SavedGameModeVersion;                              // 0x23C8(0x4)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17F9[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bAllowTekSuitPowersInGenesis;                      // 0x23D0(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17FA[0x47];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<struct FItemCraftingCostOverride>     OverrideItemCraftingCosts;                         // 0x2418(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FConfigItemCraftingCostOverride> ConfigOverrideItemCraftingCosts;                   // 0x2428(0x10)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FConfigMaxItemQuantityOverride> ConfigOverrideItemMaxQuantity;                     // 0x2438(0x10)(ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_17FC[0x50];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<struct FConfigSupplyCrateItemsOverride> ConfigOverrideSupplyCrateItems;                    // 0x2498(0x10)(ExportObject, Net, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FConfigNPCSpawnEntriesContainer> ConfigOverrideNPCSpawnEntriesContainer;            // 0x24A8(0x10)(BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FConfigNPCSpawnEntriesContainer> ConfigAddNPCSpawnEntriesContainer;                 // 0x24B8(0x10)(ConstParm, OutParm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FConfigNPCSpawnEntriesContainer> ConfigSubtractNPCSpawnEntriesContainer;            // 0x24C8(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	float                                        BabyImprintingStatScaleMultiplier;                 // 0x24D8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        BabyCuddleIntervalMultiplier;                      // 0x24DC(0x4)(Edit, ConstParm, BlueprintVisible, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        BabyImprintAmountMultiplier;                       // 0x24E0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	float                                        BabyCuddleGracePeriodMultiplier;                   // 0x24E4(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        BabyCuddleLoseImprintQualitySpeedMultiplier;       // 0x24E8(0x4)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig, DuplicateTransient)
	float                                        HairGrowthSpeedMultiplier;                         // 0x24EC(0x4)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        DinoHairGrowthSpeedMultiplier;                     // 0x24F0(0x4)(ConstParm, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bPreventDiseases;                                  // 0x24F4(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	bool                                         bNonPermanentDiseases;                             // 0x24F5(0x1)(ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1805[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	class UAllClustersInventory*                 AllClustersInventory;                              // 0x24F8(0x8)(Edit, ExportObject, Net, EditFixedSize, ZeroConstructor, GlobalConfig)
	int32                                        SaveForceRespawnDinosVersion;                      // 0x2500(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1807[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	uint64                                       ServerID;                                          // 0x2508(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1808[0x58];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<int32>                                SupportedSpawnRegions;                             // 0x2568(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, EditConst, InstancedReference, SubobjectReference)
	bool                                         bServerUseDinoList;                                // 0x2578(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_1809[0x3];                                     // Fixing Size After Last Property  > TateDumper <
