#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xB0 (0x790 - 0x6E0)
// Class ShooterGame.CustomCanvasWidget
class UCustomCanvasWidget : public UButton
{
public:
	uint8                                        Pad_1A53[0x48];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bOverrideScreenCanvasProjection;                   // 0x728(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIgnoreParentAlpha;                                // 0x729(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1A55[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnDraggedObject;                                   // 0x730(0x10)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1A56[0x50];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCustomCanvasWidget* GetDefaultObj();

};

// 0x148 (0x8D8 - 0x790)
// Class ShooterGame.DataListEntryButton
class UDataListEntryButton : public UCustomCanvasWidget
{
public:
	uint8                                        Pad_1A71[0x10];                                    // Fixing Size After Last Property  > TateDumper <
	class FString                                DisplayString;                                     // 0x7A0(0x10)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, EditConst, GlobalConfig, SubobjectReference)
	class FString                                AdditionalDisplayString;                           // 0x7B0(0x10)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class FName                                  ContextMenuAnchorName;                             // 0x7C0(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class UTexture2D*                            ItemIcon;                                          // 0x7C8(0x8)(Edit, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	struct FLinearColor                          ForegroundColor;                                   // 0x7D0(0x10)(ExportObject, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance)
	bool                                         bUseSelectedBackgroundColor;                       // 0x7E0(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1A74[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          SelectedBackgroundColor;                           // 0x7E4(0x10)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1A76[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UTexture2D*                            AltHighlightBGTexture;                             // 0x7F8(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        NameOffset;                                        // 0x800(0x4)(ExportObject, Net, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bClickable;                                        // 0x804(0x1)(ConstParm, Net, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bEnabled;                                          // 0x805(0x1)(Edit, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, SubobjectReference)
	bool                                         bUseDisplayString;                                 // 0x806(0x1)(ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1A7B[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          DisplayStringColor;                                // 0x808(0x10)(ConstParm, BlueprintVisible, ExportObject, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector2D                             DisplayStringOffset;                               // 0x818(0x10)(Edit, ConstParm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        TextDisplayStringSize;                             // 0x828(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1A7C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector2D                             DisplayStringScale;                                // 0x830(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisplayStringCenterX;                             // 0x840(0x1)(Edit, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisplayStringCenterY;                             // 0x841(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bSetIndexPlusOneToDisplayString;                   // 0x842(0x1)(BlueprintVisible, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bAllowClickingWhenNoEntry;                         // 0x843(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1A81[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UFont*                                 DisplayStringFont;                                 // 0x848(0x8)(BlueprintVisible, ExportObject, Net, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class UTexture2D*                            SelectedIcon;                                      // 0x850(0x8)(ConstParm, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	struct FLinearColor                          DisabledColor;                                     // 0x858(0x10)(BlueprintVisible, Net, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	struct FLinearColor                          TintColorOverride;                                 // 0x868(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bDataListAutomaticallyOverrideText : 1;            // Mask: 0x1, PropSize: 0x10x878(0x1)(ExportObject, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bDataListAutomaticallyOverrideEnabled : 1;         // Mask: 0x2, PropSize: 0x10x878(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bWrapText : 1;                                     // Mask: 0x4, PropSize: 0x10x878(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseDataProviderCustomColor : 1;                   // Mask: 0x8, PropSize: 0x10x878(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bOverrideTintColor : 1;                            // Mask: 0x10, PropSize: 0x10x878(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bShowDisplayStringWhenHasItem : 1;                 // Mask: 0x20, PropSize: 0x10x878(0x1)(Edit, BlueprintVisible, EditFixedSize, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseCustomTextColor : 1;                           // Mask: 0x40, PropSize: 0x10x878(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bSelected : 1;                                     // Mask: 0x80, PropSize: 0x10x878(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bForceDraggingDisabled : 1;                        // Mask: 0x1, PropSize: 0x10x879(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bDraggable : 1;                                    // Mask: 0x2, PropSize: 0x10x879(0x1)(ExportObject, Net, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_DC : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bAllowExtraIcon : 1;                               // Mask: 0x10, PropSize: 0x10x879(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bToggleButton : 1;                                 // Mask: 0x20, PropSize: 0x10x879(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_DD : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1A8E[0x16];                                    // Fixing Size After Last Property  > TateDumper <
	class UTexture2D*                            OverrideDisabledIcon;                              // 0x890(0x8)(BlueprintVisible, ExportObject, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector2D                             WrappedTextSpacingAdjust;                          // 0x898(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1A91[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FColor                                OverridenTextColor;                                // 0x8B0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bHasEngram;                                        // 0x8B4(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bKnownEngram;                                      // 0x8B5(0x1)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bOverrideStlye;                                    // 0x8B6(0x1)(Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1A94[0x11];                                    // Fixing Size After Last Property  > TateDumper <
	class UMaterialInstanceDynamic*              MyIconMat;                                         // 0x8C8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	class UMenuAnchor*                           ContextMenuAnchor;                                 // 0x8D0(0x8)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UDataListEntryButton* GetDefaultObj();

	void OnGetContextMenuContent(class UWidget* ReturnValue);
	void GetStringValue(const class FString& ReturnValue);
	void GetOverridenStringValue(const class FString& ReturnValue);
	class UWidget* ClickedSecondaryButton();
	class UWidget* ClickedButton();
};

// 0x58 (0x930 - 0x8D8)
// Class ShooterGame.AdminPlayerInfoEntryButton
class UAdminPlayerInfoEntryButton : public UDataListEntryButton
{
public:
	uint8                                        bIsCustom : 1;                                     // Mask: 0x1, PropSize: 0x10x8D8(0x1)(Edit, ConstParm, BlueprintVisible, Parm, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_DE : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1A99[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                PlayerName;                                        // 0x8E0(0x10)(ConstParm, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	class FString                                SteamPlayerName;                                   // 0x8F0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class FString                                LinkedPlayerID;                                    // 0x900(0x10)(Edit, ConstParm, BlueprintVisible, Net, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bCenterDisplayName;                                // 0x910(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1A9F[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          DisplayStringSelectedColor;                        // 0x914(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1AA1[0xC];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAdminPlayerInfoEntryButton* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class ShooterGame.AhoCorasickMatch
class UAhoCorasickMatch : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAhoCorasickMatch* GetDefaultObj();

	TArray<class FString> SearchWords(class FString* Text, struct FAhoCorasickMatcher* Matcher, const TArray<struct FIntArray>& OutValues, bool* bFilterOverlaps, bool* bGetShortest);
	void AddWords(TArray<class FString>* WordList, struct FAhoCorasickMatcher* Matcher);
};

// 0x20 (0x4E8 - 0x4C8)
// Class ShooterGame.AIAttackCoordinator
class AAIAttackCoordinator : public AActor
{
public:
	int32                                        MaxAttackersPerTarget;                             // 0x4C8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        UpdateInterval;                                    // 0x4CC(0x4)(Edit, BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	TArray<TWeakObjectPtr<class APrimalDinoAIController>> Attackers;                                         // 0x4D0(0x10)(Edit, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1B00[0x8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class AAIAttackCoordinator* GetDefaultObj();

	void UpdateAttackGroup(TArray<class APrimalDinoAIController*>* AttackGroup);
	void RemoveAttacker(class APrimalDinoAIController** Controller);
	class AActor* GetNumAttackersWithPriorityForTarget(int32 ReturnValue);
	class AActor* GetNumAttackersForTarget(int32 ReturnValue);
	void ClearAllAttackers();
	class APrimalDinoAIController* CalculateAttackerPriorityWeight(float ReturnValue);
	class APrimalDinoCharacter* AddAttackerCharacter();
	void AddAttacker(class APrimalDinoAIController** Controller);
};

// 0xC0 (0xE8 - 0x28)
// Class ShooterGame.AllClustersInventory
class UAllClustersInventory : public UObject
{
public:
	uint8                                        Pad_1B22[0xC0];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAllClustersInventory* GetDefaultObj();

	class FString OnFinishedSaveForChangingItems(bool* Success);
	class FString OnFinishedReadLockForCreateLock(bool* Success, bool Locked);
	class FString OnFinishedLoadForChangingItems(bool* Success, const TArray<struct FItemNetInfo>& ArkItems);
	class FString OnFinishedCreateLockForChangingItems(bool* Success);
	class FString OnFinishedClearLockForChangingItems(bool* Success);
};

// 0x38 (0x910 - 0x8D8)
// Class ShooterGame.AllPaintingsEntryButton
class UAllPaintingsEntryButton : public UDataListEntryButton
{
public:
	class FString                                Filename;                                          // 0x8D8(0x10)(Edit, ExportObject, Net, EditFixedSize, OutParm, ReturnParm)
	class FString                                FilePath;                                          // 0x8E8(0x10)(Edit, ConstParm, ExportObject, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, SubobjectReference)
	struct FLinearColor                          DisplayStringSelectedColor;                        // 0x8F8(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1B3C[0x8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAllPaintingsEntryButton* GetDefaultObj();

};

// 0x48 (0x920 - 0x8D8)
// Class ShooterGame.AllPlayersEntryButton
class UAllPlayersEntryButton : public UDataListEntryButton
{
public:
	class FString                                PlayerName;                                        // 0x8D8(0x10)(ConstParm, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	class FString                                TribeName;                                         // 0x8E8(0x10)(ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	uint64                                       PlayerID;                                          // 0x8F8(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint64                                       TargetingTeamID;                                   // 0x900(0x8)(Edit, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class AShooterCharacter*                     CurrentCharachter;                                 // 0x908(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	struct FLinearColor                          DisplayStringSelectedColor;                        // 0x910(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UAllPlayersEntryButton* GetDefaultObj();

};

// 0xC8 (0x410 - 0x348)
// Class ShooterGame.AnimInstance_DinoBlueprintBase
class UAnimInstance_DinoBlueprintBase : public UAnimInstance
{
public:
	bool                                         bAllowNativeAnimations;                            // 0x348(0x1)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisableBlueprint;                                 // 0x349(0x1)(BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1B57[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              RootRotationOffset;                                // 0x350(0x18)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               RootLocationOffset;                                // 0x368(0x18)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bSkipAnimGraph;                                    // 0x380(0x1)(ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1B62[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MovementAnimRate;                                  // 0x384(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MovementAnimRatePower;                             // 0x388(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MinMovementAnimRate;                               // 0x38C(0x4)(ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MaxMovementAnimRate;                               // 0x390(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MovingAnimSpeedTreshold;                           // 0x394(0x4)(BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsMoving;                                         // 0x398(0x1)(ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseAimOffset;                                     // 0x399(0x1)(ConstParm, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1B6A[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        AimPitch;                                          // 0x39C(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        AimYaw;                                            // 0x3A0(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseBlinking;                                      // 0x3A4(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1B6F[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BlinkBlend;                                        // 0x3A8(0x4)(BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseTurning;                                       // 0x3AC(0x1)(Edit, BlueprintVisible, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseTurnInPlaceAnimation;                          // 0x3AD(0x1)(ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1B74[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TurningEnabledBlendTime;                           // 0x3B0(0x4)(Edit, ConstParm, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        TurningDisabledBlendTime;                          // 0x3B4(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        TurningDirectionBlendTime;                         // 0x3B8(0x4)(BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MinTurnRateForTurnAnimation;                       // 0x3BC(0x4)(Edit, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsTurning;                                        // 0x3C0(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bTurningRight;                                     // 0x3C1(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseSwimming;                                      // 0x3C2(0x1)(BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1B7A[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        SwimmingMovingAnimSpeedThreshold;                  // 0x3C4(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsSwimming;                                       // 0x3C8(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseRunning;                                       // 0x3C9(0x1)(Edit, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseRunningMovementAnimRate;                       // 0x3CA(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1B9C[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        RunningMovementAnimRate;                           // 0x3CC(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsRunning;                                        // 0x3D0(0x1)(Edit, ConstParm, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseSleepingAnim;                                  // 0x3D1(0x1)(ConstParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1B9D[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SleepingAnimTranslationOffset;                     // 0x3D8(0x18)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsSleeping;                                       // 0x3F0(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	bool                                         bUseFalling;                                       // 0x3F1(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1B9F[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        FallingAnimPlayRate;                               // 0x3F4(0x4)(Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        FallingBlendInTime;                                // 0x3F8(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        FallingBlendOutTime;                               // 0x3FC(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsFalling;                                        // 0x400(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1BA2[0xF];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimInstance_DinoBlueprintBase* GetDefaultObj();

};

// 0xE8 (0x430 - 0x348)
// Class ShooterGame.AnimInstance_DinoRootBoneName
class UAnimInstance_DinoRootBoneName : public UAnimInstance
{
public:
	bool                                         bAllowNativeAnimations;                            // 0x348(0x1)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisableBlueprint;                                 // 0x349(0x1)(BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1BAA[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              RootRotationOffset;                                // 0x350(0x18)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               RootLocationOffset;                                // 0x368(0x18)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        IKAlpha;                                           // 0x380(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bDisableIK;                                        // 0x384(0x1)(BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisableIKWhenFalling;                             // 0x385(0x1)(Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bSleepingEnableIK;                                 // 0x386(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bSkipAnimGraph;                                    // 0x387(0x1)(ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MovementAnimRate;                                  // 0x388(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MovementAnimRatePower;                             // 0x38C(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MinMovementAnimRate;                               // 0x390(0x4)(ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MaxMovementAnimRate;                               // 0x394(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MovingAnimSpeedTreshold;                           // 0x398(0x4)(BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MovingBlendInTime;                                 // 0x39C(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MovingBlendOutTime;                                // 0x3A0(0x4)(ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsMoving;                                         // 0x3A4(0x1)(ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseAimOffset;                                     // 0x3A5(0x1)(ConstParm, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1BB1[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        AimPitch;                                          // 0x3A8(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        AimYaw;                                            // 0x3AC(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        AimOffsetPitchScale;                               // 0x3B0(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        AimOffsetYawScale;                                 // 0x3B4(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseAlignGround;                                   // 0x3B8(0x1)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1BB4[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        AlignGroundAlpha;                                  // 0x3BC(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseBlinking;                                      // 0x3C0(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1BB6[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BlinkBlend;                                        // 0x3C4(0x4)(BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseTurning;                                       // 0x3C8(0x1)(Edit, BlueprintVisible, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseTurnInPlaceAnimation;                          // 0x3C9(0x1)(ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1BB9[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TurningEnabledBlendTime;                           // 0x3CC(0x4)(Edit, ConstParm, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        TurningDisabledBlendTime;                          // 0x3D0(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        TurningDirectionBlendTime;                         // 0x3D4(0x4)(BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MinTurnRateForTurnAnimation;                       // 0x3D8(0x4)(Edit, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsTurning;                                        // 0x3DC(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bTurningRight;                                     // 0x3DD(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseSwimming;                                      // 0x3DE(0x1)(BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1BC6[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        SwimmingMovingAnimSpeedThreshold;                  // 0x3E0(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsSwimming;                                       // 0x3E4(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseRunning;                                       // 0x3E5(0x1)(Edit, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseRunningMovementAnimRate;                       // 0x3E6(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1BC9[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        RunningMovementAnimRate;                           // 0x3E8(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        RunningBlendInTime;                                // 0x3EC(0x4)(Edit, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        RunningBlendOutTime;                               // 0x3F0(0x4)(ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsRunning;                                        // 0x3F4(0x1)(Edit, ConstParm, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseSleepingAnim;                                  // 0x3F5(0x1)(ConstParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1BDE[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SleepingAnimTranslationOffset;                     // 0x3F8(0x18)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsSleeping;                                       // 0x410(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	bool                                         bUseFalling;                                       // 0x411(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1BE1[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        FallingAnimPlayRate;                               // 0x414(0x4)(Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        FallingBlendInTime;                                // 0x418(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        FallingBlendOutTime;                               // 0x41C(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsFalling;                                        // 0x420(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1BE3[0xF];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimInstance_DinoRootBoneName* GetDefaultObj();

};

// 0x158 (0x4A0 - 0x348)
// Class ShooterGame.AnimInstance_DinoRootTransform
class UAnimInstance_DinoRootTransform : public UAnimInstance
{
public:
	bool                                         bAllowNativeAnimations;                            // 0x348(0x1)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisableBlueprint;                                 // 0x349(0x1)(BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1BF3[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              RootRotationOffset;                                // 0x350(0x18)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               RootLocationOffset;                                // 0x368(0x18)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FTransform                            RootOffsetTransform;                               // 0x380(0x60)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bSkipAnimGraph;                                    // 0x3E0(0x1)(ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1BF8[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MovementAnimRate;                                  // 0x3E4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MovementAnimRatePower;                             // 0x3E8(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MinimumMovementSpeed;                              // 0x3EC(0x4)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MovingBlendInTime;                                 // 0x3F0(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MovingBlendOutTime;                                // 0x3F4(0x4)(ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsMoving;                                         // 0x3F8(0x1)(ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1BFE[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MinimumMovementSpeedFlying;                        // 0x3FC(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        FlyingMoveBlendIn;                                 // 0x400(0x4)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        FlyingMoveBlendOut;                                // 0x404(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsFlying;                                         // 0x408(0x1)(Edit, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseFlyingOffset;                                  // 0x409(0x1)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1C00[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FlyingOffset;                                      // 0x410(0x18)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector                               CurrentFlyingOffset;                               // 0x428(0x18)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector                               LandedOffset;                                      // 0x440(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseAimOffset;                                     // 0x458(0x1)(ConstParm, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1C04[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        AimPitch;                                          // 0x45C(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        AimYaw;                                            // 0x460(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        AimOffsetPitchScale;                               // 0x464(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        AimOffsetYawScale;                                 // 0x468(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseBlinking;                                      // 0x46C(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1C06[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BlinkBlend;                                        // 0x470(0x4)(BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseTurning;                                       // 0x474(0x1)(Edit, BlueprintVisible, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1C08[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TurningEnabledBlendTime;                           // 0x478(0x4)(Edit, ConstParm, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        TurningDisabledBlendTime;                          // 0x47C(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        TurningDirectionBlendTime;                         // 0x480(0x4)(BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MinTurnRateForTurnAnimation;                       // 0x484(0x4)(Edit, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsTurning;                                        // 0x488(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bTurningRight;                                     // 0x489(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseRunning;                                       // 0x48A(0x1)(Edit, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsRunning;                                        // 0x48B(0x1)(Edit, ConstParm, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseSleepingAnim;                                  // 0x48C(0x1)(ConstParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsSleeping;                                       // 0x48D(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	bool                                         bUseFalling;                                       // 0x48E(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1C0F[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        FallingAnimPlayRate;                               // 0x490(0x4)(Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        FallingBlendInTime;                                // 0x494(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        FallingBlendOutTime;                               // 0x498(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsFalling;                                        // 0x49C(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseMounted;                                       // 0x49D(0x1)(ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsMounted;                                        // 0x49E(0x1)(ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1C15[0x1];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimInstance_DinoRootTransform* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class ShooterGame.AnimNotifyState_Custom
class UAnimNotifyState_Custom : public UAnimNotifyState
{
public:
	class FName                                  EventName;                                         // 0x30(0x8)(ExportObject, Net, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         bSendNotifyToWeapon;                               // 0x38(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bSendNotifyToArmorSlot;                            // 0x39(0x1)(Edit, ConstParm, ExportObject, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	enum class EPrimalEquipmentType              ArmorSlotToSendNotify;                             // 0x3A(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1C22[0x5];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimNotifyState_Custom* GetDefaultObj();

};

// 0x18 (0x58 - 0x40)
// Class ShooterGame.AnimNotify_CustomEvent
class UAnimNotify_CustomEvent : public UAnimNotify
{
public:
	class FName                                  EventName;                                         // 0x40(0x8)(ExportObject, Net, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	bool                                         bSendNotifyToWeapon;                               // 0x48(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bSendNotifyToArmorSlot;                            // 0x49(0x1)(Edit, ConstParm, ExportObject, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	enum class EPrimalEquipmentType              ArmorSlotToSendNotify;                             // 0x4A(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bLockHeadPositionNormalized;                       // 0x4B(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        TimeToLockHeadPosition;                            // 0x4C(0x4)(ConstParm, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUnlockHeadPositionNormalized;                     // 0x50(0x1)(ConstParm, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1C3E[0x7];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimNotify_CustomEvent* GetDefaultObj();

};

// 0x38 (0x78 - 0x40)
// Class ShooterGame.AnimNotify_PlayCameraShake
class UAnimNotify_PlayCameraShake : public UAnimNotify
{
public:
	float                                        PercentChanceToPlay;                               // 0x40(0x4)(ConstParm, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1C47[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                TheCameraShake;                                    // 0x48(0x8)(ConstParm, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        InnerRadius;                                       // 0x50(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        OuterRadius;                                       // 0x54(0x4)(ConstParm, BlueprintVisible, Net, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        Falloff;                                           // 0x58(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, DuplicateTransient)
	bool                                         bOrientShakeTowardsEpicenter;                      // 0x5C(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1C4A[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        ShakeScale;                                        // 0x60(0x4)(ConstParm, BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1C4C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                AttachName;                                        // 0x68(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UAnimNotify_PlayCameraShake* GetDefaultObj();

};

// 0x10 (0x120 - 0x110)
// Class ShooterGame.AnimNotify_PlayParticleEffectCustom
class UAnimNotify_PlayParticleEffectCustom : public UAnimNotify_PlayParticleEffect
{
public:
	class FName                                  AttachedComponentTag;                              // 0x110(0x8)(Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1C56[0x8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimNotify_PlayParticleEffectCustom* GetDefaultObj();

};

// 0x10 (0x50 - 0x40)
// Class ShooterGame.AnimNotify_StopSound
class UAnimNotify_StopSound : public UAnimNotify
{
public:
	class USoundBase*                            SoundToStop;                                       // 0x40(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        FadeOutTime;                                       // 0x48(0x4)(Edit, BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1C5B[0x4];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimNotify_StopSound* GetDefaultObj();

};

// 0x98 (0xC0 - 0x28)
// Class ShooterGame.AntiDupeTransactionLog
class UAntiDupeTransactionLog : public UObject
{
public:
	class UWorld*                                CurrentWorld;                                      // 0x28(0x8)(Edit, ConstParm, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1C61[0x90];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAntiDupeTransactionLog* GetDefaultObj();

};

// 0x30 (0x58 - 0x28)
// Class ShooterGame.ArkCloudInventoryData
class UArkCloudInventoryData : public UObject
{
public:
	struct FArkInventoryData                     MyArkData;                                         // 0x28(0x30)(ConstParm, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UArkCloudInventoryData* GetDefaultObj();

};

// 0x18 (0x4E0 - 0x4C8)
// Class ShooterGame.BaseBoxTrigger
class ABaseBoxTrigger : public AActor
{
public:
	class USceneComponent*                       SceneComp;                                         // 0x4C8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class UBoxComponent*                         TriggerBox;                                        // 0x4D0(0x8)(ExportObject, ReturnParm, Transient, SubobjectReference)
	uint8                                        bUseBPOnTriggerBeginOverlap : 1;                   // Mask: 0x1, PropSize: 0x10x4D8(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseBPOnTriggerEndOverlap : 1;                     // Mask: 0x2, PropSize: 0x10x4D8(0x1)(EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1CB6[0x7];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class ABaseBoxTrigger* GetDefaultObj();

	int32 OnTriggerEndOverlap(class AActor** OtherActor);
	struct FHitResult OnTriggerBeginOverlap(class AActor** OtherActor);
	class APrimalCharacter* IsCharacterTouchingTrigger(bool ReturnValue);
	TArray<class APrimalCharacter*> GetAllCharactersTouchingTrigger();
	int32 BPOnTriggerEndOverlap(class AActor** OtherActor);
	struct FHitResult BPOnTriggerBeginOverlap(class AActor** OtherActor);
};

// 0x40 (0xB40 - 0xB00)
// Class ShooterGame.BasePlayerController
class ABasePlayerController : public APrimalPlayerController
{
public:
	uint8                                        Pad_1CCC[0x28];                                    // Fixing Size After Last Property  > TateDumper <
	class UUI_CustomOverlay*                     CustomCursor;                                      // 0xB28(0x8)(ExportObject, Net, EditFixedSize, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1CCE[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bIsGamepadActive;                                  // 0xB38(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1CCF[0x7];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class ABasePlayerController* GetDefaultObj();

	struct FKey SimulateInputKey(bool bPressed);
	class FString ServerCheat();
	class FString Say();
	void ClientStartOnlineGame();
	void ClientSetSpectatorCamera(const struct FVector& CameraLocation, const struct FRotator& CameraRotation);
	bool ClientSendRoundEndEvent(int32 ExpendedTimeInSeconds);
	void ClientGameStarted();
	void ClientEndOnlineGame();
};

// 0x10 (0x330 - 0x320)
// Class ShooterGame.PrimalUserWidget
class UPrimalUserWidget : public UUserWidget
{
public:
	uint8                                        Pad_1CF4[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        ViewportZOrder;                                    // 0x328(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	float                                        DPIScaler;                                         // 0x32C(0x4)(ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)

	static class UClass* StaticClass();
	static class UPrimalUserWidget* GetDefaultObj();

	void WidgetRemovedFromViewport();
	void WidgetAddedToViewport();
	void StopAnimationByString(class FString* Name);
	void SetZOrderInViewport(int32* ZOrder);
	void PlayAnimationByString(class FString* Name, bool ReturnValue);
	bool OnWidgetGamepadActiveChangedBP();
	class UFont* NumCharactersThatFit(const class FString& ReturnValue);
	void HandleVirtualBack(bool ReturnValue);
	struct FKey HandleKeyUp(bool ReturnValue);
	void GetOverrideHighligteableWidgetBP(class UWidget* ReturnValue);
	struct FBPNetExecParams ExecuteCommandForPrimalUI();
	struct FBPNetExecParams BPExecutedCommandForPrimalUI();
};

// 0x428 (0x758 - 0x330)
// Class ShooterGame.PrimalUI
class UPrimalUI : public UPrimalUserWidget
{
public:
	uint8                                        Pad_1D6B[0x4C];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bCaptureMouseInput;                                // 0x37C(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bPreventGamepadDpadNavegation;                     // 0x37D(0x1)(ConstParm, BlueprintVisible, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bForceVirtualCursorEnabled;                        // 0x37E(0x1)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsClosing;                                        // 0x37F(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bWantsPrimalItemNotifications;                     // 0x380(0x1)(ConstParm, Net, EditFixedSize, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1D6F[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                DefaultToolTipWidget;                              // 0x388(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bEscapeClosesMenu;                                 // 0x390(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bEscapeOpensPauseMenu;                             // 0x391(0x1)(Edit, EditFixedSize, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bSpecialRightOpensPauseMenu;                       // 0x392(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bMenuSupportSlomo;                                 // 0x393(0x1)(ExportObject, Net, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bClickClosesMenu;                                  // 0x394(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsGameplayUI;                                     // 0x395(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsTopUI;                                          // 0x396(0x1)(ConstParm, BlueprintReadOnly, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	enum class EHighlightStartingPoint           HighlightStartPointType;                           // 0x397(0x1)(Edit, BlueprintVisible, Parm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	class UClass*                                ConfirmationDialogUITemplate;                      // 0x398(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	class UClass*                                XBoxFooterUITemplate;                              // 0x3A0(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bShowCancelIcon;                                   // 0x3A8(0x1)(ConstParm, Net, EditFixedSize, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bShowAcceptIcon;                                   // 0x3A9(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bShowLStickIcon;                                   // 0x3AA(0x1)(BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bShowRStickIcon;                                   // 0x3AB(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bShowBumpersIcon;                                  // 0x3AC(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bShowStartBtnIcon;                                 // 0x3AD(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bShowLTBtnIcon;                                    // 0x3AE(0x1)(BlueprintVisible, ExportObject, Net, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bShowRTBtnIcon;                                    // 0x3AF(0x1)(BlueprintVisible, Net, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bShowFaceBtnLeftIcon;                              // 0x3B0(0x1)(Edit, ExportObject, BlueprintReadOnly, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bShowFaceBtnTopIcon;                               // 0x3B1(0x1)(ConstParm, BlueprintVisible, ExportObject, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bShowFaceBtnRightIcon;                             // 0x3B2(0x1)(ConstParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bShowFaceBtnBottomIcon;                            // 0x3B3(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bShowLeftShoulderBtnIcon;                          // 0x3B4(0x1)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bShowXBoxFooter;                                   // 0x3B5(0x1)(Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIgnoreUIScaling;                                  // 0x3B6(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bCloseOnPlayerDie;                                 // 0x3B7(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	float                                        SplitscreenDPIScaler;                              // 0x3B8(0x4)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bForceFullscreenVirtualCursor;                     // 0x3BC(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bConstrainVirtualCursor;                           // 0x3BD(0x1)(Edit, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDoExtraDataListButtonPanelFilteringChecks;        // 0x3BE(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1D7C[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  DefaultHighlightWidgetOverrideName;                // 0x3C0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bShouldValidateInputOnRemove;                      // 0x3C8(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         ShouldStretchMainScreenWhenHandheld;               // 0x3C9(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         WasInHandheldMode;                                 // 0x3CA(0x1)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1D7D[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnchors                              OriginalUnStretchedAnchors;                        // 0x3D0(0x20)(Edit, ConstParm, EditFixedSize, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	struct FMargin                               OriginalUnstretchedSize;                           // 0x3F0(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector2D                             OriginalSizeBoxUnstretchedSize;                    // 0x400(0x10)(ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	struct FAnchors                              StretchedHandheldAnchors;                          // 0x410(0x20)(Edit, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	struct FMargin                               StretchedHandheldSize;                             // 0x430(0x10)(Edit, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector2D                             SizeBoxHandheldSize;                               // 0x440(0x10)(ConstParm, OutParm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bAutoProcessSplitscreenScaling;                    // 0x450(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1D83[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        VirtualCursorFrames;                               // 0x454(0x4)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1D84[0x48];                                    // Fixing Size After Last Property  > TateDumper <
	float                                        AnalogDeltaX;                                      // 0x4A0(0x4)(Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	float                                        AnalogDeltaY;                                      // 0x4A4(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1D85[0x1C0];                                   // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            HTTPGetResponseEvent;                              // 0x668(0x10)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	TWeakObjectPtr<class APrimalStructureItemContainer> ItemContainer;                                     // 0x678(0x8)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bCachedIsGamepadActive;                            // 0x680(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1D88[0xD3];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         OverrideButtonSounds;                              // 0x754(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1D89[0x3];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UPrimalUI* GetDefaultObj();

	void UsingProController(bool DebugOut, bool ReturnValue);
	void ShowDLCConfirmationDialog(enum class EDLCSelector DLC, class UUI_GenericConfirmationDialog* ReturnValue);
	class FString ShowConfirmationDialogBP(const class FString& TitleText, bool IsJustOKBox);
	void SetInputMode();
	class UWidget* SetHighlightedWidget(bool bSetLastHighlightedPosition);
	void ResetAllScrollBars();
	void RemovedFromViewport();
	bool ProcessSplitscreen();
	class APlayerController* PlayHapticEffect(enum class EHapticEffectType Type, struct FVector* Location, class UWorld* World);
	void OpenTheStoreDLCPage(const class FString& TheDLCName);
	struct FPointerEvent OnMouseButtonDownEvent(const struct FEventReply& ReturnValue);
	struct FGeometry OnKeyUpEvent(const struct FKeyEvent& InKeyboardEvent, const struct FEventReply& ReturnValue);
	struct FGeometry OnKeyDownEvent(const struct FKeyEvent& InKeyboardEvent, const struct FEventReply& ReturnValue);
	struct FControllerEvent OnGamepadButtonDownEvent(const struct FEventReply& ReturnValue);
	bool OnGamepadActiveChangedBP();
	bool OnGamepadActiveChanged();
	bool OnDLCConfirmationDialogClosed();
	class UWidget* OnCreateCredits();
	bool OnConfirmationDialogClosedBP();
	bool OnConfirmationDialogClosed();
	void MainMenuEscapePressed();
	void IsRightTriggerDown(bool ReturnValue);
	void IsLeftTriggerDown(bool ReturnValue);
	void HTTPGetString(class FString* InURL);
	void HandleDockedModeChanges();
	void GetWidgetToScaleForHandheld(class UWidget* ReturnValue);
	void GetSizeboxForExtraHandheldScaling(class USizeBox* ReturnValue);
	void GetShooterHud(class AShooterHUD* ReturnValue);
	void GetPlayerState(class AShooterPlayerState* ReturnValue);
	void GetPC(class AShooterPlayerController* ReturnValue);
	void GetPawn(class APrimalCharacter* ReturnValue);
	void GetOpenComboBox(class UComboBoxString* ReturnValue);
	void FixHighlights();
	void DoExtraScalingForSplitscreen(const struct FVector2D& PlayerSize);
	void CloseWithAnimation();
	class UWidget* ClickedSecondaryButton();
	class UWidget* ClickedButton();
	bool CheckGamepadActiveChanged();
	struct FSlateColor ChangeChildrenTextColorBP(class UPanelWidget** Parent, bool Recursive);
	void BPVirtualCursorinit();
	void BPReleasedVirtualAccept();
	bool BPProcessSplitscreenAndAddToViewport(int32* ZOrder);
	void BPHighlightWidgetOnStart(bool ReturnValue);
	void BPHandleDockedModeChange(bool bIsDocked);
	float BPGameTick();
	struct FKey BPGamepadReleased(bool ReturnValue);
	void BPEscapeClosed(bool ReturnValue);
	void BPCycleHighlighted(bool ReturnValue);
	struct FKey BPControlHighlighted(enum class EControlDirection Dir, float AnalogValue);
	void AddedToViewport();
};

// 0x0 (0x758 - 0x758)
// Class ShooterGame.BaseSelectableButtonWidget
class UBaseSelectableButtonWidget : public UPrimalUI
{
public:

	static class UClass* StaticClass();
	static class UBaseSelectableButtonWidget* GetDefaultObj();

	bool BPSetSelected();
	void BPIsSelected(bool ReturnValue);
	void BPGetButton(class UCustomButtonWidget* ReturnValue);
};

// 0x8B8 (0xE68 - 0x5B0)
// Class ShooterGame.ShooterGameState
class AShooterGameState : public AGameState
{
public:
	uint8                                        Pad_1EF7[0x10];                                    // Fixing Size After Last Property  > TateDumper <
	int32                                        NumNPC;                                            // 0x5C0(0x4)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NumHibernatedNPC;                                  // 0x5C4(0x4)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NPCActiveCountTamed;                               // 0x5C8(0x4)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NumActiveNPC;                                      // 0x5CC(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NumDeadNPC;                                        // 0x5D0(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NumPlayerActors;                                   // 0x5D4(0x4)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NumPlayerConnected;                                // 0x5D8(0x4)(ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bServerUseLocalizedChat;                           // 0x5DC(0x1)(Edit, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1EFD[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        LocalizedChatRadius;                               // 0x5E0(0x4)(ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        LocalizedChatRadiusUnconsiousScale;                // 0x5E4(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ServerFramerate;                                   // 0x5E8(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F01[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                NewStructureDestructionTag;                        // 0x5F0(0x10)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        DayNumber;                                         // 0x600(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	float                                        DayTime;                                           // 0x604(0x4)(Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       NetworkTime;                                       // 0x608(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint32                                       TimeUTC;                                           // 0x610(0x4)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NetUTC;                                            // 0x614(0x4)(BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsOfficialServer;                                 // 0x618(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsListenServer;                                   // 0x619(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsDediServer;                                     // 0x61A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsServerRunningOnConsole;                         // 0x61B(0x1)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsArkTributeAvailable;                            // 0x61C(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsArkDownloadsAllowed;                            // 0x61D(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowThirdPersonPlayer;                           // 0x61E(0x1)(ConstParm, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bServerHardcore;                                   // 0x61F(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bServerPVE;                                        // 0x620(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAutoPvE;                                          // 0x621(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bServerCrosshair;                                  // 0x622(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bServerForceNoHUD;                                 // 0x623(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bFlyerPlatformAllowUnalignedDinoBasing;            // 0x624(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bMapPlayerLocation;                                // 0x625(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPvEDisableFriendlyFire;                           // 0x626(0x1)(BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPvEAllowTribeWar;                                 // 0x627(0x1)(ConstParm, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPvEAllowTribeWarCancel;                           // 0x628(0x1)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bEnablePvPGamma;                                   // 0x629(0x1)(BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventDroppedItemPhysics;                        // 0x62A(0x1)(ConstParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisablePvEGamma;                                  // 0x62B(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NumTamedDinos;                                     // 0x62C(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxStructuresInRange;                              // 0x630(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        DayCycleSpeedScale;                                // 0x634(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        DayTimeSpeedScale;                                 // 0x638(0x4)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        NightTimeSpeedScale;                               // 0x63C(0x4)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	int32                                        StartTimeHour;                                     // 0x640(0x4)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PvEStructureDecayPeriodMultiplier;                 // 0x644(0x4)(Edit, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        PvEDinoDecayPeriodMultiplier;                      // 0x648(0x4)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PerPlatformMaxStructuresMultiplier;                // 0x64C(0x4)(ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ImplantSuicideCD;                                  // 0x650(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableStructureDecayPvE;                         // 0x654(0x1)(Edit, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableDinoDecayPvE;                              // 0x655(0x1)(ConstParm, BlueprintVisible, Net, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowCaveBuildingPvE;                             // 0x656(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowCaveBuildingPvP;                             // 0x657(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventDownloadSurvivors;                         // 0x658(0x1)(Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bReachedPlatformStructureLimit;                    // 0x659(0x1)(BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAdminLogging;                                     // 0x65A(0x1)(ExportObject, Net, EditFixedSize, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPvPStructureDecay;                                // 0x65B(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventDownloadDinos;                             // 0x65C(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventDownloadItems;                             // 0x65D(0x1)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventUploadDinos;                               // 0x65E(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventUploadItems;                               // 0x65F(0x1)(BlueprintReadOnly, Net, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventUploadSurvivors;                           // 0x660(0x1)(Edit, ConstParm, Net, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventMateBoost;                                 // 0x661(0x1)(Edit, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventStructurePainting;                         // 0x662(0x1)(Edit, ConstParm, ExportObject, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowCharacterCreation;                           // 0x663(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowSpawnPointSelection;                         // 0x664(0x1)(BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F1D[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        MaxTamedDinos;                                     // 0x668(0x4)(ExportObject, Net, EditFixedSize, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableSpawnAnimations;                           // 0x66C(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F1F[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                PlayerListString;                                  // 0x670(0x10)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnPlayerListPopulated;                             // 0x680(0x10)(ConstParm, BlueprintVisible, EditFixedSize, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        GlobalSpoilingTimeMultiplier;                      // 0x690(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        GlobalItemDecompositionTimeMultiplier;             // 0x694(0x4)(Edit, ConstParm, Net, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxNumberOfPlayersInTribe;                         // 0x698(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        TribeSlotReuseCooldown;                            // 0x69C(0x4)(Edit, ExportObject, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        GlobalCorpseDecompositionTimeMultiplier;           // 0x6A0(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        EggHatchSpeedMultiplier;                           // 0x6A4(0x4)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  ActiveEvent;                                       // 0x6A8(0x8)(BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bAllowPaintingWithoutResources;                    // 0x6B0(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bEnableExtraStructurePreventionVolumes;            // 0x6B1(0x1)(Edit, ConstParm, EditFixedSize, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F23[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FItemCraftingCostOverride>     OverrideItemCraftingCosts;                         // 0x6B8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FItemMaxItemQuantityOverride>  OverrideItemMaxQuantity;                           // 0x6C8(0x10)(ExportObject, Net, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         DisableRailgunPVP;                                 // 0x6D8(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F24[0xA7];                                    // Fixing Size After Last Property  > TateDumper <
	double                                       PrivateNetworkTime;                                // 0x780(0x8)(BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       LastServerSaveTime;                                // 0x788(0x8)(ConstParm, ExportObject, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ServerSaveInterval;                                // 0x790(0x4)(DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        TribeNameChangeCooldown;                           // 0x794(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        PlatformSaddleBuildAreaBoundsMultiplier;           // 0x798(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bAlwaysAllowStructurePickup;                       // 0x79C(0x1)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F27[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        StructurePickupTimeAfterPlacement;                 // 0x7A0(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        StructurePickupHoldDuration;                       // 0x7A4(0x4)(ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bAllowHideDamageSourceFromLogs;                    // 0x7A8(0x1)(ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F28[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FClassMultiplier>              DinoClassSpeedMultipliers;                         // 0x7B0(0x10)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              TamedDinoClassSpeedMultipliers;                    // 0x7C0(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bRiderDinoCollision;                               // 0x7D0(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F2A[0x1F];                                    // Fixing Size After Last Property  > TateDumper <
	class UAudioComponent*                       DynamicMusicAudioComponent;                        // 0x7F0(0x8)(Edit, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class UAudioComponent*                       DynamicMusicAudioComponent2;                       // 0x7F8(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F2B[0x10];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<struct FLevelExperienceRamp>          LevelExperienceRampOverrides;                      // 0x810(0x10)(Edit, ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<struct FEngramEntryOverride>          OverrideEngramEntries;                             // 0x820(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class UClass*                                CustomGameUITemplate;                              // 0x830(0x8)(BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<class FString>                        PreventDinoTameClassNames;                         // 0x838(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        ListenServerTetherDistanceMultiplier;              // 0x848(0x4)(Edit, ConstParm, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F2D[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                PGMapName;                                         // 0x850(0x10)(Edit, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<int32>                                SupportedSpawnRegions;                             // 0x860(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class UPaintingCache*                        PaintingCache;                                     // 0x870(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	class USoundBase*                            StaticOverrideMusic;                               // 0x878(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bEnableDeathTeamSpectator;                         // 0x880(0x1)(Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F32[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               PlayerFloatingHUDOffset;                           // 0x888(0x18)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        PlayerFloatingHUDOffsetScreenY;                    // 0x8A0(0x4)(Edit, ConstParm, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        StructureDamageRepairCooldown;                     // 0x8A4(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bForceAllStructureLocking;                         // 0x8A8(0x1)(Edit, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bAllowCustomRecipes;                               // 0x8A9(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bAllowRaidDinoFeeding;                             // 0x8AA(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F37[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CustomRecipeEffectivenessMultiplier;               // 0x8AC(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        CustomRecipeSkillMultiplier;                       // 0x8B0(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F3A[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class USoundBase*                            OverrideAreaMusic;                                 // 0x8B8(0x8)(ConstParm, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector                               OverrideAreaMusicPosition;                         // 0x8C0(0x18)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        OverrideAreaMusicRange;                            // 0x8D8(0x4)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bAllowUnclaimDinos;                                // 0x8DC(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F3D[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        FloatingHUDRange;                                  // 0x8E0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        FloatingChatRange;                                 // 0x8E4(0x4)(Edit, ConstParm, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        ExtinctionEventTimeInterval;                       // 0x8E8(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        RTSModeNumSelectableDinosScale;                    // 0x8EC(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        RTSMaxRangeFromPlayerCharacterScale;               // 0x8F0(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        ExtinctionEventPercent;                            // 0x8F4(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        ExtinctionEventSecondsRemaining;                   // 0x8F8(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDoExtinctionEvent;                                // 0x8FC(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F44[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        DestroyTamesOverLevelClamp;                        // 0x900(0x4)(BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F46[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FInventoryComponentDefaultItemsAppend> InventoryComponentAppends;                         // 0x908(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bPreventOfflinePvP;                                // 0x918(0x1)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bPvPDinoDecay;                                     // 0x919(0x1)(BlueprintVisible, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bAllowUnclaimDinosConfig;                          // 0x91A(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bForceUseInventoryAppends;                         // 0x91B(0x1)(Edit, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bOverideStructurePlatformPrevention;               // 0x91C(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F4E[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        ItemStackSizeMultiplier;                           // 0x920(0x4)(Edit, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F50[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<int32>                                PreventOfflinePvPLiveTeams;                        // 0x928(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<int32>                                PreventOfflinePvPExpiringTeams;                    // 0x938(0x10)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<float>                                PreventOfflinePvPExpiringTimes;                    // 0x948(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F53[0xA0];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bAllowAnyoneBabyImprintCuddle;                     // 0x9F8(0x1)(Edit, ConstParm, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisableImprintDinoBuff;                           // 0x9F9(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F54[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        MaxPersonalTamedDinos;                             // 0x9FC(0x4)(ConstParm, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F56[0x18];                                    // Fixing Size After Last Property  > TateDumper <
	class FString                                ClusterId;                                         // 0xA18(0x10)(BlueprintVisible, ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F59[0x30];                                    // Fixing Size After Last Property  > TateDumper <
	class FString                                ServerSessionName;                                 // 0xA58(0x10)(ConstParm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bPreventTribeAlliances;                            // 0xA68(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F5A[0x19];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bServerUseDinoList;                                // 0xA82(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bPvEAllowStructuresAtSupplyDrops;                  // 0xA83(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bAllowForceNetUpdate;                              // 0xA84(0x1)(BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F5F[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MinimumDinoReuploadInterval;                       // 0xA88(0x4)(Edit, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        HairGrowthSpeedMultiplier;                         // 0xA8C(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        DinoHairGrowthSpeedMultiplier;                     // 0xA90(0x4)(Edit, ConstParm, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        FastDecayInterval;                                 // 0xA94(0x4)(Edit, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class FString                                CachedSessionOwnerId;                              // 0xA98(0x10)(ConstParm, BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        OxygenSwimSpeedStatMultiplier;                     // 0xAA8(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F64[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnHTTPGetResponse;                                 // 0xAB0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnHTTPPostResponse;                                // 0xAC0(0x10)(ConstParm, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bAllowMultipleAttachedC4;                          // 0xAD0(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bCrossARKAllowForeignDinoDownloads;                // 0xAD1(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F69[0x16];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bUseCorpseLocator;                                 // 0xAE8(0x1)(Edit, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bEnablePlayerMoveThroughSleeping;                  // 0xAE9(0x1)(BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bEnablePlayerMoveThroughAlly;                      // 0xAEA(0x1)(Edit, Net, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisableStructurePlacementCollision;               // 0xAEB(0x1)(ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseSingleplayerSettings;                          // 0xAEC(0x1)(Edit, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bAllowPlatformSaddleMultiFloors;                   // 0xAED(0x1)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bPreventSpawnAnimations;                           // 0xAEE(0x1)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F6B[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        MaxAlliancesPerTribe;                              // 0xAF0(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        MaxTribesPerAlliance;                              // 0xAF4(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsLegacyServer;                                   // 0xAF8(0x1)(BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisableDinoDecayClaiming;                         // 0xAF9(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F6E[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        bEnableServerDestroyTamesAboveSoftTameLimit;       // 0xAFC(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        MaxTamedDinos_SoftTameLimit_CountdownForDeletionDuration; // 0xB00(0x4)(ConstParm, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        MaxTamedDinos_SoftTameLimit_NumTamedDinos_UnderLimit; // 0xB04(0x4)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        MaxTamedDinos_SoftTameLimit_NumTamedDinos_OverLimit; // 0xB08(0x4)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         MaxTamedDinos_SoftTameLimit_HasDoneInitialSearch;  // 0xB0C(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F72[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  UseStructurePreventionVolumeTag;                   // 0xB10(0x8)(ConstParm, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        MaxStructuresInSmallRadius;                        // 0xB18(0x4)(BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        RadiusStructuresInSmallRadius;                     // 0xB1C(0x4)(BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bUseTameLimitForStructuresOnly;                    // 0xB20(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisableWirelessCrafting;                          // 0xB21(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisableWirelessCraftingForDinos;                  // 0xB22(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisableWirelessCraftingForPlayers;                // 0xB23(0x1)(BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisableWirelessCraftingForStructures;             // 0xB24(0x1)(BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F75[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        WirelessCraftingRangeOverride;                     // 0xB28(0x4)(Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F76[0xC];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bLimitTurretsInRange;                              // 0xB38(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F77[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        LimitTurretsRange;                                 // 0xB3C(0x4)(Edit, ConstParm, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        LimitTurretsNum;                                   // 0xB40(0x4)(ConstParm, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        LimitGeneratorsNum;                                // 0xB44(0x4)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        LimitGeneratorsRange;                              // 0xB48(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        CropPlotStackLimit;                                // 0xB4C(0x4)(Edit, ConstParm, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisablePhotoMode;                                 // 0xB50(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisableTekLegsBoost;                              // 0xB51(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F79[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        PhotoModeRangeLimit;                               // 0xB54(0x4)(Edit, ConstParm, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bForceAllowAllStructures;                          // 0xB58(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bShowCreativeMode;                                 // 0xB59(0x1)(BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F7A[0x26];                                    // Fixing Size After Last Property  > TateDumper <
	float                                        PassiveTameIntervalMultiplier;                     // 0xB80(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F7C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class UClass*>                        UniqueDinos;                                       // 0xB88(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<class FName>                          ActiveMissionTags;                                 // 0xB98(0x10)(Edit, ConstParm, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint32                                       MinimumUniqueDownloadInterval;                     // 0xBA8(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint32                                       MaximumUniqueDownloadInterval;                     // 0xBAC(0x4)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIgnoreStructuresPreventionVolumes;                // 0xBB0(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bPreventOutOfTribePinCodeUse;                      // 0xBB1(0x1)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F7D[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FDinoDownloadData>             UniqueDownloads;                                   // 0xBB8(0x10)(Edit, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<struct FDataSet>                      GameDataSets;                                      // 0xBC8(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class UPrimalWorldSettingsEventOverrides*    ActiveEventOverrides;                              // 0xBD8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIgnoreLimitMaxStructuresInRangeTypeFlag;          // 0xBE0(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F7F[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FMassTeleportData>             MassTeleportQueue;                                 // 0xBE8(0x10)(BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F81[0x70];                                    // Fixing Size After Last Property  > TateDumper <
	TMap<class FName, class UDataLayerInstance*> DataLayerMap;                                      // 0xC68(0x50)(Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bAllowLowGravitySpin;                              // 0xCB8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F84[0x17];                                    // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnDinoDownloaded;                                  // 0xCD0(0x10)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnDinoUploaded;                                    // 0xCE0(0x10)(BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<struct FWorldBuffPersistantData>      WorldBuffPersistantDatas;                          // 0xCF0(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        TurretCopySettingsCooldown;                        // 0xD00(0x4)(Edit, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        BaseHexagonRewardMultiplier;                       // 0xD04(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        HexagonRewardMultiplier;                           // 0xD08(0x4)(Edit, BlueprintVisible, ExportObject, Net, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        HexagonCostMultiplier;                             // 0xD0C(0x4)(Edit, Net, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisableHexagonStore;                              // 0xD10(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bHexStoreAllowOnlyEngramTradeOption;               // 0xD11(0x1)(Edit, ConstParm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bAllowSpeedLeveling;                               // 0xD12(0x1)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bAllowFlyerSpeedLeveling;                          // 0xD13(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F89[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class FString>                        PreventBreedingForClassNames;                      // 0xD18(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        LiveTuningReplicatedChunkSize;                     // 0xD28(0x4)(BlueprintVisible, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F8A[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class FString>                        LiveTuningOverloadChunks;                          // 0xD30(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F8B[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class FString>                        PreventTransferForClassNames;                      // 0xD48(0x10)(BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        EnvironmentIndex;                                  // 0xD58(0x4)(Edit, ConstParm, BlueprintVisible, Net, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        NextEnvironmentIndex;                              // 0xD5C(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	struct FColor                                FloatingPlatformProfileNameColor;                  // 0xD60(0x4)(Edit, ConstParm, ExportObject, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	struct FColor                                FloatingNameColor;                                 // 0xD64(0x4)(Edit, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	double                                       NextMutagenTime;                                   // 0xD68(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        OverrideMaxExperiencePointsPlayer;                 // 0xD70(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        OverrideMaxExperiencePointsDino;                   // 0xD74(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<int32>                                DeferredExplorerNoteUnlockQueue;                   // 0xD78(0x10)(BlueprintVisible, EditFixedSize, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisableCustomFoldersInTributeInventories;         // 0xD88(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F91[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<TWeakObjectPtr<class AActor>>         ForcedRelevantPOIActors;                           // 0xD90(0x10)(Edit, Net, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisableRailgunPVP;                                // 0xDA0(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F92[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MinimumTimebetweeninventoryRetrieval;              // 0xDA4(0x4)(BlueprintVisible, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        WildFollowerSpawnChanceMultiplier;                 // 0xDA8(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	float                                        WildFollowerSpawnCountMultiplier;                  // 0xDAC(0x4)(Edit, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDisableDinoItemBlacklist;                         // 0xDB0(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bAllowCryoFridgeOnSaddle;                          // 0xDB1(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F99[0x56];                                    // Fixing Size After Last Property  > TateDumper <
	double                                       RealtimeThrottledTickTimeAmount;                   // 0xE08(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F9A[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        bCharacterPaintingOnlySameTeam : 1;                // Mask: 0x1, PropSize: 0x10xE14(0x1)(Edit, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_11E : 7;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1F9B[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FNetChangeDefaultPropertyValue> CurrentDefaultPropertyValueUpdates;                // 0xE18(0x10)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F9C[0x18];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<int64>                                WhiteListedCustomCosmeticModSkins;                 // 0xE40(0x10)(Edit, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F9D[0x18];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class AShooterGameState* GetDefaultObj();

	bool StartMassTeleport(const struct FMassTeleportData& MassTeleportData, struct FTeleportDestination* TeleportDestination, bool ReturnValue);
	struct FMassTeleportData ShouldMassTeleportMoveActor(class AActor* ForActor, bool ReturnValue);
	int32 SetNextEnvironmentIndex();
	int32 SetEnvironmentIndex();
	class AActor* RemoveRelevantPOIActor();
	void QueueExplorerNoteForDeferredUnlock(int32* ExplorerNoteIndex);
	class APrimalCharacter* PrintCDODebugForChar();
	struct FCDODebugData PrintCDODebug();
	struct FMassTeleportData PrepareActorForMassTeleport();
	void OnRep_SupportedSpawnRegions();
	void OnRep_ReplicateLocalizedChatRadius();
	void OnRep_ReplicateLiveTuningOverloadChunks();
	void OnRep_CurrentDefaultPropertyValueUpdates();
	void OnRep_CosmeticWhitelist();
	void OnNewClassInitialized(class UClass** ForClass);
	struct FHUDNotification OnHUDNotification(bool ReturnValue);
	TArray<int32> NetUpdateOfflinePvPLiveTeams();
	TArray<float> NetUpdateOfflinePvPExpiringTeams();
	struct FVector NetSpawnFoliageVFXActorAtLocationAndDoFoliageInteraction(int32* DataIndex);
	int32 NetAddFloatingText(float MinScale);
	int32 NetAddFloatingDamageText();
	struct FRotator Multi_SpawnCosmeticActor();
	void LoadedWorld();
	struct FMassTeleportData IsValidMassTeleportData(bool ReturnValue);
	void IsUniqueDinoAlreadySpawned(TSoftClassPtr<class APrimalDinoCharacter> UniqueDino, bool ReturnValue);
	bool IsTeamIDInvincible(bool ReturnValue);
	class AActor* IsMassTeleportInProgress(bool ReturnValue);
	class UClass* IsEngramClassHidden(bool ReturnValue);
	void HTTPPostRequest(class FString* InURL, class FString* Content);
	void HTTPGetRequest(class FString* InURL);
	void HandleInitializedGameState();
	void GetStartTimeHour(int32 ReturnValue);
	int32 GetOfflineDamagePreventionTime(float ReturnValue);
	bool GetNetworkTimeDelta(double ReturnValue);
	struct FMaxItemQuantityOverride GetItemMaxQuantityOverride(class UClass** ForClass, bool ReturnValue);
	class FString GetIniArray(const TArray<struct FGameIniData>& ReturnValue);
	void GetGamePhase(enum class EGamePhase ReturnValue);
	void GetDayTimeString(const class FString& ReturnValue);
	void GetDayCycleSpeed(float ReturnValue);
	void GetCleanServerSessionName(const class FString& ReturnValue);
	bool ForceStartMatch();
	void DisplayWelcomeUI();
	class FString CDOGetPrintStringForObjectProperty(class FName PropertyName, bool ReturnValue);
	class FString CDOGetPrintStringForObjectProperties(TArray<class FName>* PropertyNames, bool ReturnValue);
	class AActor* CancelMassTeleport(bool ReturnValue);
	void BPPreGameplaySetup();
	bool BPNetSpawnActorAtLocation(int32* DataIndex);
	void BPDrawGameStateHUD(class AShooterHUD* HUD);
	float BaseSpawnBuffAndAttachToCharacter(class APrimalBuff* ReturnValue);
	class APlayerController* BaseProjectWorldToScreenPosition(const struct FVector2D& ReturnValue);
	void BaseIsTribeID(int32* TeamID, bool ReturnValue);
	class FName BaseGetCustomActors(class ACustomActorList* ReturnValue);
	void BaseGetAllShooterControllers(const TArray<class AShooterPlayerController*>& ReturnValue);
	int32 BaseGetAllShooterCharactersOfTeam(const TArray<class AShooterCharacter*>& ReturnValue);
	void BaseGetAllShooterCharacters(const TArray<class AShooterCharacter*>& ReturnValue);
	int32 BaseGetAllDinoCharactersOfTeam(const TArray<class APrimalDinoCharacter*>& ReturnValue);
	float BaseDrawTileOnCanvas(class AShooterHUD* HUD, float* X, float* Y, struct FColor* DrawColor);
	TSoftClassPtr<class APrimalDinoCharacter> AllowDownloadDino(bool ReturnValue);
	class AShooterPlayerController* AllowDinoTame(bool ReturnValue);
	class AShooterPlayerController* AllowDinoClassTame(bool ReturnValue);
	int32 AddTokens(int32* Quantity);
	class AActor* AddRelevantPOIActor();
	float AddFloatingText(float MinScale);
};

// 0x0 (0xE68 - 0xE68)
// Class ShooterGame.BattleGameState
class ABattleGameState : public AShooterGameState
{
public:

	static class UClass* StaticClass();
	static class ABattleGameState* GetDefaultObj();

};

// 0xD8 (0x770 - 0x698)
// Class ShooterGame.BeamWeaponComponent
class UBeamWeaponComponent : public UPrimitiveComponent
{
public:
	class UParticleSystem*                       ParticleSystemTemplate;                            // 0x698(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UParticleSystem*                       ChargeupParticleSystemTemplate;                    // 0x6A0(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UParticleSystem*                       BurstWhenFiredSystemTemplate;                      // 0x6A8(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UParticleSystem*                       ImpactSystemTemplate;                              // 0x6B0(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        Duration;                                          // 0x6B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, DuplicateTransient)
	float                                        DamageRadius;                                      // 0x6BC(0x4)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                DamageType;                                        // 0x6C0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	float                                        DamageDelay;                                       // 0x6C8(0x4)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BaseDamage;                                        // 0x6CC(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        Length;                                            // 0x6D0(0x4)(ConstParm, BlueprintVisible, Net, ReturnParm)
	bool                                         IsPenetrating;                                     // 0x6D4(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1FCE[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TargetTrackingSpeed;                               // 0x6D8(0x4)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         UseOwnerForward;                                   // 0x6DC(0x1)(Edit, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1FCF[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        Offset;                                            // 0x6E0(0x4)(Edit, ExportObject, Parm, Transient, Config, DisableEditOnInstance, EditConst)
	float                                        ChargeupTime;                                      // 0x6E4(0x4)(ConstParm, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         WhenChargingWaitForCallToFire;                     // 0x6E8(0x1)(ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         DeactivateChargeupOnFiring;                        // 0x6E9(0x1)(BlueprintVisible, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1FD1[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            BeamStoppedFiringEvent;                            // 0x6F0(0x10)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TWeakObjectPtr<class AActor>                 BeamTarget;                                        // 0x700(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UParticleSystemComponent*              ParticleComp;                                      // 0x708(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UParticleSystemComponent*              ChargeUpComp;                                      // 0x710(0x8)(BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UParticleSystemComponent*              ImpactComp;                                        // 0x718(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1FD2[0x50];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UBeamWeaponComponent* GetDefaultObj();

	void UpdateBeamVisuals();
	void StopFiring();
	void StartFiring();
	void StartCharging();
	class AActor* SetTarget();
	void GetTarget(class AActor* ReturnValue);
	void GetParticleSystem(class UParticleSystemComponent* ReturnValue);
	void GetLastStoppedFiringTime(double ReturnValue);
	void GetIsFiring(bool ReturnValue);
	void GetIsCharging(bool ReturnValue);
	void GetImpactParticleSystem(class UParticleSystemComponent* ReturnValue);
	void GetChargeupParticleSystem(class UParticleSystemComponent* ReturnValue);
	void GetBeamEndLocation(const struct FVector& ReturnValue);
};

// 0x30 (0xE8 - 0xB8)
// Class ShooterGame.BeamWeaponController
class UBeamWeaponController : public UActorComponent
{
public:
	TArray<struct FComponentReference>           BeamWeapons;                                       // 0xB8(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            BeamStoppedFiringEvent;                            // 0xC8(0x10)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            BeamsStoppedFiringEvent;                           // 0xD8(0x10)(Edit, BlueprintReadOnly, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UBeamWeaponController* GetDefaultObj();

	void StopFiringBeams();
	void StartChargingBeams(bool ReturnValue);
	void StartChargingBeam(bool ReturnValue);
	class UBeamWeaponComponent* OnBeamStoppedFiringHandler();
	void GetBeamWeaponComponents(const TArray<class UBeamWeaponComponent*>& ReturnValue);
	void FireBeams(bool ReturnValue);
	void FireBeam(bool ReturnValue);
};

// 0x10 (0x768 - 0x758)
// Class ShooterGame.BinocularsWidgetUI
class UBinocularsWidgetUI : public UPrimalUI
{
public:
	class FName                                  GamepadUnlockButtonName;                           // 0x758(0x8)(ExportObject, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1FF3[0x8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UBinocularsWidgetUI* GetDefaultObj();

	class APrimalCharacter* GetDinoParentClass(class UClass* ReturnValue);
	class APrimalCharacter* GetCharUsesStat(enum class EPrimalCharacterStatusValue* ValueType, bool ReturnValue);
	class APrimalCharacter* GetCharTorpidMaxStatus(float ReturnValue);
	class APrimalCharacter* GetCharTorpidCurrentStatus(float ReturnValue);
	class APrimalCharacter* GetCharNumStatPointsString(enum class EPrimalCharacterStatusValue* ValueType, const class FString& ReturnValue);
	class APrimalCharacter* GetCharHealthMaxStatus(float ReturnValue);
	class APrimalCharacter* GetCharHealthCurrentStatus(float ReturnValue);
};

// 0x90 (0x558 - 0x4C8)
// Class ShooterGame.BiomeZoneSettings
class ABiomeZoneSettings : public AActor
{
public:
	class FString                                BiomeZoneName;                                     // 0x4C8(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FinalTemperatureMultiplier;                        // 0x4D8(0x4)(BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FinalTemperatureExponent;                          // 0x4DC(0x4)(Edit, ConstParm, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FinalTemperatureAddition;                          // 0x4E0(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PreOffsetTemperatureMultiplier;                    // 0x4E4(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PreOffsetTemperatureExponent;                      // 0x4E8(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PreOffsetTemperatureAddition;                      // 0x4EC(0x4)(ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AboveTemperatureOffsetThreshold;                   // 0x4F0(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AboveTemperatureOffsetMultiplier;                  // 0x4F4(0x4)(ConstParm, BlueprintVisible, Net, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AboveTemperatureOffsetExponent;                    // 0x4F8(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BelowTemperatureOffsetThreshold;                   // 0x4FC(0x4)(Edit, BlueprintVisible, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BelowTemperatureOffsetMultiplier;                  // 0x500(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BelowTemperatureOffsetExponent;                    // 0x504(0x4)(BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AbsoluteTemperatureOverride;                       // 0x508(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bPreventCrops : 1;                                 // Mask: 0x1, PropSize: 0x10x50C(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_125 : 7;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1FF9[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        EggRangeMaximumNumberOverride;                     // 0x510(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        EggMaximumNumberOverride;                          // 0x514(0x4)(BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        EggChanceToSpawnOverride;                          // 0x518(0x4)(Edit, ConstParm, Net, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        EggIntervalUnstasisChanceToSpawnOverride;          // 0x51C(0x4)(ConstParm, BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class UClass*>                        OverrideEggLimitsDinoClasses;                      // 0x520(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        BiomeZonePriority;                                 // 0x530(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MaxMultiplier;                                     // 0x534(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicDay;                            // 0x538(0x8)(Edit, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicNight;                          // 0x540(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicDay_Heavy;                      // 0x548(0x8)(Edit, BlueprintVisible, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicNight_Heavy;                    // 0x550(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class ABiomeZoneSettings* GetDefaultObj();

};

// 0x1B8 (0x6D0 - 0x518)
// Class ShooterGame.BiomeZoneVolume
class ABiomeZoneVolume : public AVolume
{
public:
	class FString                                BiomeZoneName;                                     // 0x518(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	enum class EBiomeZone                        BiomeZone;                                         // 0x528(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_201B[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        FinalTemperatureMultiplier;                        // 0x52C(0x4)(BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FinalTemperatureExponent;                          // 0x530(0x4)(Edit, ConstParm, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FinalTemperatureAddition;                          // 0x534(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PreOffsetTemperatureMultiplier;                    // 0x538(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PreOffsetTemperatureExponent;                      // 0x53C(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PreOffsetTemperatureAddition;                      // 0x540(0x4)(ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AboveTemperatureOffsetThreshold;                   // 0x544(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AboveTemperatureOffsetMultiplier;                  // 0x548(0x4)(ConstParm, BlueprintVisible, Net, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AboveTemperatureOffsetExponent;                    // 0x54C(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BelowTemperatureOffsetThreshold;                   // 0x550(0x4)(Edit, BlueprintVisible, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BelowTemperatureOffsetMultiplier;                  // 0x554(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BelowTemperatureOffsetExponent;                    // 0x558(0x4)(BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AbsoluteTemperatureOverride;                       // 0x55C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AbsoluteMaxTemperature;                            // 0x560(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AbsoluteMinTemperature;                            // 0x564(0x4)(Edit, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bPreventCrops : 1;                                 // Mask: 0x1, PropSize: 0x10x568(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bIsOutside : 1;                                    // Mask: 0x2, PropSize: 0x10x568(0x1)(Edit, ConstParm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bRemoveBuffWhenLeavingVolume : 1;                  // Mask: 0x4, PropSize: 0x10x568(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_127 : 5;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_2020[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        EggRangeMaximumNumberOverride;                     // 0x56C(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        EggMaximumNumberOverride;                          // 0x570(0x4)(BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        EggChanceToSpawnOverride;                          // 0x574(0x4)(Edit, ConstParm, Net, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        EggIntervalUnstasisChanceToSpawnOverride;          // 0x578(0x4)(ConstParm, BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2021[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class UClass*>                        OverrideEggLimitsDinoClasses;                      // 0x580(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        BiomeZonePriority;                                 // 0x590(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MaxMultiplier;                                     // 0x594(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AbsoluteWindOverride;                              // 0x598(0x4)(Edit, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PreOffsetWindMultiplier;                           // 0x59C(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PreOffsetWindExponent;                             // 0x5A0(0x4)(BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PreOffsetWindAddition;                             // 0x5A4(0x4)(BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AboveWindOffsetThreshold;                          // 0x5A8(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AboveWindOffsetMultiplier;                         // 0x5AC(0x4)(Edit, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AboveWindOffsetExponent;                           // 0x5B0(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BelowWindOffsetThreshold;                          // 0x5B4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BelowWindOffsetMultiplier;                         // 0x5B8(0x4)(Edit, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BelowWindOffsetExponent;                           // 0x5BC(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FinalWindMultiplier;                               // 0x5C0(0x4)(Edit, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FinalWindExponent;                                 // 0x5C4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FinalWindAddition;                                 // 0x5C8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2022[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                BiomeCustomDatas;                                  // 0x5D0(0x10)(BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        StatusAdjustmentRateMultipliersPositive[0xC];      // 0x5E0(0x30)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        StatusAdjustmentRateMultipliersNegative[0xC];      // 0x610(0x30)(ConstParm, Net, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bOnlyApplyAdjustmentRateValuesOutdoors;            // 0x640(0x1)(ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bStatusAdjustRateValues;                           // 0x641(0x1)(Edit, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableDayTransitionSounds;                       // 0x642(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2024[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	TSoftClassPtr<class APrimalBuff>             BuffToGive;                                        // 0x648(0x30)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TSoftClassPtr<class APrimalBuff>             BuffToPreventActiveUse;                            // 0x678(0x30)(Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicDay;                            // 0x6A8(0x8)(Edit, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicDay_Heavy;                      // 0x6B0(0x8)(Edit, BlueprintVisible, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicNight;                          // 0x6B8(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicNight_Heavy;                    // 0x6C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USoundBase*                            ForceMusicInBiome;                                 // 0x6C8(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class ABiomeZoneVolume* GetDefaultObj();

	void OnEndOverlap(class AActor* OverlappedActor, class AActor** Actor);
	void OnBeginOverlap(class AActor* OverlappedActor, class AActor** Actor);
	bool IsPointUnderwater(bool ReturnValue);
	struct FVector IsPointInVacuumBase(bool ReturnValue);
	bool GetWaterVolumeAtPoint(class APhysicsVolume* ReturnValue);
	bool GetPhysicsVolumeAtLocation(class APhysicsVolume* ReturnValue);
	void GetBiomeZoneVolume(class UWorld* World, struct FVector* Location, class ABiomeZoneVolume* ReturnValue);
	void GetAllBiomeZones(class UWorld* World, const TArray<class ABiomeZoneVolume*>& BiomeZones);
};

// 0x0 (0x28 - 0x28)
// Class ShooterGame.BiomeZoneVolumeEffectUtility
class UBiomeZoneVolumeEffectUtility : public UObject
{
public:

	static class UClass* StaticClass();
	static class UBiomeZoneVolumeEffectUtility* GetDefaultObj();

	bool SpawnRelevantEffect(struct FVector* Location);
	struct FBiomeZoneImpactEffect SpawnImpactEffect(class UWorld* World, class AActor** Owner, class AActor* ReturnValue);
	bool GetRelevantEffect(class AActor** SourceActor, const struct FBiomeZoneVolumeEffect& ReturnValue);
};

// 0x8 (0xA0 - 0x98)
// Class ShooterGame.BTService_FindTarget
class UBTService_FindTarget : public UBTService_BlackboardBase
{
public:
	bool                                         bDontSet;                                          // 0x98(0x1)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2039[0x7];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UBTService_FindTarget* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class ShooterGame.BTService_UpdateAggro
class UBTService_UpdateAggro : public UBTService
{
public:

	static class UClass* StaticClass();
	static class UBTService_UpdateAggro* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class ShooterGame.BTTask_AttackTarget
class UBTTask_AttackTarget : public UBTTaskNode
{
public:

	static class UClass* StaticClass();
	static class UBTTask_AttackTarget* GetDefaultObj();

};

// 0x38 (0xD0 - 0x98)
// Class ShooterGame.BTTask_GetRandomWanderDestination
class UBTTask_GetRandomWanderDestination : public UBTTask_BlackboardBase
{
public:
	struct FVector                               LocOverride;                                       // 0x98(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        RandomOffsetMultiplier;                            // 0xB0(0x4)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseRandomNegativeXDir;                            // 0xB4(0x1)(Edit, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bOrientRandOffsetByRotation;                       // 0xB5(0x1)(ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_203E[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              OrientRandOffsetByRotation;                        // 0xB8(0x18)(BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UBTTask_GetRandomWanderDestination* GetDefaultObj();

};

// 0x0 (0xD0 - 0xD0)
// Class ShooterGame.BTTask_RotateToFaceBBEntryWithGrab
class UBTTask_RotateToFaceBBEntryWithGrab : public UBTTask_RotateToFaceBBEntry
{
public:

	static class UClass* StaticClass();
	static class UBTTask_RotateToFaceBBEntryWithGrab* GetDefaultObj();

};

// 0x0 (0x758 - 0x758)
// Class ShooterGame.BuildingUI
class UBuildingUI : public UPrimalUI
{
public:

	static class UClass* StaticClass();
	static class UBuildingUI* GetDefaultObj();

	void GetStructurePlacer(class APrimalStructurePlacer* ReturnValue);
	class APrimalStructure* GetStructureIcon(class UTexture2D* ReturnValue);
};

// 0x8 (0x38 - 0x30)
// Class ShooterGame.CachedDB
class UCachedDB : public UDataAsset
{
public:
	bool                                         bForceRepopulateAll;                               // 0x30(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2050[0x7];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCachedDB* GetDefaultObj();

	void PopulateDBFromEditor();
	TArray<struct FAssetData> PopulateDB();
};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.ShooterWeaponDB
class UShooterWeaponDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class AShooterWeapon>, struct FShooterWeaponDBEntry> CachedWeaponData;                                  // 0x38(0x50)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UShooterWeaponDB* GetDefaultObj();

};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.PrimalDinoDB
class UPrimalDinoDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class APrimalDinoCharacter>, struct FPrimalDinoDBEntry> CachedDinoData;                                    // 0x38(0x50)(Edit, ConstParm, BlueprintReadOnly, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UPrimalDinoDB* GetDefaultObj();

};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.PrimalStructureDB
class UPrimalStructureDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class APrimalStructure>, struct FPrimalStructureDBEntry> CachedStructureData;                               // 0x38(0x50)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UPrimalStructureDB* GetDefaultObj();

};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.PrimalInventoryDB
class UPrimalInventoryDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class UPrimalInventoryComponent>, struct FPrimalInventoryDBEntry> CachedInventoryData;                               // 0x38(0x50)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UPrimalInventoryDB* GetDefaultObj();

};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.PrimalMissionDB
class UPrimalMissionDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class AMissionType>, struct FPrimalMissionDBEntry> CachedMissionData;                                 // 0x38(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UPrimalMissionDB* GetDefaultObj();

};

// 0x0 (0x80 - 0x80)
// Class ShooterGame.GenerateCacheDBForModsCommandlet
class UGenerateCacheDBForModsCommandlet : public UCommandlet
{
public:

	static class UClass* StaticClass();
	static class UGenerateCacheDBForModsCommandlet* GetDefaultObj();

};

// 0x8 (0x50 - 0x48)
// Class ShooterGame.CameraModifier_Climbing
class UCameraModifier_Climbing : public UCameraModifier
{
public:
	class AShooterWeapon_Climb*                  OwningWeapon;                                      // 0x48(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UCameraModifier_Climbing* GetDefaultObj();

};

// 0x28 (0x50 - 0x28)
// Class ShooterGame.CDOLiveUpdateData
class UCDOLiveUpdateData : public UObject
{
public:
	TArray<struct FNetChangeDefaultPropertyValue> CDOLiveUpdates;                                    // 0x28(0x10)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FCDODebugData                         CDODebugData;                                      // 0x38(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UCDOLiveUpdateData* GetDefaultObj();

};

// 0x30 (0x360 - 0x330)
// Class ShooterGame.CharacterViewPanelWidget
class UCharacterViewPanelWidget : public UPrimalUserWidget
{
public:
	class FString                                PreviewWidgetName;                                 // 0x330(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_205E[0x20];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCharacterViewPanelWidget* GetDefaultObj();

	void RefreshPreviewWidget();
};

// 0x38 (0x910 - 0x8D8)
// Class ShooterGame.CheatFunctionInfoEntryButton
class UCheatFunctionInfoEntryButton : public UDataListEntryButton
{
public:
	uint8                                        bIsCustom : 1;                                     // Mask: 0x1, PropSize: 0x10x8D8(0x1)(Edit, ConstParm, BlueprintVisible, Parm, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_129 : 7;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_2061[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                FunctionName;                                      // 0x8E0(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         bCenterDisplayName;                                // 0x8F0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_2062[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          DisplayStringSelectedColor;                        // 0x8F4(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        FolderNameTextClipOffset;                          // 0x904(0x4)(BlueprintVisible, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2063[0x8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCheatFunctionInfoEntryButton* GetDefaultObj();

};

// 0x548 (0xA10 - 0x4C8)
// Class ShooterGame.PointOfInterestActor
class APointOfInterestActor : public AActor
{
public:
	uint8                                        Pad_2069[0x10];                                    // Fixing Size After Last Property  > TateDumper <
	class USceneComponent*                       PointRootComp;                                     // 0x4D8(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USphereComponent*                      PointUseSphereComp;                                // 0x4E0(0x8)(BlueprintVisible, ExportObject, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UTextRenderComponent*                  PointTextComp;                                     // 0x4E8(0x8)(BlueprintVisible, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UTextRenderComponent*                  PointTitleTextComp;                                // 0x4F0(0x8)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_206F[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FPointOfInterestData                  MyPointOfInterestData;                             // 0x500(0x1E0)(ConstParm, BlueprintVisible, ExportObject, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FPointOfInterestCompanionBehavior     MyPointOfInterestCompanionBehavior;                // 0x6E0(0x300)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FVector                               UseSphereLocOffset;                                // 0x9E0(0x18)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        UseSphereRadius;                                   // 0x9F8(0x4)(Edit, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        TitleTextZOffset;                                  // 0x9FC(0x4)(Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bHasBeenViewed : 1;                                // Mask: 0x1, PropSize: 0x10xA00(0x1)(ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bSyncWithPointManager : 1;                         // Mask: 0x2, PropSize: 0x10xA00(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bPreventViewMultiUseEntry : 1;                     // Mask: 0x4, PropSize: 0x10xA00(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bDebugPointActor_Persistent : 1;                   // Mask: 0x8, PropSize: 0x10xA00(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bDebugPointActor_Single : 1;                       // Mask: 0x10, PropSize: 0x10xA00(0x1)(ConstParm, ExportObject, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bDebugPointActor_ClearDebugLines : 1;              // Mask: 0x20, PropSize: 0x10xA00(0x1)(Edit, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_12A : 2;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_2070[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class APointOfInterestManagerList*           MyPointManager;                                    // 0xA08(0x8)(Edit, BlueprintReadOnly, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class APointOfInterestActor* GetDefaultObj();

	void RefreshPointData();
	void IsPointOfInterestValid(bool ReturnValue);
	void GetMyPointOfInterestData(const struct FPointOfInterestData& ReturnValue);
	void GetMyPointOfInterestCompanionBehavior(const struct FPointOfInterestCompanionBehavior& ReturnValue);
};

// 0x60 (0xA70 - 0xA10)
// Class ShooterGame.CompanionEventTrigger
class ACompanionEventTrigger : public APointOfInterestActor
{
public:
	class UBoxComponent*                         BoxTriggerComp;                                    // 0xA10(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UTextRenderComponent*                  EventTitleTextComp;                                // 0xA18(0x8)(Edit, BlueprintVisible, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FCompanionEventData                   MyEventData;                                       // 0xA20(0x50)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class ACompanionEventTrigger* GetDefaultObj();

	void OnEndOverlap(class AActor* OverlappedActor, class AActor** Actor);
	void OnBeginOverlap(class AActor* OverlappedActor, class AActor** Actor);
};

// 0x18 (0x770 - 0x758)
// Class ShooterGame.ConsoleCommandButtonWidget
class UConsoleCommandButtonWidget : public UBaseSelectableButtonWidget
{
public:
	uint8                                        Pad_207B[0x18];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UConsoleCommandButtonWidget* GetDefaultObj();

};

// 0x58 (0x388 - 0x330)
// Class ShooterGame.ContextMenu
class UContextMenu : public UPrimalUserWidget
{
public:
	FDelegateProperty_                           OnPopulateMenu;                                    // 0x330(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	FDelegateProperty_                           OnPopulateMenuCustom;                              // 0x340(0x10)(BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnActiveItemChanged;                               // 0x350(0x10)(Edit, BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FName                                  CustomName;                                        // 0x360(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2097[0x20];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UContextMenu* GetDefaultObj();

	class UContextMenuItem* SetActiveItem();
	class FName PopulateContextMenuCustom__DelegateSignature();
	class UContextMenu* PopulateContextMenu__DelegateSignature();
	void GetActiveItem(class UContextMenuItem* ReturnValue);
	bool CloseMenu();
	class UContextMenuItem* ActiveMenuItemChanged__DelegateSignature();
};

// 0xF8 (0x428 - 0x330)
// Class ShooterGame.ContextMenuItem
class UContextMenuItem : public UPrimalUserWidget
{
public:
	FDelegateProperty_                           OnGetMenuContentEvent;                             // 0x330(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	FDelegateProperty_                           OnGetMenuContentEventCustom;                       // 0x340(0x10)(BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnExecuteMainAction;                               // 0x350(0x10)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnExecuteMainActionCustom;                         // 0x360(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FName                                  SubmenuMenuAnchorName;                             // 0x370(0x8)(Edit, ConstParm, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FName                                  SubmenuIndicatorName;                              // 0x378(0x8)(Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FName                                  ShortcutKeyWidgetName;                             // 0x380(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FName                                  SwitchName;                                        // 0x388(0x8)(ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FName                                  SwitchContainerName;                               // 0x390(0x8)(Edit, ConstParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	enum class EUContextMenuItemSwitchMode       SwitchType;                                        // 0x398(0x1)(ConstParm, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	bool                                         IsSwitchedOn;                                      // 0x399(0x1)(Edit, ConstParm, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_20B6[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  CustomName;                                        // 0x39C(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_20B7[0x84];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UContextMenuItem* GetDefaultObj();

	bool SetSubmenuEnabled();
	struct FKey SetShortcutKey();
	void SetJustification(enum class ETextJustify* Value);
	class FText SetCaption();
	void OnGetContextMenuContent(class UWidget* ReturnValue);
	class UContextMenuItem* OnButtonClickedEventObjectCustom__DelegateSignature(class FName* SelectedOption);
	class UContextMenuItem* OnButtonClickedEventObject__DelegateSignature();
	void OnButtonClicked();
	class UContextMenuItem* OnActiveMenuItemChanged();
	void GetSubmenuEnabled(bool ReturnValue);
	class UContextMenuItem* GetSubmenuContentCustom__DelegateSignature(class FName* SelectedOption, class UContextMenu* ReturnValue);
	class UContextMenuItem* GetSubmenuContent__DelegateSignature(class UContextMenu* ReturnValue);
	void GetJustification(enum class ETextJustify ReturnValue);
	void GetCaption(class FText ReturnValue);
};

// 0x20 (0x448 - 0x428)
// Class ShooterGame.ContextMenuItem_CosmeticEntry
class UContextMenuItem_CosmeticEntry : public UContextMenuItem
{
public:
	uint8                                        Pad_20EF[0x20];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UContextMenuItem_CosmeticEntry* GetDefaultObj();

	class UTexture2D* SetImage();
	struct FItemNetID SetData(int32* VariantID);
};

// 0x18 (0x440 - 0x428)
// Class ShooterGame.ContextMenuItem_Sort
class UContextMenuItem_Sort : public UContextMenuItem
{
public:
	class FName                                  SorDirSwitcherName;                                // 0x428(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_20F2[0x10];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UContextMenuItem_Sort* GetDefaultObj();

};

// 0x38 (0x460 - 0x428)
// Class ShooterGame.ContextMenuItem_Spinner
class UContextMenuItem_Spinner : public UContextMenuItem
{
public:
	FMulticastInlineDelegateProperty_            OnValueCommitted;                                  // 0x428(0x10)(BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_210B[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        MinValue;                                          // 0x43C(0x4)(Edit, ConstParm, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	int32                                        MaxValue;                                          // 0x440(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_210D[0x1C];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UContextMenuItem_Spinner* GetDefaultObj();

	void SetValue(int32* NewValue);
	void SetMinValue(int32* NewValue);
	void SetMaxValue(int32* NewValue);
	enum class ETextCommit OnSpinnerValueCommitedEvent__DelegateSignature();
	enum class ETextCommit HandleOnTextCommited(class FText* Text);
	void HandleOnTextChanged(class FText* Text);
	void HandleOnButtonIncreaseClicked();
	void HandleOnButtonDecreaseClicked();
	void GetValue(int32 ReturnValue);
	void GetMinValue(int32 ReturnValue);
	void GetMaxValue(int32 ReturnValue);
};

// 0x20 (0x3A8 - 0x388)
// Class ShooterGame.ContextMenu_DinoGroupEntry
class UContextMenu_DinoGroupEntry : public UContextMenu
{
public:
	class UClass*                                ItemClass_SimpleButton;                            // 0x388(0x8)(Edit, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                ItemClass_SimpleCaption;                           // 0x390(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                ItemClass_Spinner;                                 // 0x398(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                SubmenuClass;                                      // 0x3A0(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UContextMenu_DinoGroupEntry* GetDefaultObj();

	class UContextMenu* PopulateRootMenu();
	class UContextMenuItem* HandleActionSetGroup();
	class UContextMenuItem* HandleActionRemoveDino();
	class UContextMenuItem* HandleActionRemoveClass();
};

// 0x8 (0x390 - 0x388)
// Class ShooterGame.ContextMenu_InventorySort
class UContextMenu_InventorySort : public UContextMenu
{
public:
	class UClass*                                ItemClass_SortButton;                              // 0x388(0x8)(Edit, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UContextMenu_InventorySort* GetDefaultObj();

	class UContextMenu* PopulateRootMenu();
	class UContextMenuItem* HandleActionWeight();
	class UContextMenuItem* HandleActionUnsort();
	class UContextMenuItem* HandleActionType();
	class UContextMenuItem* HandleActionSpoilTimer();
	class UContextMenuItem* HandleActionAlphabetical();
};

// 0x58 (0x3E0 - 0x388)
// Class ShooterGame.ContextMenu_PrimalItem
class UContextMenu_PrimalItem : public UContextMenu
{
public:
	class UClass*                                ItemClass_SimpleButton;                            // 0x388(0x8)(Edit, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                ItemClass_SimpleCaption;                           // 0x390(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                ItemClass_Spinner;                                 // 0x398(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                ItemClass_CosmeticEntry;                           // 0x3A0(0x8)(Edit, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                SubmenuClass;                                      // 0x3A8(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_21F9[0x10];                                    // Fixing Size After Last Property  > TateDumper <
	int32                                        SplitAmountValue;                                  // 0x3C0(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        SplitAmountMax;                                    // 0x3C4(0x4)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        CraftAmountValue;                                  // 0x3C8(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        CraftAmountMax;                                    // 0x3CC(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        CraftQuantityValue;                                // 0x3D0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        CraftQuantityMax;                                  // 0x3D4(0x4)(BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bIsFreeCraftingMode : 1;                           // Mask: 0x1, PropSize: 0x10x3D8(0x1)(Edit, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_21FB[0x7];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UContextMenu_PrimalItem* GetDefaultObj();

	class UContextMenu* PopulateSubmenuSplitStack();
	class UContextMenu* PopulateSubmenuSplitAmount();
	class UContextMenu* PopulateSubmenuRemove();
	class UContextMenu* PopulateSubmenuCustomCosmetics();
	class FName PopulateSubmenuCustom();
	class UContextMenu* PopulateSubmenuCraftAmount();
	class UContextMenu* PopulateRootMenu();
	class UContextMenu* PopulateFolderMenu();
	class UContextMenu* PopulateCraftMenu();
	enum class ETextCommit HandleSplitAmountValueCommit();
	void HandleOnGetSubmenuSplitStackContent(class UContextMenuItem** MenuItem, class UContextMenu* ReturnValue);
	void HandleOnGetSubmenuSplitAmountContent(class UContextMenuItem** MenuItem, class UContextMenu* ReturnValue);
	void HandleOnGetSubmenuRemoveContent(class UContextMenuItem** MenuItem, class UContextMenu* ReturnValue);
	void HandleOnGetSubmenuCustomCosmetics(class UContextMenuItem** MenuItem, class UContextMenu* ReturnValue);
	class FName HandleOnGetSubmenuCustomContent(class UContextMenuItem** MenuItem, class UContextMenu* ReturnValue);
	void HandleOnGetSubmenuCraftContent(class UContextMenuItem** MenuItem, class UContextMenu* ReturnValue);
	void HandleOnGetSubmenuCraftAmountContent(class UContextMenuItem** MenuItem, class UContextMenu* ReturnValue);
	enum class ETextCommit HandleCraftAmountValueCommit();
	class UContextMenuItem* HandleActionUse();
	class UContextMenuItem* HandleActionUnequip();
	class UContextMenuItem* HandleActionTransfer();
	class UContextMenuItem* HandleActionTrack();
	class UContextMenuItem* HandleActionSplitOne();
	class UContextMenuItem* HandleActionSplitHalf();
	class UContextMenuItem* HandleActionSplitAmount();
	class UContextMenuItem* HandleActionSplitAll();
	class UContextMenuItem* HandleActionSetCraftQuantity();
	class UContextMenuItem* HandleActionRepair();
	class UContextMenuItem* HandleActionRenameFolder();
	class UContextMenuItem* HandleActionRemoveSkin();
	class UContextMenuItem* HandleActionRemoveCosmetic();
	class UContextMenuItem* HandleActionRemoveAmmo();
	class UContextMenuItem* HandleActionRemoveAccessory();
	class UContextMenuItem* HandleActionFavorite();
	class UContextMenuItem* HandleActionFastInventoryInFolder();
	class UContextMenuItem* HandleActionEquipAllInFolder();
	class UContextMenuItem* HandleActionEquip();
	class UContextMenuItem* HandleActionDiscard();
	class UContextMenuItem* HandleActionDeleteFolder();
	class FName HandleActionCustom();
	class UContextMenuItem* HandleActionCraftOne();
	class UContextMenuItem* HandleActionCraftAmount();
	class UContextMenuItem* HandleActionCraftAll();
	class UContextMenuItem* HandleActionApplyCosmetic();
	void BPUpdateCanUse();
};

// 0x8 (0x4F0 - 0x4E8)
// Class ShooterGame.CorruptedAvatarAttackCoordinator
class ACorruptedAvatarAttackCoordinator : public AAIAttackCoordinator
{
public:
	uint8                                        Pad_2207[0x8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class ACorruptedAvatarAttackCoordinator* GetDefaultObj();

};

// 0xB0 (0xE8 - 0x38)
// Class ShooterGame.CursorSettings
class UCursorSettings : public UDeveloperSettings
{
public:
	struct FRuntimeFloatCurve                    AnalogCursorAccelerationCurve;                     // 0x38(0x88)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	float                                        MaxAnalogCursorSpeed;                              // 0xC0(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	float                                        MaxAnalogCursorSpeedWhenHovered;                   // 0xC4(0x4)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	float                                        AnalogCursorDragCoefficient;                       // 0xC8(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	float                                        AnalogCursorDragCoefficientWhenHovered;            // 0xCC(0x4)(Edit, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	float                                        MinAnalogCursorSpeed;                              // 0xD0(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	float                                        AnalogCursorDeadZone;                              // 0xD4(0x4)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	float                                        AnalogCursorAccelerationMultiplier;                // 0xD8(0x4)(Edit, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	float                                        AnalogCursorSize;                                  // 0xDC(0x4)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	bool                                         bUseEngineAnalogCursor;                            // 0xE0(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	bool                                         bAnalogCursorNoAcceleration;                       // 0xE1(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, InstancedReference, SubobjectReference)
	uint8                                        Pad_220B[0x6];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCursorSettings* GetDefaultObj();

};

// 0x18 (0x4E0 - 0x4C8)
// Class ShooterGame.CustomActorList
class ACustomActorList : public AInfo
{
public:
	TArray<class AActor*>                        ActorList;                                         // 0x4C8(0x10)(ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_220F[0x8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class ACustomActorList* GetDefaultObj();

	void DestroyActors();
};

// 0x60 (0x740 - 0x6E0)
// Class ShooterGame.CustomButtonWidget
class UCustomButtonWidget : public UButton
{
public:
	struct FCustomButtonWidgetStyle              ExtendedWidgetStyle;                               // 0x6E0(0x48)(ExportObject, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         IsToggleButton;                                    // 0x728(0x1)(ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         IsToggledOn;                                       // 0x729(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2218[0x16];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCustomButtonWidget* GetDefaultObj();

	void SetToggledState(bool* IsToggled);
	void SetIsToggleButton(bool* IsToggle);
	void GetToggledState(bool ReturnValue);
	void GetIsToggleButton(bool ReturnValue);
	void BPSetToggledState(bool* IsToggled);
};

// 0x39E0 (0x3FB0 - 0x5D0)
// Class ShooterGame.ShooterGameMode
class AShooterGameMode : public APrimalGameMode
{
public:
	uint8                                        Pad_23A1[0x108];                                   // Fixing Size After Last Property  > TateDumper <
	class FString                                BanFileName;                                       // 0x6D8(0x10)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23A2[0x188];                                   // Fixing Size After Last Property  > TateDumper <
	class UShooterCheatManager*                  ServerCheatManager;                                // 0x870(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ForceLoadWorldSeconds;                             // 0x878(0x4)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23A4[0x14];                                    // Fixing Size After Last Property  > TateDumper <
	class URCONServer*                           RCONSocket;                                        // 0x890(0x8)(ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                PlayersJoinNoCheckFilename;                        // 0x898(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                PlayersExclusiveCheckFilename;                     // 0x8A8(0x10)(ConstParm, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UShooterCheatManager*                  GlobalCommandsCheatManager;                        // 0x8B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23A6[0x10];                                    // Fixing Size After Last Property  > TateDumper <
	class FString                                CheckGlobalEnablesURL;                             // 0x8D0(0x10)(BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UDatabase_LoginData*                   Database_LoginDataRef;                             // 0x8E0(0x8)(BlueprintVisible, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UDatabase_PubSub_GeneralNotifications* PubSub_GeneralNotificationsRef;                    // 0x8E8(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23A8[0x88];                                    // Fixing Size After Last Property  > TateDumper <
	TMap<int32, uint64>                          PlayersIds;                                        // 0x978(0x50)(ConstParm, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TMap<uint64, int32>                          SteamIds;                                          // 0x9C8(0x50)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23A9[0x50];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bGlobalDisableLoginLockCheck;                      // 0xA68(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bTempDisableLoginLockCheck;                        // 0xA69(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23AA[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                MyServerId;                                        // 0xA70(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23AC[0x70];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<struct FTribeData>                    TribesData;                                        // 0xAF0(0x10)(Edit, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class APrimalDinoCharacter*>          ActivelyTamingDinos;                               // 0xB00(0x10)(ConstParm, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAutoCreateNewPlayerData;                          // 0xB10(0x1)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23AD[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        DifficultyValue;                                   // 0xB18(0x4)(BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        DifficultyValueMin;                                // 0xB1C(0x4)(ConstParm, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        DifficultyValueMax;                                // 0xB20(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ProximityRadius;                                   // 0xB24(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ProximityRadiusUnconsiousScale;                    // 0xB28(0x4)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23AF[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                CheatClass;                                        // 0xB30(0x8)(Edit, Parm, OutParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bIsOfficialServer;                                 // 0xB38(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsCurrentlySavingWorld;                           // 0xB39(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23B8[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bIsConsoleUnOfficialPCServer;                      // 0xB3B(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bServerAllowArkDownload;                           // 0xB3C(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23BA[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bAlwaysNotifyPlayerLeft;                           // 0xB3F(0x1)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAlwaysNotifyPlayerJoined;                         // 0xB40(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bServerHardcore;                                   // 0xB41(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23BC[0x33];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bEnableCryoSicknessPVE;                            // 0xB75(0x1)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23BE[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CryopodNerfDamageMult;                             // 0xB78(0x4)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        CryopodNerfDuration;                               // 0xB7C(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bEnableMeshBitingProtection;                       // 0xB80(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23BF[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CryopodNerfIncomingDamageMultPercent;              // 0xB84(0x4)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23C1[0x48];                                    // Fixing Size After Last Property  > TateDumper <
	float                                        ResourcesRespawnPeriodMultiplier;                  // 0xBD0(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        KickIdlePlayersPeriod;                             // 0xBD4(0x4)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MateBoostEffectMultiplier;                         // 0xBD8(0x4)(EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AutoSavePeriodMinutes;                             // 0xBDC(0x4)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        XPMultiplier;                                      // 0xBE0(0x4)(Edit, ConstParm, ExportObject, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	class FName                                  ActiveEvent;                                       // 0xBE4(0x8)(BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        TribeNameChangeCooldown;                           // 0xBEC(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        PlatformSaddleBuildAreaBoundsMultiplier;           // 0xBF0(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bAlwaysAllowStructurePickup;                       // 0xBF4(0x1)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_23C3[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        StructurePickupTimeAfterPlacement;                 // 0xBF8(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        StructurePickupHoldDuration;                       // 0xBFC(0x4)(ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bAllowHideDamageSourceFromLogs;                    // 0xC00(0x1)(ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_23C9[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        KillXPMultiplier;                                  // 0xC04(0x4)(Edit, ConstParm, ExportObject, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        HarvestXPMultiplier;                               // 0xC08(0x4)(Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        CraftXPMultiplier;                                 // 0xC0C(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        GenericXPMultiplier;                               // 0xC10(0x4)(Edit, ConstParm, ExportObject, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        SpecialXPMultiplier;                               // 0xC14(0x4)(OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AlphaKillXPMultiplier;                             // 0xC18(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        CaveKillXPMultiplier;                              // 0xC1C(0x4)(Edit, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        WildKillXPMultiplier;                              // 0xC20(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BossKillXPMultiplier;                              // 0xC24(0x4)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        TamedKillXPMultiplier;                             // 0xC28(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        UnclaimedKillXPMultiplier;                         // 0xC2C(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ExplorerNoteXPMultiplier;                          // 0xC30(0x4)(BlueprintVisible, ExportObject, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23CF[0x84];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<class UPrimalPlayerData*>             PlayerDatas;                                       // 0xCB8(0x10)(Edit, BlueprintVisible, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23D4[0xE];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bForceRespawnDinos;                                // 0xCD6(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23D5[0x29];                                    // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnCharacterPossessedByPlayer;                      // 0xD00(0x10)(BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnCharacterUnpossessedByPlayer;                    // 0xD10(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnShooterCharacterSpawned;                         // 0xD20(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnShooterCharacterDied;                            // 0xD30(0x10)(ConstParm, Net, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnMissionTriggerBeginOverlap;                      // 0xD40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, Transient, Config, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	FMulticastInlineDelegateProperty_            OnMissionTriggerEndOverlap;                        // 0xD50(0x10)(BlueprintVisible, Net, Parm, OutParm, Transient, Config, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	float                                        TamedDinoDamageMultiplier;                         // 0xD60(0x4)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        DinoDamageMultiplier;                              // 0xD64(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        PlayerDamageMultiplier;                            // 0xD68(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        StructureDamageMultiplier;                         // 0xD6C(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        PlayerResistanceMultiplier;                        // 0xD70(0x4)(ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        DinoResistanceMultiplier;                          // 0xD74(0x4)(ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        TamedDinoResistanceMultiplier;                     // 0xD78(0x4)(BlueprintVisible, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        StructureResistanceMultiplier;                     // 0xD7C(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	bool                                         bJoinInProgressGamesAsSpectator;                   // 0xD80(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23DA[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TamingSpeedMultiplier;                             // 0xD84(0x4)(ConstParm, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        HarvestAmountMultiplier;                           // 0xD88(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        HarvestHealthMultiplier;                           // 0xD8C(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        PlayerCharacterWaterDrainMultiplier;               // 0xD90(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        PlayerCharacterFoodDrainMultiplier;                // 0xD94(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        DinoCharacterFoodDrainMultiplier;                  // 0xD98(0x4)(BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        RaidDinoCharacterFoodDrainMultiplier;              // 0xD9C(0x4)(Net, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PlayerCharacterStaminaDrainMultiplier;             // 0xDA0(0x4)(Edit, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        DinoCharacterStaminaDrainMultiplier;               // 0xDA4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        PlayerCharacterHealthRecoveryMultiplier;           // 0xDA8(0x4)(ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        DinoCharacterHealthRecoveryMultiplier;             // 0xDAC(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        CarnivoreNaturalTargetingRangeMultiplier;          // 0xDB0(0x4)(Edit, ConstParm, ExportObject, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        CarnivorePlayerAggroMultiplier;                    // 0xDB4(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        HerbivoreNaturalTargetingRangeMultiplier;          // 0xDB8(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        HerbivorePlayerAggroMultiplier;                    // 0xDBC(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         AIForceTargetPlayers;                              // 0xDC0(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         AIForceOverlapCheck;                               // 0xDC1(0x1)(EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23E1[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bDisableSaveLoad;                                  // 0xDC8(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableXP;                                        // 0xDC9(0x1)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableDynamicMusic;                              // 0xDCA(0x1)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23E2[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FLevelExperienceRamp>          LevelExperienceRampOverrides;                      // 0xDD0(0x10)(Edit, ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<int32>                                OverridePlayerLevelEngramPoints;                   // 0xDE0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<int32>                                ExcludeItemIndices;                                // 0xDF0(0x10)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FEngramEntryOverride>          OverrideEngramEntries;                             // 0xE00(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<struct FEngramEntryOverride>          OverrideNamedEngramEntries;                        // 0xE10(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FEngramEntryAutoUnlock>        EngramEntryAutoUnlocks;                            // 0xE20(0x10)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class FString>                        PreventDinoTameClassNames;                         // 0xE30(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              DinoClassStaminaMultipliers;                       // 0xE40(0x10)(ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              TamedDinoClassStaminaMultipliers;                  // 0xE50(0x10)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              DinoClassSpeedMultipliers;                         // 0xE60(0x10)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              TamedDinoClassSpeedMultipliers;                    // 0xE70(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<struct FDinoSpawnWeightMultiplier>    DinoSpawnWeightMultipliers;                        // 0xE80(0x10)(Edit, ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              DinoClassResistanceMultipliers;                    // 0xE90(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              TamedDinoClassResistanceMultipliers;               // 0xEA0(0x10)(Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              DinoClassDamageMultipliers;                        // 0xEB0(0x10)(ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              TamedDinoClassDamageMultipliers;                   // 0xEC0(0x10)(Edit, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              HarvestResourceItemAmountClassMultipliers;         // 0xED0(0x10)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FClassNameReplacement>         NPCReplacements;                                   // 0xEE0(0x10)(ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PvPZoneStructureDamageMultiplier;                  // 0xEF0(0x4)(Edit, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bOnlyAllowSpecifiedEngrams;                        // 0xEF4(0x1)(Edit, ConstParm, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23E7[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        OverrideMaxExperiencePointsPlayer;                 // 0xEF8(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        OverrideMaxExperiencePointsDino;                   // 0xEFC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        GlobalSpoilingTimeMultiplier;                      // 0xF00(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        GlobalItemDecompositionTimeMultiplier;             // 0xF04(0x4)(Edit, ConstParm, Net, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        GlobalCorpseDecompositionTimeMultiplier;           // 0xF08(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MaxFallSpeedMultiplier;                            // 0xF0C(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAutoPvETimer;                                     // 0xF10(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAutoPvEUseSystemTime;                             // 0xF11(0x1)(Edit, ConstParm, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23EA[0xA];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        AutoPvEStartTimeSeconds;                           // 0xF1C(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AutoPvEStopTimeSeconds;                            // 0xF20(0x4)(ConstParm, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23EC[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class AHibernationManager*                   HibernationManager;                                // 0xF28(0x8)(Edit, Net, Transient, Config, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	int32                                        TributeItemExpirationSeconds;                      // 0xF30(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        TributeDinoExpirationSeconds;                      // 0xF34(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        TributeCharacterExpirationSeconds;                 // 0xF38(0x4)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23ED[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        MaxTributeItems;                                   // 0xF44(0x4)(Edit, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxTributeDinos;                                   // 0xF48(0x4)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxTributeCharacters;                              // 0xF4C(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIncreasePvPRespawnInterval;                       // 0xF50(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23EE[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        IncreasePvPRespawnIntervalCheckPeriod;             // 0xF54(0x4)(ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        IncreasePvPRespawnIntervalMultiplier;              // 0xF58(0x4)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        IncreasePvPRespawnIntervalBaseAmount;              // 0xF5C(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ResourceNoReplenishRadiusStructures;               // 0xF60(0x4)(Edit, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ResourceNoReplenishRadiusPlayers;                  // 0xF64(0x4)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        CropGrowthSpeedMultiplier;                         // 0xF68(0x4)(ConstParm, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        LayEggIntervalMultiplier;                          // 0xF6C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PoopIntervalMultiplier;                            // 0xF70(0x4)(Edit, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        CropDecaySpeedMultiplier;                          // 0xF74(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowChatFromDeadNonAdmins;                       // 0xF78(0x1)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowDisablingSpectator;                          // 0xF79(0x1)(Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPvEDisableFriendlyFire;                           // 0xF7A(0x1)(BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bFlyerPlatformAllowUnalignedDinoBasing;            // 0xF7B(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowUnclaimDinos;                                // 0xF7C(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_23F0[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        MaxPerTribePlatformSaddleStructureLimit;           // 0xF80(0x4)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxPlatformSaddleStructureLimit;                   // 0xF84(0x4)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxDinoBaseLevel;                                  // 0xF88(0x4)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxNumberOfPlayersInTribe;                         // 0xF8C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        TribeSlotReuseCooldown;                            // 0xF90(0x4)(Edit, ExportObject, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MatingIntervalMultiplier;                          // 0xF94(0x4)(BlueprintVisible, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        EggHatchSpeedMultiplier;                           // 0xF98(0x4)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BabyMatureSpeedMultiplier;                         // 0xF9C(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BabyFoodConsumptionSpeedMultiplier;                // 0xFA0(0x4)(BlueprintVisible, Net, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23F2[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        PerLevelStatsMultiplier_Player[0xC];               // 0xFA8(0x30)(BlueprintVisible, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PerLevelStatsMultiplier_DinoTamed[0xC];            // 0xFD8(0x30)(ConstParm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PerLevelStatsMultiplier_DinoTamed_Add[0xC];        // 0x1008(0x30)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PerLevelStatsMultiplier_DinoTamed_Affinity[0xC];   // 0x1038(0x30)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PerLevelStatsMultiplier_DinoWild[0xC];             // 0x1068(0x30)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MutagenLevelBoost[0xC];                            // 0x1098(0x30)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MutagenLevelBoost_Bred[0xC];                       // 0x10C8(0x30)(Edit, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        ItemStatClamps[0x8];                               // 0x10F8(0x20)(Edit, ExportObject, Net, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxGateFrameOnSaddles;                             // 0x1118(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxHexagonsPerCharacter;                           // 0x111C(0x4)(BlueprintReadOnly, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bCustomGameModeAllowSpectatorJoinAfterMatchStart;  // 0x1120(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23F5[0x110F];                                  // Fixing Size After Last Property  > TateDumper <
	bool                                         bGameplayLogEnabled;                               // 0x2230(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bServerGameLogEnabled;                             // 0x2231(0x1)(Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23F6[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                BonusSupplyCrateItemClass;                         // 0x2238(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BonusSupplyCrateItemGiveInterval;                  // 0x2240(0x4)(Edit, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        StructureDamageRepairCooldown;                     // 0x2244(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        CustomRecipeEffectivenessMultiplier;               // 0x2248(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        CustomRecipeSkillMultiplier;                       // 0x224C(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class FString                                BonusSupplyCrateItemString;                        // 0x2250(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         MaxDifficulty;                                     // 0x2260(0x1)(Edit, ConstParm, ExportObject, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPvEAllowTribeWar;                                 // 0x2261(0x1)(ConstParm, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPvEAllowTribeWarCancel;                           // 0x2262(0x1)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowCustomRecipes;                               // 0x2263(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bPassiveDefensesDamageRiderlessDinos;              // 0x2264(0x1)(ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23F7[0xB];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bEnableDeathTeamSpectator;                         // 0x2270(0x1)(Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bTribeStoreCharacterConfiguration;                 // 0x2271(0x1)(ConstParm, BlueprintVisible, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23F9[0xF6];                                    // Fixing Size After Last Property  > TateDumper <
	int32                                        MaxTribeLogs;                                      // 0x2368(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23FB[0x1C];                                    // Fixing Size After Last Property  > TateDumper <
	int32                                        MaxPlayersOverride;                                // 0x2388(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableFriendlyFire;                              // 0x238C(0x1)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowInactiveTribes;                              // 0x238D(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bForceMapPlayerLocation;                           // 0x238E(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_23FE[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        DinoHarvestingDamageMultiplier;                    // 0x2390(0x4)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PlayerHarvestingDamageMultiplier;                  // 0x2394(0x4)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        DinoTurretDamageMultiplier;                        // 0x2398(0x4)(Edit, ConstParm, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableLootCrates;                                // 0x239C(0x1)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2400[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        ExtinctionEventTimeInterval;                       // 0x23A0(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_2401[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	uint32                                       NextExtinctionEventUTC;                            // 0x23A8(0x4)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2402[0x1C];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bUseCharacterTracker;                              // 0x23C8(0x1)(ConstParm, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bShowFloatingDamageText;                           // 0x23C9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2403[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        SavedGameModeVersion;                              // 0x23CC(0x4)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2404[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bAllowTekSuitPowersInGenesis;                      // 0x23D4(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2405[0x43];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<struct FItemCraftingCostOverride>     OverrideItemCraftingCosts;                         // 0x2418(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FConfigItemCraftingCostOverride> ConfigOverrideItemCraftingCosts;                   // 0x2428(0x10)(ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FConfigMaxItemQuantityOverride> ConfigOverrideItemMaxQuantity;                     // 0x2438(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2406[0x50];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<struct FConfigSupplyCrateItemsOverride> ConfigOverrideSupplyCrateItems;                    // 0x2498(0x10)(ConstParm, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FConfigNPCSpawnEntriesContainer> ConfigOverrideNPCSpawnEntriesContainer;            // 0x24A8(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FConfigNPCSpawnEntriesContainer> ConfigAddNPCSpawnEntriesContainer;                 // 0x24B8(0x10)(BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FConfigNPCSpawnEntriesContainer> ConfigSubtractNPCSpawnEntriesContainer;            // 0x24C8(0x10)(BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BabyImprintingStatScaleMultiplier;                 // 0x24D8(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BabyCuddleIntervalMultiplier;                      // 0x24DC(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BabyImprintAmountMultiplier;                       // 0x24E0(0x4)(EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BabyCuddleGracePeriodMultiplier;                   // 0x24E4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BabyCuddleLoseImprintQualitySpeedMultiplier;       // 0x24E8(0x4)(ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        HairGrowthSpeedMultiplier;                         // 0x24EC(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        DinoHairGrowthSpeedMultiplier;                     // 0x24F0(0x4)(Edit, ConstParm, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bPreventDiseases;                                  // 0x24F4(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bNonPermanentDiseases;                             // 0x24F5(0x1)(Edit, ConstParm, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2408[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	class UAllClustersInventory*                 AllClustersInventory;                              // 0x24F8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Config, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	int32                                        SaveForceRespawnDinosVersion;                      // 0x2500(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_240B[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	uint64                                       ServerID;                                          // 0x2508(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_240C[0x58];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<int32>                                SupportedSpawnRegions;                             // 0x2568(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bServerUseDinoList;                                // 0x2578(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_240D[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MaxAllowedRespawnInterval;                         // 0x257C(0x4)(Edit, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseDinoLevelUpAnimations;                         // 0x2580(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableDinoTaming;                                // 0x2581(0x1)(Edit, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableDinoRiding;                                // 0x2582(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_240F[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        SaveGameCustomVersion;                             // 0x2588(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2410[0x894];                                   // Fixing Size After Last Property  > TateDumper <
	bool                                         bFailedWaterDinoSpawnLogEnabled;                   // 0x2E20(0x1)(ConstParm, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2411[0x88F];                                   // Fixing Size After Last Property  > TateDumper <
