#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------

enum class EPrimalCharacterInputType : uint8
{
	PrimaryFire                    = 0,
	Targeting                      = 1,
	AltFire                        = 2,
	SwitchWeapon                   = 3,
	Reload                         = 4,
	Crouch                         = 5,
	Prone                          = 6,
	CrouchProneToggle              = 7,
	SwitchMap                      = 8,
	DinoAttack                     = 9,
	EPrimalCharacterInputType_MAX  = 10,
};

enum class EUContextMenuItemSwitchMode : uint8
{
	None                           = 0,
	Radio                          = 1,
	Checkbox                       = 2,
	UContextMenuItemSwitchMode_MAX = 3,
};

enum class EAntiDupeTransactionLog : uint8
{
	Item_Upload                    = 0,
	Dino_Upload                    = 1,
	Player_Upload                  = 2,
	MAX_ENTRY                      = 3,
	EAntiDupeTransactionLog_MAX    = 4,
};

enum class EBiomeZone : uint8
{
	None                           = 0,
	Beach                          = 1,
	Canyon                         = 2,
	River                          = 3,
	Grassland                      = 4,
	Swamp                          = 5,
	Jungle                         = 6,
	RedwoodForest                  = 7,
	Mountain                       = 8,
	Snow                           = 9,
	Ocean                          = 10,
	Lava                           = 11,
	Surface                        = 12,
	FertileChamber                 = 13,
	BioluminescentChamber          = 14,
	ElementChamber                 = 15,
	Wasteland                      = 16,
	EBiomeZone_MAX                 = 17,
};

enum class EFolderWidgetType : uint8
{
	FWT_Back                       = 0,
	FWT_Folder                     = 1,
	FWT_CustomFolder               = 2,
	FWT_MAX                        = 3,
};

enum class EBoidType : uint8
{
	Follower                       = 0,
	Leader                         = 1,
	FreeAgent                      = 2,
	EBoidType_MAX                  = 3,
};

enum class EOldShaderPlatform : uint8
{
	OSP_PCD3D_SM5                  = 0,
	OSP_OPENGL_SM4                 = 1,
	OSP_PS4                        = 2,
	OSP_OPENGL_PCES2               = 3,
	OSP_XBOXONE                    = 4,
	OSP_PCD3D_SM4                  = 5,
	OSP_OPENGL_SM5                 = 6,
	OSP_PCD3D_ES2                  = 7,
	OSP_OPENGL_ES2_ANDROID         = 8,
	OSP_OPENGL_ES2_WEBGL           = 9,
	OSP_OPENGL_ES2_IOS             = 10,
	OSP_METAL                      = 11,
	OSP_OPENGL_SM4_MAC             = 12,
	OSP_METAL_MRT                  = 13,
	OSP_OPENGL_ES31_EXT            = 14,
	OSP_PCD3D_ES3_1                = 15,
	OSP_OPENGL_PCES3_1             = 16,
	OSP_METAL_SM5                  = 17,
	OSP_VULKAN_PCES3_1             = 18,
	OSP_METAL_SM4                  = 19,
	OSP_VULKAN_SM4                 = 20,
	OSP_VULKAN_SM5                 = 21,
	OSP_VULKAN_ES3_1_ANDROID       = 22,
	OSP_METAL_MACES3_1             = 23,
	OSP_METAL_MACES2               = 24,
	OSP_OPENGL_ES3_1_ANDROID       = 25,
	OSP_SWITCH                     = 26,
	OSP_SWITCH_FORWARD             = 27,
	OSP_NumPlatforms               = 28,
	OSP_MAX                        = 29,
};

enum class EMissionDispatcherTriggerMode : uint8
{
	AutoStartMission               = 0,
	Ignore                         = 1,
	ActivateViaMultiUse            = 2,
	EMissionDispatcherTriggerMode_MAX = 3,
};

enum class ENativeMissionMetaTag : uint8
{
	INVALID                        = 0,
	GENESIS_VR_BOSS_UNLOCK         = 1,
	ARCTIC_MISSION                 = 2,
	BOG_MISSION                    = 3,
	LUNAR_MISSION                  = 4,
	OCEAN_MISSION                  = 5,
	VOLCANIC_MISSION               = 6,
	NORMAL_DIFFICULTY              = 7,
	ALPHA_DIFFICULTY               = 8,
	BETA_DIFFICULTY                = 9,
	GAMMA_DIFFICULTY               = 10,
	MAX                            = 11,
};

enum class EMissionDispatchMode : uint8
{
	StartAnywhere                  = 0,
	RequireNearbyMissionDispatcher = 1,
	RequireInsideMissionDispatcher = 2,
	UseBPStaticCanStartMission     = 3,
	RequireInsideDispatcherNoCheck = 4,
	EMissionDispatchMode_MAX       = 5,
};

enum class ECompanionState : uint8
{
	IDLE                           = 0,
	FOCUSED                        = 1,
	EVENT                          = 2,
	MONOLOGUE                      = 3,
	ASLEEP                         = 4,
	CUSTOM                         = 5,
	ECompanionState_MAX            = 6,
};

enum class EGrappleState : uint8
{
	GRAPPLE_Idle                   = 0,
	GRAPPLE_Pulling                = 1,
	GRAPPLE_Releasing              = 2,
	GRAPPLE_Custom                 = 3,
	GRAPPLE_Max                    = 4,
};

enum class EClimbingMode : uint8
{
	None                           = 0,
	Attached                       = 1,
	Finalizing                     = 2,
	MAX                            = 3,
};

enum class EClimbingType : uint8
{
	None                           = 0,
	ClimbLook                      = 1,
	ClimbInput                     = 2,
	Slide                          = 3,
	MAX                            = 4,
};

enum class EClimbingAnimationType : uint8
{
	Up                             = 0,
	Down                           = 1,
	Right                          = 2,
	Left                           = 3,
	MeleeUp                        = 4,
	MeleeRight                     = 5,
	MeleeLeft                      = 6,
	FinishUp                       = 7,
	FinishDown                     = 8,
	HangingFwd                     = 9,
	HangingMelee                   = 10,
	HangingFinishUp                = 11,
	HangingFinishDown              = 12,
	JumpUp                         = 13,
	JumpUpRight                    = 14,
	JumpUpLeft                     = 15,
	SlideDown                      = 16,
	AttachUp                       = 17,
	AttachDown                     = 18,
	AttachHangingUp                = 19,
	AttachHangingDown              = 20,
	FlipLeft                       = 21,
	FlipRight                      = 22,
	FlipUp                         = 23,
	FlipDown                       = 24,
	TurnUp                         = 25,
	TurnDown                       = 26,
	TurnRight                      = 27,
	TurnLeft                       = 28,
	OpenInventory                  = 29,
	OpenInventoryHanging           = 30,
	QuakeFall                      = 31,
	MAX                            = 32,
};

enum class EBabyCuddleType : uint8
{
	PET                            = 0,
	FOOD                           = 1,
	WALK                           = 2,
	MAX                            = 3,
};

enum class EInteractionType : uint8
{
	InteractionType_Foliage        = 0,
	InteractionType_Fluid          = 1,
	InteractionType_Both           = 2,
	InteractionType_MAX            = 3,
};

enum class EEngramCategory : uint8
{
	TOOLS                          = 0,
	CLOTHING                       = 1,
	WEAPONS                        = 2,
	SADDLES                        = 3,
	STRUCTURES                     = 4,
	CRAFTING                       = 5,
	MISC                           = 6,
	MODSPECIFIC                    = 7,
	MAX                            = 8,
};

enum class EEngramGroup : uint8
{
	ARK_PRIME                      = 2,
	ARK_SCORCHEDEARTH              = 4,
	ARK_TEK                        = 8,
	ARK_UNLEARNED                  = 16,
	ARK_ABERRATION                 = 32,
	ARK_EXTINCTION                 = 64,
	ARK_GENESIS                    = 128,
	ARK_GEN2                       = 129,
	MAX                            = 130,
};

enum class EBoneModifierType : uint8
{
	HEAD                           = 0,
	NECK                           = 1,
	NECKLENGTH                     = 2,
	CHEST                          = 3,
	SHOULDERS                      = 4,
	ARMLENGTH                      = 5,
	UPPERARM                       = 6,
	LOWERARM                       = 7,
	HAND                           = 8,
	LEGLENGTH                      = 9,
	UPPERLEG                       = 10,
	LOWERLEG                       = 11,
	FOOT                           = 12,
	HIP                            = 13,
	TORSO                          = 14,
	UPPERFACESIZE                  = 15,
	LOWERFACESIZE                  = 16,
	TORSODEPTH                     = 17,
	HEADHEIGHT                     = 18,
	HEADWIDTH                      = 19,
	HEADDEPTH                      = 20,
	TORSOHEIGHT                    = 21,
	TORSOSIZE                      = 22,
	OVERALLHEIGHT                  = 23,
	EYESIZE                        = 24,
	EYEWIDTH                       = 25,
	MAX                            = 26,
};

enum class ETooltipMode : uint8
{
	DEFAULT                        = 0,
	ONLY_ACTION                    = 1,
	OFF                            = 2,
	ETooltipMode_MAX               = 3,
};

enum class ENotificationMode : uint8
{
	DEFAULT                        = 0,
	MINIMAL                        = 1,
	COMBAT                         = 2,
	OFF                            = 3,
	ENotificationMode_MAX          = 4,
};

enum class EPlayerConfigDynamicMaterialVectorTypes : uint8
{
	BODYFAT_FATDEPOSITS            = 0,
	BODYMUSCLE_CHEST               = 1,
	BODYMUSCLE_BACK                = 2,
	BODYMUSCLE_ARMS_1              = 3,
	BODYMUSCLE_ARMS_2              = 4,
	BODYMUSCLE_LEGS_1              = 5,
	BODYMUSCLE_LEGS_2              = 6,
	MAX                            = 7,
};

enum class EPlayerConfigPlayerDynamicMaterialSliderTypes : uint8
{
	BODYFAT_CHEST                  = 0,
	BODYFAT_BELLY                  = 1,
	BODYFAT_BUTT                   = 2,
	BODYMUSCLE_CHEST_PECTORALS     = 3,
	BODYMUSCLE_CHEST_ABS           = 4,
	BODYMUSCLE_CHEST_OBLIQUES      = 5,
	BODYMUSCLE_BACK_NECK           = 6,
	BODYMUSCLE_BACK_TRAPEZIES      = 7,
	BODYMUSCLE_BACK_BACK           = 8,
	BODYMUSCLE_ARMS_1_DELTOID      = 9,
	BODYMUSCLE_ARMS_1_TRICEP       = 10,
	BODYMUSCLE_ARMS_1_BICEP        = 11,
	BODYMUSCLE_ARMS_2_FOREARM      = 12,
	BODYMUSCLE_LEGS_1_LATS         = 13,
	BODYMUSCLE_LEGS_1_GLUTES       = 14,
	BODYMUSCLE_LEGS_1_HAMSTRINGS   = 15,
	BODYMUSCLE_LEGS_2_ADDUCTORS    = 16,
	BODYMUSCLE_LEGS_2_QUADS        = 17,
	BODYMUSCLE_LEGS_2_CALVES       = 18,
	BODYMUSCLE_OVERALL             = 19,
	BODYFATOVERALL                 = 20,
	MAX                            = 21,
};

enum class EPlayerDynamicMaterialType : uint8
{
	Float                          = 0,
	Vector                         = 1,
	Color                          = 2,
	EPlayerDynamicMaterialType_MAX = 3,
};

enum class ETeamPingType : uint8
{
	SmartPing                      = 0,
	GoHere                         = 1,
	Tame                           = 2,
	Follow                         = 3,
	FollowMe                       = 4,
	Attack                         = 5,
	Danger                         = 6,
	LootIt                         = 7,
	Track                          = 8,
	Rallypoint                     = 9,
	ETeamPingType_MAX              = 10,
};

enum class ETribeDataExclude : uint8
{
	TribeNone                      = 0,
	TribeLog                       = 1,
	TrackingPoints                 = 2,
	TribeLogAndTrackingPoints      = 3,
	ETribeDataExclude_MAX          = 4,
};

enum class ETribeGroupPermission : uint8
{
	STRUCTUREACTIVATE              = 0,
	INVENTORYACCESS                = 1,
	PET_ORDER                      = 2,
	PET_RIDE                       = 3,
	GENERAL_STRUCTUREDEMOLISH      = 4,
	GENERAL_STRUCTUREATTACHMENT    = 5,
	GENERAL_BUILDSTRUCTUREINRANGE  = 6,
	INVITEMEMBER                   = 7,
	PROMOTEMEMBER                  = 8,
	DEMOTEMEMBER                   = 9,
	BANISHMEMBER                   = 10,
	PET_UNCLAIM                    = 11,
	TELEPORT_MEMBERS               = 12,
	TELEPORT_DINOS                 = 13,
	PING                           = 14,
	RALLYPOINT                     = 15,
	WIRELESSCRAFTING               = 16,
	ETribeGroupPermission_MAX      = 17,
};

enum class EXPType : uint8
{
	XP_GENERIC                     = 0,
	XP_KILL                        = 1,
	XP_HARVEST                     = 2,
	XP_CRAFT                       = 3,
	XP_SPECIAL                     = 4,
	XP_ALPHAKILL                   = 5,
	XP_CAVEKILL                    = 6,
	XP_WILDKILL                    = 7,
	XP_BOSSKILL                    = 8,
	XP_TAMEDKILL                   = 9,
	XP_UNCLAIMEDKILL               = 10,
	XP_EXPLORERNOTE                = 11,
	MAX                            = 12,
};

enum class EDinoTamedOrder : uint8
{
	SetAggressionPassive           = 0,
	SetAggressionNeutral           = 1,
	SetAggressionAggressive        = 2,
	SetAggressionAttackTarget      = 3,
	ToggleFollowMe                 = 4,
	FollowMe                       = 5,
	StopFollowing                  = 6,
	CycleFollowDistance            = 7,
	SetAggressionPassiveFlee       = 8,
	LandingToMe                    = 9,
	MAX                            = 10,
};

enum class EPrimalItemStat : uint8
{
	GenericQuality                 = 0,
	Armor                          = 1,
	MaxDurability                  = 2,
	WeaponDamagePercent            = 3,
	WeaponClipAmmo                 = 4,
	HypothermalInsulation          = 5,
	Weight                         = 6,
	HyperthermalInsulation         = 7,
	MAX                            = 8,
};

enum class EPrimalCustomCosmeticType : uint8
{
	AllItems                       = 0,
	CreatureCustoms                = 1,
	PlayerCustoms                  = 2,
	Structures                     = 3,
	Weapons                        = 4,
	Armor                          = 5,
	Hat                            = 6,
	Shirt                          = 7,
	Gloves                         = 8,
	Pants                          = 9,
	Boots                          = 10,
	OffHand                        = 11,
	Saddles                        = 12,
	MAX                            = 13,
};

enum class EPrimalItemType : uint8
{
	MiscConsumable                 = 0,
	Equipment                      = 1,
	Weapon                         = 2,
	Ammo                           = 3,
	Structure                      = 4,
	Resource                       = 5,
	Skin                           = 6,
	WeaponAttachment               = 7,
	Artifact                       = 8,
	MAX                            = 9,
};

enum class ELevelExperienceRampType : uint8
{
	Player                         = 0,
	DinoEasy                       = 1,
	DinoMedium                     = 2,
	DinoHard                       = 3,
	MAX                            = 4,
};

enum class EPrimalConsumableType : uint8
{
	Food                           = 0,
	Water                          = 1,
	Medicine                       = 2,
	Other                          = 3,
	MAX                            = 4,
};

enum class EPrimalCharacterStatusState : uint8
{
	Dead                           = 0,
	Winded                         = 1,
	Starvation                     = 2,
	Dehydration                    = 3,
	Suffocation                    = 4,
	Encumbered                     = 5,
	Hypothermia                    = 6,
	Hyperthermia                   = 7,
	Injured                        = 8,
	KnockedOut                     = 9,
	Sleeping                       = 10,
	Cold                           = 11,
	Hot                            = 12,
	Crafting                       = 13,
	MAX                            = 14,
};

enum class EPrimalItemMessage : uint8
{
	Broken                         = 0,
	Repaired                       = 1,
	MAX                            = 2,
};

enum class ETraceType : uint8
{
	TT_LineTrace                   = 0,
	TT_ArcTrace                    = 1,
	TT_Max                         = 2,
};

enum class EPrimalStructureElevatorState : uint8
{
	PSLS_Down                      = 0,
	PSLS_Up                        = 1,
	PSLS_MAX                       = 2,
};

enum class ESeedCropPhase : uint8
{
	Seedling                       = 0,
	Midling                        = 1,
	Growthling                     = 2,
	Fruiting                       = 3,
	MAX                            = 4,
};

enum class ECrateMovementMode : uint8
{
	None                           = 0,
	Regular                        = 1,
	Throttled                      = 2,
	ECrateMovementMode_MAX         = 3,
};

enum class EPrimalStructurePlacerState : uint8
{
	Default                        = 0,
	FadeAway                       = 1,
	PlacingStructure               = 2,
	EPrimalStructurePlacerState_MAX = 3,
};

enum class EHighlightStartingPoint : uint8
{
	TopLeft                        = 0,
	Center                         = 1,
	HighlightStartingPoint_MAX     = 2,
};

enum class EControlDirection : uint8
{
	NoDirection                    = 0,
	Up                             = 1,
	Down                           = 2,
	Left                           = 3,
	Right                          = 4,
	ControlDirection_MAX           = 5,
};

enum class EWindSourceMode : uint8
{
	AtmosphericWind                = 0,
	FoliageInteraction             = 1,
	EWindSourceMode_MAX            = 2,
};

enum class EEffectScope : uint8
{
	FirstPersonOnly                = 0,
	ThirdPersonOnly                = 1,
	AllCameraModes                 = 2,
	EEffectScope_MAX               = 3,
};

enum class EWirelessTransmissionType : uint8
{
	Custom                         = 0,
	Power                          = 1,
	Water                          = 2,
	Fuel                           = 3,
	Ammo                           = 4,
	Crafting                       = 5,
	ItemTransfer                   = 6,
	EWirelessTransmissionType_MAX  = 7,
};

enum class EWorldBuffPropertyLocation : uint8
{
	GameMode                       = 0,
	GameState                      = 1,
	EWorldBuffPropertyLocation_MAX = 2,
};

enum class EWorldBuffDifficultyType : uint8
{
	GAMMA                          = 0,
	BETA                           = 1,
	ALPHA                          = 2,
	OTHER                          = 3,
	EWorldBuffDifficultyType_MAX   = 4,
};

enum class ECheatActorType : uint8
{
	Pawns                          = 0,
	Dino                           = 1,
	Player                         = 2,
	Tame                           = 3,
	Wild                           = 4,
	Structure                      = 5,
	MAX                            = 6,
};

enum class EHapticEffectType : uint8
{
	HET_MenuTick                   = 0,
	HET_MenuSelection              = 1,
	HET_RadialTick                 = 2,
	HET_RadialSelection            = 3,
	HET_MenuAnalogSweep            = 4,
	HET_StatLevelUp                = 5,
	HET_StructureFail              = 6,
	HET_StructureSuccess           = 7,
	HET_StructureDestroy           = 8,
	HET_StructureFlip              = 9,
	HET_ResourceGather             = 10,
	HET_EnterWater                 = 11,
	HET_StartFlying                = 12,
	HET_Explosion                  = 13,
	HET_BossTeleport               = 14,
	HET_BigDinoWalking             = 15,
	HET_MAX                        = 16,
};

enum class ETriggerEffectType : uint8
{
	None                           = 0,
	Feedback                       = 1,
	Weapon                         = 2,
	Slope                          = 3,
	Vibration                      = 4,
	VibrationSlope                 = 5,
	ETriggerEffectType_MAX         = 6,
};

enum class EPrimalStatsValueTypes : uint8
{
	TotalShots                     = 0,
	Misses                         = 1,
	HitsStructure                  = 2,
	HitsDinoBody                   = 3,
	HitsDinoCritical               = 4,
	HitsPlayerBody                 = 5,
	HitsPlayerCritical             = 6,
	MAX                            = 7,
};

enum class EPrimalGDKStat : uint8
{
	CreatureTamed                  = 0,
	KilledSurvivor                 = 1,
	PlayerDied                     = 2,
	PunchedTrees                   = 3,
	EPrimalGDKStat_MAX             = 4,
};

enum class EAimAssistType : uint8
{
	Off                            = 0,
	TargetingOn                    = 1,
	RangeWeaponAlwaysOn            = 2,
	EAimAssistType_MAX             = 3,
};

enum class EMissionState : uint8
{
	ServerSetup                    = 0,
	Activated                      = 1,
	Suspended                      = 2,
	Deactivated                    = 3,
	EMissionState_MAX              = 4,
};

enum class EGamePhase : uint8
{
	None                           = 0,
	Lobby_SOTF                     = 1,
	Match_SOTF                     = 2,
	EGamePhase_MAX                 = 3,
};

enum class EMissionTimerMode : uint8
{
	HideTimer                      = 0,
	ShowTimeRemaining              = 1,
	ShowTimeElapsed                = 2,
	UseBPGetMissionTimerText       = 3,
	EMissionTimerMode_MAX          = 4,
};

enum class ESpawnPattern : uint8
{
	Circle                         = 0,
	Grid                           = 1,
	Random                         = 2,
	ESpawnPattern_MAX              = 3,
};

enum class EMissionRelatedPropertyUsage : uint8
{
	Prefix                         = 0,
	Suffix                         = 1,
	Description                    = 2,
	EMissionRelatedPropertyUsage_MAX = 3,
};

enum class EMissionRelatedPropertyType : uint8
{
	Name_PropertyType              = 0,
	String_PropertyType            = 1,
	Boolean_PropertyType           = 2,
	Integer_PropertyType           = 3,
	Float_PropertyType             = 4,
	Double_PropertyType            = 5,
	EMissionRelatedPropertyType_MAX = 6,
};

enum class ESTOFNotificationType : uint8
{
	Death                          = 0,
	TribeEliminated                = 1,
	MatchVictory                   = 2,
	MatchDraw                      = 3,
	MAX                            = 4,
};

enum class EPrimalARKTributeDataType : uint8
{
	Items                          = 0,
	TamedDinos                     = 1,
	CharacterData                  = 2,
	MAX                            = 3,
};

enum class EPrimalCharacterStatusValue : uint8
{
	Health                         = 0,
	Stamina                        = 1,
	Torpidity                      = 2,
	Oxygen                         = 3,
	Food                           = 4,
	Water                          = 5,
	Temperature                    = 6,
	Weight                         = 7,
	MeleeDamageMultiplier          = 8,
	SpeedMultiplier                = 9,
	TemperatureFortitude           = 10,
	CraftingSpeedMultiplier        = 11,
	MAX                            = 12,
};

enum class EBoolExecResult : uint8
{
	Success                        = 0,
	Failed                         = 1,
	EBoolExecResult_MAX            = 2,
};

enum class ECameraStyle : uint8
{
	Default                        = 0,
	FirstPerson                    = 1,
	ThirdPerson                    = 2,
	FreeCam                        = 3,
	Orbit                          = 4,
	Spectator                      = 5,
	ECameraStyle_MAX               = 6,
};

enum class ETargetingTeamBehavior : uint8
{
	ExactMatch                     = 0,
	FriendlyWith                   = 1,
	PrioritizeButIncludeAny        = 2,
	ETargetingTeamBehavior_MAX     = 3,
};

enum class EChatMessageType : uint8
{
	MyMessage                      = 0,
	SameTeamMessage                = 1,
	DifferentTeamMessage           = 2,
	SystemWideMessage              = 3,
	SameAllianceMessage            = 4,
	AdminMessage                   = 5,
	MAX                            = 6,
};

enum class EChatType : uint8
{
	GlobalChat                     = 0,
	ProximityChat                  = 1,
	RadioChat                      = 2,
	GlobalTribeChat                = 3,
	AllianceChat                   = 4,
	MAX                            = 5,
};

enum class EChatSendMode : uint8
{
	GlobalChat                     = 0,
	GlobalTribeChat                = 1,
	LocalChat                      = 2,
	AllianceChat                   = 3,
	MAX                            = 4,
};

enum class EShooterPhysMaterialType : uint8
{
	Unknown                        = 0,
	Concrete                       = 1,
	Dirt                           = 2,
	Water                          = 3,
	Metal                          = 4,
	Wood                           = 5,
	Grass                          = 6,
	Glass                          = 7,
	Flesh                          = 8,
	Leaves                         = 9,
	Rock                           = 10,
	Sand                           = 11,
	Snow                           = 12,
	Corruption                     = 13,
	Lava                           = 14,
	Acid                           = 15,
	MAX                            = 16,
};

enum class EPlayerActionIndex : uint8
{
	None                           = 0,
	WhistleFollow                  = 1,
	WhistleFollowOne               = 2,
	WhistleStop                    = 3,
	WhistleStopOne                 = 4,
	WhistleAggressive              = 5,
	WhistleNeutral                 = 6,
	WhistlePassive                 = 7,
	WhistlePassiveFlee             = 8,
	WhistleAttackTarget            = 9,
	WhistleAttackThisTarget        = 10,
	WhistleLandFlyerOne            = 11,
	ShowInventory                  = 12,
	ShowCraftables                 = 13,
	ShowTribeManager               = 14,
	Poop                           = 15,
	UnHideCompanion                = 16,
	ShowEmoteSelection             = 17,
	Back_WhistleList               = 18,
	Emote_HatSwitch                = 19,
	Emote_Salute                   = 20,
	Emote_Sorry                    = 21,
	Emote_Thank                    = 22,
	Emote_Wave                     = 23,
	Emote_Laugh                    = 24,
	Emote_Yes                      = 25,
	Emote_No                       = 26,
	Emote_Taunt                    = 27,
	Emote_Cheer                    = 28,
	Emote_FriendlyLowerHands       = 29,
	Emote_MAX                      = 30,
	EPlayerActionIndex_MAX         = 31,
};

enum class EMissionAlertType : uint8
{
	Positive                       = 0,
	Neutral                        = 1,
	Negative                       = 2,
	EMissionAlertType_MAX          = 3,
};

enum class EPhaseRequirementWidgetVisualState : uint8
{
	Neutral                        = 0,
	Positive                       = 1,
	Negative                       = 2,
	Custom                         = 3,
	EPhaseRequirementWidgetVisualState_MAX = 4,
};

enum class ELootItemType : uint8
{
	None                           = 0,
	Element                        = 1,
	Hexagons                       = 2,
	ResourceCommon                 = 3,
	ResourceUncommon               = 4,
	ResourceRare                   = 5,
	ArmorTier1                     = 6,
	ArmorTier2                     = 7,
	ArmorTier3                     = 8,
	ArmorTek                       = 9,
	WeaponTier1                    = 10,
	WeaponTier2                    = 11,
	WeaponTier3                    = 12,
	WeaponTek                      = 13,
	AmmoTier1                      = 14,
	AmmoTier2                      = 15,
	AmmoTier3                      = 16,
	Saddle                         = 17,
	ELootItemType_MAX              = 18,
};

enum class ESimpleCurve : uint8
{
	Linear                         = 0,
	Pow0_5                         = 1,
	Pow1_0                         = 2,
	Pow1_5                         = 3,
	Pow2_0                         = 4,
	Pow2_5                         = 5,
	Pow3_0                         = 6,
	Pow3_5                         = 7,
	PowCos0_5                      = 8,
	PowCos1_0                      = 9,
	PowCos1_5                      = 10,
	PowCos2_0                      = 11,
	PowCos2_5                      = 12,
	PowCos3_0                      = 13,
	PowCos3_5                      = 14,
	PowSin0_5                      = 15,
	PowSin1_0                      = 16,
	PowSin1_5                      = 17,
	PowSin2_0                      = 18,
	PowSin2_5                      = 19,
	PowSin3_0                      = 20,
	PowSin3_5                      = 21,
	PowMinCos0_5                   = 22,
	PowMinCos1_0                   = 23,
	PowMinCos1_5                   = 24,
	PowMinCos2_0                   = 25,
	PowMinCos2_5                   = 26,
	PowMinCos3_0                   = 27,
	PowMinCos3_5                   = 28,
	PowMax0_5                      = 29,
	PowMax1_0                      = 30,
	PowMax1_5                      = 31,
	PowMax2_0                      = 32,
	PowMax2_5                      = 33,
	PowMax3_0                      = 34,
	PowMax3_5                      = 35,
	ESimpleCurve_MAX               = 36,
};

enum class EHUDElementType : uint8
{
	Text                           = 0,
	ProgressBar                    = 1,
	Image                          = 2,
	EHUDElementType_MAX            = 3,
};

enum class EHUDElementAnchorMode : uint8
{
	Specified                      = 0,
	QuickbarLeft                   = 1,
	QuickbarRight                  = 2,
	QuickbarTop                    = 3,
	EHUDElementAnchorMode_MAX      = 4,
};

enum class EStencilAlliance : uint8
{
	None                           = 0,
	Friendly                       = 1,
	NPC                            = 2,
	NPCFleeing                     = 3,
	Hostile                        = 4,
	Ally                           = 5,
	Element                        = 6,
	EStencilAlliance_MAX           = 7,
};

enum class EHUDElementHorizontalAlignment : uint8
{
	Center                         = 0,
	Left                           = 1,
	Right                          = 2,
	EHUDElementHorizontalAlignment_MAX = 3,
};

enum class EHUDElementVerticalAlignment : uint8
{
	Center                         = 0,
	Top                            = 1,
	Bottom                         = 2,
	EHUDElementVerticalAlignment_MAX = 3,
};

enum class ELeaderboardColumnName : uint8
{
	MissionTag                     = 0,
	PlayerNetId                    = 1,
	TribeId                        = 2,
	TimestampUtc                   = 3,
	FloatValue                     = 4,
	IntValue                       = 5,
	NameValue                      = 6,
	StringValue                    = 7,
	ELeaderboardColumnName_MAX     = 8,
};

enum class ELeaderboardGroupByMode : uint8
{
	None                           = 0,
	First                          = 1,
	Min                            = 2,
	Max                            = 3,
	Sum                            = 4,
	Count                          = 5,
	Average                        = 6,
};

enum class ELeaderboardOrdering : uint8
{
	Ascending                      = 0,
	Descending                     = 1,
	ELeaderboardOrdering_MAX       = 2,
};

enum class EMassTeleportState : uint8
{
	INITIATED                      = 0,
	TRIGGERED_SUCCESS              = 1,
	TRIGGERED_FAILED               = 2,
	COMPLETED                      = 3,
	CANCELLED                      = 4,
	EMassTeleportState_MAX         = 5,
};

enum class EDLCSelector : uint8
{
	DLCScorchedEarth               = 0,
	DLCAberration                  = 1,
	DLCExtinction                  = 2,
	DLCCrystalIsles                = 3,
	DLCGenesis                     = 4,
	DLCGen2                        = 5,
	DLCTheCenter                   = 6,
	DLCRagnarok                    = 7,
	DLCLostIsland                  = 8,
	DLCValguero                    = 9,
	DLCFjordur                     = 10,
	DLCSelectorMax                 = 11,
	EDLCSelector_MAX               = 12,
};

enum class EDinoInputAction : uint8
{
	Fire                           = 0,
	Target                         = 1,
	Crouch                         = 2,
	EDinoInputAction_MAX           = 3,
};

enum class ECameraSetting_BoolCondition : uint8
{
	Dont_Care                      = 0,
	Yes                            = 1,
	No                             = 2,
	ECameraSetting_MAX             = 3,
};

enum class ECDOArrayModificationType : uint8
{
	MODIFY                         = 0,
	ADD                            = 1,
	REMOVE                         = 2,
	REPLACE_TARRAY                 = 3,
	ECDOArrayModificationType_MAX  = 4,
};

enum class ETrackedActorCategory : uint8
{
	NoCategory                     = 0,
	Creatures                      = 1,
	Allies                         = 2,
	Teammates                      = 3,
	MAX                            = 4,
};

enum class EFieldActivationType_New : uint8
{
	Delay                          = 0,
	OnTick                         = 1,
	OnTickWithDelay                = 2,
	Trigger                        = 3,
	MAX                            = 4,
};

enum class EPrimalCameraState : uint8
{
	OLD_CAMERA                     = 0,
	ASA_CAMERA                     = 1,
	NORMAL_INTERP_TO_OLD_CAMERA    = 2,
	NORMAL_INTERP_TO_ASA_CAMERA    = 3,
	WAITING_TO_SWITCH_TO_OLD_CAMERA_SLOW = 4,
	SLOW_INTERP_TO_OLD_CAMERA      = 5,
	EPrimalCameraState_MAX         = 6,
};

enum class EWeaponState : uint8
{
	Idle                           = 0,
	Firing                         = 1,
	Reloading                      = 2,
	Equipping                      = 3,
	UnEquipping                    = 4,
	EWeaponState_MAX               = 5,
};

enum class EWeaponAmmoReloadState : uint8
{
	Playing_Anim                   = 0,
	Waiting_For_Ammo               = 1,
	Ready                          = 2,
	EWeaponAmmoReloadState_MAX     = 3,
};

enum class EDomeState : uint8
{
	NotADome                       = 0,
	Inside                         = 1,
	Outside                        = 2,
	EDomeState_MAX                 = 3,
};

enum class EHubSubMenu : uint8
{
	Inventory                      = 0,
	Engrams                        = 1,
	TribeManager                   = 2,
	TrackedDinoList                = 3,
	SurvivalProfile                = 4,
	MissionList                    = 5,
	Minimap                        = 6,
	MAX                            = 7,
};

enum class EDropItemIconAction : uint8
{
	DA_NoAction                    = 0,
	DA_Equip                       = 1,
	DA_UnEquip                     = 2,
	DA_AddToSlot                   = 3,
	DA_RemoveFromSlot              = 4,
	DA_ToRemoteInv                 = 5,
	DA_FromRemoteInv               = 6,
	DA_RemoteEquip                 = 7,
	DA_MergeItemStack              = 8,
	DA_SplitItemStack              = 9,
	DA_SwapItems                   = 10,
	DA_UseWithItem                 = 11,
	DA_UnEquipTransferToLocal      = 12,
	DA_RemoveItemSkin              = 13,
	DA_SplitItemStackOne           = 14,
	DA_RemoveWeaponAmmo            = 15,
	DA_FromRemoteInvToSlot         = 16,
	DA_ToRemoteInvFromSlot         = 17,
	DA_EquipLocalFromRemote        = 18,
	DA_EquipRemoteFromLocal        = 19,
	DA_UnequipRemote               = 20,
	DA_UnequipTransferToRemote     = 21,
	DA_ToArkInv                    = 22,
	DA_FromArkInv                  = 23,
	DA_AddCustomCosmetic           = 24,
	MAX                            = 25,
};

enum class EListDisplay : uint8
{
	MISSIONS                       = 0,
	EFFECTS                        = 1,
	EListDisplay_MAX               = 2,
};

enum class EDataDisplay : uint8
{
	MISSION_INFO                   = 0,
	LEADERBOARDS                   = 1,
	EDataDisplay_MAX               = 2,
};

enum class EServerOctreeGroup : uint8
{
	STASISCOMPONENTS               = 0,
	PLAYERPAWNS                    = 1,
	DINOPAWNS                      = 2,
	PAWNS                          = 3,
	STRUCTURES                     = 4,
	TARGETABLEACTORS               = 5,
	PLAYERS_CONNECTED              = 6,
	SPATIALNETWORKEDACTORS         = 7,
	SPATIALNETWORKEDACTORS_DORMANT = 8,
	ALL_SPATIAL                    = 9,
	THERMALSTRUCTURES              = 10,
	STRUCTURES_CORE                = 11,
	DINOPAWNS_TAMED                = 12,
	PLAYERS_AND_TAMED_DINOS        = 13,
	PLAYERS_CONNECTED_AND_TAMED_DINOS = 14,
	DINOFOODCONTAINER              = 15,
	GRENADES                       = 16,
	TREESAPTAPS                    = 17,
	LARGEUNSTASISRANGE             = 18,
	TRAPS                          = 19,
	MAX                            = 20,
};

enum class EEditorMessageLogLevel : uint8
{
	Error                          = 0,
	Warning                        = 1,
	Info                           = 2,
	Success                        = 3,
	EEditorMessageLogLevel_MAX     = 4,
};

enum class EPlayMovieVolumeType : uint8
{
	Default                        = 0,
	Music                          = 1,
	Character                      = 2,
	Voice                          = 3,
	EPlayMovieVolumeType_MAX       = 4,
};

enum class EColorChannelTarget : uint8
{
	Red                            = 0,
	Green                          = 1,
	Blue                           = 2,
	Alpha                          = 3,
	All                            = 4,
	EColorChannelTarget_MAX        = 5,
};


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x40 (0x40 - 0x0)
// ScriptStruct ShooterGame.SoundWaveAnimTexturePairs
struct FSoundWaveAnimTexturePairs
{
public:
	struct FSoftObjectPath                       LocalizedSoundWave;                                // 0x0(0x20)(BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	struct FSoftObjectPath                       MatchingAnimTexture;                               // 0x20(0x20)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct ShooterGame.LocalizedSoundWaveAnimTexturePairArrays
struct FLocalizedSoundWaveAnimTexturePairArrays
{
public:
	class FString                                TwoLetterISOLanguageName;                          // 0x0(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	TArray<struct FSoundWaveAnimTexturePairs>    SoundWaveAnimTexturePairs;                         // 0x10(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance)
};

// 0xB0 (0xB0 - 0x0)
// ScriptStruct ShooterGame.CompanionReactionData
struct FCompanionReactionData
{
public:
	int32                                        ReactionPriority;                                  // 0x0(0x4)(BlueprintVisible, Net, Parm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        ReactionType;                                      // 0x4(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_503D[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        ReactionTimePadding_Start;                         // 0x8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	float                                        ReactionTimePadding_End;                           // 0xC(0x4)(ConstParm, Parm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	float                                        ForceReactionDuration;                             // 0x10(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_503E[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UAnimMontage*                          ReactionAnim;                                      // 0x18(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	float                                        ReactionStartDelay_Anim;                           // 0x20(0x4)(ConstParm, Net, EditFixedSize, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	float                                        ReactionForceDuration_Anim;                        // 0x24(0x4)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class UParticleSystem*                       ReactionVFX;                                       // 0x28(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	float                                        ReactionStartDelay_VFX;                            // 0x30(0x4)(Edit, EditFixedSize, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	float                                        ReactionForceDuration_VFX;                         // 0x34(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	TArray<struct FSoftObjectPath>               ReactionSFXArray;                                  // 0x38(0x10)(ConstParm, ExportObject, Net, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	float                                        ReactionStartDelay_SFX;                            // 0x48(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	float                                        ReactionForceDuration_SFX;                         // 0x4C(0x4)(BlueprintReadOnly, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        bReactionIsMonologue : 1;                          // Mask: 0x1, PropSize: 0x10x50(0x1)(Edit, BlueprintVisible, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIsReactionPlaying : 1;                            // Mask: 0x2, PropSize: 0x10x50(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIsReactionPlaying_Anim : 1;                       // Mask: 0x4, PropSize: 0x10x50(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIsReactionPlaying_VFX : 1;                        // Mask: 0x8, PropSize: 0x10x50(0x1)(ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIsReactionPlaying_SFX : 1;                        // Mask: 0x10, PropSize: 0x10x50(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3EA : 3;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_5041[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       ReactionStartTime;                                 // 0x58(0x8)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	double                                       ReactionEndTime;                                   // 0x60(0x8)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	float                                        RequiredSecondsSincePreviousReactionInOrderToBePlayed; // 0x68(0x4)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        bDontCancelWhenGreaterOrEqualPriorityPlays : 1;    // Mask: 0x1, PropSize: 0x10x6C(0x1)(Edit, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3EB : 7;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_5043[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        ChanceToOccur;                                     // 0x70(0x4)(Edit, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5044[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FSoftObjectPath                       FallbackSharedAnimTexture;                         // 0x78(0x20)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	TArray<struct FLocalizedSoundWaveAnimTexturePairArrays> LocalizedSoundWaves;                               // 0x98(0x10)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	int32                                        ExplorerNoteIndexToUnlock;                         // 0xA8(0x4)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5046[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x14 (0x14 - 0x0)
// ScriptStruct ShooterGame.TribeGovernment
struct FTribeGovernment
{
public:
	int32                                        TribeGovern_PINCode;                               // 0x0(0x4)(BlueprintVisible, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	int32                                        TribeGovern_DinoOwnership;                         // 0x4(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	int32                                        TribeGovern_StructureOwnership;                    // 0x8(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	int32                                        TribeGovern_DinoTaming;                            // 0xC(0x4)(ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	int32                                        TribeGovern_DinoUnclaimAdminOnly;                  // 0x10(0x4)(Edit, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x4 (0x4 - 0x0)
// ScriptStruct ShooterGame.ArkTributeEntity
struct FArkTributeEntity
{
public:
	int32                                        UploadTime;                                        // 0x0(0x4)(Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x11C (0x120 - 0x4)
// ScriptStruct ShooterGame.ArkTributePlayerData
struct FArkTributePlayerData : public FArkTributeEntity
{
public:
	uint8                                        Pad_5049[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	uint64                                       PlayerDataID;                                      // 0x8(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	TArray<uint8>                                PlayerDataBytes;                                   // 0x10(0x10)(BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FString                                PlayerName;                                        // 0x20(0x10)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, SubobjectReference)
	class FString                                PlayerStats[0xC];                                  // 0x30(0xC0)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FString                                UploadingServerMapName;                            // 0xF0(0x10)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FString                                UploadingServerName;                               // 0x100(0x10)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	bool                                         bWasAllowDPCUpload;                                // 0x110(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	bool                                         bWithItems;                                        // 0x111(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_504C[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	uint32                                       ItemCount;                                         // 0x114(0x4)(BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	bool                                         bForServerTransfer;                                // 0x118(0x1)(ConstParm, BlueprintVisible, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_504D[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        Version;                                           // 0x11C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct ShooterGame.ItemNetID
struct FItemNetID
{
public:
	uint32                                       ItemID1;                                           // 0x0(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, Transient, DisableEditOnInstance)
	uint32                                       ItemID2;                                           // 0x4(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, Transient, DisableEditOnInstance)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct ShooterGame.CustomItemByteArray
struct FCustomItemByteArray
{
public:
	TArray<uint8>                                Bytes;                                             // 0x0(0x10)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct ShooterGame.CustomItemByteArrays
struct FCustomItemByteArrays
{
public:
	TArray<struct FCustomItemByteArray>          ByteArrays;                                        // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct ShooterGame.CustomItemDoubles
struct FCustomItemDoubles
{
public:
	TArray<double>                               Doubles;                                           // 0x0(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x78 (0x78 - 0x0)
// ScriptStruct ShooterGame.CustomItemData
struct FCustomItemData
{
public:
	class FName                                  CustomDataName;                                    // 0x0(0x8)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	TArray<class FString>                        CustomDataStrings;                                 // 0x8(0x10)(ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	TArray<float>                                CustomDataFloats;                                  // 0x18(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	TArray<class UObject*>                       CustomDataObjects;                                 // 0x28(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	TArray<class UClass*>                        CustomDataClasses;                                 // 0x38(0x10)(Edit, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	TArray<class FName>                          CustomDataNames;                                   // 0x48(0x10)(Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	struct FCustomItemByteArrays                 CustomDataBytes;                                   // 0x58(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	struct FCustomItemDoubles                    CustomDataDoubles;                                 // 0x68(0x10)(Edit, ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct ShooterGame.CraftingResourceRequirement
struct FCraftingResourceRequirement
{
public:
	float                                        BaseResourceRequirement;                           // 0x0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_504F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                ResourceItemType;                                  // 0x8(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	bool                                         bCraftingRequireExactResourceType;                 // 0x10(0x1)(BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5050[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x30 (0x30 - 0x0)
// ScriptStruct ShooterGame.DinoAncestorsEntry
struct FDinoAncestorsEntry
{
public:
	class FString                                MaleName;                                          // 0x0(0x10)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint32                                       MaleDinoID1;                                       // 0x10(0x4)(Edit, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint32                                       MaleDinoID2;                                       // 0x14(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FString                                FemaleName;                                        // 0x18(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint32                                       FemaleDinoID1;                                     // 0x28(0x4)(BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint32                                       FemaleDinoID2;                                     // 0x2C(0x4)(BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x1E0 (0x1E0 - 0x0)
// ScriptStruct ShooterGame.ItemNetInfo
struct FItemNetInfo
{
public:
	class UClass*                                ItemArchetype;                                     // 0x0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, Config, GlobalConfig, SubobjectReference)
	struct FItemNetID                            ItemID;                                            // 0x8(0x8)(ConstParm, BlueprintReadOnly, Parm, ReturnParm, Transient, DisableEditOnInstance)
	uint32                                       ItemQuantity;                                      // 0x10(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	int32                                        CustomItemID;                                      // 0x14(0x4)(ExportObject, BlueprintReadOnly, OutParm, Config, GlobalConfig, SubobjectReference)
	int32                                        SlotIndex;                                         // 0x18(0x4)(ConstParm, BlueprintReadOnly, OutParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5054[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	int64                                        CustomCosmeticModSkinReplacementID;                // 0x20(0x8)(OutParm, Config, GlobalConfig, SubobjectReference)
	int32                                        CustomCosmeticModSkinVariantID;                    // 0x28(0x4)(BlueprintReadOnly, Net, EditFixedSize, Parm, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5055[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                CustomCosmeticModSkinReplacementOriginalClass;     // 0x30(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, Config, GlobalConfig, SubobjectReference)
	double                                       CreationTime;                                      // 0x38(0x8)(Edit, BlueprintReadOnly, EditFixedSize, Parm, Config, GlobalConfig, SubobjectReference)
	class FString                                CustomItemName;                                    // 0x40(0x10)(Edit, ExportObject, EditFixedSize, Parm, Config, GlobalConfig, SubobjectReference)
	class FString                                CustomItemDescription;                             // 0x50(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, Config, GlobalConfig, SubobjectReference)
	double                                       UploadEarliestValidTime;                           // 0x60(0x8)(BlueprintReadOnly, Net, Parm, Config, GlobalConfig, SubobjectReference)
	TArray<uint64>                               SteamUserItemID;                                   // 0x68(0x10)(Edit, ConstParm, BlueprintVisible, Net, Parm, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIsBlueprint : 1;                                  // Mask: 0x1, PropSize: 0x10x78(0x1)(Net, Parm, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIsEngram : 1;                                     // Mask: 0x2, PropSize: 0x10x78(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIsCustomRecipe : 1;                               // Mask: 0x4, PropSize: 0x10x78(0x1)(Edit, BlueprintReadOnly, Parm, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIsFoodRecipe : 1;                                 // Mask: 0x8, PropSize: 0x10x78(0x1)(Edit, ExportObject, Parm, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIsRepairing : 1;                                  // Mask: 0x10, PropSize: 0x10x78(0x1)(ConstParm, Parm, Config, GlobalConfig, SubobjectReference)
	uint8                                        bAllowRemovalFromInventory : 1;                    // Mask: 0x20, PropSize: 0x10x78(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Config, GlobalConfig, SubobjectReference)
	uint8                                        bHideFromInventoryDisplay : 1;                     // Mask: 0x40, PropSize: 0x10x78(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, Config, GlobalConfig, SubobjectReference)
	uint8                                        bAllowRemovalFromSteamInventory : 1;               // Mask: 0x80, PropSize: 0x10x78(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Config, GlobalConfig, SubobjectReference)
	uint8                                        bFromSteamInventory : 1;                           // Mask: 0x1, PropSize: 0x10x79(0x1)(ConstParm, ExportObject, EditFixedSize, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIsFromAllClustersInventory : 1;                   // Mask: 0x2, PropSize: 0x10x79(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Config, GlobalConfig, SubobjectReference)
	uint8                                        bForcePreventGrinding : 1;                         // Mask: 0x4, PropSize: 0x10x79(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIsEquipped : 1;                                   // Mask: 0x8, PropSize: 0x10x79(0x1)(ExportObject, Net, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIsSlot : 1;                                       // Mask: 0x10, PropSize: 0x10x79(0x1)(Edit, ConstParm, Net, Config, GlobalConfig, SubobjectReference)
	uint8                                        bIsInitialItem : 1;                                // Mask: 0x20, PropSize: 0x10x79(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Config, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3EC : 2;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_5059[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	uint16                                       CraftQueue;                                        // 0x7C(0x2)(Edit, BlueprintVisible, BlueprintReadOnly, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_505B[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       NextCraftCompletionTime;                           // 0x80(0x8)(ExportObject, Config, GlobalConfig, SubobjectReference)
	float                                        CraftingSkill;                                     // 0x88(0x4)(Config, GlobalConfig, SubobjectReference)
	float                                        CraftedSkillBonus;                                 // 0x8C(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FString                                CrafterCharacterName;                              // 0x90(0x10)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FString                                CrafterTribeName;                                  // 0xA0(0x10)(ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint32                                       WeaponClipAmmo;                                    // 0xB0(0x4)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	float                                        ItemDurability;                                    // 0xB4(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	float                                        ItemRating;                                        // 0xB8(0x4)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint32                                       ExpirationTimeUTC;                                 // 0xBC(0x4)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        ItemQualityIndex;                                  // 0xC0(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_505E[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                ItemCustomClass;                                   // 0xC8(0x8)(BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint16                                       ItemStatValues[0x8];                               // 0xD0(0x10)(ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	int16                                        ItemColorID[0x6];                                  // 0xE0(0xC)(Edit, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5060[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                ItemSkinTemplate;                                  // 0xF0(0x8)(ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	TArray<struct FCustomItemData>               CustomItemDatas;                                   // 0xF8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	TArray<struct FColor>                        CustomItemColors;                                  // 0x108(0x10)(BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	TArray<struct FCraftingResourceRequirement>  CustomResourceRequirements;                        // 0x118(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	double                                       NextSpoilingTime;                                  // 0x128(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	double                                       LastSpoilingTime;                                  // 0x130(0x8)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint64                                       OwnerPlayerDataId;                                 // 0x138(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	TWeakObjectPtr<class AShooterCharacter>      LastOwnerPlayer;                                   // 0x140(0x8)(Edit, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	double                                       LastAutoDurabilityDecreaseTime;                    // 0x148(0x8)(ExportObject, Net, Parm, ReturnParm, Transient, DisableEditOnInstance)
	float                                        ItemStatClampsMultiplier;                          // 0x150(0x4)(BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5062[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               OriginalItemDropLocation;                          // 0x158(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	int16                                        PreSkinItemColorID[0x6];                           // 0x170(0xC)(Edit, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        EggNumberOfLevelUpPointsApplied[0xC];              // 0x17C(0xC)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        EggNumberMutationsApplied[0xC];                    // 0x188(0xC)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	float                                        EggTamedIneffectivenessModifier;                   // 0x194(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        EggColorSetIndices[0x6];                           // 0x198(0x6)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5064[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        EggGenderOverride;                                 // 0x1A0(0x4)(Edit, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        ItemVersion;                                       // 0x1A4(0x1)(ConstParm, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5065[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       ClusterSpoilingTimeUTC;                            // 0x1A8(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	TArray<struct FDinoAncestorsEntry>           EggDinoAncestors;                                  // 0x1B0(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	TArray<struct FDinoAncestorsEntry>           EggDinoAncestorsMale;                              // 0x1C0(0x10)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	int32                                        EggRandomMutationsFemale;                          // 0x1D0(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	int32                                        EggRandomMutationsMale;                            // 0x1D4(0x4)(ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        ItemProfileVersion;                                // 0x1D8(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	bool                                         bNetInfoFromClient;                                // 0x1D9(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5067[0x6];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// ScriptStruct ShooterGame.IntArray
struct FIntArray
{
public:
	TArray<int32>                                Array;                                             // 0x0(0x10)(ExportObject, Parm, OutParm, ZeroConstructor)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct ShooterGame.StringArray
struct FStringArray
{
public:
	TArray<class FString>                        Array;                                             // 0x0(0x10)(ExportObject, Parm, OutParm, ZeroConstructor)
};

// 0x68 (0x68 - 0x0)
// ScriptStruct ShooterGame.AhoCorasickState
struct FAhoCorasickState
{
public:
	uint8                                        Pad_507D[0x50];                                    // Fixing Size After Last Property  > TateDumper <
	int32                                        Failure;                                           // 0x50(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_507F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<int32>                                Goto;                                              // 0x58(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct ShooterGame.AhoCorasickMatcher
struct FAhoCorasickMatcher
{
public:
	TArray<struct FAhoCorasickState>             States;                                            // 0x0(0x10)(ConstParm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        MaxC;                                              // 0x10(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5080[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x38 (0x38 - 0x0)
// ScriptStruct ShooterGame.PlayerAllClustersInventory
struct FPlayerAllClustersInventory
{
public:
	uint8                                        Pad_5081[0x38];                                    // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0xD0 - 0xC8)
// ScriptStruct ShooterGame.AnimNode_ApplyBoneMods
struct FAnimNode_ApplyBoneMods : public FAnimNode_SkeletalControlBase
{
public:
	uint8                                        Pad_5082[0x8];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0xD0 - 0xC8)
// ScriptStruct ShooterGame.AnimNode_FemaleBoneMods
struct FAnimNode_FemaleBoneMods : public FAnimNode_SkeletalControlBase
{
public:
	uint8                                        Pad_5083[0x8];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x28 (0xF0 - 0xC8)
// ScriptStruct ShooterGame.AnimNode_FixVirtualBones
struct FAnimNode_FixVirtualBones : public FAnimNode_SkeletalControlBase
{
public:
	bool                                         bIgnoreOnDedicatedServer;                          // 0xC8(0x1)(Edit, ConstParm, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bAllowUpdatingOutsideOfGameWorld;                  // 0xC9(0x1)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5085[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FBoneReference>                VirtualBonesToFix;                                 // 0xD0(0x10)(BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FBoneReference>                VirtualBoneTargets;                                // 0xE0(0x10)(ConstParm, BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x88 (0x150 - 0xC8)
// ScriptStruct ShooterGame.AnimNode_GroundBones
struct FAnimNode_GroundBones : public FAnimNode_SkeletalControlBase
{
public:
	uint8                                        bDebug : 1;                                        // Mask: 0x1, PropSize: 0x10xC8(0x1)(ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5086[0x87];                                    // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0xD0 - 0xC8)
// ScriptStruct ShooterGame.AnimNode_ModifyBones
struct FAnimNode_ModifyBones : public FAnimNode_SkeletalControlBase
{
public:
	uint8                                        Pad_5087[0x8];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0xD8 - 0xC8)
// ScriptStruct ShooterGame.AnimNode_MultiFabrik
struct FAnimNode_MultiFabrik : public FAnimNode_SkeletalControlBase
{
public:
	float                                        Precision;                                         // 0xC8(0x4)(ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bEnableDebugDraw;                                  // 0xCC(0x1)(Edit, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_508A[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  NodeName;                                          // 0xD0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x30 (0xF8 - 0xC8)
// ScriptStruct ShooterGame.AnimNode_MultiFabrik_Dinos
struct FAnimNode_MultiFabrik_Dinos : public FAnimNode_SkeletalControlBase
{
public:
	float                                        Precision;                                         // 0xC8(0x4)(ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bEnableDebugDraw;                                  // 0xCC(0x1)(Edit, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_508C[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        RootOffset;                                        // 0xD0(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_508D[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              RootRotationOffset;                                // 0xD8(0x18)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bInitOffset;                                       // 0xF0(0x1)(ConstParm, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_508E[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// ScriptStruct ShooterGame.TransactionLogData
struct FTransactionLogData
{
public:
	uint8                                        Pad_508F[0x18];                                    // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// ScriptStruct ShooterGame.BattleTribeData
struct FBattleTribeData
{
public:
	class FString                                TribeName;                                         // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance)
	int32                                        TribeID;                                           // 0x10(0x4)(Edit, BlueprintReadOnly, Net, Parm, ZeroConstructor, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5091[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x20 (0x20 - 0x0)
// ScriptStruct ShooterGame.BattlePlayerData
struct FBattlePlayerData
{
public:
	class FString                                PlayerName;                                        // 0x0(0x10)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, SubobjectReference)
	bool                                         bConnected;                                        // 0x10(0x1)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bAlive;                                            // 0x11(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5093[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        TribeID;                                           // 0x14(0x4)(Edit, BlueprintReadOnly, Net, Parm, ZeroConstructor, Config, GlobalConfig, SubobjectReference)
	int32                                        PlayerID;                                          // 0x18(0x4)(Edit, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5095[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x110 (0x110 - 0x0)
// ScriptStruct ShooterGame.PrimalPlayerCharacterConfigStructReplicated
struct FPrimalPlayerCharacterConfigStructReplicated
{
public:
	uint8                                        bIsFemale : 1;                                     // Mask: 0x1, PropSize: 0x10x0(0x1)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, DisableEditOnInstance)
	uint8                                        BitPad_3ED : 7;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_5097[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          BodyColors[0x4];                                   // 0x4(0x40)(Edit, ConstParm, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5098[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                PlayerCharacterName;                               // 0x48(0x10)(ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        FacialHairIndex;                                   // 0x58(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        HeadHairIndex;                                     // 0x59(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        EyebrowIndex;                                      // 0x5A(0x1)(ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5099[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        PercentOfFullHeadHairGrowth;                       // 0x5C(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        PercentOfFullFacialHairGrowth;                     // 0x60(0x4)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        RawBoneModifiers[0x1A];                            // 0x64(0x68)(EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        PlayerSpawnRegionIndex;                            // 0xCC(0x4)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        OverrideHeadHairColor[0x2];                        // 0xD0(0x2)(ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        OverrideFacialHairColor[0x2];                      // 0xD2(0x2)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        DynamicMaterialBytes[0x32];                        // 0xD4(0x32)(BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_509B[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        PlayerVoiceCollectionIndex;                        // 0x108(0x4)(ConstParm, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUsingCustomPlayerVoiceCollection : 1;             // Mask: 0x1, PropSize: 0x10x10C(0x1)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_509C[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x88 (0x88 - 0x0)
// ScriptStruct ShooterGame.PlayerDeathNotification
struct FPlayerDeathNotification
{
public:
	class FString                                PlayerDeathStringEnemy;                            // 0x0(0x10)(BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                PlayerDeathStringAlly;                             // 0x10(0x10)(BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                PlayerDeathStringYou;                              // 0x20(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                DeathReason;                                       // 0x30(0x10)(ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<class FString>                        DeadPlayerNames;                                   // 0x40(0x10)(Edit, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bIsTribeDeath;                                     // 0x50(0x1)(Edit, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_509F[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                DeathTribeName;                                    // 0x58(0x10)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        TargetingTeam;                                     // 0x68(0x4)(Edit, ConstParm, BlueprintReadOnly, ReturnParm, Transient, DisableEditOnInstance)
	uint8                                        Pad_50A0[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	int64                                        LinkedPlayerID;                                    // 0x70(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FPrimalPlayerCharacterConfigStructReplicated> PlayersData;                                       // 0x78(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x80 (0x80 - 0x0)
// ScriptStruct ShooterGame.BiomeZoneImpactEffect
struct FBiomeZoneImpactEffect
{
public:
	class UClass*                                SpawnActors[0x10];                                 // 0x0(0x80)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct ShooterGame.DecalData
struct FDecalData
{
public:
	class UMaterialInterface*                    DecalMaterial;                                     // 0x0(0x8)(Edit, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        DecalSize;                                         // 0x8(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        DecalDepth;                                        // 0xC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        DecalImpactNormalOffset;                           // 0x10(0x4)(ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        LifeSpan;                                          // 0x14(0x4)(BlueprintVisible, Net, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        RandomAngleRange;                                  // 0x18(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50A5[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x48 (0x48 - 0x0)
// ScriptStruct ShooterGame.BiomeZoneVolumeEffect
struct FBiomeZoneVolumeEffect
{
public:
	enum class EBiomeZone                        BiomeZone;                                         // 0x0(0x1)(Edit, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50A6[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UParticleSystem*                       ParticleSystem;                                    // 0x8(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, GlobalConfig)
	struct FDecalData                            DecalData;                                         // 0x10(0x20)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance)
	uint8                                        bIsImpactEffect : 1;                               // Mask: 0x1, PropSize: 0x10x30(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsNonImpactEffect : 1;                            // Mask: 0x2, PropSize: 0x10x30(0x1)(BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsUnderwaterEffect : 1;                           // Mask: 0x4, PropSize: 0x10x30(0x1)(Edit, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bDecalUniformSize : 1;                             // Mask: 0x8, PropSize: 0x10x30(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3EE : 4;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_50A8[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        Weight;                                            // 0x34(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst)
	float                                        MinSpawnDistance;                                  // 0x38(0x4)(ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MaxSpawnDistance;                                  // 0x3C(0x4)(Edit, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        ScaleAtMinDistance;                                // 0x40(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        ScaleAtMaxDistance;                                // 0x44(0x4)(Edit, ConstParm, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0xB0 (0xB0 - 0x0)
// ScriptStruct ShooterGame.ShooterWeaponDBEntry
struct FShooterWeaponDBEntry
{
public:
	class UClass*                                WeaponAmmoItemTemplate;                            // 0x0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        WeaponConfig_AmmoPerClip;                          // 0x8(0x4)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        WeaponConfig_bShowAmmoInClipAsPercent : 1;         // Mask: 0x1, PropSize: 0x10xC(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        WeaponConfig_bUsesAmmo : 1;                        // Mask: 0x2, PropSize: 0x10xC(0x1)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        WeaponConfig_bFullReloadFromSingleItem : 1;        // Mask: 0x4, PropSize: 0x10xC(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCanBeUsedAsEquipment : 1;                         // Mask: 0x8, PropSize: 0x10xC(0x1)(ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bForceAllowMountedWeaponry : 1;                    // Mask: 0x10, PropSize: 0x10xC(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAllowUseWhileRidingDino : 1;                      // Mask: 0x20, PropSize: 0x10xC(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bForcePreventUseWhileRidingDino : 1;               // Mask: 0x40, PropSize: 0x10xC(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOnlyUseOnSeatingStructure : 1;                    // Mask: 0x80, PropSize: 0x10xC(0x1)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAllowUseOnSeatingStructure : 1;                   // Mask: 0x1, PropSize: 0x10xD(0x1)(Edit, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOnlyAllowUseWhenRidingDino : 1;                   // Mask: 0x2, PropSize: 0x10xD(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBPCanEquip : 1;                                // Mask: 0x4, PropSize: 0x10xD(0x1)(ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bDontActuallyConsumeItemAmmo : 1;                  // Mask: 0x8, PropSize: 0x10xD(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventEquippingUnderwater : 1;                   // Mask: 0x10, PropSize: 0x10xD(0x1)(BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3EF : 3;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_50B0[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MeleeAttackUsableHarvestDamageMultiplier;          // 0x10(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50B1[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                MeleeAttackUsableHarvestDamageType;                // 0x18(0x8)(Edit, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UClass*                                MeleeDamageType;                                   // 0x20(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        ItemDurabilityToConsumePerMeleeHit;                // 0x28(0x4)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MeleeDamageAmount;                                 // 0x2C(0x4)(Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TSoftClassPtr<class AShooterProjectile>      ProjectileClass;                                   // 0x30(0x30)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TSet<TSoftClassPtr<class AShooterWeapon>>    IsChildClassOf;                                    // 0x60(0x50)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x78 (0x78 - 0x0)
// ScriptStruct ShooterGame.PrimalDinoDBEntry
struct FPrimalDinoDBEntry
{
public:
	TSet<TSoftClassPtr<class APrimalDinoCharacter>> ParentClassTree;                                   // 0x0(0x50)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FName                                  DinoNameTag;                                       // 0x50(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        NPCZoneVolumeCountWeight;                          // 0x58(0x4)(ConstParm, BlueprintVisible, EditFixedSize, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        CapsuleHalfHeight;                                 // 0x5C(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        CapsuleWaterDepthMultiplier;                       // 0x60(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        CapsuleRadius;                                     // 0x64(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        UnnetworkedStasisMultiplier;                       // 0x68(0x4)(Net, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        MeleeDamageAmount;                                 // 0x6C(0x4)(Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUsesGender : 1;                                   // Mask: 0x1, PropSize: 0x10x70(0x1)(Edit, ExportObject, BlueprintReadOnly, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCanBeTorpid : 1;                                  // Mask: 0x2, PropSize: 0x10x70(0x1)(ConstParm, BlueprintReadOnly, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsWaterDino : 1;                                  // Mask: 0x4, PropSize: 0x10x70(0x1)(Edit, ConstParm, ExportObject, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsAmphibious : 1;                                 // Mask: 0x8, PropSize: 0x10x70(0x1)(Edit, ConstParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50B5[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x1 (0x1 - 0x0)
// ScriptStruct ShooterGame.PrimalStructureDBEntry
struct FPrimalStructureDBEntry
{
public:
	uint8                                        bTraceThruEncroachmentPoints : 1;                  // Mask: 0x1, PropSize: 0x10x0(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bSpawnCrateOnTopOfStructures : 1;                  // Mask: 0x2, PropSize: 0x10x0(0x1)(Edit, ConstParm, Net, EditFixedSize, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct ShooterGame.PrimalInventoryDBEntry
struct FPrimalInventoryDBEntry
{
public:
	class FString                                InventoryNameOverride;                             // 0x0(0x10)(Edit, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// ScriptStruct ShooterGame.PrimalMissionDBEntry
struct FPrimalMissionDBEntry
{
public:
	bool                                         bUsesFallbackSeeds;                                // 0x0(0x1)(Edit, BlueprintVisible, ExportObject, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x40 (0x48 - 0x8)
// ScriptStruct ShooterGame.CustomButtonWidgetStyle
struct FCustomButtonWidgetStyle : public FSlateWidgetStyle
{
public:
	struct FLinearColor                          NormalChildTintColor;                              // 0x8(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FLinearColor                          HoveredChildTintColor;                             // 0x18(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FLinearColor                          PressedChildTintColor;                             // 0x28(0x10)(Edit, ConstParm, Net, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FLinearColor                          DisabledChildTintColor;                            // 0x38(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct ShooterGame.DamageNegatingItem
struct FDamageNegatingItem
{
public:
	class UClass*                                ItemSubclass;                                      // 0x0(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        NegationFactor;                                    // 0x8(0x4)(ConstParm, BlueprintVisible, EditFixedSize, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50B7[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// ScriptStruct ShooterGame.DataListEntryButtonBorderColors
struct FDataListEntryButtonBorderColors
{
public:
	struct FColor                                Normal;                                            // 0x0(0x4)(ConstParm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst)
	struct FColor                                Hovered;                                           // 0x4(0x4)(BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance)
	struct FColor                                Pressed;                                           // 0x8(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, GlobalConfig, SubobjectReference)
	struct FColor                                Disabled;                                          // 0xC(0x4)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, GlobalConfig, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct ShooterGame.PrimalFolderIcons
struct FPrimalFolderIcons
{
public:
	class UTexture2D*                            NormalFolder;                                      // 0x0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UTexture2D*                            CustomFolder;                                      // 0x8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UTexture2D*                            Back;                                              // 0x10(0x8)(ConstParm, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance)
	struct FColor                                TextColor;                                         // 0x18(0x4)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_50B9[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0x30 - 0x28)
// ScriptStruct ShooterGame.DeferredMovementTick
struct FDeferredMovementTick : public FTickFunction
{
public:
	uint8                                        Pad_50BB[0x8];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// ScriptStruct ShooterGame.DeferredMove
struct FDeferredMove
{
public:
	TWeakObjectPtr<class UPrimalCharacterMovement> Component;                                         // 0x0(0x8)(ConstParm, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         bMoveEveryFrame;                                   // 0x8(0x1)(Edit, ConstParm, Net, EditFixedSize, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50BC[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        DeltaTime;                                         // 0xC(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0xC0 (0xC0 - 0x0)
// ScriptStruct ShooterGame.AvoidanceArea
struct FAvoidanceArea
{
public:
	struct FVector                               Location;                                          // 0x0(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor)
	struct FRotator                              Rotation;                                          // 0x18(0x18)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor)
	struct FTransform                            Transform;                                         // 0x30(0x60)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm)
	struct FVector                               BoxExtents;                                        // 0x90(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        SphereRadius;                                      // 0xA8(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	uint8                                        Pad_50BF[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       CreationTime;                                      // 0xB0(0x8)(Edit, BlueprintReadOnly, EditFixedSize, Parm, Config, GlobalConfig, SubobjectReference)
	uint8                                        bBlockBox : 1;                                     // Mask: 0x1, PropSize: 0x10xB8(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bBlockSphere : 1;                                  // Mask: 0x2, PropSize: 0x10xB8(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsDynamic : 1;                                    // Mask: 0x4, PropSize: 0x10xB8(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50C1[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x38 (0x38 - 0x0)
// ScriptStruct ShooterGame.FlockPersistentData
struct FFlockPersistentData
{
public:
	float                                        AvoidanceAreaDecayRate;                            // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AvoidanceTraceInterval;                            // 0x4(0x4)(ExportObject, Net, EditFixedSize, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AvoidanceTraceInferredBoxSize;                     // 0x8(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AvoidanceTraceInferredSphereRadius;                // 0xC(0x4)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AvoidanceTraceForwardDistance;                     // 0x10(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AvoidanceTraceDownDistance;                        // 0x14(0x4)(ExportObject, Net, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	double                                       LastAvoidanceTraceTime;                            // 0x18(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        MaxNumAvoidanceAreas;                              // 0x20(0x4)(Edit, BlueprintReadOnly, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50C2[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FAvoidanceArea>                DynamicAvoidanceAreas;                             // 0x28(0x10)(Edit, BlueprintVisible, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct ShooterGame.BoidBehavior
struct FBoidBehavior
{
public:
	TArray<struct FAvoidanceArea>                AvoidanceAreas;                                    // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        DesiredSeparation;                                 // 0x10(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        NeighborDist;                                      // 0x14(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        SeparationMultiplier;                              // 0x18(0x4)(Edit, Net, EditFixedSize, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AlignmentMultiplier;                               // 0x1C(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        CohesionMultiplier;                                // 0x20(0x4)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AvoidanceMultiplier;                               // 0x24(0x4)(Edit, EditFixedSize, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        TargetingMultiplier;                               // 0x28(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MaxDistanceToLeaders;                              // 0x2C(0x4)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MaxSpeedMultiplier;                                // 0x30(0x4)(Edit, Net, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MaxForceMultiplier;                                // 0x34(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bUseBoundsCulling;                                 // 0x38(0x1)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50C3[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoundsCullingMultiplier;                           // 0x3C(0x4)(Parm, OutParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x98 (0x98 - 0x0)
// ScriptStruct ShooterGame.Boid
struct FBoid
{
public:
	struct FVector                               Location;                                          // 0x0(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor)
	struct FRotator                              Rotation;                                          // 0x18(0x18)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor)
	struct FVector                               Velocity;                                          // 0x30(0x18)(Config, EditConst, GlobalConfig)
	struct FVector                               Acceleration;                                      // 0x48(0x18)(Edit, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	float                                        MaxSpeed;                                          // 0x60(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, SubobjectReference)
	float                                        MaxForce;                                          // 0x64(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        TurnRate;                                          // 0x68(0x4)(ConstParm, ExportObject, Net, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseTargeting : 1;                                 // Mask: 0x1, PropSize: 0x10x6C(0x1)(ConstParm, Net, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bHasReachedTarget : 1;                             // Mask: 0x2, PropSize: 0x10x6C(0x1)(ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsAlive : 1;                                      // Mask: 0x4, PropSize: 0x10x6C(0x1)(Edit, ConstParm, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3F0 : 5;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_50C4[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        SpiralTime;                                        // 0x70(0x4)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50C5[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               TargetLocation;                                    // 0x78(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	enum class EBoidType                         Type;                                              // 0x90(0x1)(Edit, BlueprintReadOnly, Net, Parm, Transient, Config)
	uint8                                        Pad_50C6[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x38 (0x38 - 0x0)
// ScriptStruct ShooterGame.FogOfWarInfoStruct
struct FFogOfWarInfoStruct
{
public:
	class FString                                MapName;                                           // 0x0(0x10)(Edit, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<uint8>                                CompressedVisibilityBuffer;                        // 0x10(0x10)(Edit, ConstParm, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint32                                       UnCompressedVisibilityBufferSize;                  // 0x20(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50C8[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<bool>                                 UnlockMask;                                        // 0x28(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct ShooterGame.FloorSlopeData
struct FFloorSlopeData
{
public:
	struct FVector                               Location;                                          // 0x0(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor)
	struct FVector                               SlopeDir;                                          // 0x18(0x18)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x68 (0x68 - 0x0)
// ScriptStruct ShooterGame.SlideData
struct FSlideData
{
public:
	TWeakObjectPtr<class USplineComponent>       SplineComponent;                                   // 0x0(0x8)(ConstParm, Net, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, GlobalConfig)
	class UParticleSystemComponent*              Emitter;                                           // 0x8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor)
	float                                        CurTime;                                           // 0x10(0x4)(Edit, ConstParm, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        Duration;                                          // 0x14(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, GlobalConfig, DuplicateTransient)
	TArray<struct FVector>                       Points;                                            // 0x18(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, SubobjectReference)
	TArray<struct FVector>                       Tangents;                                          // 0x28(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               Location;                                          // 0x38(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor)
	struct FVector                               Tangent;                                           // 0x50(0x18)(ConstParm, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst)
};

// 0x1C (0x1C - 0x0)
// ScriptStruct ShooterGame.DinoClassCount
struct FDinoClassCount
{
public:
	int32                                        NumberofTamedClass;                                // 0x0(0x4)(ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        NumberofTamedBabyClass;                            // 0x4(0x4)(ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        NumberofTamedFemalesClass;                         // 0x8(0x4)(ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        NumberofWildClass;                                 // 0xC(0x4)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        NumberofWildBabyClass;                             // 0x10(0x4)(ConstParm, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        NumberofWildFemalesClass;                          // 0x14(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        NumberofWildLatentSpawns;                          // 0x18(0x4)(ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct ShooterGame.HordeCrateNPCGroup
struct FHordeCrateNPCGroup
{
public:
	TArray<class UClass*>                        NPCClasses;                                        // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<TSoftClassPtr<class APrimalDinoCharacter>> NPCAssets;                                         // 0x10(0x10)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<float>                                NPCWeights;                                        // 0x20(0x10)(ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<int32>                                MinLevels;                                         // 0x30(0x10)(ConstParm, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<int32>                                MaxLevels;                                         // 0x40(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x60 (0x60 - 0x0)
// ScriptStruct ShooterGame.HordeCrateWave
struct FHordeCrateWave
{
public:
	int32                                        MinNumOfNPCs;                                      // 0x0(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        MaxNumOfNPCs;                                      // 0x4(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        TimeToPrepareForWave;                              // 0x8(0x4)(Edit, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50CC[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FHordeCrateNPCGroup                   NPCsToSpawn;                                       // 0x10(0x50)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0xB0 (0xB0 - 0x0)
// ScriptStruct ShooterGame.HordeCrateDifficultyLevel
struct FHordeCrateDifficultyLevel
{
public:
	bool                                         bEnabled;                                          // 0x0(0x1)(Edit, ConstParm, Parm, ZeroConstructor, Transient, EditConst, GlobalConfig)
	uint8                                        Pad_50CE[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        MaxNumOfEventsForDifficulty;                       // 0x4(0x4)(Edit, BlueprintVisible, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        DifficultyLevel;                                   // 0x8(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        MinNPCsToStart;                                    // 0xC(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        MaxNPCsToStart;                                    // 0x10(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50CF[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FHordeCrateNPCGroup                   StartingNPCs;                                      // 0x18(0x50)(Edit, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FHordeCrateWave>               NPCWavesToComplete;                                // 0x68(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MinTimeBeforeSelfDestruct;                         // 0x78(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MaxTimeBeforeSelfDestruct;                         // 0x7C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UClass*                                ActorTemplate;                                     // 0x80(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MinQualityMultiplier;                              // 0x88(0x4)(BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MaxQualityMultiplier;                              // 0x8C(0x4)(Edit, Net, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        MinAmtRewardItems;                                 // 0x90(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        MaxAmtRewardItems;                                 // 0x94(0x4)(Edit, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FLinearColor                          DifficultyColor;                                   // 0x98(0x10)(BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MainNodeElementPct;                                // 0xA8(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50D0[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x20 (0x20 - 0x0)
// ScriptStruct ShooterGame.HordeCrateEvent
struct FHordeCrateEvent
{
public:
	double                                       EventStartTime;                                    // 0x0(0x8)(BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TWeakObjectPtr<class AActor>                 HordeSpawnNetwork;                                 // 0x8(0x8)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TWeakObjectPtr<class AActor>                 HordeModeCrate;                                    // 0x10(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bHasBeenInitiated;                                 // 0x18(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        EventType;                                         // 0x19(0x1)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_50D1[0x6];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0x8 - 0x0)
// ScriptStruct ShooterGame.PropertyThunkWrapper
struct FPropertyThunkWrapper
{
public:
	uint8                                        Pad_50D2[0x8];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x48 (0x48 - 0x0)
// ScriptStruct ShooterGame.LeaderboardRow
struct FLeaderboardRow
{
public:
	class FName                                  MissionTag;                                        // 0x0(0x8)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                PlayerNetId;                                       // 0x8(0x10)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        TribeID;                                           // 0x18(0x4)(Edit, BlueprintReadOnly, Net, Parm, ZeroConstructor, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50D3[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       TimestampUtc;                                      // 0x20(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        FloatValue;                                        // 0x28(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	int32                                        IntValue;                                          // 0x2C(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FName                                  NameValue;                                         // 0x30(0x8)(Edit, ConstParm, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                StringValue;                                       // 0x38(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct ShooterGame.LeaderboardEntry
struct FLeaderboardEntry
{
public:
	class FName                                  MissionTag;                                        // 0x0(0x8)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FLeaderboardRow>               Rows;                                              // 0x8(0x10)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct ShooterGame.LeaderboardsContainer
struct FLeaderboardsContainer
{
public:
	TArray<struct FLeaderboardEntry>             Leaderboards;                                      // 0x0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x70 (0x70 - 0x0)
// ScriptStruct ShooterGame.LeaderboardColumnDefinition
struct FLeaderboardColumnDefinition
{
public:
	float                                        WidthPercent;                                      // 0x0(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FMargin                               ColumnPadding;                                     // 0x4(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50D4[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FSlateFontInfo                        Font;                                              // 0x18(0x58)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance)
};

// 0x78 (0x78 - 0x0)
// ScriptStruct ShooterGame.MapData
struct FMapData
{
public:
	class FString                                MapName;                                           // 0x0(0x10)(Edit, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UTexture2D*                            MapTexture;                                        // 0x10(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               OriginMax;                                         // 0x18(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               OriginMin;                                         // 0x30(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               PlayableMax;                                       // 0x48(0x18)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               PlayableMin;                                       // 0x60(0x18)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct ShooterGame.Int32Array
struct FInt32Array
{
public:
	TArray<int32>                                Array;                                             // 0x0(0x10)(ExportObject, Parm, OutParm, ZeroConstructor)
};

// 0xC (0xC - 0x0)
// ScriptStruct ShooterGame.MetaTagIDInfo
struct FMetaTagIDInfo
{
public:
	int32                                        MetaTagEnumIndex;                                  // 0x0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FName                                  MetaTagDisplayName;                                // 0x4(0x8)(Edit, BlueprintVisible, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0xB0 (0xB0 - 0x0)
// ScriptStruct ShooterGame.MissionWorldIndicator
struct FMissionWorldIndicator
{
public:
	class FName                                  DescriptionTagString;                              // 0x0(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UTexture2D*                            Icon;                                              // 0x8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst)
	class UClass*                                ItemType;                                          // 0x10(0x8)(BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Config, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               WorldPosition;                                     // 0x18(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Config, EditConst, GlobalConfig)
	class AActor*                                TargetActor;                                       // 0x30(0x8)(BlueprintVisible, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        Priority;                                          // 0x38(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, SubobjectReference)
	uint8                                        Pad_50D5[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                CustomData;                                        // 0x40(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, Config, EditConst, SubobjectReference)
	uint8                                        bUseTargetActorName : 1;                           // Mask: 0x1, PropSize: 0x10x48(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseTargetActorIcon : 1;                           // Mask: 0x2, PropSize: 0x10x48(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseItemName : 1;                                  // Mask: 0x4, PropSize: 0x10x48(0x1)(Edit, ConstParm, BlueprintVisible, Net, Parm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseItemIcon : 1;                                  // Mask: 0x8, PropSize: 0x10x48(0x1)(Net, Parm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOnlyVisibleOffScreen : 1;                         // Mask: 0x10, PropSize: 0x10x48(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOnlyVisibleOnScreen : 1;                          // Mask: 0x20, PropSize: 0x10x48(0x1)(Edit, ExportObject, Parm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAlwaysVisible : 1;                                // Mask: 0x40, PropSize: 0x10x48(0x1)(Edit, Parm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCompanionIndicator : 1;                           // Mask: 0x80, PropSize: 0x10x48(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bShowDistance : 1;                                 // Mask: 0x1, PropSize: 0x10x49(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3F1 : 7;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_50D6[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          IndicatorColor;                                    // 0x4C(0x10)(ConstParm, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FLinearColor                          IconColor;                                         // 0x5C(0x10)(Net, EditFixedSize, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUsePulseAnimation : 1;                            // Mask: 0x1, PropSize: 0x10x6C(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bShowProgress : 1;                                 // Mask: 0x2, PropSize: 0x10x6C(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3F2 : 6;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_50D7[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        ProgressValue;                                     // 0x70(0x4)(ConstParm, BlueprintVisible, EditFixedSize, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50D8[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                ProgressLabelText;                                 // 0x78(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FLinearColor                          ProgressBarColor;                                  // 0x88(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FLinearColor                          ProgressLabelColor;                                // 0x98(0x10)(Edit, ExportObject, Net, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bShowProgressLabelWhenOffScreen : 1;               // Mask: 0x1, PropSize: 0x10xA8(0x1)(ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50D9[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x40 (0x40 - 0x0)
// ScriptStruct ShooterGame.MissionRelatedActorData
struct FMissionRelatedActorData
{
public:
	class AActor*                                RelatedActor;                                      // 0x0(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FName                                  RelatedActorPropertyName;                          // 0x8(0x8)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	enum class EMissionRelatedPropertyType       RelatedActorPropertyType;                          // 0x10(0x1)(Net, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	enum class EMissionRelatedPropertyUsage      RelatedActorPropertyUsage;                         // 0x11(0x1)(ConstParm, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50DA[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          RelatedActorPropertyTextColor;                     // 0x14(0x10)(ConstParm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FLinearColor                          LocalIndexMatchColorModifier;                      // 0x24(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bUseLocalIndexMatchColorModifier;                  // 0x34(0x1)(ConstParm, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50DB[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        IndexMatchRangeOffset;                             // 0x38(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50DC[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x90 (0x90 - 0x0)
// ScriptStruct ShooterGame.MissionPhaseRequirement
struct FMissionPhaseRequirement
{
public:
	class FName                                  DescriptionStringTag;                              // 0x0(0x8)(ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UClass*                                RelatedType;                                       // 0x8(0x8)(Edit, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseRelatedTypeName : 1;                           // Mask: 0x1, PropSize: 0x10x10(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3F3 : 7;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_50DD[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FMissionRelatedActorData              OptionalRelatedActorData;                          // 0x18(0x40)(Edit, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsComplete : 1;                                   // Mask: 0x1, PropSize: 0x10x58(0x1)(ConstParm, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseCount : 1;                                     // Mask: 0x2, PropSize: 0x10x58(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseProgress : 1;                                  // Mask: 0x4, PropSize: 0x10x58(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAutoCalculateProgressFromCount : 1;               // Mask: 0x8, PropSize: 0x10x58(0x1)(BlueprintVisible, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3F4 : 4;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_50DE[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        CurrentCount;                                      // 0x5C(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        MaxCount;                                          // 0x60(0x4)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        Progress;                                          // 0x64(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class EPhaseRequirementWidgetVisualState PhaseRequirementWidgetVisualState;                 // 0x68(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50DF[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          CustomPhaseRequirementTextColor;                   // 0x6C(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FLinearColor                          CustomPhaseRequirementProgressBarColor;            // 0x7C(0x10)(Edit, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50E0[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0x8 - 0x0)
// ScriptStruct ShooterGame.TimeRange
struct FTimeRange
{
public:
	float                                        Min;                                               // 0x0(0x4)(ExportObject, Net, ReturnParm, Transient, Config)
	float                                        Max;                                               // 0x4(0x4)(Edit, ConstParm, ExportObject, Net, ReturnParm, Transient, Config)
};

// 0x48 (0x48 - 0x0)
// ScriptStruct ShooterGame.MissionPhase
struct FMissionPhase
{
public:
	class FName                                  Name;                                              // 0x0(0x8)(ConstParm, Net, OutParm)
	class FString                                DisplayText;                                       // 0x8(0x10)(ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bShowInUI : 1;                                     // Mask: 0x1, PropSize: 0x10x18(0x1)(BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBPGetPhaseDisplayText : 1;                     // Mask: 0x2, PropSize: 0x10x18(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseGeneratePhaseRequirements : 1;                 // Mask: 0x4, PropSize: 0x10x18(0x1)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAutoSwitchToNextPhase : 1;                        // Mask: 0x8, PropSize: 0x10x18(0x1)(ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsLastPhase : 1;                                  // Mask: 0x10, PropSize: 0x10x18(0x1)(Edit, ConstParm, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3F5 : 3;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_50E1[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        WaitTimeAfterPhaseCompletes;                       // 0x1C(0x4)(BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FName                                  NextPhaseName;                                     // 0x20(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FTimeRange                            AutoSwitchPhaseAttemptInterval;                    // 0x28(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class USoundBase*                            PhaseStartSound;                                   // 0x30(0x8)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class USoundBase*                            PhaseEndSound;                                     // 0x38(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class USoundBase*                            PhaseMusicLoop;                                    // 0x40(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x4 (0x4 - 0x0)
// ScriptStruct ShooterGame.MissionPhaseData
struct FMissionPhaseData
{
public:
	uint8                                        bPhaseCompleted : 1;                               // Mask: 0x1, PropSize: 0x10x0(0x1)(Edit, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50E2[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x40 (0x40 - 0x0)
// ScriptStruct ShooterGame.TeleportedCharacter
struct FTeleportedCharacter
{
public:
	class APrimalCharacter*                      Character;                                         // 0x0(0x8)(Edit, ConstParm, Net, Parm, DisableEditOnTemplate, Config, GlobalConfig)
	class AController*                           Controller;                                        // 0x8(0x8)(ConstParm, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig)
	struct FVector                               OriginalLocation;                                  // 0x10(0x18)(Edit, ConstParm, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FRotator                              OriginalRotation;                                  // 0x28(0x18)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x58 (0x58 - 0x0)
// ScriptStruct ShooterGame.MissionDinoPath
struct FMissionDinoPath
{
public:
	TWeakObjectPtr<class AActor>                 TargetActor;                                       // 0x0(0x8)(BlueprintVisible, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               CurrentTarget;                                     // 0x8(0x18)(ConstParm, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               LastTarget;                                        // 0x20(0x18)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        CurrentSplineKeyTarget;                            // 0x38(0x4)(BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        LastSplineKeyTarget;                               // 0x3C(0x4)(Edit, BlueprintVisible, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	double                                       LastUpdateTime;                                    // 0x40(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        UpdateInterval;                                    // 0x48(0x4)(ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	TWeakObjectPtr<class USplineComponent>       ForcePathSpline;                                   // 0x4C(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bReverseAtEnd : 1;                                 // Mask: 0x1, PropSize: 0x10x54(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50E3[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// ScriptStruct ShooterGame.CharacterAndControllerPair
struct FCharacterAndControllerPair
{
public:
	class AShooterCharacter*                     Character;                                         // 0x0(0x8)(Edit, ConstParm, Net, Parm, DisableEditOnTemplate, Config, GlobalConfig)
	class AShooterPlayerController*              Controller;                                        // 0x8(0x8)(ConstParm, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct ShooterGame.PlayerItems
struct FPlayerItems
{
public:
	class AShooterCharacter*                     Character;                                         // 0x0(0x8)(Edit, ConstParm, Net, Parm, DisableEditOnTemplate, Config, GlobalConfig)
	TArray<struct FItemNetID>                    ItemIDs;                                           // 0x8(0x10)(ConstParm, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct ShooterGame.TaggedString
struct FTaggedString
{
public:
	class FName                                  Tag;                                               // 0x0(0x8)(Edit, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class FString                                String;                                            // 0x8(0x10)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct ShooterGame.RacePlayerData
struct FRacePlayerData
{
public:
	class AShooterPlayerController*              Controller;                                        // 0x0(0x8)(ConstParm, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, GlobalConfig)
	class AShooterCharacter*                     Character;                                         // 0x8(0x8)(Edit, ConstParm, Net, Parm, DisableEditOnTemplate, Config, GlobalConfig)
	int32                                        TargetCheckpoint;                                  // 0x10(0x4)(EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50E4[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<bool>                                 CheckpointsHit;                                    // 0x18(0x10)(ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<float>                                CheckpointTimes;                                   // 0x28(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0xC (0xC - 0x0)
// ScriptStruct ShooterGame.MissionWorldBuffData
struct FMissionWorldBuffData
{
public:
	class FName                                  WorldBuffIdentifier;                               // 0x0(0x8)(BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        StacksToGive;                                      // 0x8(0x4)(Edit, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x58 (0x58 - 0x0)
// ScriptStruct ShooterGame.MountedDLCInfo
struct FMountedDLCInfo
{
public:
	class FString                                Name;                                              // 0x0(0x10)(ConstParm, Net, OutParm)
	class FString                                Path;                                              // 0x10(0x10)(BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, EditConst, GlobalConfig)
	class FString                                ID;                                                // 0x20(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor)
	class FString                                ProductId;                                         // 0x30(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAutoMount : 1;                                    // Mask: 0x1, PropSize: 0x10x40(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3F6 : 7;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_50E5[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                StoreProductIdOverride;                            // 0x48(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct ShooterGame.MountedDLCMapInfo
struct FMountedDLCMapInfo
{
public:
	class FString                                ID;                                                // 0x0(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor)
	class FString                                Map;                                               // 0x10(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct ShooterGame.Struct_MissionModule_Travel
struct FStruct_MissionModule_Travel
{
public:
	class FString                                RequirementsTitle;                                 // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FName                                  RequirementsMessage;                               // 0x10(0x8)(ConstParm, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        DelayAfterModule;                                  // 0x18(0x4)(Edit, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        DelayBeforeModule;                                 // 0x1C(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FName                                  TriggerKeyOfPointToGoTo;                           // 0x20(0x8)(ConstParm, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        DistanceFromPointToHideIcon;                       // 0x28(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FName                                  NavPointLabel;                                     // 0x2C(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50E6[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x50 (0x50 - 0x0)
// ScriptStruct ShooterGame.LinkedZoneSpawnVolumeEntry
struct FLinkedZoneSpawnVolumeEntry
{
public:
	class ANPCZoneSpawnVolume*                   LinkedZoneSpawnVolume;                             // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<class AActor*>                        ZoneSpawnVolumeFloors;                             // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<class AActor*>                        ZoneSpawnVolumeIgnoreCeilings;                     // 0x18(0x10)(BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<class FName>                          ZoneSpawnVolumeIgnoreCeilingTags;                  // 0x28(0x10)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<class FName>                          ZoneSpawnVolumeFloorTags;                          // 0x38(0x10)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        EntryWeight;                                       // 0x48(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50E7[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x38 (0x38 - 0x0)
// ScriptStruct ShooterGame.HibernationCountInfo
struct FHibernationCountInfo
{
public:
	TSoftClassPtr<class APrimalDinoCharacter>    ClassType;                                         // 0x0(0x30)(BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        Count;                                             // 0x30(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst)
	uint8                                        Pad_50E8[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x60 (0x60 - 0x0)
// ScriptStruct ShooterGame.OceanDinoSpawnEntry
struct FOceanDinoSpawnEntry
{
public:
	class FString                                EntryFriendlyName;                                 // 0x0(0x10)(ConstParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TSoftClassPtr<class APrimalDinoCharacter>    SpawnDinoClass;                                    // 0x10(0x30)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        SpawnDinoWeight;                                   // 0x40(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        EntrySpawnDistanceMultiplier;                      // 0x44(0x4)(ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        SpawnZOffset;                                      // 0x48(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MinimumDepthFromWaterSurface;                      // 0x4C(0x4)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MaxSpawnZ;                                         // 0x50(0x4)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        NetworkAndStasisRangeMultiplier;                   // 0x54(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MinimumAllowedFreeDepthForSpawn;                   // 0x58(0x4)(BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        OverrideMaxValidSpawnPointAttempts;                // 0x5C(0x4)(ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct ShooterGame.OceanDinoDepthEntry
struct FOceanDinoDepthEntry
{
public:
	TArray<struct FOceanDinoSpawnEntry>          OceanDinoSpawnEntries;                             // 0x0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                SectionFriendlyName;                               // 0x10(0x10)(BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        StartAtDepthZ;                                     // 0x20(0x4)(BlueprintVisible, ExportObject, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50E9[0x14];                                    // Fixing Size Of Struct > TateDumper <
};

// 0x40 (0x40 - 0x0)
// ScriptStruct ShooterGame.PaintingStreamingJob
struct FPaintingStreamingJob
{
public:
	uint8                                        Pad_50EA[0x40];                                    // Fixing Size Of Struct > TateDumper <
};

// 0x48 (0x48 - 0x0)
// ScriptStruct ShooterGame.BPForces
struct FBPForces
{
public:
	struct FVector                               Location;                                          // 0x0(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor)
	struct FVector                               Force;                                             // 0x18(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	class FName                                  ForceName;                                         // 0x30(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAtCenterOfGravity : 1;                            // Mask: 0x1, PropSize: 0x10x38(0x1)(BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3F7 : 7;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_50EB[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  CustomSocketName;                                  // 0x3C(0x8)(Edit, ConstParm, ExportObject, Net, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50EC[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// ScriptStruct ShooterGame.AssetRetainer
struct FAssetRetainer
{
public:
	class UObject*                               HardReference;                                     // 0x0(0x8)(Edit, ExportObject, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        TimeLeft;                                          // 0x8(0x4)(BlueprintVisible, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50ED[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0xC (0xC - 0x0)
// ScriptStruct ShooterGame.MaxStatScaler
struct FMaxStatScaler
{
public:
	enum class EPrimalCharacterStatusValue       LevelUpValueType;                                  // 0x0(0x1)(Edit, ConstParm, Net, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50EE[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TargetValue;                                       // 0x4(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         TargetValueIsPercent;                              // 0x8(0x1)(Edit, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50EF[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x48 (0x48 - 0x0)
// ScriptStruct ShooterGame.PostProcessMaterialAdjuster
struct FPostProcessMaterialAdjuster
{
public:
	class UMaterialInterface*                    PostProcessParentMaterial;                         // 0x0(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<class FName>                          ScalarParameterNames;                              // 0x8(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<float>                                ScalarParameterValues;                             // 0x18(0x10)(Edit, ConstParm, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<class FName>                          VectorParameterNames;                              // 0x28(0x10)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FVector>                       VectorParameterValues;                             // 0x38(0x10)(BlueprintVisible, ExportObject, Net, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x48 (0x48 - 0x0)
// ScriptStruct ShooterGame.BuffMPCAdjuster
struct FBuffMPCAdjuster
{
public:
	class UMaterialParameterCollection*          MPC;                                               // 0x0(0x8)(ExportObject, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<class FName>                          ScalarParameterNames;                              // 0x8(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<float>                                ScalarParameterValues;                             // 0x18(0x10)(Edit, ConstParm, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<class FName>                          VectorParameterNames;                              // 0x28(0x10)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FVector>                       VectorParameterValues;                             // 0x38(0x10)(BlueprintVisible, ExportObject, Net, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct ShooterGame.SerializedMissionData
struct FSerializedMissionData
{
public:
	class FName                                  MissionTag;                                        // 0x0(0x8)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                SerializedData;                                    // 0x8(0x10)(Edit, ConstParm, ExportObject, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x100 (0x100 - 0x0)
// ScriptStruct ShooterGame.CompanionEventSegmentData
struct FCompanionEventSegmentData
{
public:
	float                                        SegmentDuration;                                   // 0x0(0x4)(Edit, ConstParm, BlueprintVisible, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50F0[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FCompanionReactionData                SegmentCompanionReaction;                          // 0x8(0xB0)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bMoveCompanionToLocation : 1;                      // Mask: 0x1, PropSize: 0x10xB8(0x1)(Edit, BlueprintVisible, ExportObject, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bMakeCompanionLookAtSomething : 1;                 // Mask: 0x2, PropSize: 0x10xB8(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3F8 : 6;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_50F1[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               MoveCompanionToLocationOffset;                     // 0xC0(0x18)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class AActor*                                MakeCompanionLookAtActor;                          // 0xD8(0x8)(Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               MakeCompanionLookAtLocation;                       // 0xE0(0x18)(Edit, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        CompanionLocationInterpSpeed;                      // 0xF8(0x4)(ConstParm, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        CompanionRotationInterpSpeed;                      // 0xFC(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct ShooterGame.CompanionEventData
struct FCompanionEventData
{
public:
	uint8                                        EventType;                                         // 0x0(0x1)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_50F2[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                EventTitle;                                        // 0x8(0x10)(Edit, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FCompanionEventSegmentData>    EventSegmentArray;                                 // 0x18(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        EventTotalDuration;                                // 0x28(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50F3[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       EventStartTime;                                    // 0x30(0x8)(BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        CurrentSegmentIndex;                               // 0x38(0x4)(ConstParm, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50F4[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LastSegmentStartTime;                              // 0x40(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	double                                       EventEndTime;                                      // 0x48(0x8)(BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct ShooterGame.GrappleAnchor
struct FGrappleAnchor
{
public:
	struct FVector                               AnchorWorldLocation;                               // 0x0(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class USceneComponent*                       AnchoredComponent;                                 // 0x18(0x8)(Edit, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        AnchoredItemIndex;                                 // 0x20(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50F5[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                AnchoredBoneName;                                  // 0x28(0x10)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               AnchorRelativeOffset;                              // 0x38(0x18)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x1B8 (0x1B8 - 0x0)
// ScriptStruct ShooterGame.GrappleTether
struct FGrappleTether
{
public:
	class FString                                TetherTag;                                         // 0x0(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FGrappleAnchor                        TetherAnchor_Start;                                // 0x10(0x50)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FGrappleAnchor                        TetherAnchor_End;                                  // 0x60(0x50)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FGrappleAnchor                        TetherAnchor_Visual_Start;                         // 0xB0(0x50)(ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FGrappleAnchor                        TetherAnchor_Visual_End;                           // 0x100(0x50)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class APrimalCharacter*                      GrappledParentPrimalChar;                          // 0x150(0x8)(BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class APrimalCharacter*                      GrappleOwner;                                      // 0x158(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class APrimalBuff_Grappled*                  MasterGrappleBuff;                                 // 0x160(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        TetherLifetime;                                    // 0x168(0x4)(Edit, ConstParm, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50F6[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       TetherCreationTime;                                // 0x170(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50F7[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        bAnyoneCanControl : 1;                             // Mask: 0x1, PropSize: 0x10x180(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseVisualAnchor_Start : 1;                        // Mask: 0x2, PropSize: 0x10x180(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseVisualAnchor_End : 1;                          // Mask: 0x4, PropSize: 0x10x180(0x1)(ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bTetherBroken : 1;                                 // Mask: 0x8, PropSize: 0x10x180(0x1)(Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3F9 : 4;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_50F8[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LastAboveBreakDistPastTetherLengthTime;            // 0x188(0x8)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        TetherLength_Current;                              // 0x190(0x4)(Edit, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50F9[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               DirFromOwner_Current;                              // 0x198(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        DistToOwner_Current;                               // 0x1B0(0x4)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        OwnerDistFromTetherLimit_Current;                  // 0x1B4(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x178 (0x178 - 0x0)
// ScriptStruct ShooterGame.ReplicatedGrappleTetherData
struct FReplicatedGrappleTetherData
{
public:
	class FString                                Rep_TetherTag;                                     // 0x0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FGrappleAnchor                        Rep_TetherAnchor_Start;                            // 0x10(0x50)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FGrappleAnchor                        Rep_TetherAnchor_End;                              // 0x60(0x50)(ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FGrappleAnchor                        Rep_TetherAnchor_Visual_Start;                     // 0xB0(0x50)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FGrappleAnchor                        Rep_TetherAnchor_Visual_End;                       // 0x100(0x50)(Edit, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class APrimalBuff_Grappled*                  Rep_MasterGrappledBuff;                            // 0x150(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        Rep_TetherLifetime;                                // 0x158(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50FA[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       Rep_TetherCreationTime;                            // 0x160(0x8)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Rep_bUseVisualAnchor_Start : 1;                    // Mask: 0x1, PropSize: 0x10x168(0x1)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Rep_bUseVisualAnchor_End : 1;                      // Mask: 0x2, PropSize: 0x10x168(0x1)(BlueprintVisible, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3FA : 6;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_50FB[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        Rep_TetherLength;                                  // 0x16C(0x4)(Edit, ConstParm, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Rep_bAnyoneCanControl : 1;                         // Mask: 0x1, PropSize: 0x10x170(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Rep_bTetherBroken : 1;                             // Mask: 0x2, PropSize: 0x10x170(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50FC[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x160 (0x160 - 0x0)
// ScriptStruct ShooterGame.CreateGrappleTetherData
struct FCreateGrappleTetherData
{
public:
	class FString                                WithTag;                                           // 0x0(0x10)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FGrappleAnchor                        WithTetherStartAnchor;                             // 0x10(0x50)(Edit, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FGrappleAnchor                        WithTetherEndAnchor;                               // 0x60(0x50)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FGrappleAnchor                        WithTetherVisualStartAnchor;                       // 0xB0(0x50)(Edit, ConstParm, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FGrappleAnchor                        WithTetherVisualEndAnchor;                         // 0x100(0x50)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class APrimalBuff_Grappled*                  WithMasterGrappleBuff;                             // 0x150(0x8)(Edit, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        WithTetherLifetime;                                // 0x158(0x4)(Edit, ConstParm, BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseVisualAnchor_Start : 1;                        // Mask: 0x1, PropSize: 0x10x15C(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseVisualAnchor_End : 1;                          // Mask: 0x2, PropSize: 0x10x15C(0x1)(ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAnyoneCanControl : 1;                             // Mask: 0x4, PropSize: 0x10x15C(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_50FD[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x58 (0x58 - 0x0)
// ScriptStruct ShooterGame.ClientMissionData
struct FClientMissionData
{
public:
	class AMissionType*                          Mission;                                           // 0x0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Config, GlobalConfig)
	TArray<struct FMissionPhaseRequirement>      Requirements;                                      // 0x8(0x10)(BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FMissionPhaseRequirement>      LocalRequirements;                                 // 0x18(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FMissionWorldIndicator>        MissionWorldIndicators;                            // 0x28(0x10)(Edit, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FMissionWorldIndicator>        LocalWorldIndicators;                              // 0x38(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FItemNetInfo>                  Items;                                             // 0x48(0x10)(ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct ShooterGame.MissionEligibilityData
struct FMissionEligibilityData
{
public:
	class UClass*                                MissionType;                                       // 0x0(0x8)(ConstParm, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig)
	class FName                                  IneligibleReasonType;                              // 0x8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	double                                       LastCompletedUtcTime;                              // 0x10(0x8)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsEligible : 1;                                   // Mask: 0x1, PropSize: 0x10x18(0x1)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCompleted : 1;                                    // Mask: 0x2, PropSize: 0x10x18(0x1)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOnGlobalCooldown : 1;                             // Mask: 0x4, PropSize: 0x10x18(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOnPerPlayerCooldown : 1;                          // Mask: 0x8, PropSize: 0x10x18(0x1)(ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3FB : 4;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_50FE[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MissionMaxDurationSeconds;                         // 0x1C(0x4)(BlueprintVisible, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	double                                       MissionStartNetworkTime;                           // 0x20(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct ShooterGame.ClientMissionEligibility
struct FClientMissionEligibility
{
public:
	uint8                                        bIsEligible : 1;                                   // Mask: 0x1, PropSize: 0x10x0(0x1)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCompleted : 1;                                    // Mask: 0x2, PropSize: 0x10x0(0x1)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOnGlobalCooldown : 1;                             // Mask: 0x4, PropSize: 0x10x0(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOnPerPlayerCooldown : 1;                          // Mask: 0x8, PropSize: 0x10x0(0x1)(ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bMinLevelRequirement : 1;                          // Mask: 0x10, PropSize: 0x10x0(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3FC : 3;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_50FF[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LastUpdateNetworkTime;                             // 0x8(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	double                                       LastCompletedUtcTime;                              // 0x10(0x8)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MissionMaxDurationSeconds;                         // 0x18(0x4)(BlueprintVisible, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5100[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       MissionStartNetworkTime;                           // 0x20(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                Reason;                                            // 0x28(0x10)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct ShooterGame.ClientMissionSubscriptionData
struct FClientMissionSubscriptionData
{
public:
	TSoftClassPtr<class AMissionType>            MissionType;                                       // 0x0(0x30)(ConstParm, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig)
	TArray<class FName>                          Keys;                                              // 0x30(0x10)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct ShooterGame.CableParticle
struct FCableParticle
{
public:
	bool                                         bFree;                                             // 0x0(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5101[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               Position;                                          // 0x8(0x18)(Edit, ConstParm, ExportObject, ReturnParm, Transient, Config)
	struct FVector                               OldPosition;                                       // 0x20(0x18)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct ShooterGame.DefaultTextureParamOverride
struct FDefaultTextureParamOverride
{
public:
	class FName                                  TextureParamName;                                  // 0x0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UTexture2D*                            TextureValue;                                      // 0x8(0x8)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x48 (0x48 - 0x0)
// ScriptStruct ShooterGame.PrimalSnapshotPose
struct FPrimalSnapshotPose
{
public:
	class FString                                Name;                                              // 0x0(0x10)(ConstParm, Net, OutParm)
	class UAnimSequence*                         Sequence;                                          // 0x10(0x8)(BlueprintVisible, OutParm, Transient, DisableEditOnInstance, SubobjectReference)
	float                                        Time;                                              // 0x18(0x4)(Edit, ConstParm, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	bool                                         Pedestal;                                          // 0x1C(0x1)(Edit, ConstParm, BlueprintVisible, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5102[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                PedestalBone;                                      // 0x20(0x10)(ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               RootOffset;                                        // 0x30(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct ShooterGame.VelocityBasedCharacterSoundInfo
struct FVelocityBasedCharacterSoundInfo
{
public:
	TArray<class USoundBase*>                    Sounds;                                            // 0x0(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector2D                             VelocityRange;                                     // 0x10(0x10)(ConstParm, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bAdjustByCharacterSize;                            // 0x20(0x1)(ConstParm, BlueprintVisible, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5103[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        LowerSize;                                         // 0x24(0x4)(Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        UpperSize;                                         // 0x28(0x4)(ConstParm, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        LowerOffset;                                       // 0x2C(0x4)(Edit, ConstParm, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        UpperOffset;                                       // 0x30(0x4)(BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5104[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x48 (0x48 - 0x0)
// ScriptStruct ShooterGame.PrimalCharacterStatusStateThresholds
struct FPrimalCharacterStatusStateThresholds
{
public:
	TArray<float>                                HighThresholdStatusStateValues;                    // 0x0(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<enum class EPrimalCharacterStatusState> HighThresholdStatusStateType;                      // 0x10(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<float>                                LowThresholdStatusStateValues;                     // 0x20(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<enum class EPrimalCharacterStatusState> LowThresholdStatusStateType;                       // 0x30(0x10)(BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         StatusStateThresholdValuesAbsolute;                // 0x40(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5105[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x28 (0x28 - 0x0)
// ScriptStruct ShooterGame.PrimalCharacterStatusValueModifier
struct FPrimalCharacterStatusValueModifier
{
public:
	uint8                                        Pad_5106[0x28];                                    // Fixing Size Of Struct > TateDumper <
};

// 0x38 (0x38 - 0x0)
// ScriptStruct ShooterGame.CinematicMaterial
struct FCinematicMaterial
{
public:
	class UMaterialInstanceDynamic*              Mid;                                               // 0x0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, GlobalConfig)
	TSoftObjectPtr<class UMaterial>              CinematicMaterial;                                 // 0x8(0x30)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Config)
};

// 0x1C (0x1C - 0x0)
// ScriptStruct ShooterGame.ClimbingTypeSettings
struct FClimbingTypeSettings
{
public:
	uint8                                        bIsOneShot : 1;                                    // Mask: 0x1, PropSize: 0x10x0(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3FD : 7;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_5107[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        WaitTime;                                          // 0x4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        StaminaConsumption;                                // 0x8(0x4)(Edit, BlueprintVisible, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        ConsumeDurabilityMultiplier;                       // 0xC(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AttachMoveTraceDistance;                           // 0x10(0x4)(Edit, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AttachBackTraceDistance;                           // 0x14(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AttachForwardTraceDistance;                        // 0x18(0x4)(ConstParm, BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x70 (0x70 - 0x0)
// ScriptStruct ShooterGame.ClimbingTransitionParams
struct FClimbingTransitionParams
{
public:
	float                                        LocationInterpSpeed;                               // 0x0(0x4)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        RotationInterpSpeed;                               // 0x4(0x4)(Edit, ConstParm, BlueprintVisible, Parm, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	float                                        OvershootDuration;                                 // 0x8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        OvershootCurveExp;                                 // 0xC(0x4)(Edit, BlueprintVisible, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        OvershootCurveStartOffset;                         // 0x10(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        OvershootCurveDirectionBias;                       // 0x14(0x4)(ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        OvershootCurveStartBias;                           // 0x18(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        OvershootCurveEndOffset;                           // 0x1C(0x4)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        OvershootCurveEndBias;                             // 0x20(0x4)(ConstParm, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        CameraLocationInterpSpeed;                         // 0x24(0x4)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        CameraRotationInterpSpeed;                         // 0x28(0x4)(ConstParm, BlueprintVisible, Net, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bCameraSwitch;                                     // 0x2C(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5108[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CameraTransitionDuration;                          // 0x30(0x4)(Edit, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5109[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               CameraSwitchStrength;                              // 0x38(0x18)(ConstParm, BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        CameraSwitchLocationInterpSpeed;                   // 0x50(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        CameraSwitchRotationInterpSpeed;                   // 0x54(0x4)(BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FRotator                              CameraSwitchOffset;                                // 0x58(0x18)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x60 (0x60 - 0x0)
// ScriptStruct ShooterGame.ColorSetDefinition
struct FColorSetDefinition
{
public:
	class FString                                RegionName;                                        // 0x0(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<class FName>                          ColorEntryNames;                                   // 0x10(0x10)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<float>                                RandomWeights;                                     // 0x20(0x10)(Edit, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<float>                                MinLevel;                                          // 0x30(0x10)(BlueprintVisible, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<float>                                MaxLevel;                                          // 0x40(0x10)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	uint8                                        Pad_510A[0x10];                                    // Fixing Size Of Struct > TateDumper <
};

// 0x40 (0x40 - 0x0)
// ScriptStruct ShooterGame.ARKDinoData
struct FARKDinoData
{
public:
	class UClass*                                DinoClass;                                         // 0x0(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<uint8>                                DinoData;                                          // 0x8(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                DinoNameInMap;                                     // 0x18(0x10)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                DinoName;                                          // 0x28(0x10)(EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bNetInfoFromClient;                                // 0x38(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_510B[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// ScriptStruct ShooterGame.HibernationZoneInfo
struct FHibernationZoneInfo
{
public:
	class ANPCZoneVolume*                        Volume;                                            // 0x0(0x8)(EditFixedSize, OutParm, ReturnParm, Transient, Config)
	float                                        Weight;                                            // 0x8(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst)
	uint8                                        Pad_510C[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x50 (0x50 - 0x0)
// ScriptStruct ShooterGame.WildFollowerSpawnEntry
struct FWildFollowerSpawnEntry
{
public:
	TArray<float>                                WeightedChancesToAlsoSpawnWildFollowerOnSpawn;     // 0x0(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TSoftClassPtr<class APrimalDinoCharacter>    ClassOverride;                                     // 0x10(0x30)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bDontSpawnAsChild : 1;                             // Mask: 0x1, PropSize: 0x10x40(0x1)(ConstParm, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIgnoreConfigSpawnChanceMultiplier : 1;            // Mask: 0x2, PropSize: 0x10x40(0x1)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIgnoreConfigSpawnCountMultiplier : 1;             // Mask: 0x4, PropSize: 0x10x40(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3FE : 5;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_510D[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        AgeRangeMin;                                       // 0x44(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AgeRangeMax;                                       // 0x48(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_510E[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// ScriptStruct ShooterGame.DinoExtraDefaultItemList
struct FDinoExtraDefaultItemList
{
public:
	int32                                        MinimumDinoLevel;                                  // 0x0(0x4)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        ChanceToGive;                                      // 0x4(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<class UClass*>                        DefaultItemsToGive;                                // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0xC (0xC - 0x0)
// ScriptStruct ShooterGame.DinoBaseLevelWeightEntry
struct FDinoBaseLevelWeightEntry
{
public:
	float                                        EntryWeight;                                       // 0x0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        BaseLevelMinRange;                                 // 0x4(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        BaseLevelMaxRange;                                 // 0x8(0x4)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct ShooterGame.DinoFoodEffectivenessMultipliers
struct FDinoFoodEffectivenessMultipliers
{
public:
	float                                        FoodEffectivenessMultiplier;                       // 0x0(0x4)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        HealthEffectivenessMultiplier;                     // 0x4(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        TorpidityEffectivenessMultiplier;                  // 0x8(0x4)(Edit, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AffinityEffectivenessMultiplier;                   // 0xC(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AffinityOverride;                                  // 0x10(0x4)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        StaminaEffectivenessMultiplier;                    // 0x14(0x4)(Edit, ConstParm, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        FoodItemCategory;                                  // 0x18(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_510F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                FoodItemParent;                                    // 0x20(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        UntamedFoodConsumptionPriority;                    // 0x28(0x4)(ConstParm, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5110[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x40 (0x40 - 0x0)
// ScriptStruct ShooterGame.PrimalSaddleStructure
struct FPrimalSaddleStructure
{
public:
	struct FVector                               DinoRelativeLocation;                              // 0x0(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FRotator                              DinoRelativeRotation;                              // 0x18(0x18)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FName                                  BoneName;                                          // 0x30(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config)
	class APrimalStructure*                      MyStructure;                                       // 0x38(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x150 (0x150 - 0x0)
// ScriptStruct ShooterGame.DinoAttackInfo
struct FDinoAttackInfo
{
public:
	class FName                                  AttackName;                                        // 0x0(0x8)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AttackWeight;                                      // 0x8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AttackRange;                                       // 0xC(0x4)(ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MinAttackRange;                                    // 0x10(0x4)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        ActivateAttackRange;                               // 0x14(0x4)(Edit, BlueprintVisible, Net, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AttackInterval;                                    // 0x18(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bHighQualityAttack : 1;                            // Mask: 0x1, PropSize: 0x10x1C(0x1)(Edit, ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bSkipUntamed : 1;                                  // Mask: 0x2, PropSize: 0x10x1C(0x1)(BlueprintVisible, ExportObject, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bSkipTamed : 1;                                    // Mask: 0x4, PropSize: 0x10x1C(0x1)(ConstParm, BlueprintVisible, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOnlyOnWildDinos : 1;                              // Mask: 0x8, PropSize: 0x10x1C(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventWhenEncumbered : 1;                        // Mask: 0x10, PropSize: 0x10x1C(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bRidingOnlyAllowOnGround : 1;                      // Mask: 0x20, PropSize: 0x10x1C(0x1)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bRidingOnlyAllowWhileFlying : 1;                   // Mask: 0x40, PropSize: 0x10x1C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOnlyUseWithPlayersOrRiders : 1;                   // Mask: 0x80, PropSize: 0x10x1C(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOnlyUseWithPlayers : 1;                           // Mask: 0x1, PropSize: 0x10x1D(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventWhenSwimming : 1;                          // Mask: 0x2, PropSize: 0x10x1D(0x1)(BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventWhenInsufficientStamina : 1;               // Mask: 0x4, PropSize: 0x10x1D(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bSkipOnFlyers : 1;                                 // Mask: 0x8, PropSize: 0x10x1D(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bSkipAI : 1;                                       // Mask: 0x10, PropSize: 0x10x1D(0x1)(ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventOnFemale : 1;                              // Mask: 0x20, PropSize: 0x10x1D(0x1)(Edit, ExportObject, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventOnMale : 1;                                // Mask: 0x40, PropSize: 0x10x1D(0x1)(Edit, Parm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventWhenDinoCarrying : 1;                      // Mask: 0x80, PropSize: 0x10x1D(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBlueprintCanRiderAttack : 1;                   // Mask: 0x1, PropSize: 0x10x1E(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bRequiresWalking : 1;                              // Mask: 0x2, PropSize: 0x10x1E(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bRequiresSwimming : 1;                             // Mask: 0x4, PropSize: 0x10x1E(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        AttackStatusStarted : 1;                           // Mask: 0x8, PropSize: 0x10x1E(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAttackStopsMovement : 1;                          // Mask: 0x10, PropSize: 0x10x1E(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAttackStopsMovementAllowFalling : 1;              // Mask: 0x20, PropSize: 0x10x1E(0x1)(Edit, ConstParm, ExportObject, Net, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAttackWithJump : 1;                               // Mask: 0x40, PropSize: 0x10x1E(0x1)(ConstParm, Net, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bLocationBasedAttack : 1;                          // Mask: 0x80, PropSize: 0x10x1E(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bDropCarriedCharacter : 1;                         // Mask: 0x1, PropSize: 0x10x1F(0x1)(Edit, ConstParm, ExportObject, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCancelAndDropIfCarriedCharacter : 1;              // Mask: 0x2, PropSize: 0x10x1F(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventAttackWhileRunning : 1;                    // Mask: 0x4, PropSize: 0x10x1F(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        ForceUpdateInRange : 1;                            // Mask: 0x8, PropSize: 0x10x1F(0x1)(ConstParm, Net, EditFixedSize, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        ForceUpdateMeshSelf : 1;                           // Mask: 0x10, PropSize: 0x10x1F(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseSecondaryAnimationInAir : 1;                   // Mask: 0x20, PropSize: 0x10x1F(0x1)(ExportObject, EditFixedSize, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBlueprintCanAttack : 1;                        // Mask: 0x40, PropSize: 0x10x1F(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBlueprintAdjustOutputDamage : 1;               // Mask: 0x80, PropSize: 0x10x1F(0x1)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bDisableRunningWhenAttacking : 1;                  // Mask: 0x1, PropSize: 0x10x20(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bKeepExecutingWhenAcquiringTarget : 1;             // Mask: 0x2, PropSize: 0x10x20(0x1)(ConstParm, ExportObject, Parm, OutParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventWithRider : 1;                             // Mask: 0x4, PropSize: 0x10x20(0x1)(Parm, OutParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAIForceAttackDotProductCheck : 1;                 // Mask: 0x8, PropSize: 0x10x20(0x1)(BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bInstantlyHarvestCorpse : 1;                       // Mask: 0x10, PropSize: 0x10x20(0x1)(Edit, ConstParm, Net, EditFixedSize, OutParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAddPawnVelocityToProjectile : 1;                  // Mask: 0x20, PropSize: 0x10x20(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAttackStopsRotation : 1;                          // Mask: 0x40, PropSize: 0x10x20(0x1)(Edit, ExportObject, EditFixedSize, OutParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bTamedAISpecialAttack : 1;                         // Mask: 0x80, PropSize: 0x10x20(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventWhenCarryingExplosive : 1;                 // Mask: 0x1, PropSize: 0x10x21(0x1)(Edit, BlueprintVisible, ExportObject, Net, OutParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAllowWhenAnimationPreventsInput : 1;              // Mask: 0x2, PropSize: 0x10x21(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bRequireLineOfSight : 1;                           // Mask: 0x4, PropSize: 0x10x21(0x1)(Edit, BlueprintReadOnly, OutParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseBPOverrideGetAttackAnimationIndex : 1;         // Mask: 0x8, PropSize: 0x10x21(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseSecondaryAnimationWhenSwimming : 1;            // Mask: 0x10, PropSize: 0x10x21(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseTertiaryAnimationWhenSwimming : 1;             // Mask: 0x20, PropSize: 0x10x21(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bHighQualityAttackOnlyPlayerOrTamed : 1;           // Mask: 0x40, PropSize: 0x10x21(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bMeleeTraceForHitBlockers : 1;                     // Mask: 0x80, PropSize: 0x10x21(0x1)(ExportObject, BlueprintReadOnly, Net, Parm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bMeleeTraceForHitBlockersAddHeadsocket : 1;        // Mask: 0x1, PropSize: 0x10x22(0x1)(BlueprintVisible, Net, Parm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3FF : 7;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_5111[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        bIgnoreCrouchAttack : 1;                           // Mask: 0x1, PropSize: 0x10x24(0x1)(Edit, ExportObject, BlueprintReadOnly, Parm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIgnoreResettingAttackIndexInTick : 1;             // Mask: 0x2, PropSize: 0x10x24(0x1)(Edit, ConstParm, BlueprintVisible, Parm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventSkippingAnimGraphDuringAttack : 1;         // Mask: 0x4, PropSize: 0x10x24(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_400 : 5;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_5112[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<int32>                                ChildStateIndexes;                                 // 0x28(0x10)(Edit, ExportObject, Net, EditFixedSize, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AttackWithJumpChance;                              // 0x38(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5113[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LastAttackTime;                                    // 0x40(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	double                                       RiderLastAttackTime;                               // 0x48(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AttackSelectionExpirationTime;                     // 0x50(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5114[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       AttackSelectionTime;                               // 0x58(0x8)(BlueprintReadOnly, Net, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AttackRotationRangeDegrees;                        // 0x60(0x4)(ConstParm, Net, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AttackRotationGroundSpeedMultiplier;               // 0x64(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FRotator                              AttackRotationRate;                                // 0x68(0x18)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<class FName>                          MeleeSwingSockets;                                 // 0x80(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FName                                  RangedSocket;                                      // 0x90(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        MeleeDamageAmount;                                 // 0x98(0x4)(Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MeleeDamageImpulse;                                // 0x9C(0x4)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MeleeSwingRadius;                                  // 0xA0(0x4)(Edit, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5115[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                MeleeDamageType;                                   // 0xA8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AttackOffset;                                      // 0xB0(0x4)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        StaminaCost;                                       // 0xB4(0x4)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        RiderAttackInterval;                               // 0xB8(0x4)(ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        DotProductCheckMin;                                // 0xBC(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        DotProductCheckMax;                                // 0xC0(0x4)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5116[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class UAnimMontage*>                  AttackAnimations;                                  // 0xC8(0x10)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<float>                                AttackAnimationWeights;                            // 0xD8(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<float>                                AttackAnimationsTimeFromEndToConsiderFinished;     // 0xE8(0x10)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UClass*                                ProjectileClass;                                   // 0xF8(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UClass*                                AttackStateTypeClass;                              // 0x100(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        AttackRunningSpeedModifier;                        // 0x108(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        SwimmingAttackRunningSpeedModifier;                // 0x10C(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        SetAttackTargetTime;                               // 0x110(0x4)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5117[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UPrimalAIState*                        AttackStateType;                                   // 0x118(0x8)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FVector>                       LastSocketPositions;                               // 0x120(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	double                                       LastProjectileSpawnTime;                           // 0x130(0x8)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<class FName>                          AttackAnimDamageImpactFXSocketNames;               // 0x138(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseClosestSocketsForDamageImpactFX : 1;           // Mask: 0x1, PropSize: 0x10x148(0x1)(ConstParm, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bDisableAttackerDamageImpactFX : 1;                // Mask: 0x2, PropSize: 0x10x148(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5118[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x20 (0x20 - 0x0)
// ScriptStruct ShooterGame.DinoSaddleStruct
struct FDinoSaddleStruct
{
public:
	class USkeletalMeshComponent*                Saddle;                                            // 0x0(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class USkeletalMesh*                         SkeletalMesh;                                      // 0x8(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, GlobalConfig)
	struct FItemNetID                            ItemID;                                            // 0x10(0x8)(ConstParm, BlueprintReadOnly, Parm, ReturnParm, Transient, DisableEditOnInstance)
	bool                                         bJustRemoved;                                      // 0x18(0x1)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5119[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// ScriptStruct ShooterGame.EngramEntries
struct FEngramEntries
{
public:
	TArray<class UClass*>                        EngramEntries;                                     // 0x0(0x10)(ConstParm, BlueprintVisible, Net, Parm, OutParm, Config)
};

// 0x90 (0x90 - 0x0)
// ScriptStruct ShooterGame.CustomCosmeticModObjectSkinEntry
struct FCustomCosmeticModObjectSkinEntry
{
public:
	class FString                                CustomCosmeticSkinDescriptiveName;                 // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        CosmeticID;                                        // 0x10(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_511A[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<TSoftClassPtr<class UObject>>         ApplyToClasses;                                    // 0x18(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TSoftClassPtr<class UPrimalItem>             ModSkinItem;                                       // 0x28(0x30)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TSoftClassPtr<class APrimalStructure>        ModSkinStructure;                                  // 0x58(0x30)(BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bCosmeticApplyAsItemSkin;                          // 0x88(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_511B[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x28 (0x28 - 0x0)
// ScriptStruct ShooterGame.CustomCosmeticModSkin
struct FCustomCosmeticModSkin
{
public:
	int64                                        ModId;                                             // 0x0(0x8)(ConstParm, Net, Parm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	class FString                                ModSkinName;                                       // 0x8(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FCustomCosmeticModObjectSkinEntry> ObjectSkinEntries;                                 // 0x18(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x68 (0x68 - 0x0)
// ScriptStruct ShooterGame.HairStyleDefinitionMeshAnimbpPair
struct FHairStyleDefinitionMeshAnimbpPair
{
public:
	TSoftObjectPtr<class USkeletalMesh>          HairMesh;                                          // 0x0(0x30)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UClass*                                AnimBlueprint;                                     // 0x30(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig)
	TSoftObjectPtr<class UTexture2D>             PlayerMeshTextureMask;                             // 0x38(0x30)(Edit, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0xB8 (0xB8 - 0x0)
// ScriptStruct ShooterGame.HairStyleDefinition
struct FHairStyleDefinition
{
public:
	bool                                         bIsHairStyleLocked;                                // 0x0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bUseTallHairOffsetCamera;                          // 0x1(0x1)(ExportObject, Net, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_511C[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  UnlockHairStyleName;                               // 0x4(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_511D[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                HairStyleName;                                     // 0x10(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FHairStyleDefinitionMeshAnimbpPair> HairMeshesMale;                                    // 0x20(0x10)(Edit, BlueprintVisible, ExportObject, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MaleBeginHairMorphTargetRange;                     // 0x30(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_511E[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FHairStyleDefinitionMeshAnimbpPair> HairMeshesFemale;                                  // 0x38(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TSoftObjectPtr<class UMaterialInterface>     FemaleHairOverride;                                // 0x48(0x30)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        FemaleBeginHairMorphTargetRange;                   // 0x78(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_511F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UTexture2D*                            HairStylePreviewIconImage;                         // 0x80(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TSoftObjectPtr<class UTexture2D>             FemaleOverrideHairStylePreviewIconImage;           // 0x88(0x30)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct ShooterGame.MusicTrackEntry
struct FMusicTrackEntry
{
public:
	class FString                                Name;                                              // 0x0(0x10)(ConstParm, Net, OutParm)
	class FString                                Description;                                       // 0x10(0x10)(BlueprintVisible, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig)
	class UTexture2D*                            DisplayIcon;                                       // 0x20(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class USoundWave*                            Music;                                             // 0x28(0x8)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, DuplicateTransient)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct ShooterGame.DinoAncestorsEntryBlueprint
struct FDinoAncestorsEntryBlueprint
{
public:
	class FString                                MaleName;                                          // 0x0(0x10)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	int32                                        MaleDinoID1;                                       // 0x10(0x4)(Edit, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	int32                                        MaleDinoID2;                                       // 0x14(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FString                                FemaleName;                                        // 0x18(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	int32                                        FemaleDinoID1;                                     // 0x28(0x4)(BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	int32                                        FemaleDinoID2;                                     // 0x2C(0x4)(BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0xC (0xC - 0x0)
// ScriptStruct ShooterGame.PlayerConfigDynamicMaterialVectorNameVectorTypePairs
struct FPlayerConfigDynamicMaterialVectorNameVectorTypePairs
{
public:
	enum class EPlayerConfigDynamicMaterialVectorTypes DynamicMaterialVectorType;                         // 0x0(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5120[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  NameUsedForDynamicMaterialVectorParam;             // 0x4(0x8)(ConstParm, BlueprintVisible, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct ShooterGame.PlayerConfigVoiceCollectionInfo
struct FPlayerConfigVoiceCollectionInfo
{
public:
	class UPrimaryDataAsset*                     VoiceCollectionRef;                                // 0x0(0x8)(BlueprintVisible, ExportObject, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                NameUsedForVoiceCollection;                        // 0x8(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsMasculineCategory : 1;                          // Mask: 0x1, PropSize: 0x10x18(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsFeminineCategory : 1;                           // Mask: 0x2, PropSize: 0x10x18(0x1)(ExportObject, Net, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5121[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0x8 - 0x0)
// ScriptStruct ShooterGame.BoneTypeValueStruct
struct FBoneTypeValueStruct
{
public:
	enum class EBoneModifierType                 BoneModifierType;                                  // 0x0(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5122[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        Value;                                             // 0x4(0x4)(ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct ShooterGame.PlayerDynamicMaterialFloat
struct FPlayerDynamicMaterialFloat
{
public:
	class FName                                  NameUsedForDynamicMaterialByteParam;               // 0x0(0x8)(ExportObject, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MinValue;                                          // 0x8(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	float                                        MaxValue;                                          // 0xC(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	float                                        MinRandomSliderValue;                              // 0x10(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        MaxRandomSliderValue;                              // 0x14(0x4)(ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        DefaultValueMale;                                  // 0x18(0x4)(Edit, ExportObject, Net, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        DefaultValueFemale;                                // 0x1C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct ShooterGame.PlayerDynamicMaterialVector
struct FPlayerDynamicMaterialVector
{
public:
	class FName                                  NameUsedForDynamicMaterialByteParam;               // 0x0(0x8)(ExportObject, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               MinValue;                                          // 0x8(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	struct FVector                               MaxValue;                                          // 0x20(0x18)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
};

// 0xC (0xC - 0x0)
// ScriptStruct ShooterGame.PlayerDynamicMaterialColors
struct FPlayerDynamicMaterialColors
{
public:
	class FName                                  NameUsedForDynamicMaterialByteParam;               // 0x0(0x8)(ExportObject, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FColor                                Value;                                             // 0x8(0x4)(ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config)
};

// 0x60 (0x60 - 0x0)
// ScriptStruct ShooterGame.PlayerBoneBodyPreset
struct FPlayerBoneBodyPreset
{
public:
	class FString                                BodyPresetName;                                    // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UTexture2D*                            BodyPresetPreviewIconImage;                        // 0x10(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FBoneTypeValueStruct>          BoneModifierSliderValues;                          // 0x18(0x10)(ConstParm, BlueprintReadOnly, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<float>                                DynamicMaterialByteFloats;                         // 0x28(0x10)(BlueprintVisible, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FPlayerDynamicMaterialVector>  DynamicMaterialByteVector;                         // 0x38(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FPlayerDynamicMaterialColors>  DynamicMaterialByteColors;                         // 0x48(0x10)(ExportObject, Net, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bMaleOnly : 1;                                     // Mask: 0x1, PropSize: 0x10x58(0x1)(ConstParm, Net, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bFemaleOnly : 1;                                   // Mask: 0x2, PropSize: 0x10x58(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_5123[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// ScriptStruct ShooterGame.NameColorPair
struct FNameColorPair
{
public:
	class FName                                  MaterialParamName;                                 // 0x0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FLinearColor                          Color;                                             // 0x8(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm)
};

// 0xC (0xC - 0x0)
// ScriptStruct ShooterGame.NameScalarPair
struct FNameScalarPair
{
public:
	class FName                                  MaterialParamName;                                 // 0x0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        Value;                                             // 0x8(0x4)(ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct ShooterGame.LocalizedSoundCueEntry
struct FLocalizedSoundCueEntry
{
public:
	class FString                                TwoLetterISOLanguageName;                          // 0x0(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	struct FSoftObjectPath                       LocalizedSoundCue;                                 // 0x10(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x110 (0x110 - 0x0)
// ScriptStruct ShooterGame.ExplorerNoteEntry
struct FExplorerNoteEntry
{
public:
	uint8                                        Pad_5124[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        ExplorerNoteType;                                  // 0x4(0x4)(Edit, EditFixedSize, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsIsland : 1;                                     // Mask: 0x1, PropSize: 0x10x8(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsScorchedEarth : 1;                              // Mask: 0x2, PropSize: 0x10x8(0x1)(ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsAberration : 1;                                 // Mask: 0x4, PropSize: 0x10x8(0x1)(ConstParm, ExportObject, Net, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsExtinction : 1;                                 // Mask: 0x8, PropSize: 0x10x8(0x1)(ConstParm, Net, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsGenesis1 : 1;                                   // Mask: 0x10, PropSize: 0x10x8(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsGenesis2 : 1;                                   // Mask: 0x20, PropSize: 0x10x8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsDossier : 1;                                    // Mask: 0x40, PropSize: 0x10x8(0x1)(ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bDontRequireProximityToChest : 1;                  // Mask: 0x80, PropSize: 0x10x8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUnlockIgnorePopup : 1;                            // Mask: 0x1, PropSize: 0x10x9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUnlockIgnoreSound : 1;                            // Mask: 0x2, PropSize: 0x10x9(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventXPBuff : 1;                                // Mask: 0x4, PropSize: 0x10x9(0x1)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
