#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xB0 (0x790 - 0x6E0)
// Class ShooterGame.CustomCanvasWidget
class UCustomCanvasWidget : public UButton
{
public:
	uint8                                        Pad_1E60[0x48];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bOverrideScreenCanvasProjection;                   // 0x728(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIgnoreParentAlpha;                                // 0x729(0x1)(BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1E62[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnDraggedObject;                                   // 0x730(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1E63[0x50];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCustomCanvasWidget* GetDefaultObj();

};

// 0x148 (0x8D8 - 0x790)
// Class ShooterGame.DataListEntryButton
class UDataListEntryButton : public UCustomCanvasWidget
{
public:
	uint8                                        Pad_1E6A[0x10];                                    // Fixing Size After Last Property  > TateDumper <
	class FString                                DisplayString;                                     // 0x7A0(0x10)(BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	class FString                                AdditionalDisplayString;                           // 0x7B0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  ContextMenuAnchorName;                             // 0x7C0(0x8)(Edit, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UTexture2D*                            ItemIcon;                                          // 0x7C8(0x8)(BlueprintVisible, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          ForegroundColor;                                   // 0x7D0(0x10)(ConstParm, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance)
	bool                                         bUseSelectedBackgroundColor;                       // 0x7E0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1E6D[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          SelectedBackgroundColor;                           // 0x7E4(0x10)(ConstParm, ExportObject, Net, Parm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1E6E[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UTexture2D*                            AltHighlightBGTexture;                             // 0x7F8(0x8)(Edit, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        NameOffset;                                        // 0x800(0x4)(Edit, ConstParm, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bClickable;                                        // 0x804(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bEnabled;                                          // 0x805(0x1)(Edit, ConstParm, Parm, ZeroConstructor, Transient, EditConst, GlobalConfig)
	bool                                         bUseDisplayString;                                 // 0x806(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1E73[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          DisplayStringColor;                                // 0x808(0x10)(Edit, ExportObject, Net, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FVector2D                             DisplayStringOffset;                               // 0x818(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        TextDisplayStringSize;                             // 0x828(0x4)(ConstParm, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1E74[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector2D                             DisplayStringScale;                                // 0x830(0x10)(ExportObject, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisplayStringCenterX;                             // 0x840(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisplayStringCenterY;                             // 0x841(0x1)(BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bSetIndexPlusOneToDisplayString;                   // 0x842(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowClickingWhenNoEntry;                         // 0x843(0x1)(Edit, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1E77[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UFont*                                 DisplayStringFont;                                 // 0x848(0x8)(Edit, ConstParm, BlueprintVisible, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UTexture2D*                            SelectedIcon;                                      // 0x850(0x8)(ConstParm, BlueprintVisible, Net, Parm, DisableEditOnTemplate, Transient, Config, DuplicateTransient)
	struct FLinearColor                          DisabledColor;                                     // 0x858(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          TintColorOverride;                                 // 0x868(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bDataListAutomaticallyOverrideText : 1;            // Mask: 0x1, PropSize: 0x10x878(0x1)(Edit, ConstParm, Net, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bDataListAutomaticallyOverrideEnabled : 1;         // Mask: 0x2, PropSize: 0x10x878(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bWrapText : 1;                                     // Mask: 0x4, PropSize: 0x10x878(0x1)(Edit, ExportObject, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseDataProviderCustomColor : 1;                   // Mask: 0x8, PropSize: 0x10x878(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bOverrideTintColor : 1;                            // Mask: 0x10, PropSize: 0x10x878(0x1)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bShowDisplayStringWhenHasItem : 1;                 // Mask: 0x20, PropSize: 0x10x878(0x1)(Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseCustomTextColor : 1;                           // Mask: 0x40, PropSize: 0x10x878(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bSelected : 1;                                     // Mask: 0x80, PropSize: 0x10x878(0x1)(BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bForceDraggingDisabled : 1;                        // Mask: 0x1, PropSize: 0x10x879(0x1)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bDraggable : 1;                                    // Mask: 0x2, PropSize: 0x10x879(0x1)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_E8 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bAllowExtraIcon : 1;                               // Mask: 0x10, PropSize: 0x10x879(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bToggleButton : 1;                                 // Mask: 0x20, PropSize: 0x10x879(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_E9 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1E89[0x16];                                    // Fixing Size After Last Property  > TateDumper <
	class UTexture2D*                            OverrideDisabledIcon;                              // 0x890(0x8)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FVector2D                             WrappedTextSpacingAdjust;                          // 0x898(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1E8D[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FColor                                OverridenTextColor;                                // 0x8B0(0x4)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bHasEngram;                                        // 0x8B4(0x1)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bKnownEngram;                                      // 0x8B5(0x1)(Edit, ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bOverrideStlye;                                    // 0x8B6(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1E8F[0x11];                                    // Fixing Size After Last Property  > TateDumper <
	class UMaterialInstanceDynamic*              MyIconMat;                                         // 0x8C8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UMenuAnchor*                           ContextMenuAnchor;                                 // 0x8D0(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UDataListEntryButton* GetDefaultObj();

	class UWidget* OnGetContextMenuContent();
	class FString GetStringValue();
	class FString GetOverridenStringValue();
	void ClickedSecondaryButton(class UWidget** ClickedWidget);
	void ClickedButton(class UWidget** ClickedWidget);
};

// 0x58 (0x930 - 0x8D8)
// Class ShooterGame.AdminPlayerInfoEntryButton
class UAdminPlayerInfoEntryButton : public UDataListEntryButton
{
public:
	uint8                                        bIsCustom : 1;                                     // Mask: 0x1, PropSize: 0x10x8D8(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_EB : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1E9A[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                PlayerName;                                        // 0x8E0(0x10)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, SubobjectReference)
	class FString                                SteamPlayerName;                                   // 0x8F0(0x10)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                LinkedPlayerID;                                    // 0x900(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bCenterDisplayName;                                // 0x910(0x1)(BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1EA1[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          DisplayStringSelectedColor;                        // 0x914(0x10)(ConstParm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1EA2[0xC];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAdminPlayerInfoEntryButton* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class ShooterGame.AhoCorasickMatch
class UAhoCorasickMatch : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAhoCorasickMatch* GetDefaultObj();

	TArray<struct FIntArray> SearchWords(struct FAhoCorasickMatcher* Matcher, bool* bFilterOverlaps, bool* bGetShortest);
	void AddWords(TArray<class FString>* WordList, struct FAhoCorasickMatcher* Matcher);
};

// 0x20 (0x4E0 - 0x4C0)
// Class ShooterGame.AIAttackCoordinator
class AAIAttackCoordinator : public AActor
{
public:
	int32                                        MaxAttackersPerTarget;                             // 0x4C0(0x4)(ConstParm, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        UpdateInterval;                                    // 0x4C4(0x4)(ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	TArray<TWeakObjectPtr<class APrimalDinoAIController>> Attackers;                                         // 0x4C8(0x10)(BlueprintVisible, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1EEB[0x8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class AAIAttackCoordinator* GetDefaultObj();

	void UpdateAttackGroup(TArray<class APrimalDinoAIController*>* AttackGroup);
	class APrimalDinoAIController* RemoveAttacker();
	int32 GetNumAttackersWithPriorityForTarget();
	int32 GetNumAttackersForTarget();
	void ClearAllAttackers();
	float CalculateAttackerPriorityWeight(class APrimalDinoAIController** Attacker);
	void AddAttackerCharacter(class APrimalDinoCharacter* Character);
	class APrimalDinoAIController* AddAttacker();
};

// 0xC0 (0xE8 - 0x28)
// Class ShooterGame.AllClustersInventory
class UAllClustersInventory : public UObject
{
public:
	uint8                                        Pad_1F0F[0xC0];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAllClustersInventory* GetDefaultObj();

	void OnFinishedSaveForChangingItems(bool* Success, const class FString& UserId);
	bool OnFinishedReadLockForCreateLock(bool* Success, const class FString& UserId);
	TArray<struct FItemNetInfo> OnFinishedLoadForChangingItems(bool* Success, const class FString& UserId);
	void OnFinishedCreateLockForChangingItems(bool* Success, const class FString& UserId);
	void OnFinishedClearLockForChangingItems(bool* Success, const class FString& UserId);
};

// 0x38 (0x910 - 0x8D8)
// Class ShooterGame.AllPaintingsEntryButton
class UAllPaintingsEntryButton : public UDataListEntryButton
{
public:
	class FString                                Filename;                                          // 0x8D8(0x10)(Edit, ExportObject, Net, EditFixedSize, OutParm, ReturnParm)
	class FString                                FilePath;                                          // 0x8E8(0x10)(Edit, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, EditConst, SubobjectReference)
	struct FLinearColor                          DisplayStringSelectedColor;                        // 0x8F8(0x10)(ConstParm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F29[0x8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAllPaintingsEntryButton* GetDefaultObj();

};

// 0x48 (0x920 - 0x8D8)
// Class ShooterGame.AllPlayersEntryButton
class UAllPlayersEntryButton : public UDataListEntryButton
{
public:
	class FString                                PlayerName;                                        // 0x8D8(0x10)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, SubobjectReference)
	class FString                                TribeName;                                         // 0x8E8(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance)
	uint64                                       PlayerID;                                          // 0x8F8(0x8)(Edit, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint64                                       TargetingTeamID;                                   // 0x900(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class AShooterCharacter*                     CurrentCharachter;                                 // 0x908(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          DisplayStringSelectedColor;                        // 0x910(0x10)(ConstParm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UAllPlayersEntryButton* GetDefaultObj();

};

// 0xC8 (0x410 - 0x348)
// Class ShooterGame.AnimInstance_DinoBlueprintBase
class UAnimInstance_DinoBlueprintBase : public UAnimInstance
{
public:
	bool                                         bAllowNativeAnimations;                            // 0x348(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableBlueprint;                                 // 0x349(0x1)(Edit, ConstParm, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F37[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              RootRotationOffset;                                // 0x350(0x18)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               RootLocationOffset;                                // 0x368(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         bSkipAnimGraph;                                    // 0x380(0x1)(Edit, ConstParm, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F38[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MovementAnimRate;                                  // 0x384(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MovementAnimRatePower;                             // 0x388(0x4)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MinMovementAnimRate;                               // 0x38C(0x4)(Edit, ConstParm, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MaxMovementAnimRate;                               // 0x390(0x4)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MovingAnimSpeedTreshold;                           // 0x394(0x4)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsMoving;                                         // 0x398(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseAimOffset;                                     // 0x399(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F39[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        AimPitch;                                          // 0x39C(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AimYaw;                                            // 0x3A0(0x4)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseBlinking;                                      // 0x3A4(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F3A[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BlinkBlend;                                        // 0x3A8(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseTurning;                                       // 0x3AC(0x1)(EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseTurnInPlaceAnimation;                          // 0x3AD(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F3D[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TurningEnabledBlendTime;                           // 0x3B0(0x4)(ConstParm, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        TurningDisabledBlendTime;                          // 0x3B4(0x4)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        TurningDirectionBlendTime;                         // 0x3B8(0x4)(Edit, ConstParm, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MinTurnRateForTurnAnimation;                       // 0x3BC(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsTurning;                                        // 0x3C0(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bTurningRight;                                     // 0x3C1(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseSwimming;                                      // 0x3C2(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F40[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        SwimmingMovingAnimSpeedThreshold;                  // 0x3C4(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsSwimming;                                       // 0x3C8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseRunning;                                       // 0x3C9(0x1)(ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseRunningMovementAnimRate;                       // 0x3CA(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F45[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        RunningMovementAnimRate;                           // 0x3CC(0x4)(BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsRunning;                                        // 0x3D0(0x1)(ConstParm, BlueprintVisible, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseSleepingAnim;                                  // 0x3D1(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F46[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SleepingAnimTranslationOffset;                     // 0x3D8(0x18)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsSleeping;                                       // 0x3F0(0x1)(BlueprintVisible, Parm, OutParm, ReturnParm, Config, GlobalConfig, SubobjectReference)
	bool                                         bUseFalling;                                       // 0x3F1(0x1)(ConstParm, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F47[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        FallingAnimPlayRate;                               // 0x3F4(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FallingBlendInTime;                                // 0x3F8(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FallingBlendOutTime;                               // 0x3FC(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsFalling;                                        // 0x400(0x1)(Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F48[0xF];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimInstance_DinoBlueprintBase* GetDefaultObj();

};

// 0xE8 (0x430 - 0x348)
// Class ShooterGame.AnimInstance_DinoRootBoneName
class UAnimInstance_DinoRootBoneName : public UAnimInstance
{
public:
	bool                                         bAllowNativeAnimations;                            // 0x348(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableBlueprint;                                 // 0x349(0x1)(Edit, ConstParm, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F4C[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              RootRotationOffset;                                // 0x350(0x18)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               RootLocationOffset;                                // 0x368(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	float                                        IKAlpha;                                           // 0x380(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         bDisableIK;                                        // 0x384(0x1)(Edit, ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableIKWhenFalling;                             // 0x385(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bSleepingEnableIK;                                 // 0x386(0x1)(Edit, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bSkipAnimGraph;                                    // 0x387(0x1)(Edit, ConstParm, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MovementAnimRate;                                  // 0x388(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MovementAnimRatePower;                             // 0x38C(0x4)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MinMovementAnimRate;                               // 0x390(0x4)(Edit, ConstParm, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MaxMovementAnimRate;                               // 0x394(0x4)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MovingAnimSpeedTreshold;                           // 0x398(0x4)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MovingBlendInTime;                                 // 0x39C(0x4)(Edit, ConstParm, BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MovingBlendOutTime;                                // 0x3A0(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsMoving;                                         // 0x3A4(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseAimOffset;                                     // 0x3A5(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F50[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        AimPitch;                                          // 0x3A8(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AimYaw;                                            // 0x3AC(0x4)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AimOffsetPitchScale;                               // 0x3B0(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AimOffsetYawScale;                                 // 0x3B4(0x4)(ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseAlignGround;                                   // 0x3B8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F52[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        AlignGroundAlpha;                                  // 0x3BC(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseBlinking;                                      // 0x3C0(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F53[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BlinkBlend;                                        // 0x3C4(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseTurning;                                       // 0x3C8(0x1)(EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseTurnInPlaceAnimation;                          // 0x3C9(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F56[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TurningEnabledBlendTime;                           // 0x3CC(0x4)(ConstParm, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        TurningDisabledBlendTime;                          // 0x3D0(0x4)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        TurningDirectionBlendTime;                         // 0x3D4(0x4)(Edit, ConstParm, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MinTurnRateForTurnAnimation;                       // 0x3D8(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsTurning;                                        // 0x3DC(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bTurningRight;                                     // 0x3DD(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseSwimming;                                      // 0x3DE(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F5A[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        SwimmingMovingAnimSpeedThreshold;                  // 0x3E0(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsSwimming;                                       // 0x3E4(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseRunning;                                       // 0x3E5(0x1)(ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseRunningMovementAnimRate;                       // 0x3E6(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F5C[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        RunningMovementAnimRate;                           // 0x3E8(0x4)(BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        RunningBlendInTime;                                // 0x3EC(0x4)(BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        RunningBlendOutTime;                               // 0x3F0(0x4)(Edit, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsRunning;                                        // 0x3F4(0x1)(ConstParm, BlueprintVisible, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseSleepingAnim;                                  // 0x3F5(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F62[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               SleepingAnimTranslationOffset;                     // 0x3F8(0x18)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsSleeping;                                       // 0x410(0x1)(BlueprintVisible, Parm, OutParm, ReturnParm, Config, GlobalConfig, SubobjectReference)
	bool                                         bUseFalling;                                       // 0x411(0x1)(ConstParm, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F64[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        FallingAnimPlayRate;                               // 0x414(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FallingBlendInTime;                                // 0x418(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FallingBlendOutTime;                               // 0x41C(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsFalling;                                        // 0x420(0x1)(Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F68[0xF];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimInstance_DinoRootBoneName* GetDefaultObj();

};

// 0x158 (0x4A0 - 0x348)
// Class ShooterGame.AnimInstance_DinoRootTransform
class UAnimInstance_DinoRootTransform : public UAnimInstance
{
public:
	bool                                         bAllowNativeAnimations;                            // 0x348(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableBlueprint;                                 // 0x349(0x1)(Edit, ConstParm, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F74[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              RootRotationOffset;                                // 0x350(0x18)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               RootLocationOffset;                                // 0x368(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	struct FTransform                            RootOffsetTransform;                               // 0x380(0x60)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bSkipAnimGraph;                                    // 0x3E0(0x1)(Edit, ConstParm, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F79[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MovementAnimRate;                                  // 0x3E4(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MovementAnimRatePower;                             // 0x3E8(0x4)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MinimumMovementSpeed;                              // 0x3EC(0x4)(BlueprintVisible, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MovingBlendInTime;                                 // 0x3F0(0x4)(Edit, ConstParm, BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MovingBlendOutTime;                                // 0x3F4(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsMoving;                                         // 0x3F8(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F7D[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MinimumMovementSpeedFlying;                        // 0x3FC(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FlyingMoveBlendIn;                                 // 0x400(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FlyingMoveBlendOut;                                // 0x404(0x4)(ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsFlying;                                         // 0x408(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseFlyingOffset;                                  // 0x409(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F82[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FlyingOffset;                                      // 0x410(0x18)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FVector                               CurrentFlyingOffset;                               // 0x428(0x18)(Edit, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FVector                               LandedOffset;                                      // 0x440(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseAimOffset;                                     // 0x458(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F87[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        AimPitch;                                          // 0x45C(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AimYaw;                                            // 0x460(0x4)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AimOffsetPitchScale;                               // 0x464(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AimOffsetYawScale;                                 // 0x468(0x4)(ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseBlinking;                                      // 0x46C(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F8C[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BlinkBlend;                                        // 0x470(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseTurning;                                       // 0x474(0x1)(EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1F90[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TurningEnabledBlendTime;                           // 0x478(0x4)(ConstParm, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        TurningDisabledBlendTime;                          // 0x47C(0x4)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        TurningDirectionBlendTime;                         // 0x480(0x4)(Edit, ConstParm, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MinTurnRateForTurnAnimation;                       // 0x484(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsTurning;                                        // 0x488(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bTurningRight;                                     // 0x489(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseRunning;                                       // 0x48A(0x1)(ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsRunning;                                        // 0x48B(0x1)(ConstParm, BlueprintVisible, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseSleepingAnim;                                  // 0x48C(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsSleeping;                                       // 0x48D(0x1)(BlueprintVisible, Parm, OutParm, ReturnParm, Config, GlobalConfig, SubobjectReference)
	bool                                         bUseFalling;                                       // 0x48E(0x1)(ConstParm, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1FB9[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        FallingAnimPlayRate;                               // 0x490(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FallingBlendInTime;                                // 0x494(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FallingBlendOutTime;                               // 0x498(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsFalling;                                        // 0x49C(0x1)(Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseMounted;                                       // 0x49D(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsMounted;                                        // 0x49E(0x1)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1FBC[0x1];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimInstance_DinoRootTransform* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class ShooterGame.AnimNotifyState_Custom
class UAnimNotifyState_Custom : public UAnimNotifyState
{
public:
	class FName                                  EventName;                                         // 0x30(0x8)(Edit, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         bSendNotifyToWeapon;                               // 0x38(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bSendNotifyToArmorSlot;                            // 0x39(0x1)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	enum class EPrimalEquipmentType              ArmorSlotToSendNotify;                             // 0x3A(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1FCC[0x5];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimNotifyState_Custom* GetDefaultObj();

};

// 0x18 (0x58 - 0x40)
// Class ShooterGame.AnimNotify_CustomEvent
class UAnimNotify_CustomEvent : public UAnimNotify
{
public:
	class FName                                  EventName;                                         // 0x40(0x8)(Edit, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         bSendNotifyToWeapon;                               // 0x48(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bSendNotifyToBuff;                                 // 0x49(0x1)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bSendNotifyToArmorSlot;                            // 0x4A(0x1)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	enum class EPrimalEquipmentType              ArmorSlotToSendNotify;                             // 0x4B(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bLockHeadPositionNormalized;                       // 0x4C(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1FD9[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TimeToLockHeadPosition;                            // 0x50(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUnlockHeadPositionNormalized;                     // 0x54(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1FDA[0x3];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimNotify_CustomEvent* GetDefaultObj();

};

// 0x38 (0x78 - 0x40)
// Class ShooterGame.AnimNotify_PlayCameraShake
class UAnimNotify_PlayCameraShake : public UAnimNotify
{
public:
	float                                        PercentChanceToPlay;                               // 0x40(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1FF2[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                TheCameraShake;                                    // 0x48(0x8)(Edit, ConstParm, BlueprintVisible, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        InnerRadius;                                       // 0x50(0x4)(Edit, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        OuterRadius;                                       // 0x54(0x4)(BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Config, InstancedReference, SubobjectReference)
	float                                        Falloff;                                           // 0x58(0x4)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, DuplicateTransient)
	bool                                         bOrientShakeTowardsEpicenter;                      // 0x5C(0x1)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1FF5[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        ShakeScale;                                        // 0x60(0x4)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1FF6[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                AttachName;                                        // 0x68(0x10)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UAnimNotify_PlayCameraShake* GetDefaultObj();

};

// 0x10 (0x120 - 0x110)
// Class ShooterGame.AnimNotify_PlayParticleEffectCustom
class UAnimNotify_PlayParticleEffectCustom : public UAnimNotify_PlayParticleEffect
{
public:
	class FName                                  AttachedComponentTag;                              // 0x110(0x8)(Edit, BlueprintVisible, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1FF9[0x8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimNotify_PlayParticleEffectCustom* GetDefaultObj();

};

// 0x10 (0x50 - 0x40)
// Class ShooterGame.AnimNotify_StopSound
class UAnimNotify_StopSound : public UAnimNotify
{
public:
	class USoundBase*                            SoundToStop;                                       // 0x40(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	float                                        FadeOutTime;                                       // 0x48(0x4)(ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1FFA[0x4];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimNotify_StopSound* GetDefaultObj();

};

// 0x98 (0xC0 - 0x28)
// Class ShooterGame.AntiDupeTransactionLog
class UAntiDupeTransactionLog : public UObject
{
public:
	class UWorld*                                CurrentWorld;                                      // 0x28(0x8)(BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_1FFB[0x90];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAntiDupeTransactionLog* GetDefaultObj();

};

// 0x30 (0x58 - 0x28)
// Class ShooterGame.ArkCloudInventoryData
class UArkCloudInventoryData : public UObject
{
public:
	struct FArkInventoryData                     MyArkData;                                         // 0x28(0x30)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UArkCloudInventoryData* GetDefaultObj();

};

// 0x48 (0x310 - 0x2C8)
// Class ShooterGame.AtlasWaterOverlapComponent
class UAtlasWaterOverlapComponent : public USceneComponent
{
public:
	FMulticastInlineDelegateProperty_            OnComponentEnterWater;                             // 0x2C8(0x10)(ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnComponentExitWater;                              // 0x2D8(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2012[0x28];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAtlasWaterOverlapComponent* GetDefaultObj();

};

// 0x18 (0x4D8 - 0x4C0)
// Class ShooterGame.BaseBoxTrigger
class ABaseBoxTrigger : public AActor
{
public:
	class USceneComponent*                       SceneComp;                                         // 0x4C0(0x8)(Edit, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UBoxComponent*                         TriggerBox;                                        // 0x4C8(0x8)(Edit, Net, Parm, ZeroConstructor, DisableEditOnInstance, GlobalConfig)
	uint8                                        bUseBPOnTriggerBeginOverlap : 1;                   // Mask: 0x1, PropSize: 0x10x4D0(0x1)(ConstParm, ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseBPOnTriggerEndOverlap : 1;                     // Mask: 0x2, PropSize: 0x10x4D0(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_203F[0x7];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class ABaseBoxTrigger* GetDefaultObj();

	int32 OnTriggerEndOverlap();
	struct FHitResult OnTriggerBeginOverlap();
	bool IsCharacterTouchingTrigger(class APrimalCharacter* Character);
	TArray<class APrimalCharacter*> GetAllCharactersTouchingTrigger();
	int32 BPOnTriggerEndOverlap();
	struct FHitResult BPOnTriggerBeginOverlap();
};

// 0x40 (0xB38 - 0xAF8)
// Class ShooterGame.BasePlayerController
class ABasePlayerController : public APrimalPlayerController
{
public:
	uint8                                        Pad_2057[0x28];                                    // Fixing Size After Last Property  > TateDumper <
	class UUI_CustomOverlay*                     CustomCursor;                                      // 0xB20(0x8)(BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2059[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bIsGamepadActive;                                  // 0xB30(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_205A[0x7];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class ABasePlayerController* GetDefaultObj();

	void SimulateInputKey(const struct FKey& Key, bool bPressed);
	class FString ServerCheat();
	class FString Say();
	void ClientStartOnlineGame();
	void ClientSetSpectatorCamera(const struct FVector& CameraLocation, const struct FRotator& CameraRotation);
	bool ClientSendRoundEndEvent(int32 ExpendedTimeInSeconds);
	void ClientGameStarted();
	void ClientEndOnlineGame();
};

// 0x10 (0x330 - 0x320)
// Class ShooterGame.PrimalUserWidget
class UPrimalUserWidget : public UUserWidget
{
public:
	uint8                                        Pad_207D[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        ViewportZOrder;                                    // 0x328(0x4)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	float                                        DPIScaler;                                         // 0x32C(0x4)(ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)

	static class UClass* StaticClass();
	static class UPrimalUserWidget* GetDefaultObj();

	void WidgetRemovedFromViewport();
	void WidgetAddedToViewport();
	void StopAnimationByString(class FString* Name);
	int32 SetZOrderInViewport();
	bool PlayAnimationByString(class FString* Name);
	void OnWidgetGamepadActiveChangedBP(bool* bIsGamepadActive);
	class FString NumCharactersThatFit(class FString* TheString, float* WidthThreshold, class UFont** TheFont);
	bool HandleVirtualBack();
	bool HandleKeyUp(struct FKey* TheKey);
	class UWidget* GetOverrideHighligteableWidgetBP();
	void ExecuteCommandForPrimalUI(class FName* CommandName, struct FBPNetExecParams* ExecParams);
	void BPExecutedCommandForPrimalUI(class FName* CommandName, struct FBPNetExecParams* ExecParams);
};

// 0x428 (0x758 - 0x330)
// Class ShooterGame.PrimalUI
class UPrimalUI : public UPrimalUserWidget
{
public:
	uint8                                        Pad_217F[0x4C];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bCaptureMouseInput;                                // 0x37C(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventGamepadDpadNavegation;                     // 0x37D(0x1)(ConstParm, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bForceVirtualCursorEnabled;                        // 0x37E(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsClosing;                                        // 0x37F(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bWantsPrimalItemNotifications;                     // 0x380(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2183[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                DefaultToolTipWidget;                              // 0x388(0x8)(Edit, ConstParm, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bEscapeClosesMenu;                                 // 0x390(0x1)(Edit, ExportObject, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bEscapeOpensPauseMenu;                             // 0x391(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bSpecialRightOpensPauseMenu;                       // 0x392(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bMenuSupportSlomo;                                 // 0x393(0x1)(BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bClickClosesMenu;                                  // 0x394(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsGameplayUI;                                     // 0x395(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsTopUI;                                          // 0x396(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	enum class EHighlightStartingPoint           HighlightStartPointType;                           // 0x397(0x1)(Edit, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                ConfirmationDialogUITemplate;                      // 0x398(0x8)(ConstParm, BlueprintReadOnly, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                XBoxFooterUITemplate;                              // 0x3A0(0x8)(Edit, ConstParm, BlueprintVisible, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bShowCancelIcon;                                   // 0x3A8(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bShowAcceptIcon;                                   // 0x3A9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bShowLStickIcon;                                   // 0x3AA(0x1)(BlueprintVisible, ExportObject, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bShowRStickIcon;                                   // 0x3AB(0x1)(Edit, ConstParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bShowBumpersIcon;                                  // 0x3AC(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bShowStartBtnIcon;                                 // 0x3AD(0x1)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bShowLTBtnIcon;                                    // 0x3AE(0x1)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bShowRTBtnIcon;                                    // 0x3AF(0x1)(Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bShowFaceBtnLeftIcon;                              // 0x3B0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bShowFaceBtnTopIcon;                               // 0x3B1(0x1)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bShowFaceBtnRightIcon;                             // 0x3B2(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bShowFaceBtnBottomIcon;                            // 0x3B3(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bShowLeftShoulderBtnIcon;                          // 0x3B4(0x1)(Edit, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bShowXBoxFooter;                                   // 0x3B5(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIgnoreUIScaling;                                  // 0x3B6(0x1)(Edit, ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bCloseOnPlayerDie;                                 // 0x3B7(0x1)(Edit, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        SplitscreenDPIScaler;                              // 0x3B8(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bForceFullscreenVirtualCursor;                     // 0x3BC(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bConstrainVirtualCursor;                           // 0x3BD(0x1)(Edit, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDoExtraDataListButtonPanelFilteringChecks;        // 0x3BE(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_218F[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  DefaultHighlightWidgetOverrideName;                // 0x3C0(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bShouldValidateInputOnRemove;                      // 0x3C8(0x1)(ConstParm, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ShouldStretchMainScreenWhenHandheld;               // 0x3C9(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         WasInHandheldMode;                                 // 0x3CA(0x1)(Edit, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2190[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnchors                              OriginalUnStretchedAnchors;                        // 0x3D0(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FMargin                               OriginalUnstretchedSize;                           // 0x3F0(0x10)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FVector2D                             OriginalSizeBoxUnstretchedSize;                    // 0x400(0x10)(ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FAnchors                              StretchedHandheldAnchors;                          // 0x410(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FMargin                               StretchedHandheldSize;                             // 0x430(0x10)(Edit, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FVector2D                             SizeBoxHandheldSize;                               // 0x440(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAutoProcessSplitscreenScaling;                    // 0x450(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2195[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        VirtualCursorFrames;                               // 0x454(0x4)(Edit, ConstParm, Net, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2196[0x48];                                    // Fixing Size After Last Property  > TateDumper <
	float                                        AnalogDeltaX;                                      // 0x4A0(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AnalogDeltaY;                                      // 0x4A4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2197[0x1C0];                                   // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            HTTPGetResponseEvent;                              // 0x668(0x10)(ConstParm, ExportObject, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TWeakObjectPtr<class APrimalStructureItemContainer> ItemContainer;                                     // 0x678(0x8)(ConstParm, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bCachedIsGamepadActive;                            // 0x680(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_219A[0xD3];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         OverrideButtonSounds;                              // 0x754(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_219B[0x3];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UPrimalUI* GetDefaultObj();

	bool UsingProController(bool DebugOut);
	class UUI_GenericConfirmationDialog* ShowDLCConfirmationDialog(enum class EDLCSelector DLC);
	void ShowConfirmationDialogBP(const class FString& TitleText, class FString* MessageText, bool IsJustOKBox);
	void SetInputMode();
	void SetHighlightedWidget(class UWidget* Widget, bool bSetLastHighlightedPosition);
	void ResetAllScrollBars();
	void RemovedFromViewport();
	bool ProcessSplitscreen();
	class UWorld* PlayHapticEffect(enum class EHapticEffectType Type, struct FVector* Location);
	void OpenTheStoreDLCPage(const class FString& TheDLCName);
	struct FEventReply OnMouseButtonDownEvent(struct FGeometry* MyGeometry, struct FPointerEvent* MouseEvent);
	struct FEventReply OnKeyUpEvent(struct FGeometry* MyGeometry, struct FKeyEvent* InKeyboardEvent);
	struct FEventReply OnKeyDownEvent(struct FGeometry* MyGeometry, struct FKeyEvent* InKeyboardEvent);
	struct FEventReply OnGamepadButtonDownEvent(struct FGeometry* MyGeometry, const struct FControllerEvent& ControllerEvent);
	void OnGamepadActiveChangedBP(bool* bIsGamepadActive);
	void OnGamepadActiveChanged(bool* bIsGamepadActive);
	void OnDLCConfirmationDialogClosed(bool* bAccept);
	void OnCreateCredits(class UWidget* Widget);
	void OnConfirmationDialogClosedBP(bool* bAccept);
	void OnConfirmationDialogClosed(bool* bAccept);
	void MainMenuEscapePressed();
	bool IsRightTriggerDown();
	bool IsLeftTriggerDown();
	void HTTPGetString(const class FString& InURL);
	void HandleDockedModeChanges();
	class UWidget* GetWidgetToScaleForHandheld();
	class USizeBox* GetSizeboxForExtraHandheldScaling();
	class AShooterHUD* GetShooterHud();
	class AShooterPlayerState* GetPlayerState();
	class AShooterPlayerController* GetPC();
	class APrimalCharacter* GetPawn();
	class UComboBoxString* GetOpenComboBox();
	void FixHighlights();
	void DoExtraScalingForSplitscreen(const struct FVector2D& PlayerSize);
	void CloseWithAnimation();
	void ClickedSecondaryButton(class UWidget** ClickedWidget);
	void ClickedButton(class UWidget** ClickedWidget);
	void CheckGamepadActiveChanged(bool* bIsGamepadActive);
	bool ChangeChildrenTextColorBP(class UPanelWidget** Parent);
	void BPVirtualCursorinit();
	void BPReleasedVirtualAccept();
	int32 BPProcessSplitscreenAndAddToViewport();
	bool BPHighlightWidgetOnStart();
	void BPHandleDockedModeChange(bool bIsDocked);
	float BPGameTick(struct FGeometry* MyGeometry);
	bool BPGamepadReleased(struct FKey* TheKey);
	bool BPEscapeClosed();
	bool BPCycleHighlighted();
	void BPControlHighlighted(enum class EControlDirection Dir, struct FKey* TheKey, float AnalogValue);
	void AddedToViewport();
};

// 0x0 (0x758 - 0x758)
// Class ShooterGame.BaseSelectableButtonWidget
class UBaseSelectableButtonWidget : public UPrimalUI
{
public:

	static class UClass* StaticClass();
	static class UBaseSelectableButtonWidget* GetDefaultObj();

	bool BPSetSelected();
	bool BPIsSelected();
	class UCustomButtonWidget* BPGetButton();
};

// 0x8B8 (0xE60 - 0x5A8)
// Class ShooterGame.ShooterGameState
class AShooterGameState : public AGameState
{
public:
	uint8                                        Pad_226F[0x10];                                    // Fixing Size After Last Property  > TateDumper <
	int32                                        NumNPC;                                            // 0x5B8(0x4)(BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NumHibernatedNPC;                                  // 0x5BC(0x4)(Edit, ConstParm, BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NPCActiveCountTamed;                               // 0x5C0(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NumActiveNPC;                                      // 0x5C4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NumDeadNPC;                                        // 0x5C8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NumPlayerActors;                                   // 0x5CC(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NumPlayerConnected;                                // 0x5D0(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bServerUseLocalizedChat;                           // 0x5D4(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2271[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        LocalizedChatRadius;                               // 0x5D8(0x4)(BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        LocalizedChatRadiusUnconsiousScale;                // 0x5DC(0x4)(ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ServerFramerate;                                   // 0x5E0(0x4)(Edit, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2273[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                NewStructureDestructionTag;                        // 0x5E8(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        DayNumber;                                         // 0x5F8(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	float                                        DayTime;                                           // 0x5FC(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       NetworkTime;                                       // 0x600(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint32                                       TimeUTC;                                           // 0x608(0x4)(ConstParm, ExportObject, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NetUTC;                                            // 0x60C(0x4)(ConstParm, BlueprintVisible, Parm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsOfficialServer;                                 // 0x610(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsListenServer;                                   // 0x611(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsDediServer;                                     // 0x612(0x1)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsServerRunningOnConsole;                         // 0x613(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsArkTributeAvailable;                            // 0x614(0x1)(Edit, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsArkDownloadsAllowed;                            // 0x615(0x1)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowThirdPersonPlayer;                           // 0x616(0x1)(ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bServerHardcore;                                   // 0x617(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bServerPVE;                                        // 0x618(0x1)(Edit, ExportObject, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAutoPvE;                                          // 0x619(0x1)(BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bServerCrosshair;                                  // 0x61A(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bServerForceNoHUD;                                 // 0x61B(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bFlyerPlatformAllowUnalignedDinoBasing;            // 0x61C(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bMapPlayerLocation;                                // 0x61D(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPvEDisableFriendlyFire;                           // 0x61E(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPvEAllowTribeWar;                                 // 0x61F(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPvEAllowTribeWarCancel;                           // 0x620(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bEnablePvPGamma;                                   // 0x621(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventDroppedItemPhysics;                        // 0x622(0x1)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisablePvEGamma;                                  // 0x623(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NumTamedDinos;                                     // 0x624(0x4)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxStructuresInRange;                              // 0x628(0x4)(BlueprintVisible, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        DayCycleSpeedScale;                                // 0x62C(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	float                                        DayTimeSpeedScale;                                 // 0x630(0x4)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	float                                        NightTimeSpeedScale;                               // 0x634(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, SubobjectReference)
	int32                                        StartTimeHour;                                     // 0x638(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PvEStructureDecayPeriodMultiplier;                 // 0x63C(0x4)(Edit, ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	float                                        PvEDinoDecayPeriodMultiplier;                      // 0x640(0x4)(BlueprintReadOnly, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PerPlatformMaxStructuresMultiplier;                // 0x644(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ImplantSuicideCD;                                  // 0x648(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableStructureDecayPvE;                         // 0x64C(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableDinoDecayPvE;                              // 0x64D(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowCaveBuildingPvE;                             // 0x64E(0x1)(BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowCaveBuildingPvP;                             // 0x64F(0x1)(BlueprintVisible, EditFixedSize, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventDownloadSurvivors;                         // 0x650(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bReachedPlatformStructureLimit;                    // 0x651(0x1)(ConstParm, BlueprintVisible, Net, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAdminLogging;                                     // 0x652(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPvPStructureDecay;                                // 0x653(0x1)(BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventDownloadDinos;                             // 0x654(0x1)(ExportObject, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventDownloadItems;                             // 0x655(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventUploadDinos;                               // 0x656(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventUploadItems;                               // 0x657(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventUploadSurvivors;                           // 0x658(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventMateBoost;                                 // 0x659(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventStructurePainting;                         // 0x65A(0x1)(Edit, EditFixedSize, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowCharacterCreation;                           // 0x65B(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowSpawnPointSelection;                         // 0x65C(0x1)(ConstParm, BlueprintVisible, Net, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2281[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        MaxTamedDinos;                                     // 0x660(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableSpawnAnimations;                           // 0x664(0x1)(Edit, BlueprintReadOnly, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2282[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                PlayerListString;                                  // 0x668(0x10)(ExportObject, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnPlayerListPopulated;                             // 0x678(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        GlobalSpoilingTimeMultiplier;                      // 0x688(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        GlobalItemDecompositionTimeMultiplier;             // 0x68C(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxNumberOfPlayersInTribe;                         // 0x690(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        TribeSlotReuseCooldown;                            // 0x694(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        GlobalCorpseDecompositionTimeMultiplier;           // 0x698(0x4)(ConstParm, ExportObject, Net, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        EggHatchSpeedMultiplier;                           // 0x69C(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  ActiveEvent;                                       // 0x6A0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bAllowPaintingWithoutResources;                    // 0x6A8(0x1)(Edit, BlueprintVisible, ExportObject, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bEnableExtraStructurePreventionVolumes;            // 0x6A9(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2287[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FItemCraftingCostOverride>     OverrideItemCraftingCosts;                         // 0x6B0(0x10)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FItemMaxItemQuantityOverride>  OverrideItemMaxQuantity;                           // 0x6C0(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         DisableRailgunPVP;                                 // 0x6D0(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2289[0xA7];                                    // Fixing Size After Last Property  > TateDumper <
	double                                       PrivateNetworkTime;                                // 0x778(0x8)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       LastServerSaveTime;                                // 0x780(0x8)(EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ServerSaveInterval;                                // 0x788(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        TribeNameChangeCooldown;                           // 0x78C(0x4)(Edit, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PlatformSaddleBuildAreaBoundsMultiplier;           // 0x790(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAlwaysAllowStructurePickup;                       // 0x794(0x1)(Edit, BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_228C[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        StructurePickupTimeAfterPlacement;                 // 0x798(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        StructurePickupHoldDuration;                       // 0x79C(0x4)(BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowHideDamageSourceFromLogs;                    // 0x7A0(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_228D[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FClassMultiplier>              DinoClassSpeedMultipliers;                         // 0x7A8(0x10)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FClassMultiplier>              TamedDinoClassSpeedMultipliers;                    // 0x7B8(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bRiderDinoCollision;                               // 0x7C8(0x1)(Edit, ConstParm, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_228E[0x1F];                                    // Fixing Size After Last Property  > TateDumper <
	class UAudioComponent*                       DynamicMusicAudioComponent;                        // 0x7E8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UAudioComponent*                       DynamicMusicAudioComponent2;                       // 0x7F0(0x8)(ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2291[0x10];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<struct FLevelExperienceRamp>          LevelExperienceRampOverrides;                      // 0x808(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FEngramEntryOverride>          OverrideEngramEntries;                             // 0x818(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                CustomGameUITemplate;                              // 0x828(0x8)(ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class FString>                        PreventDinoTameClassNames;                         // 0x830(0x10)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ListenServerTetherDistanceMultiplier;              // 0x840(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2292[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                PGMapName;                                         // 0x848(0x10)(Edit, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<int32>                                SupportedSpawnRegions;                             // 0x858(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UPaintingCache*                        PaintingCache;                                     // 0x868(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, DisableEditOnTemplate, Config, GlobalConfig)
	class USoundBase*                            StaticOverrideMusic;                               // 0x870(0x8)(ConstParm, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bEnableDeathTeamSpectator;                         // 0x878(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2295[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               PlayerFloatingHUDOffset;                           // 0x880(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PlayerFloatingHUDOffsetScreenY;                    // 0x898(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        StructureDamageRepairCooldown;                     // 0x89C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bForceAllStructureLocking;                         // 0x8A0(0x1)(Edit, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowCustomRecipes;                               // 0x8A1(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowRaidDinoFeeding;                             // 0x8A2(0x1)(ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2296[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CustomRecipeEffectivenessMultiplier;               // 0x8A4(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        CustomRecipeSkillMultiplier;                       // 0x8A8(0x4)(ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2297[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class USoundBase*                            OverrideAreaMusic;                                 // 0x8B0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FVector                               OverrideAreaMusicPosition;                         // 0x8B8(0x18)(BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        OverrideAreaMusicRange;                            // 0x8D0(0x4)(BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowUnclaimDinos;                                // 0x8D4(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2298[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        FloatingHUDRange;                                  // 0x8D8(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FloatingChatRange;                                 // 0x8DC(0x4)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        ExtinctionEventTimeInterval;                       // 0x8E0(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        RTSModeNumSelectableDinosScale;                    // 0x8E4(0x4)(ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        RTSMaxRangeFromPlayerCharacterScale;               // 0x8E8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ExtinctionEventPercent;                            // 0x8EC(0x4)(Edit, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        ExtinctionEventSecondsRemaining;                   // 0x8F0(0x4)(ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDoExtinctionEvent;                                // 0x8F4(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_229B[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        DestroyTamesOverLevelClamp;                        // 0x8F8(0x4)(Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_229C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FInventoryComponentDefaultItemsAppend> InventoryComponentAppends;                         // 0x900(0x10)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventOfflinePvP;                                // 0x910(0x1)(ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPvPDinoDecay;                                     // 0x911(0x1)(Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowUnclaimDinosConfig;                          // 0x912(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bForceUseInventoryAppends;                         // 0x913(0x1)(Edit, BlueprintVisible, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bOverideStructurePlatformPrevention;               // 0x914(0x1)(ConstParm, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_229E[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        ItemStackSizeMultiplier;                           // 0x918(0x4)(Edit, BlueprintVisible, Net, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_229F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<int32>                                PreventOfflinePvPLiveTeams;                        // 0x920(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<int32>                                PreventOfflinePvPExpiringTeams;                    // 0x930(0x10)(Edit, ConstParm, BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<float>                                PreventOfflinePvPExpiringTimes;                    // 0x940(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22A0[0xA0];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bAllowAnyoneBabyImprintCuddle;                     // 0x9F0(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableImprintDinoBuff;                           // 0x9F1(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22A1[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        MaxPersonalTamedDinos;                             // 0x9F4(0x4)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22A2[0x18];                                    // Fixing Size After Last Property  > TateDumper <
	class FString                                ClusterId;                                         // 0xA10(0x10)(ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22A3[0x30];                                    // Fixing Size After Last Property  > TateDumper <
	class FString                                ServerSessionName;                                 // 0xA50(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventTribeAlliances;                            // 0xA60(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22A4[0x19];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bServerUseDinoList;                                // 0xA7A(0x1)(ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPvEAllowStructuresAtSupplyDrops;                  // 0xA7B(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowForceNetUpdate;                              // 0xA7C(0x1)(BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22A6[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MinimumDinoReuploadInterval;                       // 0xA80(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        HairGrowthSpeedMultiplier;                         // 0xA84(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        DinoHairGrowthSpeedMultiplier;                     // 0xA88(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FastDecayInterval;                                 // 0xA8C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                CachedSessionOwnerId;                              // 0xA90(0x10)(ConstParm, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        OxygenSwimSpeedStatMultiplier;                     // 0xAA0(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22A8[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnHTTPGetResponse;                                 // 0xAA8(0x10)(BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnHTTPPostResponse;                                // 0xAB8(0x10)(ConstParm, BlueprintVisible, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowMultipleAttachedC4;                          // 0xAC8(0x1)(Edit, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bCrossARKAllowForeignDinoDownloads;                // 0xAC9(0x1)(Edit, ConstParm, BlueprintVisible, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22A9[0x16];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bUseCorpseLocator;                                 // 0xAE0(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bEnablePlayerMoveThroughSleeping;                  // 0xAE1(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bEnablePlayerMoveThroughAlly;                      // 0xAE2(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableStructurePlacementCollision;               // 0xAE3(0x1)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseSingleplayerSettings;                          // 0xAE4(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowPlatformSaddleMultiFloors;                   // 0xAE5(0x1)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventSpawnAnimations;                           // 0xAE6(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22AC[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        MaxAlliancesPerTribe;                              // 0xAE8(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxTribesPerAlliance;                              // 0xAEC(0x4)(Edit, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsLegacyServer;                                   // 0xAF0(0x1)(Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableDinoDecayClaiming;                         // 0xAF1(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22AE[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        bEnableServerDestroyTamesAboveSoftTameLimit;       // 0xAF4(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxTamedDinos_SoftTameLimit_CountdownForDeletionDuration; // 0xAF8(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxTamedDinos_SoftTameLimit_NumTamedDinos_UnderLimit; // 0xAFC(0x4)(Edit, ConstParm, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxTamedDinos_SoftTameLimit_NumTamedDinos_OverLimit; // 0xB00(0x4)(ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         MaxTamedDinos_SoftTameLimit_HasDoneInitialSearch;  // 0xB04(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22B1[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  UseStructurePreventionVolumeTag;                   // 0xB08(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxStructuresInSmallRadius;                        // 0xB10(0x4)(BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        RadiusStructuresInSmallRadius;                     // 0xB14(0x4)(EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseTameLimitForStructuresOnly;                    // 0xB18(0x1)(BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableWirelessCrafting;                          // 0xB19(0x1)(Edit, ConstParm, Net, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableWirelessCraftingForDinos;                  // 0xB1A(0x1)(ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableWirelessCraftingForPlayers;                // 0xB1B(0x1)(Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableWirelessCraftingForStructures;             // 0xB1C(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22B4[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        WirelessCraftingRangeOverride;                     // 0xB20(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22B5[0xC];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bLimitTurretsInRange;                              // 0xB30(0x1)(Edit, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22B8[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        LimitTurretsRange;                                 // 0xB34(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        LimitTurretsNum;                                   // 0xB38(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        LimitGeneratorsNum;                                // 0xB3C(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        LimitGeneratorsRange;                              // 0xB40(0x4)(Edit, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        CropPlotStackLimit;                                // 0xB44(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisablePhotoMode;                                 // 0xB48(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableTekLegsBoost;                              // 0xB49(0x1)(ConstParm, ExportObject, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22BC[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        PhotoModeRangeLimit;                               // 0xB4C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bForceAllowAllStructures;                          // 0xB50(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bShowCreativeMode;                                 // 0xB51(0x1)(ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22BF[0x26];                                    // Fixing Size After Last Property  > TateDumper <
	float                                        PassiveTameIntervalMultiplier;                     // 0xB78(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22C1[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class UClass*>                        UniqueDinos;                                       // 0xB80(0x10)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class FName>                          ActiveMissionTags;                                 // 0xB90(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint32                                       MinimumUniqueDownloadInterval;                     // 0xBA0(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint32                                       MaximumUniqueDownloadInterval;                     // 0xBA4(0x4)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIgnoreStructuresPreventionVolumes;                // 0xBA8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bPreventOutOfTribePinCodeUse;                      // 0xBA9(0x1)(ConstParm, BlueprintVisible, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22C2[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FDinoDownloadData>             UniqueDownloads;                                   // 0xBB0(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FDataSet>                      GameDataSets;                                      // 0xBC0(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UPrimalWorldSettingsEventOverrides*    ActiveEventOverrides;                              // 0xBD0(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIgnoreLimitMaxStructuresInRangeTypeFlag;          // 0xBD8(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22C3[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FMassTeleportData>             MassTeleportQueue;                                 // 0xBE0(0x10)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22C4[0x70];                                    // Fixing Size After Last Property  > TateDumper <
	TMap<class FName, class UDataLayerInstance*> DataLayerMap;                                      // 0xC60(0x50)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowLowGravitySpin;                              // 0xCB0(0x1)(Edit, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22C5[0x17];                                    // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnDinoDownloaded;                                  // 0xCC8(0x10)(ExportObject, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnDinoUploaded;                                    // 0xCD8(0x10)(Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FWorldBuffPersistantData>      WorldBuffPersistantDatas;                          // 0xCE8(0x10)(Edit, ConstParm, BlueprintReadOnly, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        TurretCopySettingsCooldown;                        // 0xCF8(0x4)(Edit, BlueprintVisible, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BaseHexagonRewardMultiplier;                       // 0xCFC(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        HexagonRewardMultiplier;                           // 0xD00(0x4)(Edit, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        HexagonCostMultiplier;                             // 0xD04(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableHexagonStore;                              // 0xD08(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bHexStoreAllowOnlyEngramTradeOption;               // 0xD09(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowSpeedLeveling;                               // 0xD0A(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowFlyerSpeedLeveling;                          // 0xD0B(0x1)(Edit, ConstParm, BlueprintVisible, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22CB[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class FString>                        PreventBreedingForClassNames;                      // 0xD10(0x10)(ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        LiveTuningReplicatedChunkSize;                     // 0xD20(0x4)(ExportObject, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22CC[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class FString>                        LiveTuningOverloadChunks;                          // 0xD28(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22CE[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class FString>                        PreventTransferForClassNames;                      // 0xD40(0x10)(BlueprintVisible, ExportObject, Net, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        EnvironmentIndex;                                  // 0xD50(0x4)(Edit, ConstParm, Net, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NextEnvironmentIndex;                              // 0xD54(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FColor                                FloatingPlatformProfileNameColor;                  // 0xD58(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FColor                                FloatingNameColor;                                 // 0xD5C(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       NextMutagenTime;                                   // 0xD60(0x8)(BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        OverrideMaxExperiencePointsPlayer;                 // 0xD68(0x4)(ConstParm, Net, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        OverrideMaxExperiencePointsDino;                   // 0xD6C(0x4)(Edit, BlueprintReadOnly, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<int32>                                DeferredExplorerNoteUnlockQueue;                   // 0xD70(0x10)(DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableCustomFoldersInTributeInventories;         // 0xD80(0x1)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22D0[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<TWeakObjectPtr<class AActor>>         ForcedRelevantPOIActors;                           // 0xD88(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableRailgunPVP;                                // 0xD98(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22D1[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MinimumTimebetweeninventoryRetrieval;              // 0xD9C(0x4)(EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        WildFollowerSpawnChanceMultiplier;                 // 0xDA0(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        WildFollowerSpawnCountMultiplier;                  // 0xDA4(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableDinoItemBlacklist;                         // 0xDA8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowCryoFridgeOnSaddle;                          // 0xDA9(0x1)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22D2[0x56];                                    // Fixing Size After Last Property  > TateDumper <
	double                                       RealtimeThrottledTickTimeAmount;                   // 0xE00(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22D3[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        bCharacterPaintingOnlySameTeam : 1;                // Mask: 0x1, PropSize: 0x10xE0C(0x1)(Edit, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_130 : 7;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_22D4[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FNetChangeDefaultPropertyValue> CurrentDefaultPropertyValueUpdates;                // 0xE10(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22D6[0x18];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<int64>                                WhiteListedCustomCosmeticModSkins;                 // 0xE38(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22D7[0x18];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class AShooterGameState* GetDefaultObj();

	bool StartMassTeleport(class UClass* BuffToApply, bool bMaintainRotation);
	bool ShouldMassTeleportMoveActor(class AActor** ForActor);
	int32 SetNextEnvironmentIndex();
	int32 SetEnvironmentIndex();
	class AActor* RemoveRelevantPOIActor();
	int32 QueueExplorerNoteForDeferredUnlock();
	class APrimalCharacter* PrintCDODebugForChar();
	class APrimalCharacter* PrintCDODebug(struct FCDODebugData* CDODebugData);
	struct FMassTeleportData PrepareActorForMassTeleport();
	void OnRep_SupportedSpawnRegions();
	void OnRep_ReplicateLocalizedChatRadius();
	void OnRep_ReplicateLiveTuningOverloadChunks();
	void OnRep_CurrentDefaultPropertyValueUpdates();
	void OnRep_CosmeticWhitelist();
	class UClass* OnNewClassInitialized();
	bool OnHUDNotification();
	TArray<int32> NetUpdateOfflinePvPLiveTeams();
	TArray<float> NetUpdateOfflinePvPExpiringTeams();
	struct FVector NetSpawnFoliageVFXActorAtLocationAndDoFoliageInteraction(class UClass** AnActorClass, struct FRotator_NetQuantize* AtRotation, int32* DataIndex);
	int32 NetAddFloatingText(float FadeOutTime);
	int32 NetAddFloatingDamageText(int32* DamageAmount);
	struct FRotator Multi_SpawnCosmeticActor();
	void LoadedWorld();
	bool IsValidMassTeleportData();
	bool IsUniqueDinoAlreadySpawned(TSoftClassPtr<class APrimalDinoCharacter>* UniqueDino);
	bool IsTeamIDInvincible(int32* TargetingTeamID);
	bool IsMassTeleportInProgress();
	bool IsEngramClassHidden();
	void HTTPPostRequest(const class FString& InURL, class FString* Content);
	void HTTPGetRequest(const class FString& InURL);
	void HandleInitializedGameState();
	int32 GetStartTimeHour();
	float GetOfflineDamagePreventionTime(int32* TargetingTeamID);
	double GetNetworkTimeDelta();
	bool GetItemMaxQuantityOverride();
	TArray<struct FGameIniData> GetIniArray();
	enum class EGamePhase GetGamePhase();
	class FString GetDayTimeString();
	float GetDayCycleSpeed();
	class FString GetCleanServerSessionName();
	bool ForceStartMatch();
	void DisplayWelcomeUI();
	bool CDOGetPrintStringForObjectProperty(class FName PropertyName);
	bool CDOGetPrintStringForObjectProperties(TArray<class FName>* PropertyNames);
	bool CancelMassTeleport();
	void BPPreGameplaySetup();
	bool BPNetSpawnActorAtLocation(class UClass** AnActorClass, struct FRotator* AtRotation, int32* DataIndex);
	class AShooterHUD* BPDrawGameStateHUD();
	class APrimalBuff* BaseSpawnBuffAndAttachToCharacter(class APrimalCharacter* PrimalCharacter);
	struct FVector2D BaseProjectWorldToScreenPosition();
	bool BaseIsTribeID();
	class ACustomActorList* BaseGetCustomActors();
	TArray<class AShooterPlayerController*> BaseGetAllShooterControllers();
	TArray<class AShooterCharacter*> BaseGetAllShooterCharactersOfTeam(int32* KillerTeam);
	TArray<class AShooterCharacter*> BaseGetAllShooterCharacters();
	TArray<class APrimalDinoCharacter*> BaseGetAllDinoCharactersOfTeam(int32* KillerTeam);
	struct FColor BaseDrawTileOnCanvas(float* U, float* V, float UL, float VL);
	bool AllowDownloadDino();
	bool AllowDinoTame(class AShooterPlayerController** ForPC);
	bool AllowDinoClassTame(class AShooterPlayerController** ForPC);
	int32 AddTokens();
	class AActor* AddRelevantPOIActor();
	float AddFloatingText(float FadeOutTime);
};

// 0x0 (0xE60 - 0xE60)
// Class ShooterGame.BattleGameState
class ABattleGameState : public AShooterGameState
{
public:

	static class UClass* StaticClass();
	static class ABattleGameState* GetDefaultObj();

};

// 0xE0 (0x770 - 0x690)
// Class ShooterGame.BeamWeaponComponent
class UBeamWeaponComponent : public UPrimitiveComponent
{
public:
	class UParticleSystem*                       ParticleSystemTemplate;                            // 0x690(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UParticleSystem*                       ChargeupParticleSystemTemplate;                    // 0x698(0x8)(Edit, ConstParm, Net, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UParticleSystem*                       BurstWhenFiredSystemTemplate;                      // 0x6A0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UParticleSystem*                       ImpactSystemTemplate;                              // 0x6A8(0x8)(Edit, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        Duration;                                          // 0x6B0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, GlobalConfig, DuplicateTransient)
	float                                        DamageRadius;                                      // 0x6B4(0x4)(ConstParm, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                DamageType;                                        // 0x6B8(0x8)(ConstParm, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig)
	float                                        DamageDelay;                                       // 0x6C0(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BaseDamage;                                        // 0x6C4(0x4)(Edit, ExportObject, EditFixedSize, Parm, Transient, Config, InstancedReference, SubobjectReference)
	float                                        Length;                                            // 0x6C8(0x4)(ConstParm, BlueprintVisible, Net, ReturnParm)
	bool                                         IsPenetrating;                                     // 0x6CC(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22F1[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TargetTrackingSpeed;                               // 0x6D0(0x4)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         UseOwnerForward;                                   // 0x6D4(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22F2[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        Offset;                                            // 0x6D8(0x4)(Edit, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst)
	float                                        ChargeupTime;                                      // 0x6DC(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         WhenChargingWaitForCallToFire;                     // 0x6E0(0x1)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         DeactivateChargeupOnFiring;                        // 0x6E1(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22F4[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            BeamStoppedFiringEvent;                            // 0x6E8(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TWeakObjectPtr<class AActor>                 BeamTarget;                                        // 0x6F8(0x8)(ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UParticleSystemComponent*              ParticleComp;                                      // 0x700(0x8)(Edit, Net, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UParticleSystemComponent*              ChargeUpComp;                                      // 0x708(0x8)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UParticleSystemComponent*              ImpactComp;                                        // 0x710(0x8)(BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22F5[0x58];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UBeamWeaponComponent* GetDefaultObj();

	void UpdateBeamVisuals();
	void StopFiring();
	void StartFiring();
	void StartCharging();
	class AActor* SetTarget();
	class AActor* GetTarget();
	class UParticleSystemComponent* GetParticleSystem();
	double GetLastStoppedFiringTime();
	bool GetIsFiring();
	bool GetIsCharging();
	class UParticleSystemComponent* GetImpactParticleSystem();
	class UParticleSystemComponent* GetChargeupParticleSystem();
	struct FVector GetBeamEndLocation();
};

// 0x30 (0xE8 - 0xB8)
// Class ShooterGame.BeamWeaponController
class UBeamWeaponController : public UActorComponent
{
public:
	TArray<struct FComponentReference>           BeamWeapons;                                       // 0xB8(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            BeamStoppedFiringEvent;                            // 0xC8(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            BeamsStoppedFiringEvent;                           // 0xD8(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UBeamWeaponController* GetDefaultObj();

	void StopFiringBeams();
	bool StartChargingBeams();
	bool StartChargingBeam();
	void OnBeamStoppedFiringHandler(class UBeamWeaponComponent** BeamWeaponComp);
	TArray<class UBeamWeaponComponent*> GetBeamWeaponComponents();
	bool FireBeams();
	bool FireBeam();
};

// 0x10 (0x768 - 0x758)
// Class ShooterGame.BinocularsWidgetUI
class UBinocularsWidgetUI : public UPrimalUI
{
public:
	class FName                                  GamepadUnlockButtonName;                           // 0x758(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2310[0x8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UBinocularsWidgetUI* GetDefaultObj();

	class UClass* GetDinoParentClass(class APrimalCharacter** Char);
	bool GetCharUsesStat(class APrimalCharacter** Char, enum class EPrimalCharacterStatusValue* ValueType);
	float GetCharTorpidMaxStatus(class APrimalCharacter** Char);
	float GetCharTorpidCurrentStatus(class APrimalCharacter** Char);
	class FString GetCharNumStatPointsString(class APrimalCharacter** Char, enum class EPrimalCharacterStatusValue* ValueType);
	float GetCharHealthMaxStatus(class APrimalCharacter** Char);
	float GetCharHealthCurrentStatus(class APrimalCharacter** Char);
};

// 0x90 (0x550 - 0x4C0)
// Class ShooterGame.BiomeZoneSettings
class ABiomeZoneSettings : public AActor
{
public:
	class FString                                BiomeZoneName;                                     // 0x4C0(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FinalTemperatureMultiplier;                        // 0x4D0(0x4)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FinalTemperatureExponent;                          // 0x4D4(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FinalTemperatureAddition;                          // 0x4D8(0x4)(BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PreOffsetTemperatureMultiplier;                    // 0x4DC(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PreOffsetTemperatureExponent;                      // 0x4E0(0x4)(Edit, BlueprintVisible, ExportObject, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PreOffsetTemperatureAddition;                      // 0x4E4(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AboveTemperatureOffsetThreshold;                   // 0x4E8(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AboveTemperatureOffsetMultiplier;                  // 0x4EC(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AboveTemperatureOffsetExponent;                    // 0x4F0(0x4)(BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BelowTemperatureOffsetThreshold;                   // 0x4F4(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BelowTemperatureOffsetMultiplier;                  // 0x4F8(0x4)(ConstParm, ExportObject, Net, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BelowTemperatureOffsetExponent;                    // 0x4FC(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AbsoluteTemperatureOverride;                       // 0x500(0x4)(Edit, ConstParm, ExportObject, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bPreventCrops : 1;                                 // Mask: 0x1, PropSize: 0x10x504(0x1)(Edit, ConstParm, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_134 : 7;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_231B[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        EggRangeMaximumNumberOverride;                     // 0x508(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        EggMaximumNumberOverride;                          // 0x50C(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        EggChanceToSpawnOverride;                          // 0x510(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        EggIntervalUnstasisChanceToSpawnOverride;          // 0x514(0x4)(BlueprintVisible, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class UClass*>                        OverrideEggLimitsDinoClasses;                      // 0x518(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        BiomeZonePriority;                                 // 0x528(0x4)(Edit, ConstParm, ExportObject, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MaxMultiplier;                                     // 0x52C(0x4)(Edit, ConstParm, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicDay;                            // 0x530(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicNight;                          // 0x538(0x8)(ConstParm, ExportObject, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicDay_Heavy;                      // 0x540(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicNight_Heavy;                    // 0x548(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class ABiomeZoneSettings* GetDefaultObj();

};

// 0x1B8 (0x6C8 - 0x510)
// Class ShooterGame.BiomeZoneVolume
class ABiomeZoneVolume : public AVolume
{
public:
	class FString                                BiomeZoneName;                                     // 0x510(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	enum class EBiomeZone                        BiomeZone;                                         // 0x520(0x1)(Edit, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2345[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        FinalTemperatureMultiplier;                        // 0x524(0x4)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FinalTemperatureExponent;                          // 0x528(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FinalTemperatureAddition;                          // 0x52C(0x4)(BlueprintVisible, ExportObject, Net, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PreOffsetTemperatureMultiplier;                    // 0x530(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PreOffsetTemperatureExponent;                      // 0x534(0x4)(Edit, BlueprintVisible, ExportObject, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PreOffsetTemperatureAddition;                      // 0x538(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AboveTemperatureOffsetThreshold;                   // 0x53C(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AboveTemperatureOffsetMultiplier;                  // 0x540(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AboveTemperatureOffsetExponent;                    // 0x544(0x4)(BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BelowTemperatureOffsetThreshold;                   // 0x548(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BelowTemperatureOffsetMultiplier;                  // 0x54C(0x4)(ConstParm, ExportObject, Net, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BelowTemperatureOffsetExponent;                    // 0x550(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AbsoluteTemperatureOverride;                       // 0x554(0x4)(Edit, ConstParm, ExportObject, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AbsoluteMaxTemperature;                            // 0x558(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AbsoluteMinTemperature;                            // 0x55C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bPreventCrops : 1;                                 // Mask: 0x1, PropSize: 0x10x560(0x1)(Edit, ConstParm, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bIsOutside : 1;                                    // Mask: 0x2, PropSize: 0x10x560(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bRemoveBuffWhenLeavingVolume : 1;                  // Mask: 0x4, PropSize: 0x10x560(0x1)(ConstParm, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_139 : 5;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_234A[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        EggRangeMaximumNumberOverride;                     // 0x564(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        EggMaximumNumberOverride;                          // 0x568(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        EggChanceToSpawnOverride;                          // 0x56C(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        EggIntervalUnstasisChanceToSpawnOverride;          // 0x570(0x4)(BlueprintVisible, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_234C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class UClass*>                        OverrideEggLimitsDinoClasses;                      // 0x578(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        BiomeZonePriority;                                 // 0x588(0x4)(Edit, ConstParm, ExportObject, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MaxMultiplier;                                     // 0x58C(0x4)(Edit, ConstParm, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AbsoluteWindOverride;                              // 0x590(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PreOffsetWindMultiplier;                           // 0x594(0x4)(ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PreOffsetWindExponent;                             // 0x598(0x4)(ConstParm, BlueprintVisible, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PreOffsetWindAddition;                             // 0x59C(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AboveWindOffsetThreshold;                          // 0x5A0(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AboveWindOffsetMultiplier;                         // 0x5A4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AboveWindOffsetExponent;                           // 0x5A8(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BelowWindOffsetThreshold;                          // 0x5AC(0x4)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BelowWindOffsetMultiplier;                         // 0x5B0(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BelowWindOffsetExponent;                           // 0x5B4(0x4)(ConstParm, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FinalWindMultiplier;                               // 0x5B8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FinalWindExponent;                                 // 0x5BC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FinalWindAddition;                                 // 0x5C0(0x4)(Edit, ConstParm, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2351[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                BiomeCustomDatas;                                  // 0x5C8(0x10)(ConstParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        StatusAdjustmentRateMultipliersPositive[0xC];      // 0x5D8(0x30)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        StatusAdjustmentRateMultipliersNegative[0xC];      // 0x608(0x30)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bOnlyApplyAdjustmentRateValuesOutdoors;            // 0x638(0x1)(BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bStatusAdjustRateValues;                           // 0x639(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDisableDayTransitionSounds;                       // 0x63A(0x1)(ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2355[0x5];                                     // Fixing Size After Last Property  > TateDumper <
	TSoftClassPtr<class APrimalBuff>             BuffToGive;                                        // 0x640(0x30)(ConstParm, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TSoftClassPtr<class APrimalBuff>             BuffToPreventActiveUse;                            // 0x670(0x30)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicDay;                            // 0x6A0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicDay_Heavy;                      // 0x6A8(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicNight;                          // 0x6B0(0x8)(ConstParm, ExportObject, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USoundBase*                            OverrideCombatMusicNight_Heavy;                    // 0x6B8(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USoundBase*                            ForceMusicInBiome;                                 // 0x6C0(0x8)(BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class ABiomeZoneVolume* GetDefaultObj();

	void OnEndOverlap(class AActor* OverlappedActor, class AActor** Actor);
	void OnBeginOverlap(class AActor* OverlappedActor, class AActor** Actor);
	bool IsPointUnderwater(class UWorld** ForWorld);
	bool IsPointInVacuumBase(class UWorld** ForWorld);
	class APhysicsVolume* GetWaterVolumeAtPoint(class UWorld** ForWorld);
	class APhysicsVolume* GetPhysicsVolumeAtLocation(class UWorld** ForWorld);
	class ABiomeZoneVolume* GetBiomeZoneVolume(struct FVector* Location);
	class UWorld* GetAllBiomeZones(TArray<class ABiomeZoneVolume*>* BiomeZones);
};

// 0x0 (0x28 - 0x28)
// Class ShooterGame.BiomeZoneVolumeEffectUtility
class UBiomeZoneVolumeEffectUtility : public UObject
{
public:

	static class UClass* StaticClass();
	static class UBiomeZoneVolumeEffectUtility* GetDefaultObj();

	bool SpawnRelevantEffect(const TArray<struct FBiomeZoneVolumeEffect>& Effects, struct FVector* Location);
	class AActor* SpawnImpactEffect(struct FHitResult* HitResult, class AActor** Owner);
	struct FBiomeZoneVolumeEffect GetRelevantEffect(const TArray<struct FBiomeZoneVolumeEffect>& Effects, class AActor* SourceActor);
};

// 0x8 (0xA0 - 0x98)
// Class ShooterGame.BTService_FindTarget
class UBTService_FindTarget : public UBTService_BlackboardBase
{
public:
	bool                                         bDontSet;                                          // 0x98(0x1)(ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2378[0x7];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UBTService_FindTarget* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class ShooterGame.BTService_UpdateAggro
class UBTService_UpdateAggro : public UBTService
{
public:

	static class UClass* StaticClass();
	static class UBTService_UpdateAggro* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class ShooterGame.BTTask_AttackTarget
class UBTTask_AttackTarget : public UBTTaskNode
{
public:

	static class UClass* StaticClass();
	static class UBTTask_AttackTarget* GetDefaultObj();

};

// 0x38 (0xD0 - 0x98)
// Class ShooterGame.BTTask_GetRandomWanderDestination
class UBTTask_GetRandomWanderDestination : public UBTTask_BlackboardBase
{
public:
	struct FVector                               LocOverride;                                       // 0x98(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        RandomOffsetMultiplier;                            // 0xB0(0x4)(Edit, ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseRandomNegativeXDir;                            // 0xB4(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bOrientRandOffsetByRotation;                       // 0xB5(0x1)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_237D[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              OrientRandOffsetByRotation;                        // 0xB8(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UBTTask_GetRandomWanderDestination* GetDefaultObj();

};

// 0x0 (0xD0 - 0xD0)
// Class ShooterGame.BTTask_RotateToFaceBBEntryWithGrab
class UBTTask_RotateToFaceBBEntryWithGrab : public UBTTask_RotateToFaceBBEntry
{
public:

	static class UClass* StaticClass();
	static class UBTTask_RotateToFaceBBEntryWithGrab* GetDefaultObj();

};

// 0x0 (0x758 - 0x758)
// Class ShooterGame.BuildingUI
class UBuildingUI : public UPrimalUI
{
public:

	static class UClass* StaticClass();
	static class UBuildingUI* GetDefaultObj();

	class APrimalStructurePlacer* GetStructurePlacer();
	class UTexture2D* GetStructureIcon(class APrimalStructure** Structure);
};

// 0x8 (0x38 - 0x30)
// Class ShooterGame.CachedDB
class UCachedDB : public UDataAsset
{
public:
	bool                                         bForceRepopulateAll;                               // 0x30(0x1)(ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_238C[0x7];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCachedDB* GetDefaultObj();

	void PopulateDBFromEditor();
	TArray<struct FAssetData> PopulateDB();
};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.ShooterWeaponDB
class UShooterWeaponDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class AShooterWeapon>, struct FShooterWeaponDBEntry> CachedWeaponData;                                  // 0x38(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UShooterWeaponDB* GetDefaultObj();

};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.PrimalDinoDB
class UPrimalDinoDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class APrimalDinoCharacter>, struct FPrimalDinoDBEntry> CachedDinoData;                                    // 0x38(0x50)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UPrimalDinoDB* GetDefaultObj();

};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.PrimalStructureDB
class UPrimalStructureDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class APrimalStructure>, struct FPrimalStructureDBEntry> CachedStructureData;                               // 0x38(0x50)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UPrimalStructureDB* GetDefaultObj();

};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.PrimalInventoryDB
class UPrimalInventoryDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class UPrimalInventoryComponent>, struct FPrimalInventoryDBEntry> CachedInventoryData;                               // 0x38(0x50)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UPrimalInventoryDB* GetDefaultObj();

};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.PrimalMissionDB
class UPrimalMissionDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class AMissionType>, struct FPrimalMissionDBEntry> CachedMissionData;                                 // 0x38(0x50)(Edit, ConstParm, ExportObject, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UPrimalMissionDB* GetDefaultObj();

};

// 0x0 (0x80 - 0x80)
// Class ShooterGame.GenerateCacheDBForModsCommandlet
class UGenerateCacheDBForModsCommandlet : public UCommandlet
{
public:

	static class UClass* StaticClass();
	static class UGenerateCacheDBForModsCommandlet* GetDefaultObj();

};

// 0x8 (0x50 - 0x48)
// Class ShooterGame.CameraModifier_Climbing
class UCameraModifier_Climbing : public UCameraModifier
{
public:
	class AShooterWeapon_Climb*                  OwningWeapon;                                      // 0x48(0x8)(Edit, Net, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UCameraModifier_Climbing* GetDefaultObj();

};

// 0x28 (0x50 - 0x28)
// Class ShooterGame.CDOLiveUpdateData
class UCDOLiveUpdateData : public UObject
{
public:
	TArray<struct FNetChangeDefaultPropertyValue> CDOLiveUpdates;                                    // 0x28(0x10)(ExportObject, Net, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FCDODebugData                         CDODebugData;                                      // 0x38(0x18)(Edit, ConstParm, Net, EditFixedSize, OutParm, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UCDOLiveUpdateData* GetDefaultObj();

};

// 0xA50 (0x11A8 - 0x758)
// Class ShooterGame.UI_Spawn
class UUI_Spawn : public UPrimalUI
{
public:
	class FName                                  SkinColorPreviewName;                              // 0x758(0x8)(BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  HairColorPreviewName;                              // 0x760(0x8)(Edit, BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  EyeColorPreviewName;                               // 0x768(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  SavedPresetListPanelName;                          // 0x770(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  SavedBonePresetsListPanelName;                     // 0x778(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  IslandRgionButtonListPanelName;                    // 0x780(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  LoadConfirmationButtonName;                        // 0x788(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  CancelLoadButtonName;                              // 0x790(0x8)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  LoadFromFileScrollBoxName;                         // 0x798(0x8)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  LoadBonePresetsConfirmationButtonName;             // 0x7A0(0x8)(ConstParm, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  CancelLoadBonePresetsButtonName;                   // 0x7A8(0x8)(Edit, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  LoadBonePresetsFromFileScrollBoxName;              // 0x7B0(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  RandomizeButtonName;                               // 0x7B8(0x8)(Edit, ConstParm, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  TabBgSwitcherName;                                 // 0x7C0(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  MaleEnabledEffectName;                             // 0x7C8(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  FemaleEnabledEffectName;                           // 0x7D0(0x8)(EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  SaveToFileButtonName;                              // 0x7D8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  LoadFromFileButtonName;                            // 0x7E0(0x8)(Edit, ExportObject, Net, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  LoadBonePresetFromFileButtonName;                  // 0x7E8(0x8)(ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                PreviewWidgetName;                                 // 0x7F0(0x10)(ConstParm, BlueprintVisible, ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  RespawnButtonName;                                 // 0x800(0x8)(BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  CreateNewPlayerButtonName;                         // 0x808(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  DefaultDestinationButtonName;                      // 0x810(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  DefaultDestinationButtonLabelName;                 // 0x818(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  RespawnLabelName;                                  // 0x820(0x8)(BlueprintVisible, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  MyScrollBoxName;                                   // 0x828(0x8)(Edit, ConstParm, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  CharConfigMaleButtonName;                          // 0x830(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  CharConfigFemaleButtonName;                        // 0x838(0x8)(ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  DoCreateNewPlayerButtonName;                       // 0x840(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  NewCharacterPanelName;                             // 0x848(0x8)(Edit, BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  RespawnPanelName;                                  // 0x850(0x8)(BlueprintVisible, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  RespawnPanelButtonName;                            // 0x858(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  RespawnPanelMapName;                               // 0x860(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  GenderLabelName;                                   // 0x868(0x8)(BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  BodyColorSliderName;                               // 0x870(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  HairColorSliderName;                               // 0x878(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  HairTipColorSliderName;                            // 0x880(0x8)(ConstParm, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  BeardColorSliderName;                              // 0x888(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  BeardTipColorSliderName;                           // 0x890(0x8)(ConstParm, ExportObject, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  EyeColorSliderName;                                // 0x898(0x8)(Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  EyeIrisColorSliderName;                            // 0x8A0(0x8)(BlueprintVisible, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  EyebrowStyleSliderName;                            // 0x8A8(0x8)(ExportObject, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  HairStyleSliderName;                               // 0x8B0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  HairLengthSliderName;                              // 0x8B8(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  BeardLengthSliderName;                             // 0x8C0(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  BeardStyleSliderName;                              // 0x8C8(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  GlobalMuscleMaterialSliderName;                    // 0x8D0(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  GlobalFatMaterialSliderName;                       // 0x8D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  DebugLightsUIName;                                 // 0x8E0(0x8)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FBoneModifierSlider>           BoneModifiersSliders;                              // 0x8E8(0x10)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FDynamicMaterialSlider>        DynamicMaterialSliders;                            // 0x8F8(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  PlayerVoiceSelectorComboboxName;                   // 0x908(0x8)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2489[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bPlayVoiceSample;                                  // 0x918(0x1)(Edit, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_248A[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  CharacterNameBoxName;                              // 0x91C(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  RespawnButtonLabelName;                            // 0x924(0x8)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_248C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                SlotButtonTemplate;                                // 0x930(0x8)(Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        RequestSpawnPointsInterval;                        // 0x938(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  DownloadCharacterDataButtonName;                   // 0x93C(0x8)(Edit, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  ShowRegionsButtonName;                             // 0x944(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  ShowBedsButtonName;                                // 0x94C(0x8)(Edit, ConstParm, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2490[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                ListCharacterDataSceneTemplate;                    // 0x958(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          SwitcherTextActiveColor;                           // 0x960(0x10)(ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          SwitcherTextInactiveColor;                         // 0x970(0x10)(OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2491[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCameraLocationSetting>        CameraSettingsPerTab;                              // 0x988(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FCameraLocationSetting>        CameraSettingsPerTabFemale;                        // 0x998(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2492[0x40];                                    // Fixing Size After Last Property  > TateDumper <
	TSoftClassPtr<class UAnimInstance>           OverwrittenAnimbpMale;                             // 0x9E8(0x30)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TSoftClassPtr<class UAnimInstance>           OverwrittenAnimbpFemale;                           // 0xA18(0x30)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2496[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bIsFastTravel;                                     // 0xA49(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bCharacterFirstSpawn;                              // 0xA4A(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsRespawning;                                     // 0xA4B(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        CurrentSpawnPointID;                               // 0xA4C(0x4)(ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TWeakObjectPtr<class APrimalStructure>       FastTravelIgnoreBed;                               // 0xA50(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2498[0x10];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<struct FCharacterPreset>              GenericCharacterPresets;                           // 0xA68(0x10)(BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2499[0x10];                                    // Fixing Size After Last Property  > TateDumper <
	struct FVector2D                             MousePositionOverCharacterView;                    // 0xA88(0x10)(Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_249A[0x20];                                    // Fixing Size After Last Property  > TateDumper <
	class AShooterCharacter*                     PreviewCharacter;                                  // 0xAB8(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UUI_PreviewWidget*                     PreviewWidget;                                     // 0xAC0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_249C[0xB8];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<class UDinoListButtonWidget*>         EntryWidgets;                                      // 0xB80(0x10)(ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_249E[0x30];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<class UDinoListButtonWidget*>         RespawnEntryWidgets;                               // 0xBC0(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class UDinoListButtonWidget*>         SavedPresetWidgets;                                // 0xBD0(0x10)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_24A1[0x80];                                    // Fixing Size After Last Property  > TateDumper <
	float                                        MaxDistanceForMultiSpawnPointSelect;               // 0xC60(0x4)(EditFixedSize, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_24A2[0x3C];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<class UDinoListButtonWidget*>         MultiSpawnPointWidgets;                            // 0xCA0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_24A3[0x50];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bCharConfigIsFemale;                               // 0xD00(0x1)(Edit, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_24A4[0x1C7];                                   // Fixing Size After Last Property  > TateDumper <
	TArray<struct FSavedVoiceCollectionActualIndex> MasculineVoiceOptions;                             // 0xEC8(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FSavedVoiceCollectionActualIndex> FeminineVoiceOptions;                              // 0xED8(0x10)(ConstParm, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FSavedVoiceCollectionActualIndex> AdditionalVoiceOptions;                            // 0xEE8(0x10)(ConstParm, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FSavedVoiceCollectionActualIndex> CustomModVoiceOptions;                             // 0xEF8(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FSavedVoiceCollectionActualIndex> CurrentlyDisplayedVoiceOptions;                    // 0xF08(0x10)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FPlayerBoneBodyPreset>         MaleOnlyBodyBonePresetOptions;                     // 0xF18(0x10)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FPlayerBoneBodyPreset>         FemaleOnlyBodyBonePresetOptions;                   // 0xF28(0x10)(Edit, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FPlayerBoneBodyPreset>         UniversalBodyBonePresetOptions;                    // 0xF38(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FPlayerBoneBodyPreset>         Custom_MaleOnlyBodyBonePresetOptions;              // 0xF48(0x10)(ConstParm, BlueprintVisible, Net, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FPlayerBoneBodyPreset>         Custom_FemaleOnlyBodyBonePresetOptions;            // 0xF58(0x10)(ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FPlayerBoneBodyPreset>         Custom_UniversalBodyBonePresetOptions;             // 0xF68(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FPlayerBoneBodyPreset>         CurrentlyDisplayedBodyBonePresetOptions;           // 0xF78(0x10)(Edit, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FPlayerBoneBodyPreset                 CachedBodyBonePreset;                              // 0xF88(0x60)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FCustomPreviewMeshInfo>        CustomPreviewMeshes;                               // 0xFE8(0x10)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          SkinToneColor;                                     // 0xFF8(0x10)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          EyeToneColor;                                      // 0x1008(0x10)(BlueprintVisible, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FLinearColor                          HairToneColor;                                     // 0x1018(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class UDataListValueGeneric*>         BoneSliderRefs;                                    // 0x1028(0x10)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_24AA[0x130];                                   // Fixing Size After Last Property  > TateDumper <
	class UCanvasPanel*                          SplitscreenBackdrop;                               // 0x1168(0x8)(Edit, ExportObject, Net, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        Default_Hair_Style;                                // 0x1170(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        Default_Hair_Length;                               // 0x1174(0x4)(BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        Default_Beard_Style;                               // 0x1178(0x4)(Edit, ExportObject, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        Default_Beard_Length;                              // 0x117C(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        Default_Eyebrow_Style;                             // 0x1180(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        DefaultFemaleVoiceIndex;                           // 0x1184(0x4)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        DefaultMaleVoiceIndex;                             // 0x1188(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        CheatRespawnPlayerPresetIndex;                     // 0x118C(0x4)(Edit, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDebugUtilizeSliderBoneRangesInsteadOfGameData;    // 0x1190(0x1)(Edit, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_24AF[0x17];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UUI_Spawn* GetDefaultObj();

	void UpdateCharacterPreviewImage();
	bool UpdateCharacterFirstSpawnBP();
	bool UpdateCharacterFirstSpawn();
	bool SwitchTheButton();
	int32 SpawnPointSelected(class UUI_SpawnPoint* SpawnPoint);
	void SlotButtonSelected(class UWidget* TheWidget);
	void SetupWidgetElements();
	void SetupChangeCharacterUI();
	void SetGenderVoiceOptions();
	void SetGenderBodyBoneOptions();
	void SavedPresetListButtonSelected(class UWidget* TheWidget);
	void SavedBonePresetListButtonSelected(class UWidget* TheWidget);
	void RespawnSlotButtonSelected(class UWidget* TheWidget);
	void ResetToDefault(bool Recall);
	void ResetCharacterBoneModifiersToPreset(const struct FPrimalPlayerCharacterConfigStruct& PlayerCharacterConfig, int32 PresetIndex);
	void PrintCharacterSettings();
	class FText OnSaveToFileEditableCommitted(enum class ETextCommit* CommitMethod);
	void OnResetToDefault();
	void OnMoviePlaybackFinished_SPDownload(class FString* MoviePath, bool* bPlaybackWasCancelled);
	void OnMoviePlaybackFinished_SpawnAtPoint(class FString* MoviePath, bool* bPlaybackWasCancelled);
	void OnMoviePlaybackFinished_Download(class FString* MoviePath, bool* bPlaybackWasCancelled);
	void OnMoviePlaybackFinished(class FString* MoviePath, bool* bPlaybackWasCancelled);
	void OnMaterialSliderChanged(float SliderValue);
	void OnGenderChange(bool IsFemale);
	class FText OnBedFilterChanged();
	void MultiSelectSpawnPointButtonSelected(class UWidget* TheWidget);
	void InitWidget();
	class FString GetSpawnPointName();
	class USpawnMapWidget* GetRespawnPanelMap();
	class FString GetRealBedName(int32 ChachedID);
	struct FPrimalPlayerCharacterConfigStruct GetPlayerConfigStructFromCurrentValues();
	bool GetIsSpawnPointIDDefaultDestination();
	struct FCharacterPreset GetGenericCharacterPreset();
	class FString GetDifficultRegionString();
	struct FCharacterPreset GetDefaultCharacterPreset();
	struct FCharacterPreset GetCurrentCharacterSetting();
	struct FVector2D GetCanvasLocationForRegionPoint(struct FVector* Location);
	struct FVector2D GetCanvasLocationForMinimapPoint(struct FVector* Location);
	struct FCameraLocationSetting GetCameraSettingsForTab(int32 TabIndex);
	TArray<struct FBoneModifier> GetBoneMods_Female();
	TArray<struct FBoneModifier> GetBoneMods();
	TArray<class UDataListValueGeneric*> GetAllVectorSliders();
	TArray<class UDataListValueGeneric*> GetAllFloatSliders();
	TArray<class UDataListValueGeneric*> GetAllColorSliders();
	void CheatRespawnPlayer(bool KeepGender, class AShooterPlayerController* MyPC, int32 OptionalDefaultPreset);
	class FString BPSetupButtonDataForSpawnRegion(int32 SpawnRegionIndex, const class FString& SecondText);
	bool BPSetupBed(int32 BedIndex, int32 NumBeds);
	void BPSetSelectedSpawnRegion(int32 SpawnRegionIndex, struct FVector* Location);
	int32 BPRemoveBed();
	void BPCreatedSpawnRegionWidget(int32 SpawnRegionIndex, struct FVector* Location, int32 Difficult);
	struct FPrimalPlayerCharacterConfigStruct BP_FinalAdjustPlayerCharacterConfigBeforeSpawn(const struct FPrimalPlayerCharacterConfigStruct& InPlayerCharacterConfig);
	struct FCharacterPreset ApplyCharacterPreset();
	void ApplyBodyBonePreset(const struct FPlayerBoneBodyPreset& BodyPreset);
};

// 0x8 (0x11B0 - 0x11A8)
// Class ShooterGame.CharacterChangerUI
class UCharacterChangerUI : public UUI_Spawn
{
public:
	class UPrimalUI*                             RefParentUI;                                       // 0x11A8(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UCharacterChangerUI* GetDefaultObj();

	class UUI_PreviewWidget* SetupNewPreviewWidget();
	void AcceptChangeCharacter();
};

// 0x30 (0x360 - 0x330)
// Class ShooterGame.CharacterViewPanelWidget
class UCharacterViewPanelWidget : public UPrimalUserWidget
{
public:
	class FString                                PreviewWidgetName;                                 // 0x330(0x10)(ConstParm, BlueprintVisible, ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_24D9[0x20];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCharacterViewPanelWidget* GetDefaultObj();

	void RefreshPreviewWidget();
};

// 0x38 (0x910 - 0x8D8)
// Class ShooterGame.CheatFunctionInfoEntryButton
class UCheatFunctionInfoEntryButton : public UDataListEntryButton
{
public:
	uint8                                        bIsCustom : 1;                                     // Mask: 0x1, PropSize: 0x10x8D8(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_156 : 7;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_24E0[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                FunctionName;                                      // 0x8E0(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Config, EditConst, SubobjectReference)
	bool                                         bCenterDisplayName;                                // 0x8F0(0x1)(BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_24E4[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FLinearColor                          DisplayStringSelectedColor;                        // 0x8F4(0x10)(ConstParm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        FolderNameTextClipOffset;                          // 0x904(0x4)(BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_24E6[0x8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCheatFunctionInfoEntryButton* GetDefaultObj();

};

// 0x540 (0xA00 - 0x4C0)
// Class ShooterGame.PointOfInterestActor
class APointOfInterestActor : public AActor
{
public:
	uint8                                        Pad_24EF[0x10];                                    // Fixing Size After Last Property  > TateDumper <
	class USceneComponent*                       PointRootComp;                                     // 0x4D0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class USphereComponent*                      PointUseSphereComp;                                // 0x4D8(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UTextRenderComponent*                  PointTextComp;                                     // 0x4E0(0x8)(BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UTextRenderComponent*                  PointTitleTextComp;                                // 0x4E8(0x8)(ConstParm, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FPointOfInterestData                  MyPointOfInterestData;                             // 0x4F0(0x1E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FPointOfInterestCompanionBehavior     MyPointOfInterestCompanionBehavior;                // 0x6D0(0x300)(BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FVector                               UseSphereLocOffset;                                // 0x9D0(0x18)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        UseSphereRadius;                                   // 0x9E8(0x4)(Edit, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        TitleTextZOffset;                                  // 0x9EC(0x4)(ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bHasBeenViewed : 1;                                // Mask: 0x1, PropSize: 0x10x9F0(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bSyncWithPointManager : 1;                         // Mask: 0x2, PropSize: 0x10x9F0(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bPreventViewMultiUseEntry : 1;                     // Mask: 0x4, PropSize: 0x10x9F0(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bDebugPointActor_Persistent : 1;                   // Mask: 0x8, PropSize: 0x10x9F0(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bDebugPointActor_Single : 1;                       // Mask: 0x10, PropSize: 0x10x9F0(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bDebugPointActor_ClearDebugLines : 1;              // Mask: 0x20, PropSize: 0x10x9F0(0x1)(Edit, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_158 : 2;                                    // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_24F3[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class APointOfInterestManagerList*           MyPointManager;                                    // 0x9F8(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class APointOfInterestActor* GetDefaultObj();

	void RefreshPointData();
	bool IsPointOfInterestValid();
	struct FPointOfInterestData GetMyPointOfInterestData();
	struct FPointOfInterestCompanionBehavior GetMyPointOfInterestCompanionBehavior();
};

// 0x60 (0xA60 - 0xA00)
// Class ShooterGame.CompanionEventTrigger
class ACompanionEventTrigger : public APointOfInterestActor
{
public:
	class UBoxComponent*                         BoxTriggerComp;                                    // 0xA00(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UTextRenderComponent*                  EventTitleTextComp;                                // 0xA08(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FCompanionEventData                   MyEventData;                                       // 0xA10(0x50)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class ACompanionEventTrigger* GetDefaultObj();

	void OnEndOverlap(class AActor* OverlappedActor, class AActor** Actor);
	void OnBeginOverlap(class AActor* OverlappedActor, class AActor** Actor);
};

// 0x18 (0x770 - 0x758)
// Class ShooterGame.ConsoleCommandButtonWidget
class UConsoleCommandButtonWidget : public UBaseSelectableButtonWidget
{
public:
	uint8                                        Pad_2500[0x18];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UConsoleCommandButtonWidget* GetDefaultObj();

};

// 0x58 (0x388 - 0x330)
// Class ShooterGame.ContextMenu
class UContextMenu : public UPrimalUserWidget
{
public:
	FDelegateProperty_                           OnPopulateMenu;                                    // 0x330(0x10)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	FDelegateProperty_                           OnPopulateMenuCustom;                              // 0x340(0x10)(EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnActiveItemChanged;                               // 0x350(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FName                                  CustomName;                                        // 0x360(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2520[0x20];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UContextMenu* GetDefaultObj();

	class UContextMenuItem* SetActiveItem();
	class UContextMenu* PopulateContextMenuCustom__DelegateSignature(class FName* MenuName);
	class UContextMenu* PopulateContextMenu__DelegateSignature();
	class UContextMenuItem* GetActiveItem();
	void CloseMenu(bool* CloseParents);
	void ActiveMenuItemChanged__DelegateSignature(class UContextMenu** Menu, class UContextMenuItem** NewItem, class UContextMenuItem** OldItem);
};

// 0xF8 (0x428 - 0x330)
// Class ShooterGame.ContextMenuItem
class UContextMenuItem : public UPrimalUserWidget
{
public:
	FDelegateProperty_                           OnGetMenuContentEvent;                             // 0x330(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
	FDelegateProperty_                           OnGetMenuContentEventCustom;                       // 0x340(0x10)(OutParm, ZeroConstructor, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnExecuteMainAction;                               // 0x350(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnExecuteMainActionCustom;                         // 0x360(0x10)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FName                                  SubmenuMenuAnchorName;                             // 0x370(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FName                                  SubmenuIndicatorName;                              // 0x378(0x8)(BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FName                                  ShortcutKeyWidgetName;                             // 0x380(0x8)(BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FName                                  SwitchName;                                        // 0x388(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FName                                  SwitchContainerName;                               // 0x390(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	enum class EUContextMenuItemSwitchMode       SwitchType;                                        // 0x398(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	bool                                         IsSwitchedOn;                                      // 0x399(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2542[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  CustomName;                                        // 0x39C(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2543[0x84];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UContextMenuItem* GetDefaultObj();

	void SetSubmenuEnabled(bool bEnabled);
	void SetShortcutKey(int32 ComboKeyIdx, const struct FKey& Key);
	void SetJustification(enum class ETextJustify* Value);
	void SetCaption(class FText Caption);
	class UWidget* OnGetContextMenuContent();
	class FName OnButtonClickedEventObjectCustom__DelegateSignature();
	class UContextMenuItem* OnButtonClickedEventObject__DelegateSignature();
	void OnButtonClicked();
	class UContextMenu* OnActiveMenuItemChanged(class UContextMenuItem* NewActiveItem, class UContextMenuItem** OldActiveItem);
	bool GetSubmenuEnabled();
	class UContextMenu* GetSubmenuContentCustom__DelegateSignature();
	class UContextMenu* GetSubmenuContent__DelegateSignature();
	enum class ETextJustify GetJustification();
	class FText GetCaption();
};

// 0x20 (0x448 - 0x428)
// Class ShooterGame.ContextMenuItem_CosmeticEntry
class UContextMenuItem_CosmeticEntry : public UContextMenuItem
{
public:
	uint8                                        Pad_254F[0x20];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UContextMenuItem_CosmeticEntry* GetDefaultObj();

	class UTexture2D* SetImage();
	int32 SetData(int64 ModId);
};

// 0x18 (0x440 - 0x428)
// Class ShooterGame.ContextMenuItem_Sort
class UContextMenuItem_Sort : public UContextMenuItem
{
public:
	class FName                                  SorDirSwitcherName;                                // 0x428(0x8)(Edit, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2551[0x10];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UContextMenuItem_Sort* GetDefaultObj();

};

// 0x38 (0x460 - 0x428)
// Class ShooterGame.ContextMenuItem_Spinner
class UContextMenuItem_Spinner : public UContextMenuItem
{
public:
	FMulticastInlineDelegateProperty_            OnValueCommitted;                                  // 0x428(0x10)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_257F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        MinValue;                                          // 0x43C(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	int32                                        MaxValue;                                          // 0x440(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2581[0x1C];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UContextMenuItem_Spinner* GetDefaultObj();

	void SetValue(int32 NewValue);
	void SetMinValue(int32 NewValue);
	void SetMaxValue(int32 NewValue);
	int32 OnSpinnerValueCommitedEvent__DelegateSignature(enum class ETextCommit* CommitMethod);
	class FText HandleOnTextCommited(enum class ETextCommit* CommitMethod);
	class FText HandleOnTextChanged();
	void HandleOnButtonIncreaseClicked();
	void HandleOnButtonDecreaseClicked();
	int32 GetValue();
	int32 GetMinValue();
	int32 GetMaxValue();
};

// 0x20 (0x3A8 - 0x388)
// Class ShooterGame.ContextMenu_DinoGroupEntry
class UContextMenu_DinoGroupEntry : public UContextMenu
{
public:
	class UClass*                                ItemClass_SimpleButton;                            // 0x388(0x8)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                ItemClass_SimpleCaption;                           // 0x390(0x8)(Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                ItemClass_Spinner;                                 // 0x398(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                SubmenuClass;                                      // 0x3A0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UContextMenu_DinoGroupEntry* GetDefaultObj();

	class UContextMenu* PopulateRootMenu();
	class UContextMenuItem* HandleActionSetGroup();
	class UContextMenuItem* HandleActionRemoveDino();
	class UContextMenuItem* HandleActionRemoveClass();
};

// 0x8 (0x390 - 0x388)
// Class ShooterGame.ContextMenu_InventorySort
class UContextMenu_InventorySort : public UContextMenu
{
public:
	class UClass*                                ItemClass_SortButton;                              // 0x388(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class UContextMenu_InventorySort* GetDefaultObj();

	class UContextMenu* PopulateRootMenu();
	class UContextMenuItem* HandleActionWeight();
	class UContextMenuItem* HandleActionUnsort();
	class UContextMenuItem* HandleActionType();
	class UContextMenuItem* HandleActionSpoilTimer();
	class UContextMenuItem* HandleActionAlphabetical();
};

// 0x58 (0x3E0 - 0x388)
// Class ShooterGame.ContextMenu_PrimalItem
class UContextMenu_PrimalItem : public UContextMenu
{
public:
	class UClass*                                ItemClass_SimpleButton;                            // 0x388(0x8)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                ItemClass_SimpleCaption;                           // 0x390(0x8)(Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                ItemClass_Spinner;                                 // 0x398(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                ItemClass_CosmeticEntry;                           // 0x3A0(0x8)(Edit, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                SubmenuClass;                                      // 0x3A8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2610[0x10];                                    // Fixing Size After Last Property  > TateDumper <
	int32                                        SplitAmountValue;                                  // 0x3C0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        SplitAmountMax;                                    // 0x3C4(0x4)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        CraftAmountValue;                                  // 0x3C8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        CraftAmountMax;                                    // 0x3CC(0x4)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        CraftQuantityValue;                                // 0x3D0(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        CraftQuantityMax;                                  // 0x3D4(0x4)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bIsFreeCraftingMode : 1;                           // Mask: 0x1, PropSize: 0x10x3D8(0x1)(Edit, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2611[0x7];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UContextMenu_PrimalItem* GetDefaultObj();

	class UContextMenu* PopulateSubmenuSplitStack();
	class UContextMenu* PopulateSubmenuSplitAmount();
	class UContextMenu* PopulateSubmenuRemove();
	class UContextMenu* PopulateSubmenuCustomCosmetics();
	class FName PopulateSubmenuCustom();
	class UContextMenu* PopulateSubmenuCraftAmount();
	class UContextMenu* PopulateRootMenu();
	class UContextMenu* PopulateFolderMenu();
	class UContextMenu* PopulateCraftMenu();
	int32 HandleSplitAmountValueCommit(enum class ETextCommit* CommitMethod);
	class UContextMenu* HandleOnGetSubmenuSplitStackContent();
	class UContextMenu* HandleOnGetSubmenuSplitAmountContent();
	class UContextMenu* HandleOnGetSubmenuRemoveContent();
	class UContextMenu* HandleOnGetSubmenuCustomCosmetics();
	class UContextMenu* HandleOnGetSubmenuCustomContent();
	class UContextMenu* HandleOnGetSubmenuCraftContent();
	class UContextMenu* HandleOnGetSubmenuCraftAmountContent();
	int32 HandleCraftAmountValueCommit(enum class ETextCommit* CommitMethod);
	class UContextMenuItem* HandleActionUse();
	class UContextMenuItem* HandleActionUnequip();
	class UContextMenuItem* HandleActionTransfer();
	class UContextMenuItem* HandleActionTrack();
	class UContextMenuItem* HandleActionSplitOne();
	class UContextMenuItem* HandleActionSplitHalf();
	class UContextMenuItem* HandleActionSplitAmount();
	class UContextMenuItem* HandleActionSplitAll();
	class UContextMenuItem* HandleActionSetCraftQuantity();
	class UContextMenuItem* HandleActionRepair();
	class UContextMenuItem* HandleActionRenameFolder();
	class UContextMenuItem* HandleActionRemoveSkin();
	class UContextMenuItem* HandleActionRemoveCosmetic();
	class UContextMenuItem* HandleActionRemoveAmmo();
	class UContextMenuItem* HandleActionRemoveAccessory();
	class UContextMenuItem* HandleActionFavorite();
	class UContextMenuItem* HandleActionFastInventoryInFolder();
	class UContextMenuItem* HandleActionEquipAllInFolder();
	class UContextMenuItem* HandleActionEquip();
	class UContextMenuItem* HandleActionDiscard();
	class UContextMenuItem* HandleActionDeleteFolder();
	class FName HandleActionCustom();
	class UContextMenuItem* HandleActionCraftOne();
	class UContextMenuItem* HandleActionCraftAmount();
	class UContextMenuItem* HandleActionCraftAll();
	class UContextMenuItem* HandleActionApplyCosmetic();
	void BPUpdateCanUse();
};

// 0x8 (0x4E8 - 0x4E0)
// Class ShooterGame.CorruptedAvatarAttackCoordinator
class ACorruptedAvatarAttackCoordinator : public AAIAttackCoordinator
{
public:
	uint8                                        Pad_2618[0x8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class ACorruptedAvatarAttackCoordinator* GetDefaultObj();

};

// 0x88 (0x7E0 - 0x758)
// Class ShooterGame.CosmeticSelectorPanelUI
class UCosmeticSelectorPanelUI : public UPrimalUI
{
public:
	uint8                                        Pad_2620[0x88];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCosmeticSelectorPanelUI* GetDefaultObj();

	class UUI_Inventory* SetupInventory();
	class FText SearchTextChangedItem();
	class FText SearchTextChangedCosmetic();
	enum class ESelectInfo OnFilterItemTypeSelected(const class FString& SelectedItem);
	enum class ESelectInfo OnFilterCosmeticTypeSelected(const class FString& SelectedItem);
};

// 0xB0 (0xE8 - 0x38)
// Class ShooterGame.CursorSettings
class UCursorSettings : public UDeveloperSettings
{
public:
	struct FRuntimeFloatCurve                    AnalogCursorAccelerationCurve;                     // 0x38(0x88)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MaxAnalogCursorSpeed;                              // 0xC0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MaxAnalogCursorSpeedWhenHovered;                   // 0xC4(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AnalogCursorDragCoefficient;                       // 0xC8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AnalogCursorDragCoefficientWhenHovered;            // 0xCC(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MinAnalogCursorSpeed;                              // 0xD0(0x4)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AnalogCursorDeadZone;                              // 0xD4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AnalogCursorAccelerationMultiplier;                // 0xD8(0x4)(Edit, ConstParm, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AnalogCursorSize;                                  // 0xDC(0x4)(ConstParm, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bUseEngineAnalogCursor;                            // 0xE0(0x1)(ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAnalogCursorNoAcceleration;                       // 0xE1(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2625[0x6];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCursorSettings* GetDefaultObj();

};

// 0x18 (0x4D8 - 0x4C0)
// Class ShooterGame.CustomActorList
class ACustomActorList : public AInfo
{
public:
	TArray<class AActor*>                        ActorList;                                         // 0x4C0(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2629[0x8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class ACustomActorList* GetDefaultObj();

	void DestroyActors();
};

// 0x60 (0x740 - 0x6E0)
// Class ShooterGame.CustomButtonWidget
class UCustomButtonWidget : public UButton
{
public:
	struct FCustomButtonWidgetStyle              ExtendedWidgetStyle;                               // 0x6E0(0x48)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         IsToggleButton;                                    // 0x728(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         IsToggledOn;                                       // 0x729(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_262E[0x16];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UCustomButtonWidget* GetDefaultObj();

	bool SetToggledState();
	bool SetIsToggleButton();
	bool GetToggledState();
	bool GetIsToggleButton();
	bool BPSetToggledState();
};

// 0x39E8 (0x3FB0 - 0x5C8)
// Class ShooterGame.ShooterGameMode
class AShooterGameMode : public APrimalGameMode
{
public:
	uint8                                        Pad_281C[0x108];                                   // Fixing Size After Last Property  > TateDumper <
	class FString                                BanFileName;                                       // 0x6D0(0x10)(BlueprintVisible, ExportObject, Net, Parm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_281D[0x188];                                   // Fixing Size After Last Property  > TateDumper <
	class UShooterCheatManager*                  ServerCheatManager;                                // 0x868(0x8)(ConstParm, Net, Parm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ForceLoadWorldSeconds;                             // 0x870(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_281F[0x14];                                    // Fixing Size After Last Property  > TateDumper <
	class URCONServer*                           RCONSocket;                                        // 0x888(0x8)(BlueprintReadOnly, Parm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                PlayersJoinNoCheckFilename;                        // 0x890(0x10)(ConstParm, Parm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                PlayersExclusiveCheckFilename;                     // 0x8A0(0x10)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UShooterCheatManager*                  GlobalCommandsCheatManager;                        // 0x8B0(0x8)(BlueprintVisible, Net, EditFixedSize, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2821[0x10];                                    // Fixing Size After Last Property  > TateDumper <
	class FString                                CheckGlobalEnablesURL;                             // 0x8C8(0x10)(ExportObject, BlueprintReadOnly, EditFixedSize, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UDatabase_LoginData*                   Database_LoginDataRef;                             // 0x8D8(0x8)(BlueprintVisible, ExportObject, EditFixedSize, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UDatabase_PubSub_GeneralNotifications* PubSub_GeneralNotificationsRef;                    // 0x8E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2822[0x88];                                    // Fixing Size After Last Property  > TateDumper <
	TMap<int32, uint64>                          PlayersIds;                                        // 0x970(0x50)(ConstParm, BlueprintVisible, ExportObject, Net, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TMap<uint64, int32>                          SteamIds;                                          // 0x9C0(0x50)(ConstParm, Net, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2823[0x50];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bGlobalDisableLoginLockCheck;                      // 0xA60(0x1)(Edit, ConstParm, BlueprintReadOnly, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bTempDisableLoginLockCheck;                        // 0xA61(0x1)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2825[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                MyServerId;                                        // 0xA68(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2827[0x70];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<struct FTribeData>                    TribesData;                                        // 0xAE8(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class APrimalDinoCharacter*>          ActivelyTamingDinos;                               // 0xAF8(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAutoCreateNewPlayerData;                          // 0xB08(0x1)(Edit, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2828[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        DifficultyValue;                                   // 0xB10(0x4)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        DifficultyValueMin;                                // 0xB14(0x4)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        DifficultyValueMax;                                // 0xB18(0x4)(BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ProximityRadius;                                   // 0xB1C(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ProximityRadiusUnconsiousScale;                    // 0xB20(0x4)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_282D[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                CheatClass;                                        // 0xB28(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsOfficialServer;                                 // 0xB30(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsCurrentlySavingWorld;                           // 0xB31(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_282F[0x1];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bIsConsoleUnOfficialPCServer;                      // 0xB33(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bServerAllowArkDownload;                           // 0xB34(0x1)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2831[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bAlwaysNotifyPlayerLeft;                           // 0xB37(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAlwaysNotifyPlayerJoined;                         // 0xB38(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bServerHardcore;                                   // 0xB39(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2834[0x33];                                    // Fixing Size After Last Property  > TateDumper <
	bool                                         bEnableCryoSicknessPVE;                            // 0xB6D(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2835[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CryopodNerfDamageMult;                             // 0xB70(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        CryopodNerfDuration;                               // 0xB74(0x4)(BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bEnableMeshBitingProtection;                       // 0xB78(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2837[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        CryopodNerfIncomingDamageMultPercent;              // 0xB7C(0x4)(ConstParm, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2838[0x48];                                    // Fixing Size After Last Property  > TateDumper <
	float                                        ResourcesRespawnPeriodMultiplier;                  // 0xBC8(0x4)(Edit, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	float                                        KickIdlePlayersPeriod;                             // 0xBCC(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MateBoostEffectMultiplier;                         // 0xBD0(0x4)(ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AutoSavePeriodMinutes;                             // 0xBD4(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        XPMultiplier;                                      // 0xBD8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, SubobjectReference)
	class FName                                  ActiveEvent;                                       // 0xBDC(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        TribeNameChangeCooldown;                           // 0xBE4(0x4)(Edit, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        PlatformSaddleBuildAreaBoundsMultiplier;           // 0xBE8(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAlwaysAllowStructurePickup;                       // 0xBEC(0x1)(Edit, BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_283D[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        StructurePickupTimeAfterPlacement;                 // 0xBF0(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        StructurePickupHoldDuration;                       // 0xBF4(0x4)(BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bAllowHideDamageSourceFromLogs;                    // 0xBF8(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_283F[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        KillXPMultiplier;                                  // 0xBFC(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        HarvestXPMultiplier;                               // 0xC00(0x4)(ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        CraftXPMultiplier;                                 // 0xC04(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        GenericXPMultiplier;                               // 0xC08(0x4)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        SpecialXPMultiplier;                               // 0xC0C(0x4)(ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        AlphaKillXPMultiplier;                             // 0xC10(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        CaveKillXPMultiplier;                              // 0xC14(0x4)(Edit, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        WildKillXPMultiplier;                              // 0xC18(0x4)(ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        BossKillXPMultiplier;                              // 0xC1C(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        TamedKillXPMultiplier;                             // 0xC20(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        UnclaimedKillXPMultiplier;                         // 0xC24(0x4)(Edit, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ExplorerNoteXPMultiplier;                          // 0xC28(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2846[0x84];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<class UPrimalPlayerData*>             PlayerDatas;                                       // 0xCB0(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2848[0xE];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bForceRespawnDinos;                                // 0xCCE(0x1)(Edit, ConstParm, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_284A[0x29];                                    // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnCharacterPossessedByPlayer;                      // 0xCF8(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnCharacterUnpossessedByPlayer;                    // 0xD08(0x10)(BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnShooterCharacterSpawned;                         // 0xD18(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnShooterCharacterDied;                            // 0xD28(0x10)(ConstParm, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnMissionTriggerBeginOverlap;                      // 0xD38(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Config, GlobalConfig)
	FMulticastInlineDelegateProperty_            OnMissionTriggerEndOverlap;                        // 0xD48(0x10)(ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, Config, GlobalConfig)
