#pragma once

// Dumped with TateDumper!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x8 (0x8 - 0x0)
// Function ShooterGame.DataListEntryButton.OnGetContextMenuContent
struct UDataListEntryButton_OnGetContextMenuContent_Params
{
public:
	class UWidget*                               ReturnValue;                                       // 0x0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.DataListEntryButton.GetStringValue
struct UDataListEntryButton_GetStringValue_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.DataListEntryButton.GetOverridenStringValue
struct UDataListEntryButton_GetOverridenStringValue_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.DataListEntryButton.ClickedSecondaryButton
struct UDataListEntryButton_ClickedSecondaryButton_Params
{
public:
	class UWidget*                               ClickedWidget;                                     // 0x0(0x8)(Edit, ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.DataListEntryButton.ClickedButton
struct UDataListEntryButton_ClickedButton_Params
{
public:
	class UWidget*                               ClickedWidget;                                     // 0x0(0x8)(Edit, ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
};

// 0x50 (0x50 - 0x0)
// Function ShooterGame.AhoCorasickMatch.SearchWords
struct UAhoCorasickMatch_SearchWords_Params
{
public:
	class FString                                Text;                                              // 0x0(0x10)(Edit, Net, OutParm, DisableEditOnTemplate, EditConst)
	struct FAhoCorasickMatcher                   Matcher;                                           // 0x10(0x18)(ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<class FString>                        OutKeys;                                           // 0x28(0x10)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ReturnParm, Config, InstancedReference, SubobjectReference)
	TArray<struct FIntArray>                     OutValues;                                         // 0x38(0x10)(ConstParm, BlueprintReadOnly, Net, Config, InstancedReference, SubobjectReference)
	bool                                         bFilterOverlaps;                                   // 0x48(0x1)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bGetShortest;                                      // 0x49(0x1)(ConstParm, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1AAC[0x6];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.AhoCorasickMatch.AddWords
struct UAhoCorasickMatch_AddWords_Params
{
public:
	TArray<class FString>                        WordList;                                          // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	struct FAhoCorasickMatcher                   Matcher;                                           // 0x10(0x18)(ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.AIAttackCoordinator.UpdateAttackGroup
struct AAIAttackCoordinator_UpdateAttackGroup_Params
{
public:
	TArray<class APrimalDinoAIController*>       AttackGroup;                                       // 0x0(0x10)(ConstParm, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.AIAttackCoordinator.RemoveAttacker
struct AAIAttackCoordinator_RemoveAttacker_Params
{
public:
	class APrimalDinoAIController*               Controller;                                        // 0x0(0x8)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, Config, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.AIAttackCoordinator.GetNumAttackersWithPriorityForTarget
struct AAIAttackCoordinator_GetNumAttackersWithPriorityForTarget_Params
{
public:
	class AActor*                                Target;                                            // 0x0(0x8)(Edit, ConstParm, ReturnParm, Transient, Config)
	int32                                        ReturnValue;                                       // 0x8(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1ABC[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.AIAttackCoordinator.GetNumAttackersForTarget
struct AAIAttackCoordinator_GetNumAttackersForTarget_Params
{
public:
	class AActor*                                Target;                                            // 0x0(0x8)(Edit, ConstParm, ReturnParm, Transient, Config)
	int32                                        ReturnValue;                                       // 0x8(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1AC4[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.AIAttackCoordinator.CalculateAttackerPriorityWeight
struct AAIAttackCoordinator_CalculateAttackerPriorityWeight_Params
{
public:
	class APrimalDinoAIController*               Attacker;                                          // 0x0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        ReturnValue;                                       // 0x8(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1ACE[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.AIAttackCoordinator.AddAttackerCharacter
struct AAIAttackCoordinator_AddAttackerCharacter_Params
{
public:
	class APrimalDinoCharacter*                  Character;                                         // 0x0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.AIAttackCoordinator.AddAttacker
struct AAIAttackCoordinator_AddAttacker_Params
{
public:
	class APrimalDinoAIController*               Controller;                                        // 0x0(0x8)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, Config, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.AllClustersInventory.OnFinishedSaveForChangingItems
struct UAllClustersInventory_OnFinishedSaveForChangingItems_Params
{
public:
	bool                                         Success;                                           // 0x0(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config)
	uint8                                        Pad_1B0B[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                UserId;                                            // 0x8(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.AllClustersInventory.OnFinishedReadLockForCreateLock
struct UAllClustersInventory_OnFinishedReadLockForCreateLock_Params
{
public:
	bool                                         Success;                                           // 0x0(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config)
	uint8                                        Pad_1B0F[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                UserId;                                            // 0x8(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         Locked;                                            // 0x18(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Config, DisableEditOnInstance)
	uint8                                        Pad_1B10[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.AllClustersInventory.OnFinishedLoadForChangingItems
struct UAllClustersInventory_OnFinishedLoadForChangingItems_Params
{
public:
	bool                                         Success;                                           // 0x0(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config)
	uint8                                        Pad_1B14[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                UserId;                                            // 0x8(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	TArray<struct FItemNetInfo>                  ArkItems;                                          // 0x18(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.AllClustersInventory.OnFinishedCreateLockForChangingItems
struct UAllClustersInventory_OnFinishedCreateLockForChangingItems_Params
{
public:
	bool                                         Success;                                           // 0x0(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config)
	uint8                                        Pad_1B1D[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                UserId;                                            // 0x8(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.AllClustersInventory.OnFinishedClearLockForChangingItems
struct UAllClustersInventory_OnFinishedClearLockForChangingItems_Params
{
public:
	bool                                         Success;                                           // 0x0(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config)
	uint8                                        Pad_1B20[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                UserId;                                            // 0x8(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.BaseBoxTrigger.OnTriggerEndOverlap
struct ABaseBoxTrigger_OnTriggerEndOverlap_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComponent;                               // 0x0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1C89[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x110 (0x110 - 0x0)
// Function ShooterGame.BaseBoxTrigger.OnTriggerBeginOverlap
struct ABaseBoxTrigger_OnTriggerBeginOverlap_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComponent;                               // 0x0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         bFromSweep;                                        // 0x1C(0x1)(Edit, ExportObject, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CA1[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FHitResult                            SweepResult;                                       // 0x20(0xF0)(ConstParm, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.BaseBoxTrigger.IsCharacterTouchingTrigger
struct ABaseBoxTrigger_IsCharacterTouchingTrigger_Params
{
public:
	class APrimalCharacter*                      Character;                                         // 0x0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1CA5[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.BaseBoxTrigger.GetAllCharactersTouchingTrigger
struct ABaseBoxTrigger_GetAllCharactersTouchingTrigger_Params
{
public:
	TArray<class APrimalCharacter*>              OutCharacters;                                     // 0x0(0x10)(ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.BaseBoxTrigger.BPOnTriggerEndOverlap
struct ABaseBoxTrigger_BPOnTriggerEndOverlap_Params
{
public:
	class AActor*                                OtherActor;                                        // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x8(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	int32                                        OtherBodyIndex;                                    // 0x10(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CAB[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x108 (0x108 - 0x0)
// Function ShooterGame.BaseBoxTrigger.BPOnTriggerBeginOverlap
struct ABaseBoxTrigger_BPOnTriggerBeginOverlap_Params
{
public:
	class AActor*                                OtherActor;                                        // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x8(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	int32                                        OtherBodyIndex;                                    // 0x10(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	bool                                         bFromSweep;                                        // 0x14(0x1)(Edit, ExportObject, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
	uint8                                        Pad_1CB1[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FHitResult                            SweepResult;                                       // 0x18(0xF0)(ConstParm, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.BasePlayerController.SimulateInputKey
struct ABasePlayerController_SimulateInputKey_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintReadOnly, OutParm, ReturnParm, Transient, DisableEditOnInstance)
	bool                                         bPressed;                                          // 0x18(0x1)(Edit, ConstParm, Net, EditFixedSize, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1CBB[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.BasePlayerController.ServerCheat
struct ABasePlayerController_ServerCheat_Params
{
public:
	class FString                                Msg;                                               // 0x0(0x10)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.BasePlayerController.Say
struct ABasePlayerController_Say_Params
{
public:
	class FString                                Msg;                                               // 0x0(0x10)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x30 (0x30 - 0x0)
// Function ShooterGame.BasePlayerController.ClientSetSpectatorCamera
struct ABasePlayerController_ClientSetSpectatorCamera_Params
{
public:
	struct FVector                               CameraLocation;                                    // 0x0(0x18)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	struct FRotator                              CameraRotation;                                    // 0x18(0x18)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.BasePlayerController.ClientSendRoundEndEvent
struct ABasePlayerController_ClientSendRoundEndEvent_Params
{
public:
	bool                                         bIsWinner;                                         // 0x0(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1CC9[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        ExpendedTimeInSeconds;                             // 0x4(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.PrimalUserWidget.StopAnimationByString
struct UPrimalUserWidget_StopAnimationByString_Params
{
public:
	class FString                                Name;                                              // 0x0(0x10)(ConstParm, Net, OutParm)
};

// 0x4 (0x4 - 0x0)
// Function ShooterGame.PrimalUserWidget.SetZOrderInViewport
struct UPrimalUserWidget_SetZOrderInViewport_Params
{
public:
	int32                                        ZOrder;                                            // 0x0(0x4)(Edit, Net, Parm, OutParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.PrimalUserWidget.PlayAnimationByString
struct UPrimalUserWidget_PlayAnimationByString_Params
{
public:
	class FString                                Name;                                              // 0x0(0x10)(ConstParm, Net, OutParm)
	bool                                         ReturnValue;                                       // 0x10(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1CD9[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.PrimalUserWidget.OnWidgetGamepadActiveChangedBP
struct UPrimalUserWidget_OnWidgetGamepadActiveChangedBP_Params
{
public:
	bool                                         bIsGamepadActive;                                  // 0x0(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x30 (0x30 - 0x0)
// Function ShooterGame.PrimalUserWidget.NumCharactersThatFit
struct UPrimalUserWidget_NumCharactersThatFit_Params
{
public:
	class FString                                TheString;                                         // 0x0(0x10)(Edit, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	float                                        WidthThreshold;                                    // 0x10(0x4)(Edit, Parm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1CDF[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UFont*                                 TheFont;                                           // 0x18(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class FString                                ReturnValue;                                       // 0x20(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.PrimalUserWidget.HandleVirtualBack
struct UPrimalUserWidget_HandleVirtualBack_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.PrimalUserWidget.HandleKeyUp
struct UPrimalUserWidget_HandleKeyUp_Params
{
public:
	struct FKey                                  TheKey;                                            // 0x0(0x18)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x18(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1CE8[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.PrimalUserWidget.GetOverrideHighligteableWidgetBP
struct UPrimalUserWidget_GetOverrideHighligteableWidgetBP_Params
{
public:
	class UWidget*                               ReturnValue;                                       // 0x0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x80 (0x80 - 0x0)
// Function ShooterGame.PrimalUserWidget.ExecuteCommandForPrimalUI
struct UPrimalUserWidget_ExecuteCommandForPrimalUI_Params
{
public:
	class FName                                  CommandName;                                       // 0x0(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	struct FBPNetExecParams                      ExecParams;                                        // 0x8(0x78)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x80 (0x80 - 0x0)
// Function ShooterGame.PrimalUserWidget.BPExecutedCommandForPrimalUI
struct UPrimalUserWidget_BPExecutedCommandForPrimalUI_Params
{
public:
	class FName                                  CommandName;                                       // 0x0(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	struct FBPNetExecParams                      ExecParams;                                        // 0x8(0x78)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x2 (0x2 - 0x0)
// Function ShooterGame.PrimalUI.UsingProController
struct UPrimalUI_UsingProController_Params
{
public:
	bool                                         DebugOut;                                          // 0x0(0x1)(ConstParm, ExportObject, Net, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x1(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.PrimalUI.ShowDLCConfirmationDialog
struct UPrimalUI_ShowDLCConfirmationDialog_Params
{
public:
	enum class EDLCSelector                      DLC;                                               // 0x0(0x1)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1CF7[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UUI_GenericConfirmationDialog*         ReturnValue;                                       // 0x8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.PrimalUI.ShowConfirmationDialogBP
struct UPrimalUI_ShowConfirmationDialogBP_Params
{
public:
	class FString                                TitleText;                                         // 0x0(0x10)(Edit, Net, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	class FString                                MessageText;                                       // 0x10(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	bool                                         IsJustOKBox;                                       // 0x20(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1CFE[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.PrimalUI.SetHighlightedWidget
struct UPrimalUI_SetHighlightedWidget_Params
{
public:
	class UWidget*                               Widget;                                            // 0x0(0x8)(ConstParm, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst)
	bool                                         bSetLastHighlightedPosition;                       // 0x8(0x1)(Edit, ConstParm, ExportObject, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1D06[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.PrimalUI.ProcessSplitscreen
struct UPrimalUI_ProcessSplitscreen_Params
{
public:
	bool                                         ScaleX;                                            // 0x0(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x30 (0x30 - 0x0)
// Function ShooterGame.PrimalUI.PlayHapticEffect
struct UPrimalUI_PlayHapticEffect_Params
{
public:
	class APlayerController*                     PC;                                                // 0x0(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	enum class EHapticEffectType                 Type;                                              // 0x8(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Transient, Config)
	uint8                                        Pad_1D1C[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               Location;                                          // 0x10(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor)
	class UWorld*                                World;                                             // 0x28(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, Transient, DisableEditOnInstance)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.PrimalUI.OpenTheStoreDLCPage
struct UPrimalUI_OpenTheStoreDLCPage_Params
{
public:
	class FString                                TheDLCName;                                        // 0x0(0x10)(Edit, BlueprintVisible, Parm, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x168 (0x168 - 0x0)
// Function ShooterGame.PrimalUI.OnMouseButtonDownEvent
struct UPrimalUI_OnMouseButtonDownEvent_Params
{
public:
	struct FGeometry                             MyGeometry;                                        // 0x0(0x38)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FPointerEvent                         MouseEvent;                                        // 0x38(0x78)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FEventReply                           ReturnValue;                                       // 0xB0(0xB8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x130 (0x130 - 0x0)
// Function ShooterGame.PrimalUI.OnKeyUpEvent
struct UPrimalUI_OnKeyUpEvent_Params
{
public:
	struct FGeometry                             MyGeometry;                                        // 0x0(0x38)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FKeyEvent                             InKeyboardEvent;                                   // 0x38(0x40)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FEventReply                           ReturnValue;                                       // 0x78(0xB8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x130 (0x130 - 0x0)
// Function ShooterGame.PrimalUI.OnKeyDownEvent
struct UPrimalUI_OnKeyDownEvent_Params
{
public:
	struct FGeometry                             MyGeometry;                                        // 0x0(0x38)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FKeyEvent                             InKeyboardEvent;                                   // 0x38(0x40)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	struct FEventReply                           ReturnValue;                                       // 0x78(0xB8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x130 (0x130 - 0x0)
// Function ShooterGame.PrimalUI.OnGamepadButtonDownEvent
struct UPrimalUI_OnGamepadButtonDownEvent_Params
{
public:
	struct FGeometry                             MyGeometry;                                        // 0x0(0x38)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	struct FControllerEvent                      ControllerEvent;                                   // 0x38(0x40)(Edit, Net, EditFixedSize, OutParm, ReturnParm, Transient, Config)
	struct FEventReply                           ReturnValue;                                       // 0x78(0xB8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.PrimalUI.OnGamepadActiveChangedBP
struct UPrimalUI_OnGamepadActiveChangedBP_Params
{
public:
	bool                                         bIsGamepadActive;                                  // 0x0(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.PrimalUI.OnGamepadActiveChanged
struct UPrimalUI_OnGamepadActiveChanged_Params
{
public:
	bool                                         bIsGamepadActive;                                  // 0x0(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.PrimalUI.OnDLCConfirmationDialogClosed
struct UPrimalUI_OnDLCConfirmationDialogClosed_Params
{
public:
	bool                                         bAccept;                                           // 0x0(0x1)(ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.PrimalUI.OnCreateCredits
struct UPrimalUI_OnCreateCredits_Params
{
public:
	class UWidget*                               Widget;                                            // 0x0(0x8)(ConstParm, EditFixedSize, Parm, ReturnParm, Transient, DisableEditOnInstance, EditConst)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.PrimalUI.OnConfirmationDialogClosedBP
struct UPrimalUI_OnConfirmationDialogClosedBP_Params
{
public:
	bool                                         bAccept;                                           // 0x0(0x1)(ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.PrimalUI.OnConfirmationDialogClosed
struct UPrimalUI_OnConfirmationDialogClosed_Params
{
public:
	bool                                         bAccept;                                           // 0x0(0x1)(ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.PrimalUI.IsRightTriggerDown
struct UPrimalUI_IsRightTriggerDown_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.PrimalUI.IsLeftTriggerDown
struct UPrimalUI_IsLeftTriggerDown_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.PrimalUI.HTTPGetString
struct UPrimalUI_HTTPGetString_Params
{
public:
	class FString                                InURL;                                             // 0x0(0x10)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, InstancedReference, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.PrimalUI.GetWidgetToScaleForHandheld
struct UPrimalUI_GetWidgetToScaleForHandheld_Params
{
public:
	class UWidget*                               ReturnValue;                                       // 0x0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.PrimalUI.GetSizeboxForExtraHandheldScaling
struct UPrimalUI_GetSizeboxForExtraHandheldScaling_Params
{
public:
	class USizeBox*                              ReturnValue;                                       // 0x0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.PrimalUI.GetShooterHud
struct UPrimalUI_GetShooterHud_Params
{
public:
	class AShooterHUD*                           ReturnValue;                                       // 0x0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.PrimalUI.GetPlayerState
struct UPrimalUI_GetPlayerState_Params
{
public:
	class AShooterPlayerState*                   ReturnValue;                                       // 0x0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.PrimalUI.GetPC
struct UPrimalUI_GetPC_Params
{
public:
	class AShooterPlayerController*              ReturnValue;                                       // 0x0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.PrimalUI.GetPawn
struct UPrimalUI_GetPawn_Params
{
public:
	class APrimalCharacter*                      ReturnValue;                                       // 0x0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.PrimalUI.GetOpenComboBox
struct UPrimalUI_GetOpenComboBox_Params
{
public:
	class UComboBoxString*                       ReturnValue;                                       // 0x0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.PrimalUI.DoExtraScalingForSplitscreen
struct UPrimalUI_DoExtraScalingForSplitscreen_Params
{
public:
	struct FVector2D                             PlayerSize;                                        // 0x0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.PrimalUI.ClickedSecondaryButton
struct UPrimalUI_ClickedSecondaryButton_Params
{
public:
	class UWidget*                               ClickedWidget;                                     // 0x0(0x8)(Edit, ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.PrimalUI.ClickedButton
struct UPrimalUI_ClickedButton_Params
{
public:
	class UWidget*                               ClickedWidget;                                     // 0x0(0x8)(Edit, ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, GlobalConfig, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.PrimalUI.CheckGamepadActiveChanged
struct UPrimalUI_CheckGamepadActiveChanged_Params
{
public:
	bool                                         bIsGamepadActive;                                  // 0x0(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.PrimalUI.ChangeChildrenTextColorBP
struct UPrimalUI_ChangeChildrenTextColorBP_Params
{
public:
	class UPanelWidget*                          Parent;                                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance)
	struct FSlateColor                           NewColor;                                          // 0x8(0x14)(ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	bool                                         Recursive;                                         // 0x1C(0x1)(BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1D5D[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.PrimalUI.BPProcessSplitscreenAndAddToViewport
struct UPrimalUI_BPProcessSplitscreenAndAddToViewport_Params
{
public:
	bool                                         ScaleX;                                            // 0x0(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1D5F[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        ZOrder;                                            // 0x4(0x4)(Edit, Net, Parm, OutParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.PrimalUI.BPHighlightWidgetOnStart
struct UPrimalUI_BPHighlightWidgetOnStart_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.PrimalUI.BPHandleDockedModeChange
struct UPrimalUI_BPHandleDockedModeChange_Params
{
public:
	bool                                         bIsDocked;                                         // 0x0(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x3C (0x3C - 0x0)
// Function ShooterGame.PrimalUI.BPGameTick
struct UPrimalUI_BPGameTick_Params
{
public:
	struct FGeometry                             MyGeometry;                                        // 0x0(0x38)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	float                                        InDeltaTime;                                       // 0x38(0x4)(ConstParm, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.PrimalUI.BPGamepadReleased
struct UPrimalUI_BPGamepadReleased_Params
{
public:
	struct FKey                                  TheKey;                                            // 0x0(0x18)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x18(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1D64[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.PrimalUI.BPEscapeClosed
struct UPrimalUI_BPEscapeClosed_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.PrimalUI.BPCycleHighlighted
struct UPrimalUI_BPCycleHighlighted_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.PrimalUI.BPControlHighlighted
struct UPrimalUI_BPControlHighlighted_Params
{
public:
	enum class EControlDirection                 Dir;                                               // 0x0(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1D68[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FKey                                  TheKey;                                            // 0x8(0x18)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	float                                        AnalogValue;                                       // 0x20(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1D6A[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.BaseSelectableButtonWidget.BPSetSelected
struct UBaseSelectableButtonWidget_BPSetSelected_Params
{
public:
	bool                                         bSelected;                                         // 0x0(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.BaseSelectableButtonWidget.BPIsSelected
struct UBaseSelectableButtonWidget_BPIsSelected_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.BaseSelectableButtonWidget.BPGetButton
struct UBaseSelectableButtonWidget_BPGetButton_Params
{
public:
	class UCustomButtonWidget*                   ReturnValue;                                       // 0x0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x190 (0x190 - 0x0)
// Function ShooterGame.ShooterGameState.StartMassTeleport
struct AShooterGameState_StartMassTeleport_Params
{
public:
	struct FMassTeleportData                     MassTeleportData;                                  // 0x0(0x120)(Edit, ConstParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	struct FTeleportDestination                  TeleportDestination;                               // 0x120(0x40)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance)
	class AActor*                                InitiatingActor;                                   // 0x160(0x8)(Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	TArray<class AActor*>                        TeleportActors;                                    // 0x168(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	class UClass*                                BuffToApply;                                       // 0x178(0x8)(Edit, EditFixedSize, Parm, ReturnParm, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        TeleportDuration;                                  // 0x180(0x4)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	float                                        TeleportRadius;                                    // 0x184(0x4)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bTeleportingSnapsToGround;                         // 0x188(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bMaintainRotation;                                 // 0x189(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x18A(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1DB6[0x5];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x140 (0x140 - 0x0)
// Function ShooterGame.ShooterGameState.ShouldMassTeleportMoveActor
struct AShooterGameState_ShouldMassTeleportMoveActor_Params
{
public:
	class AActor*                                ForActor;                                          // 0x0(0x8)(ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1DBC[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FMassTeleportData                     WithMassTeleportData;                              // 0x10(0x120)(ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x130(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1DBD[0xF];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x4 (0x4 - 0x0)
// Function ShooterGame.ShooterGameState.SetNextEnvironmentIndex
struct AShooterGameState_SetNextEnvironmentIndex_Params
{
public:
	int32                                        NewNextEnvironmentIndex;                           // 0x0(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x4 (0x4 - 0x0)
// Function ShooterGame.ShooterGameState.SetEnvironmentIndex
struct AShooterGameState_SetEnvironmentIndex_Params
{
public:
	int32                                        NewEnvironmentIndex;                               // 0x0(0x4)(ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameState.RemoveRelevantPOIActor
struct AShooterGameState_RemoveRelevantPOIActor_Params
{
public:
	class AActor*                                POI;                                               // 0x0(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x4 (0x4 - 0x0)
// Function ShooterGame.ShooterGameState.QueueExplorerNoteForDeferredUnlock
struct AShooterGameState_QueueExplorerNoteForDeferredUnlock_Params
{
public:
	int32                                        ExplorerNoteIndex;                                 // 0x0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameState.PrintCDODebugForChar
struct AShooterGameState_PrintCDODebugForChar_Params
{
public:
	class APrimalCharacter*                      ReferenceChar;                                     // 0x0(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.ShooterGameState.PrintCDODebug
struct AShooterGameState_PrintCDODebug_Params
{
public:
	class APrimalCharacter*                      ReferenceChar;                                     // 0x0(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	struct FCDODebugData                         CDODebugData;                                      // 0x8(0x18)(Edit, ConstParm, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance)
};

// 0x130 (0x130 - 0x0)
// Function ShooterGame.ShooterGameState.PrepareActorForMassTeleport
struct AShooterGameState_PrepareActorForMassTeleport_Params
{
public:
	class AActor*                                PrepareActor;                                      // 0x0(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1DED[0x8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FMassTeleportData                     WithMassTeleportData;                              // 0x10(0x120)(ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameState.OnNewClassInitialized
struct AShooterGameState_OnNewClassInitialized_Params
{
public:
	class UClass*                                ForClass;                                          // 0x0(0x8)(Edit, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x68 (0x68 - 0x0)
// Function ShooterGame.ShooterGameState.OnHUDNotification
struct AShooterGameState_OnHUDNotification_Params
{
public:
	struct FHUDNotification                      Notification;                                      // 0x0(0x60)(Edit, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x60(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1E01[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameState.NetUpdateOfflinePvPLiveTeams
struct AShooterGameState_NetUpdateOfflinePvPLiveTeams_Params
{
public:
	TArray<int32>                                NewPreventOfflinePvPLiveTeams;                     // 0x0(0x10)(Edit, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.ShooterGameState.NetUpdateOfflinePvPExpiringTeams
struct AShooterGameState_NetUpdateOfflinePvPExpiringTeams_Params
{
public:
	TArray<int32>                                NewPreventOfflinePvPExpiringTeams;                 // 0x0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	TArray<float>                                NewPreventOfflinePvPExpiringTimes;                 // 0x10(0x10)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x90 (0x90 - 0x0)
// Function ShooterGame.ShooterGameState.NetSpawnFoliageVFXActorAtLocationAndDoFoliageInteraction
struct AShooterGameState_NetSpawnFoliageVFXActorAtLocationAndDoFoliageInteraction_Params
{
public:
	class UClass*                                AnActorClass;                                      // 0x0(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector_NetQuantize                   AtLocation;                                        // 0x8(0x18)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FRotator_NetQuantize                  AtRotation;                                        // 0x20(0x18)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class AActor*                                EffectOwnerToIgnore;                               // 0x38(0x8)(BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MaxRangeToReplicate;                               // 0x40(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1E11[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class USceneComponent*                       AttachToComponent;                                 // 0x48(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        DataIndex;                                         // 0x50(0x4)(Edit, Net, OutParm, ZeroConstructor, Transient, Config, GlobalConfig, SubobjectReference)
	class FName                                  AttachSocketName;                                  // 0x54(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	bool                                         bOnlySendToEffectOwner;                            // 0x5C(0x1)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         IsSimpleFoliageInteraction;                        // 0x5D(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1E14[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               FoliageOrigin_ImpactPoint;                         // 0x60(0x18)(Edit, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector                               TraceEndpoint;                                     // 0x78(0x18)(Edit, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x60 (0x60 - 0x0)
// Function ShooterGame.ShooterGameState.NetAddFloatingText
struct AShooterGameState_NetAddFloatingText_Params
{
public:
	struct FVector                               AtLocation;                                        // 0x0(0x18)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                FloatingTextString;                                // 0x18(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	struct FColor                                FloatingTextColor;                                 // 0x28(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	float                                        ScaleX;                                            // 0x2C(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        ScaleY;                                            // 0x30(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        TextLifeSpan;                                      // 0x34(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector                               TextVelocity;                                      // 0x38(0x18)(BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MinScale;                                          // 0x50(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        FadeInTime;                                        // 0x54(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	float                                        FadeOutTime;                                       // 0x58(0x4)(Edit, BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	int32                                        OnlySendToTeamID;                                  // 0x5C(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.ShooterGameState.NetAddFloatingDamageText
struct AShooterGameState_NetAddFloatingDamageText_Params
{
public:
	struct FVector                               AtLocation;                                        // 0x0(0x18)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        DamageAmount;                                      // 0x18(0x4)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, Config, GlobalConfig, SubobjectReference)
	int32                                        FromTeamID;                                        // 0x1C(0x4)(Edit, ConstParm, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        OnlySendToTeamID;                                  // 0x20(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1E21[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x38 (0x38 - 0x0)
// Function ShooterGame.ShooterGameState.Multi_SpawnCosmeticActor
struct AShooterGameState_Multi_SpawnCosmeticActor_Params
{
public:
	class UClass*                                SpawnActorOfClass;                                 // 0x0(0x8)(BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector                               SpawnAtLocation;                                   // 0x8(0x18)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	struct FRotator                              SpawnWithRotation;                                 // 0x20(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x130 (0x130 - 0x0)
// Function ShooterGame.ShooterGameState.IsValidMassTeleportData
struct AShooterGameState_IsValidMassTeleportData_Params
{
public:
	struct FMassTeleportData                     CheckData;                                         // 0x0(0x120)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x120(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1E2B[0xF];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x38 (0x38 - 0x0)
// Function ShooterGame.ShooterGameState.IsUniqueDinoAlreadySpawned
struct AShooterGameState_IsUniqueDinoAlreadySpawned_Params
{
public:
	TSoftClassPtr<class APrimalDinoCharacter>    UniqueDino;                                        // 0x0(0x30)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x30(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1E31[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameState.IsTeamIDInvincible
struct AShooterGameState_IsTeamIDInvincible_Params
{
public:
	int32                                        TargetingTeamID;                                   // 0x0(0x4)(Edit, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bInvincibleOnlyWhenOffline;                        // 0x4(0x1)(Edit, ExportObject, Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x5(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1E35[0x2];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameState.IsMassTeleportInProgress
struct AShooterGameState_IsMassTeleportInProgress_Params
{
public:
	class AActor*                                InitiatingActor;                                   // 0x0(0x8)(Parm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1E3A[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameState.IsEngramClassHidden
struct AShooterGameState_IsEngramClassHidden_Params
{
public:
	class UClass*                                ForItemClass;                                      // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1E3E[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.ShooterGameState.HTTPPostRequest
struct AShooterGameState_HTTPPostRequest_Params
{
public:
	class FString                                InURL;                                             // 0x0(0x10)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, InstancedReference, SubobjectReference)
	class FString                                Content;                                           // 0x10(0x10)(Edit, BlueprintVisible, Net, EditFixedSize, OutParm, Config, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameState.HTTPGetRequest
struct AShooterGameState_HTTPGetRequest_Params
{
public:
	class FString                                InURL;                                             // 0x0(0x10)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, InstancedReference, SubobjectReference)
};

// 0x4 (0x4 - 0x0)
// Function ShooterGame.ShooterGameState.GetStartTimeHour
struct AShooterGameState_GetStartTimeHour_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameState.GetOfflineDamagePreventionTime
struct AShooterGameState_GetOfflineDamagePreventionTime_Params
{
public:
	int32                                        TargetingTeamID;                                   // 0x0(0x4)(Edit, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        ReturnValue;                                       // 0x4(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.ShooterGameState.GetNetworkTimeDelta
struct AShooterGameState_GetNetworkTimeDelta_Params
{
public:
	class AShooterGameState*                     GameState;                                         // 0x0(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	double                                       NetTime;                                           // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bTimeUntil;                                        // 0x10(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1E4F[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       ReturnValue;                                       // 0x18(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameState.GetItemMaxQuantityOverride
struct AShooterGameState_GetItemMaxQuantityOverride_Params
{
public:
	class UClass*                                ForClass;                                          // 0x0(0x8)(Edit, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FMaxItemQuantityOverride              OutMaxQuantity;                                    // 0x8(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x10(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1E58[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.ShooterGameState.GetIniArray
struct AShooterGameState_GetIniArray_Params
{
public:
	class FString                                SectionName;                                       // 0x0(0x10)(Edit, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<struct FGameIniData>                  ReturnValue;                                       // 0x10(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.ShooterGameState.GetGamePhase
struct AShooterGameState_GetGamePhase_Params
{
public:
	enum class EGamePhase                        ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameState.GetDayTimeString
struct AShooterGameState_GetDayTimeString_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x4 (0x4 - 0x0)
// Function ShooterGame.ShooterGameState.GetDayCycleSpeed
struct AShooterGameState_GetDayCycleSpeed_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameState.GetCleanServerSessionName
struct AShooterGameState_GetCleanServerSessionName_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x2 (0x2 - 0x0)
// Function ShooterGame.ShooterGameState.ForceStartMatch
struct AShooterGameState_ForceStartMatch_Params
{
public:
	bool                                         PreventFinishTheMatch;                             // 0x0(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         UseQuetzalBus;                                     // 0x1(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.ShooterGameState.CDOGetPrintStringForObjectProperty
struct AShooterGameState_CDOGetPrintStringForObjectProperty_Params
{
public:
	class UObject*                               TheObject;                                         // 0x0(0x8)(BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	class FName                                  PropertyName;                                      // 0x8(0x8)(Edit, ConstParm, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FString                                OutString;                                         // 0x10(0x10)(ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x20(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1E72[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x30 (0x30 - 0x0)
// Function ShooterGame.ShooterGameState.CDOGetPrintStringForObjectProperties
struct AShooterGameState_CDOGetPrintStringForObjectProperties_Params
{
public:
	class UObject*                               TheObject;                                         // 0x0(0x8)(BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	TArray<class FName>                          PropertyNames;                                     // 0x8(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                OutString;                                         // 0x18(0x10)(ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x28(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1E79[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameState.CancelMassTeleport
struct AShooterGameState_CancelMassTeleport_Params
{
public:
	class AActor*                                WithInitiatingActor;                               // 0x0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1E7E[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x60 (0x60 - 0x0)
// Function ShooterGame.ShooterGameState.BPNetSpawnActorAtLocation
struct AShooterGameState_BPNetSpawnActorAtLocation_Params
{
public:
	class UClass*                                AnActorClass;                                      // 0x0(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               AtLocation;                                        // 0x8(0x18)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FRotator                              AtRotation;                                        // 0x20(0x18)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class AActor*                                EffectOwnerToIgnore;                               // 0x38(0x8)(BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MaxRangeToReplicate;                               // 0x40(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1E90[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class USceneComponent*                       AttachToComponent;                                 // 0x48(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        DataIndex;                                         // 0x50(0x4)(Edit, Net, OutParm, ZeroConstructor, Transient, Config, GlobalConfig, SubobjectReference)
	class FName                                  AttachSocketName;                                  // 0x54(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	bool                                         bOnlySendToEffectOwner;                            // 0x5C(0x1)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_1E94[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameState.BPDrawGameStateHUD
struct AShooterGameState_BPDrawGameStateHUD_Params
{
public:
	class AShooterHUD*                           HUD;                                               // 0x0(0x8)(BlueprintReadOnly, Parm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, DuplicateTransient)
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.ShooterGameState.BaseSpawnBuffAndAttachToCharacter
struct AShooterGameState_BaseSpawnBuffAndAttachToCharacter_Params
{
public:
	class UClass*                                Buff;                                              // 0x0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	class APrimalCharacter*                      PrimalCharacter;                                   // 0x8(0x8)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	float                                        ExperiencePoints;                                  // 0x10(0x4)(ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	uint8                                        Pad_1EA2[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class APrimalBuff*                           ReturnValue;                                       // 0x18(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x30 (0x30 - 0x0)
// Function ShooterGame.ShooterGameState.BaseProjectWorldToScreenPosition
struct AShooterGameState_BaseProjectWorldToScreenPosition_Params
{
public:
	struct FVector                               WorldLocation;                                     // 0x0(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class APlayerController*                     ThePC;                                             // 0x18(0x8)(ConstParm, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector2D                             ReturnValue;                                       // 0x20(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameState.BaseIsTribeID
struct AShooterGameState_BaseIsTribeID_Params
{
public:
	int32                                        TeamID;                                            // 0x0(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x4(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1EB1[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameState.BaseGetCustomActors
struct AShooterGameState_BaseGetCustomActors_Params
{
public:
	class FName                                  SearchCustomTag;                                   // 0x0(0x8)(Edit, ExportObject, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	class ACustomActorList*                      ReturnValue;                                       // 0x8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameState.BaseGetAllShooterControllers
struct AShooterGameState_BaseGetAllShooterControllers_Params
{
public:
	TArray<class AShooterPlayerController*>      ReturnValue;                                       // 0x0(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameState.BaseGetAllShooterCharactersOfTeam
struct AShooterGameState_BaseGetAllShooterCharactersOfTeam_Params
{
public:
	int32                                        KillerTeam;                                        // 0x0(0x4)(Net, EditFixedSize, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1EB9[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class AShooterCharacter*>             ReturnValue;                                       // 0x8(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameState.BaseGetAllShooterCharacters
struct AShooterGameState_BaseGetAllShooterCharacters_Params
{
public:
	TArray<class AShooterCharacter*>             ReturnValue;                                       // 0x0(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameState.BaseGetAllDinoCharactersOfTeam
struct AShooterGameState_BaseGetAllDinoCharactersOfTeam_Params
{
public:
	int32                                        KillerTeam;                                        // 0x0(0x4)(Net, EditFixedSize, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1EBF[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class APrimalDinoCharacter*>          ReturnValue;                                       // 0x8(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x38 (0x38 - 0x0)
// Function ShooterGame.ShooterGameState.BaseDrawTileOnCanvas
struct AShooterGameState_BaseDrawTileOnCanvas_Params
{
public:
	class AShooterHUD*                           HUD;                                               // 0x0(0x8)(BlueprintReadOnly, Parm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, DuplicateTransient)
	class UTexture*                              Tex;                                               // 0x8(0x8)(ConstParm, BlueprintVisible, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	float                                        X;                                                 // 0x10(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config)
	float                                        Y;                                                 // 0x14(0x4)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config)
	float                                        XL;                                                // 0x18(0x4)(BlueprintVisible, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	float                                        YL;                                                // 0x1C(0x4)(ConstParm, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	float                                        U;                                                 // 0x20(0x4)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance)
	float                                        V;                                                 // 0x24(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, DisableEditOnInstance)
	float                                        UL;                                                // 0x28(0x4)(BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        VL;                                                // 0x2C(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FColor                                DrawColor;                                         // 0x30(0x4)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, SubobjectReference)
	uint8                                        Pad_1EC7[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x38 (0x38 - 0x0)
// Function ShooterGame.ShooterGameState.AllowDownloadDino
struct AShooterGameState_AllowDownloadDino_Params
{
public:
	TSoftClassPtr<class APrimalDinoCharacter>    TheDinoClass;                                      // 0x0(0x30)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x30(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1ECF[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameState.AllowDinoTame
struct AShooterGameState_AllowDinoTame_Params
{
public:
	class APrimalDinoCharacter*                  DinoChar;                                          // 0x0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	class AShooterPlayerController*              ForPC;                                             // 0x8(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x10(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1ED7[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameState.AllowDinoClassTame
struct AShooterGameState_AllowDinoClassTame_Params
{
public:
	class UClass*                                DinoCharClass;                                     // 0x0(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	class AShooterPlayerController*              ForPC;                                             // 0x8(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x10(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1EDA[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameState.AddTokens
struct AShooterGameState_AddTokens_Params
{
public:
	int32                                        Quantity;                                          // 0x0(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        byTribe;                                           // 0x4(0x4)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameState.AddRelevantPOIActor
struct AShooterGameState_AddRelevantPOIActor_Params
{
public:
	class AActor*                                POI;                                               // 0x0(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
};

// 0x60 (0x60 - 0x0)
// Function ShooterGame.ShooterGameState.AddFloatingText
struct AShooterGameState_AddFloatingText_Params
{
public:
	struct FVector                               AtLocation;                                        // 0x0(0x18)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                FloatingTextString;                                // 0x18(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	struct FColor                                FloatingTextColor;                                 // 0x28(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	float                                        ScaleX;                                            // 0x2C(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        ScaleY;                                            // 0x30(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        TextLifeSpan;                                      // 0x34(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector                               TextVelocity;                                      // 0x38(0x18)(BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	float                                        MinScale;                                          // 0x50(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        FadeInTime;                                        // 0x54(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	float                                        FadeOutTime;                                       // 0x58(0x4)(Edit, BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1EF1[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.BeamWeaponComponent.SetTarget
struct UBeamWeaponComponent_SetTarget_Params
{
public:
	class AActor*                                Target;                                            // 0x0(0x8)(Edit, ConstParm, ReturnParm, Transient, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.BeamWeaponComponent.GetTarget
struct UBeamWeaponComponent_GetTarget_Params
{
public:
	class AActor*                                ReturnValue;                                       // 0x0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.BeamWeaponComponent.GetParticleSystem
struct UBeamWeaponComponent_GetParticleSystem_Params
{
public:
	class UParticleSystemComponent*              ReturnValue;                                       // 0x0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.BeamWeaponComponent.GetLastStoppedFiringTime
struct UBeamWeaponComponent_GetLastStoppedFiringTime_Params
{
public:
	double                                       ReturnValue;                                       // 0x0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.BeamWeaponComponent.GetIsFiring
struct UBeamWeaponComponent_GetIsFiring_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.BeamWeaponComponent.GetIsCharging
struct UBeamWeaponComponent_GetIsCharging_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.BeamWeaponComponent.GetImpactParticleSystem
struct UBeamWeaponComponent_GetImpactParticleSystem_Params
{
public:
	class UParticleSystemComponent*              ReturnValue;                                       // 0x0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.BeamWeaponComponent.GetChargeupParticleSystem
struct UBeamWeaponComponent_GetChargeupParticleSystem_Params
{
public:
	class UParticleSystemComponent*              ReturnValue;                                       // 0x0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.BeamWeaponComponent.GetBeamEndLocation
struct UBeamWeaponComponent_GetBeamEndLocation_Params
{
public:
	struct FVector                               ReturnValue;                                       // 0x0(0x18)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.BeamWeaponController.StartChargingBeams
struct UBeamWeaponController_StartChargingBeams_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.BeamWeaponController.StartChargingBeam
struct UBeamWeaponController_StartChargingBeam_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.BeamWeaponController.OnBeamStoppedFiringHandler
struct UBeamWeaponController_OnBeamStoppedFiringHandler_Params
{
public:
	class UBeamWeaponComponent*                  BeamWeaponComp;                                    // 0x0(0x8)(Edit, ExportObject, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.BeamWeaponController.GetBeamWeaponComponents
struct UBeamWeaponController_GetBeamWeaponComponents_Params
{
public:
	TArray<class UBeamWeaponComponent*>          ReturnValue;                                       // 0x0(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.BeamWeaponController.FireBeams
struct UBeamWeaponController_FireBeams_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.BeamWeaponController.FireBeam
struct UBeamWeaponController_FireBeam_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.BinocularsWidgetUI.GetDinoParentClass
struct UBinocularsWidgetUI_GetDinoParentClass_Params
{
public:
	class APrimalCharacter*                      Char;                                              // 0x0(0x8)(Edit, BlueprintVisible, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                ReturnValue;                                       // 0x8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.BinocularsWidgetUI.GetCharUsesStat
struct UBinocularsWidgetUI_GetCharUsesStat_Params
{
public:
	class APrimalCharacter*                      Char;                                              // 0x0(0x8)(Edit, BlueprintVisible, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	enum class EPrimalCharacterStatusValue       ValueType;                                         // 0x8(0x1)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x9(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1FE4[0x6];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.BinocularsWidgetUI.GetCharTorpidMaxStatus
struct UBinocularsWidgetUI_GetCharTorpidMaxStatus_Params
{
public:
	class APrimalCharacter*                      Char;                                              // 0x0(0x8)(Edit, BlueprintVisible, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ReturnValue;                                       // 0x8(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1FE5[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.BinocularsWidgetUI.GetCharTorpidCurrentStatus
struct UBinocularsWidgetUI_GetCharTorpidCurrentStatus_Params
{
public:
	class APrimalCharacter*                      Char;                                              // 0x0(0x8)(Edit, BlueprintVisible, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ReturnValue;                                       // 0x8(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1FE7[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.BinocularsWidgetUI.GetCharNumStatPointsString
struct UBinocularsWidgetUI_GetCharNumStatPointsString_Params
{
public:
	class APrimalCharacter*                      Char;                                              // 0x0(0x8)(Edit, BlueprintVisible, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	enum class EPrimalCharacterStatusValue       ValueType;                                         // 0x8(0x1)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_1FE9[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                ReturnValue;                                       // 0x10(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.BinocularsWidgetUI.GetCharHealthMaxStatus
struct UBinocularsWidgetUI_GetCharHealthMaxStatus_Params
{
public:
	class APrimalCharacter*                      Char;                                              // 0x0(0x8)(Edit, BlueprintVisible, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ReturnValue;                                       // 0x8(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1FED[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.BinocularsWidgetUI.GetCharHealthCurrentStatus
struct UBinocularsWidgetUI_GetCharHealthCurrentStatus_Params
{
public:
	class APrimalCharacter*                      Char;                                              // 0x0(0x8)(Edit, BlueprintVisible, Net, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ReturnValue;                                       // 0x8(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_1FF1[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.BiomeZoneVolume.OnEndOverlap
struct ABiomeZoneVolume_OnEndOverlap_Params
{
public:
	class AActor*                                OverlappedActor;                                   // 0x0(0x8)(Edit, ExportObject, Net, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	class AActor*                                Actor;                                             // 0x8(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.BiomeZoneVolume.OnBeginOverlap
struct ABiomeZoneVolume_OnBeginOverlap_Params
{
public:
	class AActor*                                OverlappedActor;                                   // 0x0(0x8)(Edit, ExportObject, Net, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	class AActor*                                Actor;                                             // 0x8(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm)
};

// 0x30 (0x30 - 0x0)
// Function ShooterGame.BiomeZoneVolume.IsPointUnderwater
struct ABiomeZoneVolume_IsPointUnderwater_Params
{
public:
	class UWorld*                                ForWorld;                                          // 0x0(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               AtPoint;                                           // 0x8(0x18)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bFastPath;                                         // 0x20(0x1)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2004[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MinimumWaterHeight;                                // 0x24(0x4)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIgnoreVacuumStructures;                           // 0x28(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIgnorePainCausingVolumes;                         // 0x29(0x1)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x2A(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2005[0x5];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.BiomeZoneVolume.IsPointInVacuumBase
struct ABiomeZoneVolume_IsPointInVacuumBase_Params
{
public:
	class UWorld*                                ForWorld;                                          // 0x0(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               AtPoint;                                           // 0x8(0x18)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x20(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2009[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x38 (0x38 - 0x0)
// Function ShooterGame.BiomeZoneVolume.GetWaterVolumeAtPoint
struct ABiomeZoneVolume_GetWaterVolumeAtPoint_Params
{
public:
	class UWorld*                                ForWorld;                                          // 0x0(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               AtPoint;                                           // 0x8(0x18)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bFastPath;                                         // 0x20(0x1)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_200E[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MinimumWaterHeight;                                // 0x24(0x4)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIgnoreVacuumStructures;                           // 0x28(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIgnorePainCausingVolumes;                         // 0x29(0x1)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_200F[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class APhysicsVolume*                        ReturnValue;                                       // 0x30(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x30 (0x30 - 0x0)
// Function ShooterGame.BiomeZoneVolume.GetPhysicsVolumeAtLocation
struct ABiomeZoneVolume_GetPhysicsVolumeAtLocation_Params
{
public:
	class UWorld*                                ForWorld;                                          // 0x0(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               AtPoint;                                           // 0x8(0x18)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bFastPath;                                         // 0x20(0x1)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2015[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class APhysicsVolume*                        ReturnValue;                                       // 0x28(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.BiomeZoneVolume.GetBiomeZoneVolume
struct ABiomeZoneVolume_GetBiomeZoneVolume_Params
{
public:
	class UWorld*                                World;                                             // 0x0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, Transient, DisableEditOnInstance)
	struct FVector                               Location;                                          // 0x8(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor)
	class ABiomeZoneVolume*                      ReturnValue;                                       // 0x20(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.BiomeZoneVolume.GetAllBiomeZones
struct ABiomeZoneVolume_GetAllBiomeZones_Params
{
public:
	class UWorld*                                World;                                             // 0x0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, Transient, DisableEditOnInstance)
	TArray<class ABiomeZoneVolume*>              BiomeZones;                                        // 0x8(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Transient, Config, DisableEditOnInstance, EditConst, InstancedReference)
};

// 0x38 (0x38 - 0x0)
// Function ShooterGame.BiomeZoneVolumeEffectUtility.SpawnRelevantEffect
struct UBiomeZoneVolumeEffectUtility_SpawnRelevantEffect_Params
{
public:
	TArray<struct FBiomeZoneVolumeEffect>        Effects;                                           // 0x0(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	class AActor*                                AttachTo;                                          // 0x10(0x8)(Edit, ConstParm, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance, SubobjectReference)
	struct FVector                               Location;                                          // 0x18(0x18)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor)
	bool                                         bIsImpactActor;                                    // 0x30(0x1)(Edit, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2029[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x188 (0x188 - 0x0)
// Function ShooterGame.BiomeZoneVolumeEffectUtility.SpawnImpactEffect
struct UBiomeZoneVolumeEffectUtility_SpawnImpactEffect_Params
{
public:
	class UWorld*                                World;                                             // 0x0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, Transient, DisableEditOnInstance)
	struct FHitResult                            HitResult;                                         // 0x8(0xF0)(Edit, BlueprintVisible, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, Transient, EditConst)
	struct FBiomeZoneImpactEffect                ImpactEffect;                                      // 0xF8(0x80)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class AActor*                                Owner;                                             // 0x178(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor)
	class AActor*                                ReturnValue;                                       // 0x180(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x80 (0x80 - 0x0)
// Function ShooterGame.BiomeZoneVolumeEffectUtility.GetRelevantEffect
struct UBiomeZoneVolumeEffectUtility_GetRelevantEffect_Params
{
public:
	TArray<struct FBiomeZoneVolumeEffect>        Effects;                                           // 0x0(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	class AActor*                                SourceActor;                                       // 0x10(0x8)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, Transient, InstancedReference, SubobjectReference)
	struct FVector                               ForLocation;                                       // 0x18(0x18)(Edit, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsImpactActor;                                    // 0x30(0x1)(Edit, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2036[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FBiomeZoneVolumeEffect                ReturnValue;                                       // 0x38(0x48)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.BuildingUI.GetStructurePlacer
struct UBuildingUI_GetStructurePlacer_Params
{
public:
	class APrimalStructurePlacer*                ReturnValue;                                       // 0x0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.BuildingUI.GetStructureIcon
struct UBuildingUI_GetStructureIcon_Params
{
public:
	class APrimalStructure*                      Structure;                                         // 0x0(0x8)(ConstParm, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	class UTexture2D*                            ReturnValue;                                       // 0x8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.CachedDB.PopulateDB
struct UCachedDB_PopulateDB_Params
{
public:
	TArray<struct FAssetData>                    CustomAssetList;                                   // 0x0(0x10)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.PointOfInterestActor.IsPointOfInterestValid
struct APointOfInterestActor_IsPointOfInterestValid_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1E0 (0x1E0 - 0x0)
// Function ShooterGame.PointOfInterestActor.GetMyPointOfInterestData
struct APointOfInterestActor_GetMyPointOfInterestData_Params
{
public:
	struct FPointOfInterestData                  ReturnValue;                                       // 0x0(0x1E0)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x300 (0x300 - 0x0)
// Function ShooterGame.PointOfInterestActor.GetMyPointOfInterestCompanionBehavior
struct APointOfInterestActor_GetMyPointOfInterestCompanionBehavior_Params
{
public:
	struct FPointOfInterestCompanionBehavior     ReturnValue;                                       // 0x0(0x300)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.CompanionEventTrigger.OnEndOverlap
struct ACompanionEventTrigger_OnEndOverlap_Params
{
public:
	class AActor*                                OverlappedActor;                                   // 0x0(0x8)(Edit, ExportObject, Net, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	class AActor*                                Actor;                                             // 0x8(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.CompanionEventTrigger.OnBeginOverlap
struct ACompanionEventTrigger_OnBeginOverlap_Params
{
public:
	class AActor*                                OverlappedActor;                                   // 0x0(0x8)(Edit, ExportObject, Net, Parm, ZeroConstructor, Transient, Config, EditConst, SubobjectReference)
	class AActor*                                Actor;                                             // 0x8(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu.SetActiveItem
struct UContextMenu_SetActiveItem_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction ShooterGame.ContextMenu.PopulateContextMenuCustom__DelegateSignature
struct UContextMenu_PopulateContextMenuCustom__DelegateSignature_Params
{
public:
	class UContextMenu*                          ContextMenu;                                       // 0x0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
	class FName                                  MenuName;                                          // 0x8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction ShooterGame.ContextMenu.PopulateContextMenu__DelegateSignature
struct UContextMenu_PopulateContextMenu__DelegateSignature_Params
{
public:
	class UContextMenu*                          ContextMenu;                                       // 0x0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu.GetActiveItem
struct UContextMenu_GetActiveItem_Params
{
public:
	class UContextMenuItem*                      ReturnValue;                                       // 0x0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.ContextMenu.CloseMenu
struct UContextMenu_CloseMenu_Params
{
public:
	bool                                         CloseParents;                                      // 0x0(0x1)(ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction ShooterGame.ContextMenu.ActiveMenuItemChanged__DelegateSignature
struct UContextMenu_ActiveMenuItemChanged__DelegateSignature_Params
{
public:
	class UContextMenu*                          Menu;                                              // 0x0(0x8)(Edit, BlueprintVisible, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class UContextMenuItem*                      NewItem;                                           // 0x8(0x8)(EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class UContextMenuItem*                      OldItem;                                           // 0x10(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.ContextMenuItem.SetSubmenuEnabled
struct UContextMenuItem_SetSubmenuEnabled_Params
{
public:
	bool                                         bEnabled;                                          // 0x0(0x1)(Edit, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.ContextMenuItem.SetShortcutKey
struct UContextMenuItem_SetShortcutKey_Params
{
public:
	int32                                        ComboKeyIdx;                                       // 0x0(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_209B[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FKey                                  Key;                                               // 0x8(0x18)(BlueprintReadOnly, OutParm, ReturnParm, Transient, DisableEditOnInstance)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.ContextMenuItem.SetJustification
struct UContextMenuItem_SetJustification_Params
{
public:
	enum class ETextJustify                      Value;                                             // 0x0(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ContextMenuItem.SetCaption
struct UContextMenuItem_SetCaption_Params
{
public:
	class FText                                  Caption;                                           // 0x0(0x18)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenuItem.OnGetContextMenuContent
struct UContextMenuItem_OnGetContextMenuContent_Params
{
public:
	class UWidget*                               ReturnValue;                                       // 0x0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction ShooterGame.ContextMenuItem.OnButtonClickedEventObjectCustom__DelegateSignature
struct UContextMenuItem_OnButtonClickedEventObjectCustom__DelegateSignature_Params
{
public:
	class UContextMenuItem*                      ContextMenuItem;                                   // 0x0(0x8)(Edit, ConstParm, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig)
	class FName                                  SelectedOption;                                    // 0x8(0x8)(Edit, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, EditConst)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction ShooterGame.ContextMenuItem.OnButtonClickedEventObject__DelegateSignature
struct UContextMenuItem_OnButtonClickedEventObject__DelegateSignature_Params
{
public:
	class UContextMenuItem*                      ContextMenuItem;                                   // 0x0(0x8)(Edit, ConstParm, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ContextMenuItem.OnActiveMenuItemChanged
struct UContextMenuItem_OnActiveMenuItemChanged_Params
{
public:
	class UContextMenu*                          ContextMenu;                                       // 0x0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
	class UContextMenuItem*                      NewActiveItem;                                     // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	class UContextMenuItem*                      OldActiveItem;                                     // 0x10(0x8)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.ContextMenuItem.GetSubmenuEnabled
struct UContextMenuItem_GetSubmenuEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction ShooterGame.ContextMenuItem.GetSubmenuContentCustom__DelegateSignature
struct UContextMenuItem_GetSubmenuContentCustom__DelegateSignature_Params
{
public:
	class UContextMenuItem*                      ContextMenuItem;                                   // 0x0(0x8)(Edit, ConstParm, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig)
	class FName                                  SelectedOption;                                    // 0x8(0x8)(Edit, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, EditConst)
	class UContextMenu*                          ReturnValue;                                       // 0x10(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction ShooterGame.ContextMenuItem.GetSubmenuContent__DelegateSignature
struct UContextMenuItem_GetSubmenuContent__DelegateSignature_Params
{
public:
	class UContextMenuItem*                      ContextMenuItem;                                   // 0x0(0x8)(Edit, ConstParm, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig)
	class UContextMenu*                          ReturnValue;                                       // 0x8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.ContextMenuItem.GetJustification
struct UContextMenuItem_GetJustification_Params
{
public:
	enum class ETextJustify                      ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ContextMenuItem.GetCaption
struct UContextMenuItem_GetCaption_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenuItem_CosmeticEntry.SetImage
struct UContextMenuItem_CosmeticEntry_SetImage_Params
{
public:
	class UTexture2D*                            Image;                                             // 0x0(0x8)(Edit, ConstParm, Net, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ContextMenuItem_CosmeticEntry.SetData
struct UContextMenuItem_CosmeticEntry_SetData_Params
{
public:
	int64                                        ModId;                                             // 0x0(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, EditConst, SubobjectReference)
	struct FItemNetID                            ItemID;                                            // 0x8(0x8)(BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	int32                                        VariantID;                                         // 0x10(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_20E9[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x4 (0x4 - 0x0)
// Function ShooterGame.ContextMenuItem_Spinner.SetValue
struct UContextMenuItem_Spinner_SetValue_Params
{
public:
	int32                                        NewValue;                                          // 0x0(0x4)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
};

// 0x4 (0x4 - 0x0)
// Function ShooterGame.ContextMenuItem_Spinner.SetMinValue
struct UContextMenuItem_Spinner_SetMinValue_Params
{
public:
	int32                                        NewValue;                                          // 0x0(0x4)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
};

// 0x4 (0x4 - 0x0)
// Function ShooterGame.ContextMenuItem_Spinner.SetMaxValue
struct UContextMenuItem_Spinner_SetMaxValue_Params
{
public:
	int32                                        NewValue;                                          // 0x0(0x4)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction ShooterGame.ContextMenuItem_Spinner.OnSpinnerValueCommitedEvent__DelegateSignature
struct UContextMenuItem_Spinner_OnSpinnerValueCommitedEvent__DelegateSignature_Params
{
public:
	class UContextMenuItem_Spinner*              Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
	int32                                        InValue;                                           // 0x8(0x4)(Edit, BlueprintVisible, Net, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ETextCommit                       CommitMethod;                                      // 0xC(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2102[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.ContextMenuItem_Spinner.HandleOnTextCommited
struct UContextMenuItem_Spinner_HandleOnTextCommited_Params
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(Edit, Net, OutParm, DisableEditOnTemplate, EditConst)
	enum class ETextCommit                       CommitMethod;                                      // 0x18(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2104[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ContextMenuItem_Spinner.HandleOnTextChanged
struct UContextMenuItem_Spinner_HandleOnTextChanged_Params
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(Edit, Net, OutParm, DisableEditOnTemplate, EditConst)
};

// 0x4 (0x4 - 0x0)
// Function ShooterGame.ContextMenuItem_Spinner.GetValue
struct UContextMenuItem_Spinner_GetValue_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x4 (0x4 - 0x0)
// Function ShooterGame.ContextMenuItem_Spinner.GetMinValue
struct UContextMenuItem_Spinner_GetMinValue_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x4 (0x4 - 0x0)
// Function ShooterGame.ContextMenuItem_Spinner.GetMaxValue
struct UContextMenuItem_Spinner_GetMaxValue_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_DinoGroupEntry.PopulateRootMenu
struct UContextMenu_DinoGroupEntry_PopulateRootMenu_Params
{
public:
	class UContextMenu*                          ContextMenu;                                       // 0x0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_DinoGroupEntry.HandleActionSetGroup
struct UContextMenu_DinoGroupEntry_HandleActionSetGroup_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_DinoGroupEntry.HandleActionRemoveDino
struct UContextMenu_DinoGroupEntry_HandleActionRemoveDino_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_DinoGroupEntry.HandleActionRemoveClass
struct UContextMenu_DinoGroupEntry_HandleActionRemoveClass_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_InventorySort.PopulateRootMenu
struct UContextMenu_InventorySort_PopulateRootMenu_Params
{
public:
	class UContextMenu*                          ContextMenu;                                       // 0x0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_InventorySort.HandleActionWeight
struct UContextMenu_InventorySort_HandleActionWeight_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_InventorySort.HandleActionUnsort
struct UContextMenu_InventorySort_HandleActionUnsort_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_InventorySort.HandleActionType
struct UContextMenu_InventorySort_HandleActionType_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_InventorySort.HandleActionSpoilTimer
struct UContextMenu_InventorySort_HandleActionSpoilTimer_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_InventorySort.HandleActionAlphabetical
struct UContextMenu_InventorySort_HandleActionAlphabetical_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.PopulateSubmenuSplitStack
struct UContextMenu_PrimalItem_PopulateSubmenuSplitStack_Params
{
public:
	class UContextMenu*                          ContextMenu;                                       // 0x0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.PopulateSubmenuSplitAmount
struct UContextMenu_PrimalItem_PopulateSubmenuSplitAmount_Params
{
public:
	class UContextMenu*                          ContextMenu;                                       // 0x0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.PopulateSubmenuRemove
struct UContextMenu_PrimalItem_PopulateSubmenuRemove_Params
{
public:
	class UContextMenu*                          ContextMenu;                                       // 0x0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.PopulateSubmenuCustomCosmetics
struct UContextMenu_PrimalItem_PopulateSubmenuCustomCosmetics_Params
{
public:
	class UContextMenu*                          ContextMenu;                                       // 0x0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.PopulateSubmenuCustom
struct UContextMenu_PrimalItem_PopulateSubmenuCustom_Params
{
public:
	class UContextMenu*                          ContextMenu;                                       // 0x0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
	class FName                                  ContextItemName;                                   // 0x8(0x8)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.PopulateSubmenuCraftAmount
struct UContextMenu_PrimalItem_PopulateSubmenuCraftAmount_Params
{
public:
	class UContextMenu*                          ContextMenu;                                       // 0x0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.PopulateRootMenu
struct UContextMenu_PrimalItem_PopulateRootMenu_Params
{
public:
	class UContextMenu*                          ContextMenu;                                       // 0x0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.PopulateFolderMenu
struct UContextMenu_PrimalItem_PopulateFolderMenu_Params
{
public:
	class UContextMenu*                          ContextMenu;                                       // 0x0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.PopulateCraftMenu
struct UContextMenu_PrimalItem_PopulateCraftMenu_Params
{
public:
	class UContextMenu*                          ContextMenu;                                       // 0x0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleSplitAmountValueCommit
struct UContextMenu_PrimalItem_HandleSplitAmountValueCommit_Params
{
public:
	class UContextMenuItem_Spinner*              Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
	int32                                        InValue;                                           // 0x8(0x4)(Edit, BlueprintVisible, Net, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ETextCommit                       CommitMethod;                                      // 0xC(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_219C[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleOnGetSubmenuSplitStackContent
struct UContextMenu_PrimalItem_HandleOnGetSubmenuSplitStackContent_Params
{
public:
	class UContextMenuItem*                      MenuItem;                                          // 0x0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UContextMenu*                          ReturnValue;                                       // 0x8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleOnGetSubmenuSplitAmountContent
struct UContextMenu_PrimalItem_HandleOnGetSubmenuSplitAmountContent_Params
{
public:
	class UContextMenuItem*                      MenuItem;                                          // 0x0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UContextMenu*                          ReturnValue;                                       // 0x8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleOnGetSubmenuRemoveContent
struct UContextMenu_PrimalItem_HandleOnGetSubmenuRemoveContent_Params
{
public:
	class UContextMenuItem*                      MenuItem;                                          // 0x0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UContextMenu*                          ReturnValue;                                       // 0x8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleOnGetSubmenuCustomCosmetics
struct UContextMenu_PrimalItem_HandleOnGetSubmenuCustomCosmetics_Params
{
public:
	class UContextMenuItem*                      MenuItem;                                          // 0x0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UContextMenu*                          ReturnValue;                                       // 0x8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleOnGetSubmenuCustomContent
struct UContextMenu_PrimalItem_HandleOnGetSubmenuCustomContent_Params
{
public:
	class UContextMenuItem*                      MenuItem;                                          // 0x0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FName                                  ContextItemName;                                   // 0x8(0x8)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UContextMenu*                          ReturnValue;                                       // 0x10(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleOnGetSubmenuCraftContent
struct UContextMenu_PrimalItem_HandleOnGetSubmenuCraftContent_Params
{
public:
	class UContextMenuItem*                      MenuItem;                                          // 0x0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UContextMenu*                          ReturnValue;                                       // 0x8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleOnGetSubmenuCraftAmountContent
struct UContextMenu_PrimalItem_HandleOnGetSubmenuCraftAmountContent_Params
{
public:
	class UContextMenuItem*                      MenuItem;                                          // 0x0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UContextMenu*                          ReturnValue;                                       // 0x8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleCraftAmountValueCommit
struct UContextMenu_PrimalItem_HandleCraftAmountValueCommit_Params
{
public:
	class UContextMenuItem_Spinner*              Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
	int32                                        InValue;                                           // 0x8(0x4)(Edit, BlueprintVisible, Net, OutParm, ReturnParm, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ETextCommit                       CommitMethod;                                      // 0xC(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	uint8                                        Pad_21BC[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionUse
struct UContextMenu_PrimalItem_HandleActionUse_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionUnequip
struct UContextMenu_PrimalItem_HandleActionUnequip_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionTransfer
struct UContextMenu_PrimalItem_HandleActionTransfer_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionTrack
struct UContextMenu_PrimalItem_HandleActionTrack_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionSplitOne
struct UContextMenu_PrimalItem_HandleActionSplitOne_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionSplitHalf
struct UContextMenu_PrimalItem_HandleActionSplitHalf_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionSplitAmount
struct UContextMenu_PrimalItem_HandleActionSplitAmount_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionSplitAll
struct UContextMenu_PrimalItem_HandleActionSplitAll_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionSetCraftQuantity
struct UContextMenu_PrimalItem_HandleActionSetCraftQuantity_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionRepair
struct UContextMenu_PrimalItem_HandleActionRepair_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionRenameFolder
struct UContextMenu_PrimalItem_HandleActionRenameFolder_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionRemoveSkin
struct UContextMenu_PrimalItem_HandleActionRemoveSkin_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionRemoveCosmetic
struct UContextMenu_PrimalItem_HandleActionRemoveCosmetic_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionRemoveAmmo
struct UContextMenu_PrimalItem_HandleActionRemoveAmmo_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionRemoveAccessory
struct UContextMenu_PrimalItem_HandleActionRemoveAccessory_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionFavorite
struct UContextMenu_PrimalItem_HandleActionFavorite_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionFastInventoryInFolder
struct UContextMenu_PrimalItem_HandleActionFastInventoryInFolder_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionEquipAllInFolder
struct UContextMenu_PrimalItem_HandleActionEquipAllInFolder_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionEquip
struct UContextMenu_PrimalItem_HandleActionEquip_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionDiscard
struct UContextMenu_PrimalItem_HandleActionDiscard_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionDeleteFolder
struct UContextMenu_PrimalItem_HandleActionDeleteFolder_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionCustom
struct UContextMenu_PrimalItem_HandleActionCustom_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
	class FName                                  ContextItemName;                                   // 0x8(0x8)(Edit, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionCraftOne
struct UContextMenu_PrimalItem_HandleActionCraftOne_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionCraftAmount
struct UContextMenu_PrimalItem_HandleActionCraftAmount_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionCraftAll
struct UContextMenu_PrimalItem_HandleActionCraftAll_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ContextMenu_PrimalItem.HandleActionApplyCosmetic
struct UContextMenu_PrimalItem_HandleActionApplyCosmetic_Params
{
public:
	class UContextMenuItem*                      Item;                                              // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.CustomButtonWidget.SetToggledState
struct UCustomButtonWidget_SetToggledState_Params
{
public:
	bool                                         IsToggled;                                         // 0x0(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.CustomButtonWidget.SetIsToggleButton
struct UCustomButtonWidget_SetIsToggleButton_Params
{
public:
	bool                                         IsToggle;                                          // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.CustomButtonWidget.GetToggledState
struct UCustomButtonWidget_GetToggledState_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.CustomButtonWidget.GetIsToggleButton
struct UCustomButtonWidget_GetIsToggleButton_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.CustomButtonWidget.BPSetToggledState
struct UCustomButtonWidget_BPSetToggledState_Params
{
public:
	bool                                         IsToggled;                                         // 0x0(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x1A8 (0x1A8 - 0x0)
// Function ShooterGame.ShooterGameMode.UpdateTribeData
struct AShooterGameMode_UpdateTribeData_Params
{
public:
	struct FTribeData                            NewTribeData;                                      // 0x0(0x1A8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.ShooterGameMode.TryGetIntOptionIni
struct AShooterGameMode_TryGetIntOptionIni_Params
{
public:
	class FString                                Section;                                           // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance)
	class FString                                OptionName;                                        // 0x10(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        Value;                                             // 0x20(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config)
	bool                                         ReturnValue;                                       // 0x24(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_221B[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x38 (0x38 - 0x0)
// Function ShooterGame.ShooterGameMode.TryGetIntOption
struct AShooterGameMode_TryGetIntOption_Params
{
public:
	class FString                                Section;                                           // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance)
	class FString                                Options;                                           // 0x10(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	class FString                                OptionName;                                        // 0x20(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        Value;                                             // 0x30(0x4)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config)
	bool                                         ReturnValue;                                       // 0x34(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_221D[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.ShooterGameMode.TryGetBoolOptionIni
struct AShooterGameMode_TryGetBoolOptionIni_Params
{
public:
	class FString                                Section;                                           // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance)
	class FString                                OptionName;                                        // 0x10(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         Value;                                             // 0x20(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config)
	bool                                         ReturnValue;                                       // 0x21(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2224[0x6];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x38 (0x38 - 0x0)
// Function ShooterGame.ShooterGameMode.TryGetBoolOption
struct AShooterGameMode_TryGetBoolOption_Params
{
public:
	class FString                                Section;                                           // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance)
	class FString                                Options;                                           // 0x10(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	class FString                                OptionName;                                        // 0x20(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         Value;                                             // 0x30(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config)
	bool                                         ReturnValue;                                       // 0x31(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_222E[0x6];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.ShooterGameMode.TriggerLevelCustomEvents
struct AShooterGameMode_TriggerLevelCustomEvents_Params
{
public:
	class UWorld*                                InWorld;                                           // 0x0(0x8)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, InstancedReference, SubobjectReference)
	class FString                                EventName;                                         // 0x8(0x10)(ExportObject, Net, OutParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	int32                                        IDtoOnlyAllowExecutionOncePerFrame;                // 0x18(0x4)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x1C(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2231[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.TimeSinceMissionDeactivated
struct AShooterGameMode_TimeSinceMissionDeactivated_Params
{
public:
	class UClass*                                MissionType;                                       // 0x0(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, GlobalConfig, InstancedReference, DuplicateTransient)
	float                                        ReturnValue;                                       // 0x8(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2235[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameMode.StartIntervalUpdatingCachedTeamTameLists
struct AShooterGameMode_StartIntervalUpdatingCachedTeamTameLists_Params
{
public:
	class AShooterPlayerController*              RequestingPlayer;                                  // 0x0(0x8)(Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.SetTimeOfDay
struct AShooterGameMode_SetTimeOfDay_Params
{
public:
	class FString                                TimeString;                                        // 0x0(0x10)(Edit, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.SetLastMissionDeactivatedUtcTime
struct AShooterGameMode_SetLastMissionDeactivatedUtcTime_Params
{
public:
	class UClass*                                MissionType;                                       // 0x0(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, GlobalConfig, InstancedReference, DuplicateTransient)
	double                                       UtcTime;                                           // 0x8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x48 (0x48 - 0x0)
// Function ShooterGame.ShooterGameMode.SendServerNotification
struct AShooterGameMode_SendServerNotification_Params
{
public:
	class FString                                MessageText;                                       // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	struct FLinearColor                          MessageColor;                                      // 0x10(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        DisplayScale;                                      // 0x20(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        DisplayTime;                                       // 0x24(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class UTexture2D*                            MessageIcon;                                       // 0x28(0x8)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class USoundBase*                            SoundToPlay;                                       // 0x30(0x8)(BlueprintVisible, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	int32                                        ReceiverTeamId;                                    // 0x38(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	int32                                        ReceiverPlayerID;                                  // 0x3C(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	bool                                         bDoBillboard;                                      // 0x40(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_224B[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x60 (0x60 - 0x0)
// Function ShooterGame.ShooterGameMode.SendServerDirectMessage
struct AShooterGameMode_SendServerDirectMessage_Params
{
public:
	class FString                                PlayerSteamIDconst;                                // 0x0(0x10)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	class FString                                MessageText;                                       // 0x10(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	struct FLinearColor                          MessageColor;                                      // 0x20(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bIsBold;                                           // 0x30(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2255[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        ReceiverTeamId;                                    // 0x34(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	int32                                        ReceiverPlayerID;                                  // 0x38(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2256[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                PlayerName;                                        // 0x40(0x10)(ConstParm, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	class FString                                SenderId;                                          // 0x50(0x10)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x40 (0x40 - 0x0)
// Function ShooterGame.ShooterGameMode.SendServerChatMessage
struct AShooterGameMode_SendServerChatMessage_Params
{
public:
	class FString                                MessageText;                                       // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	struct FLinearColor                          MessageColor;                                      // 0x10(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bIsBold;                                           // 0x20(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2260[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        ReceiverTeamId;                                    // 0x24(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	int32                                        ReceiverPlayerID;                                  // 0x28(0x4)(BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2263[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                SenderId;                                          // 0x30(0x10)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0xA8 (0xA8 - 0x0)
// Function ShooterGame.ShooterGameMode.SendChatMessageToTeam
struct AShooterGameMode_SendChatMessageToTeam_Params
{
public:
	int32                                        Team;                                              // 0x0(0x4)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor)
	uint8                                        Pad_226C[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FPrimalChatMessage                    Message;                                           // 0x8(0xA0)(BlueprintVisible, EditFixedSize, Parm, OutParm, Transient, EditConst, SubobjectReference)
};

// 0xA8 (0xA8 - 0x0)
// Function ShooterGame.ShooterGameMode.SendChatMessageToPlayer
struct AShooterGameMode_SendChatMessageToPlayer_Params
{
public:
	class AShooterPlayerController*              ToPlayer;                                          // 0x0(0x8)(BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FPrimalChatMessage                    Message;                                           // 0x8(0xA0)(BlueprintVisible, EditFixedSize, Parm, OutParm, Transient, EditConst, SubobjectReference)
};

// 0xA0 (0xA0 - 0x0)
// Function ShooterGame.ShooterGameMode.SendChatMessage
struct AShooterGameMode_SendChatMessage_Params
{
public:
	struct FPrimalChatMessage                    Message;                                           // 0x0(0xA0)(BlueprintVisible, EditFixedSize, Parm, OutParm, Transient, EditConst, SubobjectReference)
};

// 0x2 (0x2 - 0x0)
// Function ShooterGame.ShooterGameMode.SaveWorld
struct AShooterGameMode_SaveWorld_Params
{
public:
	bool                                         bForceSynchronous;                                 // 0x0(0x1)(ConstParm, BlueprintVisible, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bForceEvenIfSaveLoadIsDisabled;                    // 0x1(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0xC (0xC - 0x0)
// Function ShooterGame.ShooterGameMode.SaveSimpleLogFileOfFormerTribeOwnerIDsAndTheirTimestamps
struct AShooterGameMode_SaveSimpleLogFileOfFormerTribeOwnerIDsAndTheirTimestamps_Params
{
public:
	int32                                        TribeID;                                           // 0x0(0x4)(Edit, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	int32                                        OwnerIDToAdd;                                      // 0x4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2271[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameMode.RequestUpdateCachedTeamTameList
struct AShooterGameMode_RequestUpdateCachedTeamTameList_Params
{
public:
	class AShooterPlayerController*              RequestingPlayer;                                  // 0x0(0x8)(Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameMode.RequestPlayerRecieveKnownCachedTeamTameList
struct AShooterGameMode_RequestPlayerRecieveKnownCachedTeamTameList_Params
{
public:
	class AShooterPlayerController*              RequestingPlayer;                                  // 0x0(0x8)(Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameMode.RemovePlayerData
struct AShooterGameMode_RemovePlayerData_Params
{
public:
	class AShooterPlayerState*                   PlayerState;                                       // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameMode.QueueUpTeamForItsCachedTeamTameListToBeUpdated
struct AShooterGameMode_QueueUpTeamForItsCachedTeamTameListToBeUpdated_Params
{
public:
	class AShooterPlayerController*              RequestingPlayer;                                  // 0x0(0x8)(Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameMode.PrintToServerGameLog
struct AShooterGameMode_PrintToServerGameLog_Params
{
public:
	class FString                                InString;                                          // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	bool                                         bSendChatToAllAdmins;                              // 0x10(0x1)(BlueprintVisible, Net, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_227D[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.PrintToGameplayLog
struct AShooterGameMode_PrintToGameplayLog_Params
{
public:
	class FString                                InString;                                          // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.ShooterGameMode.PostAlarmNotificationTribe
struct AShooterGameMode_PostAlarmNotificationTribe_Params
{
public:
	int32                                        TribeID;                                           // 0x0(0x4)(Edit, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2283[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                Title;                                             // 0x8(0x10)(ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FString                                Message;                                           // 0x18(0x10)(BlueprintVisible, EditFixedSize, Parm, OutParm, Transient, EditConst, SubobjectReference)
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.ShooterGameMode.PostAlarmNotificationPlayerID
struct AShooterGameMode_PostAlarmNotificationPlayerID_Params
{
public:
	int32                                        PlayerID;                                          // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2287[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                Title;                                             // 0x8(0x10)(ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FString                                Message;                                           // 0x18(0x10)(BlueprintVisible, EditFixedSize, Parm, OutParm, Transient, EditConst, SubobjectReference)
};

// 0x30 (0x30 - 0x0)
// Function ShooterGame.ShooterGameMode.PostAlarmNotification
struct AShooterGameMode_PostAlarmNotification_Params
{
public:
	class FString                                SteamID;                                           // 0x0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                Title;                                             // 0x10(0x10)(ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, SubobjectReference)
	class FString                                Message;                                           // 0x20(0x10)(BlueprintVisible, EditFixedSize, Parm, OutParm, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameMode.OnLogout
struct AShooterGameMode_OnLogout_Params
{
public:
	class AController*                           Exiting;                                           // 0x0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x2 (0x2 - 0x0)
// Function ShooterGame.ShooterGameMode.LoadWorld
struct AShooterGameMode_LoadWorld_Params
{
public:
	bool                                         bForceEvenIfLoadingIsDisabled;                     // 0x0(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x1(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1B8 (0x1B8 - 0x0)
// Function ShooterGame.ShooterGameMode.LoadTribeData
struct AShooterGameMode_LoadTribeData_Params
{
public:
	int32                                        TribeID;                                           // 0x0(0x4)(Edit, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_228F[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTribeData                            LoadedTribeData;                                   // 0x8(0x1A8)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsLoadingBackup;                                  // 0x1B0(0x1)(ConstParm, BlueprintVisible, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDontCheckDirtyTribeWar;                           // 0x1B1(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x1B2(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2291[0x5];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameMode.LoadAbandonedTribeFile
struct AShooterGameMode_LoadAbandonedTribeFile_Params
{
public:
	int32                                        TribeID;                                           // 0x0(0x4)(Edit, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2296[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                ReturnValue;                                       // 0x8(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.ListAllPlayers
struct AShooterGameMode_ListAllPlayers_Params
{
public:
	class FString                                Message;                                           // 0x0(0x10)(BlueprintVisible, EditFixedSize, Parm, OutParm, Transient, EditConst, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameMode.KickPlayerController
struct AShooterGameMode_KickPlayerController_Params
{
public:
	class APlayerController*                     ThePC;                                             // 0x0(0x8)(ConstParm, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	class FString                                KickMessage;                                       // 0x8(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.IsTimeSinceMissionDeactivated
struct AShooterGameMode_IsTimeSinceMissionDeactivated_Params
{
public:
	class UClass*                                MissionType;                                       // 0x0(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, GlobalConfig, InstancedReference, DuplicateTransient)
	float                                        CheckTimeSince;                                    // 0x8(0x4)(Edit, ExportObject, Net, DisableEditOnTemplate, Config, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	bool                                         bForceTrueAtZeroTime;                              // 0xC(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0xD(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_22A1[0x2];                                     // Fixing Size Of Struct > TateDumper <
};

// 0xC (0xC - 0x0)
// Function ShooterGame.ShooterGameMode.IsTeamIncludedInNextBatchToProcessTameList
struct AShooterGameMode_IsTeamIncludedInNextBatchToProcessTameList_Params
{
public:
	int32                                        Team;                                              // 0x0(0x4)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor)
	int32                                        FoundIndex;                                        // 0x4(0x4)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_22A3[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0xC (0xC - 0x0)
// Function ShooterGame.ShooterGameMode.IsTeamCurrentlyUpdatingItsCachedTeamTameList
struct AShooterGameMode_IsTeamCurrentlyUpdatingItsCachedTeamTameList_Params
{
public:
	int32                                        Team;                                              // 0x0(0x4)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor)
	int32                                        FoundIndex;                                        // 0x4(0x4)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_22A7[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.IsPlayerInNextTeamBatchPlayersAwaitingUpdatedCachedTeamTameList
struct AShooterGameMode_IsPlayerInNextTeamBatchPlayersAwaitingUpdatedCachedTeamTameList_Params
{
public:
	class AShooterPlayerController*              RequestingPlayer;                                  // 0x0(0x8)(Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        FoundIndex;                                        // 0x8(0x4)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0xC(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_22AA[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.IsPlayerControllerAllowedToJoinNoCheck
struct AShooterGameMode_IsPlayerControllerAllowedToJoinNoCheck_Params
{
public:
	class AShooterPlayerController*              ForPlayer;                                         // 0x0(0x8)(ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_22AC[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.IsPlayerControllerAllowedToExclusiveJoin
struct AShooterGameMode_IsPlayerControllerAllowedToExclusiveJoin_Params
{
public:
	class AShooterPlayerController*              ForPlayer;                                         // 0x0(0x8)(ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_22B1[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.IsPlayerAwaitingToRecieveCachedTeamTameListASAP
struct AShooterGameMode_IsPlayerAwaitingToRecieveCachedTeamTameListASAP_Params
{
public:
	class AShooterPlayerController*              RequestingPlayer;                                  // 0x0(0x8)(Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        FoundIndex;                                        // 0x8(0x4)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0xC(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_22B4[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.IsPlayerAwaitingNotificationOnceTheirCachedTeamTameListFinishesUpdating
struct AShooterGameMode_IsPlayerAwaitingNotificationOnceTheirCachedTeamTameListFinishesUpdating_Params
{
public:
	class AShooterPlayerController*              RequestingPlayer;                                  // 0x0(0x8)(Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        FoundIndex;                                        // 0x8(0x4)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0xC(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_22B7[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.IsPlayerArrayOfInAllPlayersAwaitingUpdatedCachedTeamTameLists
struct AShooterGameMode_IsPlayerArrayOfInAllPlayersAwaitingUpdatedCachedTeamTameLists_Params
{
public:
	class AShooterPlayerController*              RequestingPlayer;                                  // 0x0(0x8)(Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        FoundIndex;                                        // 0x8(0x4)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0xC(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_22BC[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.IsPlayerAllowedToCheat
struct AShooterGameMode_IsPlayerAllowedToCheat_Params
{
public:
	class AShooterPlayerController*              ForPlayer;                                         // 0x0(0x8)(ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_22BF[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.IsCachedTeamTameListOutOfDate
struct AShooterGameMode_IsCachedTeamTameListOutOfDate_Params
{
public:
	class AShooterPlayerController*              RequestingPlayer;                                  // 0x0(0x8)(Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_22C0[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x30 (0x30 - 0x0)
// Function ShooterGame.ShooterGameMode.InitOptionString
struct AShooterGameMode_InitOptionString_Params
{
public:
	class FString                                Commandline;                                       // 0x0(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                Section;                                           // 0x10(0x10)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance)
	class FString                                Option;                                            // 0x20(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
};

// 0x38 (0x38 - 0x0)
// Function ShooterGame.ShooterGameMode.InitOptionInteger
struct AShooterGameMode_InitOptionInteger_Params
{
public:
	class FString                                Commandline;                                       // 0x0(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                Section;                                           // 0x10(0x10)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance)
	class FString                                Option;                                            // 0x20(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	int32                                        CurrentValue;                                      // 0x30(0x4)(ConstParm, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_22CC[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x38 (0x38 - 0x0)
// Function ShooterGame.ShooterGameMode.InitOptionFloat
struct AShooterGameMode_InitOptionFloat_Params
{
public:
	class FString                                Commandline;                                       // 0x0(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                Section;                                           // 0x10(0x10)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance)
	class FString                                Option;                                            // 0x20(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	float                                        CurrentValue;                                      // 0x30(0x4)(ConstParm, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_22D8[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x38 (0x38 - 0x0)
// Function ShooterGame.ShooterGameMode.InitOptionBool
struct AShooterGameMode_InitOptionBool_Params
{
public:
	class FString                                Commandline;                                       // 0x0(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                Section;                                           // 0x10(0x10)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance)
	class FString                                Option;                                            // 0x20(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, GlobalConfig, SubobjectReference)
	bool                                         bDefaultValue;                                     // 0x30(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22DC[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.IncrementNumDeaths
struct AShooterGameMode_IncrementNumDeaths_Params
{
public:
	class FString                                PlayerDataID;                                      // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, Config, GlobalConfig, SubobjectReference)
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.ShooterGameMode.HitchDetected
struct AShooterGameMode_HitchDetected_Params
{
public:
	struct FSoftObjectPath                       ForAsset;                                          // 0x0(0x20)(Edit, ConstParm, BlueprintVisible, ExportObject, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        HitchTime;                                         // 0x20(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_22E3[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.ShooterGameMode.HandleNewPlayer
struct AShooterGameMode_HandleNewPlayer_Params
{
public:
	class AShooterPlayerController*              NewPlayer;                                         // 0x0(0x8)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, Config, GlobalConfig, SubobjectReference)
	class UPrimalPlayerData*                     PlayerData;                                        // 0x8(0x8)(ConstParm, BlueprintVisible, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class AShooterCharacter*                     PlayerCharacter;                                   // 0x10(0x8)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIsFromLogin;                                      // 0x18(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x19(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_22E9[0x6];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x1B0 (0x1B0 - 0x0)
// Function ShooterGame.ShooterGameMode.GetTribeDataBlueprint
struct AShooterGameMode_GetTribeDataBlueprint_Params
{
public:
	int32                                        TribeID;                                           // 0x0(0x4)(Edit, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_22EC[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTribeData                            ReturnValue;                                       // 0x8(0x1A8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x30 (0x30 - 0x0)
// Function ShooterGame.ShooterGameMode.GetStringOption
struct AShooterGameMode_GetStringOption_Params
{
public:
	class FString                                Section;                                           // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance)
	class FString                                OptionName;                                        // 0x10(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                ReturnValue;                                       // 0x20(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.GetSessionTimeString
struct AShooterGameMode_GetSessionTimeString_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameMode.GetServerSettingsFloat
struct AShooterGameMode_GetServerSettingsFloat_Params
{
public:
	class FString                                KeyValue;                                          // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        OutFloat;                                          // 0x10(0x4)(ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x14(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_22F2[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameMode.GetServerName
struct AShooterGameMode_GetServerName_Params
{
public:
	bool                                         bNumbersAndLettersOnly;                            // 0x0(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22F5[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                ReturnValue;                                       // 0x8(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameMode.GetPlayerData
struct AShooterGameMode_GetPlayerData_Params
{
public:
	class FString                                PlayerDataID;                                      // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, Config, GlobalConfig, SubobjectReference)
	class UPrimalPlayerData*                     ReturnValue;                                       // 0x10(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x40 (0x40 - 0x0)
// Function ShooterGame.ShooterGameMode.GetOverlappingDinoCharactersOfTeamAndClass
struct AShooterGameMode_GetOverlappingDinoCharactersOfTeamAndClass_Params
{
public:
	struct FVector                               AtLocation;                                        // 0x0(0x18)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        OverlapRange;                                      // 0x18(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_22FE[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                DinoClass;                                         // 0x20(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        DinoTeam;                                          // 0x28(0x4)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bExactClassMatch;                                  // 0x2C(0x1)(Edit, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIgnoreClass;                                      // 0x2D(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2300[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class APrimalDinoCharacter*>          ReturnValue;                                       // 0x30(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x1B8 (0x1B8 - 0x0)
// Function ShooterGame.ShooterGameMode.GetOrLoadTribeData_ReturnAbandonedResult
struct AShooterGameMode_GetOrLoadTribeData_ReturnAbandonedResult_Params
{
public:
	int32                                        TribeID;                                           // 0x0(0x4)(Edit, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2302[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTribeData                            LoadedTribeData;                                   // 0x8(0x1A8)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         IsAbandoned;                                       // 0x1B0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x1B1(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2304[0x6];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x1B8 (0x1B8 - 0x0)
// Function ShooterGame.ShooterGameMode.GetOrLoadTribeData
struct AShooterGameMode_GetOrLoadTribeData_Params
{
public:
	int32                                        TribeID;                                           // 0x0(0x4)(Edit, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2308[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTribeData                            LoadedTribeData;                                   // 0x8(0x1A8)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x1B0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_230A[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameMode.GetNumDeaths
struct AShooterGameMode_GetNumDeaths_Params
{
public:
	class FString                                PlayerDataID;                                      // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, Config, GlobalConfig, SubobjectReference)
	int32                                        ReturnValue;                                       // 0x10(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2310[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameMode.GetNumberOfLivePlayersOnTribe
struct AShooterGameMode_GetNumberOfLivePlayersOnTribe_Params
{
public:
	class FString                                TribeName;                                         // 0x0(0x10)(ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	int32                                        ReturnValue;                                       // 0x10(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2312[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameMode.GetLaunchOptionFloat
struct AShooterGameMode_GetLaunchOptionFloat_Params
{
public:
	class FString                                LaunchOptionKey;                                   // 0x0(0x10)(Edit, ConstParm, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ReturnVal;                                         // 0x10(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x14(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2319[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.GetLastMissionDeactivatedUtcTime
struct AShooterGameMode_GetLastMissionDeactivatedUtcTime_Params
{
public:
	class UClass*                                MissionType;                                       // 0x0(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, GlobalConfig, InstancedReference, DuplicateTransient)
	double                                       ReturnValue;                                       // 0x8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.ShooterGameMode.GetIntOptionIni
struct AShooterGameMode_GetIntOptionIni_Params
{
public:
	class FString                                Section;                                           // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance)
	class FString                                OptionName;                                        // 0x10(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        ReturnValue;                                       // 0x20(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_231B[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.ShooterGameMode.GetFloatOptionIni
struct AShooterGameMode_GetFloatOptionIni_Params
{
public:
	class FString                                Section;                                           // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance)
	class FString                                OptionName;                                        // 0x10(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ReturnValue;                                       // 0x20(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_231C[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.ShooterGameMode.GetBoolOptionIni
struct AShooterGameMode_GetBoolOptionIni_Params
{
public:
	class FString                                Section;                                           // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance)
	class FString                                OptionName;                                        // 0x10(0x10)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDefaultValue;                                     // 0x20(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x21(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2321[0x6];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x70 (0x70 - 0x0)
// Function ShooterGame.ShooterGameMode.ForceRepopulateFoliageAtPoint
struct AShooterGameMode_ForceRepopulateFoliageAtPoint_Params
{
public:
	struct FVector                               AtPoint;                                           // 0x0(0x18)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MaxRangeFromPoint;                                 // 0x18(0x4)(Edit, ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxNumFoliages;                                    // 0x1C(0x4)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                RepopulatedEmitter;                                // 0x20(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FVector                               StructureDownTraceVector;                          // 0x28(0x18)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FVector                               StructureUpTraceVector;                            // 0x40(0x18)(BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bDontCheckForOverlaps;                             // 0x58(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2329[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        TriggeredByTeamID;                                 // 0x5C(0x4)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bCheckAreaAroundEachIndividualFoliage;             // 0x60(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_232C[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        RadiusAroundEachIndivitualFoliageToCheck;          // 0x64(0x4)(Edit, BlueprintVisible, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bReallyForceIt;                                    // 0x68(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_232D[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.ShooterGameMode.ForceRepopulateAllHarvestElements
struct AShooterGameMode_ForceRepopulateAllHarvestElements_Params
{
public:
	struct FVector                               AtPoint;                                           // 0x0(0x18)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MaxRangeFromPoint;                                 // 0x18(0x4)(Edit, ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2332[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameMode.ForceCreateTribe
struct AShooterGameMode_ForceCreateTribe_Params
{
public:
	class FString                                TribeName;                                         // 0x0(0x10)(ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	int32                                        TeamOverride;                                      // 0x10(0x4)(BlueprintVisible, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        ReturnValue;                                       // 0x14(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.ShooterGameMode.ForceAddPlayerToTribe
struct AShooterGameMode_ForceAddPlayerToTribe_Params
{
public:
	class AShooterPlayerState*                   ForPlayerState;                                    // 0x0(0x8)(BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                TribeName;                                         // 0x8(0x10)(ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	int32                                        ReturnValue;                                       // 0x18(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2336[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameMode.FilterBadWords
struct AShooterGameMode_FilterBadWords_Params
{
public:
	class FString                                String;                                            // 0x0(0x10)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Config, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bCheckWithoutSpecialChars;                         // 0x10(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x11(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_233E[0x6];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x38 (0x38 - 0x0)
// Function ShooterGame.ShooterGameMode.CountOverlappingDinoCharactersOfTeamAndClass
struct AShooterGameMode_CountOverlappingDinoCharactersOfTeamAndClass_Params
{
public:
	struct FVector                               AtLocation;                                        // 0x0(0x18)(Edit, ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	float                                        OverlapRange;                                      // 0x18(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_234B[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                DinoClass;                                         // 0x20(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        DinoTeam;                                          // 0x28(0x4)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bExactClassMatch;                                  // 0x2C(0x1)(Edit, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIgnoreClass;                                      // 0x2D(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_234F[0x2];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        ReturnValue;                                       // 0x30(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2351[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameMode.ClearLastMissionDeactivatedTime
struct AShooterGameMode_ClearLastMissionDeactivatedTime_Params
{
public:
	class UClass*                                MissionType;                                       // 0x0(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, GlobalConfig, InstancedReference, DuplicateTransient)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameMode.CheckJoinInProgress
struct AShooterGameMode_CheckJoinInProgress_Params
{
public:
	bool                                         bIsFromLogin;                                      // 0x0(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_235D[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class APlayerController*                     NewPlayer;                                         // 0x8(0x8)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, Config, GlobalConfig, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x10(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_235E[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0xA8 (0xA8 - 0x0)
// Function ShooterGame.ShooterGameMode.ChatLogAppend
struct AShooterGameMode_ChatLogAppend_Params
{
public:
	class AShooterPlayerController*              SenderController;                                  // 0x0(0x8)(ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FPrimalChatMessage                    Message;                                           // 0x8(0xA0)(BlueprintVisible, EditFixedSize, Parm, OutParm, Transient, EditConst, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameMode.BPPreSpawnedDino
struct AShooterGameMode_BPPreSpawnedDino_Params
{
public:
	class APrimalDinoCharacter*                  TheDino;                                           // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameMode.BPIsSpawnpointPreferred
struct AShooterGameMode_BPIsSpawnpointPreferred_Params
{
public:
	class APlayerStart*                          SpawnPoint;                                        // 0x0(0x8)(BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class AController*                           Player;                                            // 0x8(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst)
	bool                                         ReturnValue;                                       // 0x10(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2378[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameMode.BPIsSpawnpointAllowed
struct AShooterGameMode_BPIsSpawnpointAllowed_Params
{
public:
	class APlayerStart*                          SpawnPoint;                                        // 0x0(0x8)(BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class AController*                           Player;                                            // 0x8(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst)
	bool                                         ReturnValue;                                       // 0x10(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2381[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.BPGetActorSaveGameTypes
struct AShooterGameMode_BPGetActorSaveGameTypes_Params
{
public:
	TArray<class UClass*>                        SaveGameTypes;                                     // 0x0(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x160 (0x160 - 0x0)
// Function ShooterGame.ShooterGameMode.BPDoInitSessionParams
struct AShooterGameMode_BPDoInitSessionParams_Params
{
public:
	struct FShooterGameSessionParams             Params;                                            // 0x0(0xB0)(Edit, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, SubobjectReference)
	struct FShooterGameSessionParams             ReturnValue;                                       // 0xB0(0xB0)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.ShooterGameMode.BPDoInitGame
struct AShooterGameMode_BPDoInitGame_Params
{
public:
	class FString                                MapName;                                           // 0x0(0x10)(BlueprintVisible, ExportObject, Net, Parm, OutParm, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	class FString                                Options;                                           // 0x10(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
};

// 0xC (0xC - 0x0)
// Function ShooterGame.ShooterGameMode.AreTribesAllied
struct AShooterGameMode_AreTribesAllied_Params
{
public:
	int32                                        TribeID1;                                          // 0x0(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        TribeID2;                                          // 0x4(0x4)(ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_238A[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameMode.AllowTaming
struct AShooterGameMode_AllowTaming_Params
{
public:
	int32                                        ForTeam;                                           // 0x0(0x4)(Edit, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x4(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_238B[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameMode.AllowDamage
struct AShooterGameMode_AllowDamage_Params
{
public:
	class UWorld*                                ForWorld;                                          // 0x0(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	int32                                        TargetingTeam1;                                    // 0x8(0x4)(Edit, BlueprintVisible, Net, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        TargetingTeam2;                                    // 0xC(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bIgnoreDamageIfAllied;                             // 0x10(0x1)(Edit, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x11(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2394[0x6];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.AdminExit
struct AShooterGameMode_AdminExit_Params
{
public:
	class FString                                Verify;                                            // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.ShooterGameMode.AddToTribeLog
struct AShooterGameMode_AddToTribeLog_Params
{
public:
	int32                                        TribeID;                                           // 0x0(0x4)(Edit, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2397[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                NewLog;                                            // 0x8(0x10)(Edit, ExportObject, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.ShooterGameMode.AddPlayerToNextTeamBatchPlayersAwaitingUpdatedCachedTeamTameList
struct AShooterGameMode_AddPlayerToNextTeamBatchPlayersAwaitingUpdatedCachedTeamTameList_Params
{
public:
	class AShooterPlayerController*              RequestingPlayer;                                  // 0x0(0x8)(Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_239A[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.ShooterGameMode.AddPlayerToBeNotifiedWhenCachedTeamTameListIsUpdated
struct AShooterGameMode_AddPlayerToBeNotifiedWhenCachedTeamTameListIsUpdated_Params
{
public:
	class AShooterPlayerController*              RequestingPlayer;                                  // 0x0(0x8)(Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.CustomGameMode.SaveIntToConfig
struct ACustomGameMode_SaveIntToConfig_Params
{
public:
	int32                                        IntValue;                                          // 0x0(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2473[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                KeyValue;                                          // 0x8(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.CustomGameMode.SaveFloatToConfig
struct ACustomGameMode_SaveFloatToConfig_Params
{
public:
	float                                        IntValue;                                          // 0x0(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2475[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                KeyValue;                                          // 0x8(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.CustomGameMode.SaveBoolToConfig
struct ACustomGameMode_SaveBoolToConfig_Params
{
public:
	bool                                         IntValue;                                          // 0x0(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2478[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                KeyValue;                                          // 0x8(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x1B0 (0x1B0 - 0x0)
// Function ShooterGame.CustomGameMode.OnUpdateTribeData
struct ACustomGameMode_OnUpdateTribeData_Params
{
public:
	struct FTribeData                            NewTribeData;                                      // 0x0(0x1A8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x1A8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_247C[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.CustomGameMode.OnRemoveTribe
struct ACustomGameMode_OnRemoveTribe_Params
{
public:
	int32                                        TribeID;                                           // 0x0(0x4)(Edit, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x4(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_247E[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.CustomGameMode.OnPlayerCanRestart
struct ACustomGameMode_OnPlayerCanRestart_Params
{
public:
	class APlayerController*                     Player;                                            // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2481[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.CustomGameMode.OnIsUsedSpawnPointStillSupported
struct ACustomGameMode_OnIsUsedSpawnPointStillSupported_Params
{
public:
	class APlayerStart*                          SpawnPoint;                                        // 0x0(0x8)(BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class AController*                           Player;                                            // 0x8(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst)
	bool                                         ReturnValue;                                       // 0x10(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2486[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.CustomGameMode.OnIsSpawnpointAllowed
struct ACustomGameMode_OnIsSpawnpointAllowed_Params
{
public:
	class APlayerStart*                          SpawnPoint;                                        // 0x0(0x8)(BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class AController*                           Player;                                            // 0x8(0x8)(Edit, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst)
	bool                                         ReturnValue;                                       // 0x10(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_248C[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.CustomGameMode.OnInitOptionEvent
struct ACustomGameMode_OnInitOptionEvent_Params
{
public:
	class FString                                Options;                                           // 0x0(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x10(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_248E[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.CustomGameMode.OnInitGameState
struct ACustomGameMode_OnInitGameState_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x38 (0x38 - 0x0)
// Function ShooterGame.CustomGameMode.OnInitGame
struct ACustomGameMode_OnInitGame_Params
{
public:
	class FString                                MapName;                                           // 0x0(0x10)(BlueprintVisible, ExportObject, Net, Parm, OutParm, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	class FString                                Options;                                           // 0x10(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	class FString                                ErrorMessage;                                      // 0x20(0x10)(Edit, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x30(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2490[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.CustomGameMode.OnHandleLeavingMap
struct ACustomGameMode_OnHandleLeavingMap_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.CustomGameMode.OnDoGameCommand
struct ACustomGameMode_OnDoGameCommand_Params
{
public:
	class FString                                TheCommand;                                        // 0x0(0x10)(Edit, ConstParm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                ReturnValue;                                       // 0x10(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.CustomGameMode.OnAllowRenameTribe
struct ACustomGameMode_OnAllowRenameTribe_Params
{
public:
	class AShooterPlayerState*                   ForPlayerState;                                    // 0x0(0x8)(BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                TribeName;                                         // 0x8(0x10)(ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	bool                                         ReturnValue;                                       // 0x18(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2494[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.CustomGameMode.OnAllowNotifyRemotePlayerDeath
struct ACustomGameMode_OnAllowNotifyRemotePlayerDeath_Params
{
public:
	class AShooterCharacter*                     ForChar;                                           // 0x0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2496[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.CustomGameMode.OnAllowModifyStatusValue
struct ACustomGameMode_OnAllowModifyStatusValue_Params
{
public:
	class UPrimalCharacterStatusComponent*       ForComp;                                           // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	enum class EPrimalCharacterStatusValue       ValueType;                                         // 0x8(0x1)(ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2498[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        Amount;                                            // 0xC(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x10(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_2499[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.CustomGameMode.OnAllowClearTribe
struct ACustomGameMode_OnAllowClearTribe_Params
{
public:
	class AShooterPlayerState*                   ForPlayerState;                                    // 0x0(0x8)(BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_249D[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.CustomGameMode.OnAllowAddXP
struct ACustomGameMode_OnAllowAddXP_Params
{
public:
	class UPrimalCharacterStatusComponent*       ForComp;                                           // 0x0(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_249F[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x1B8 (0x1B8 - 0x0)
// Function ShooterGame.CustomGameMode.OnAllowAddToTribe
struct ACustomGameMode_OnAllowAddToTribe_Params
{
public:
	class AShooterPlayerState*                   ForPlayerState;                                    // 0x0(0x8)(BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FTribeData                            MyNewTribe;                                        // 0x8(0x1A8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x1B0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_24A4[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x48 (0x48 - 0x0)
// Function ShooterGame.CustomGameMode.OnAdjustDamage
struct ACustomGameMode_OnAdjustDamage_Params
{
public:
	class AActor*                                Victim;                                            // 0x0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Config, GlobalConfig, SubobjectReference)
	float                                        DefaultDamage;                                     // 0x8(0x4)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_24AC[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FDamageEvent                          DamageEvent;                                       // 0x10(0x20)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst)
	class AController*                           EventInstigator;                                   // 0x30(0x8)(BlueprintVisible, Net, OutParm, ReturnParm, Config, GlobalConfig, SubobjectReference)
	class AActor*                                DamageCauser;                                      // 0x38(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	float                                        ReturnValue;                                       // 0x40(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_24AF[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x218 (0x218 - 0x0)
// Function ShooterGame.CustomGameMode.MakeTribeData
struct ACustomGameMode_MakeTribeData_Params
{
public:
	class FString                                TribeName;                                         // 0x0(0x10)(ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	int32                                        OwnerPlayerDataId;                                 // 0x10(0x4)(ConstParm, ExportObject, Net, ZeroConstructor, Config, GlobalConfig, SubobjectReference)
	int32                                        TribeID;                                           // 0x14(0x4)(Edit, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	TArray<class FString>                        MembersPlayerName;                                 // 0x18(0x10)(ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<int32>                                MembersPlayerDataID;                               // 0x28(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<int32>                                TribeAdmins;                                       // 0x38(0x10)(ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bSetGovernment;                                    // 0x48(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_24B4[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTribeGovernment                      TribeGovernment;                                   // 0x4C(0x14)(Edit, BlueprintReadOnly, Parm, Config)
	TArray<struct FPrimalPlayerCharacterConfigStructReplicated> MembersConfigs;                                    // 0x60(0x10)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	struct FTribeData                            ReturnValue;                                       // 0x70(0x1A8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.CustomGameMode.KickPlayersWithoutCharacter
struct ACustomGameMode_KickPlayersWithoutCharacter_Params
{
public:
	class FString                                Reason;                                            // 0x0(0x10)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x8 (0x8 - 0x0)
// Function ShooterGame.CustomGameMode.KickPlayer
struct ACustomGameMode_KickPlayer_Params
{
public:
	class APlayerController*                     NewPlayer;                                         // 0x0(0x8)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, Config, GlobalConfig, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.CustomGameMode.IsInAllowedToCheatList
struct ACustomGameMode_IsInAllowedToCheatList_Params
{
public:
	class APlayerController*                     NewPlayer;                                         // 0x0(0x8)(Edit, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, Config, GlobalConfig, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_24BC[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.CustomGameMode.InitOptionFloatToINI
struct ACustomGameMode_InitOptionFloatToINI_Params
{
public:
	class FString                                Options;                                           // 0x0(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, GlobalConfig, SubobjectReference)
	float                                        FloatValue;                                        // 0x10(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_24C0[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class FString                                KeyValue;                                          // 0x18(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.CustomGameMode.GetValueFromINI
struct ACustomGameMode_GetValueFromINI_Params
{
public:
	class FString                                KeyValue;                                          // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ReturnValue;                                       // 0x10(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_24C2[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.CustomGameMode.GetIntValueFromINI
struct ACustomGameMode_GetIntValueFromINI_Params
{
public:
	class FString                                KeyValue;                                          // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        ReturnValue;                                       // 0x10(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_24C5[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.CustomGameMode.GetIniFloatValue
struct ACustomGameMode_GetIniFloatValue_Params
{
public:
	class FString                                Section;                                           // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Transient, DisableEditOnInstance)
	class FString                                KeyValue;                                          // 0x10(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ReturnValue;                                       // 0x20(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_24CD[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.CustomGameMode.GetFloatValueFromINI
struct ACustomGameMode_GetFloatValueFromINI_Params
{
public:
	class FString                                KeyValue;                                          // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        ReturnValue;                                       // 0x10(0x4)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_24D4[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.CustomGameMode.GetBoolValueFromINI
struct ACustomGameMode_GetBoolValueFromINI_Params
{
public:
	class FString                                KeyValue;                                          // 0x0(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x10(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_24D8[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.CustomGameMode.CheckForCommand
struct ACustomGameMode_CheckForCommand_Params
{
public:
	class FString                                CommandName;                                       // 0x0(0x10)(Edit, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, GlobalConfig, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x10(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_24DB[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x218 (0x218 - 0x0)
// Function ShooterGame.CustomGameMode.BreakTribeData
struct ACustomGameMode_BreakTribeData_Params
{
public:
	struct FTribeData                            Data;                                              // 0x0(0x1A8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FString                                TribeName;                                         // 0x1A8(0x10)(ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	int32                                        OwnerPlayerDataId;                                 // 0x1B8(0x4)(ConstParm, ExportObject, Net, ZeroConstructor, Config, GlobalConfig, SubobjectReference)
	int32                                        TribeID;                                           // 0x1BC(0x4)(Edit, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	TArray<class FString>                        MembersPlayerName;                                 // 0x1C0(0x10)(ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<int32>                                MembersPlayerDataID;                               // 0x1D0(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<int32>                                TribeAdmins;                                       // 0x1E0(0x10)(ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bSetGovernment;                                    // 0x1F0(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_24E8[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	struct FTribeGovernment                      TribeGovernment;                                   // 0x1F4(0x14)(Edit, BlueprintReadOnly, Parm, Config)
	TArray<struct FPrimalPlayerCharacterConfigStructReplicated> MembersConfigs;                                    // 0x208(0x10)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x4 (0x4 - 0x0)
// Function ShooterGame.CustomGameMode.BlueprintRemoveTribe
struct ACustomGameMode_BlueprintRemoveTribe_Params
{
public:
	int32                                        TribeID;                                           // 0x0(0x4)(Edit, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.CustomGameState.SpawnBuffAndAttachToCharacter
struct ACustomGameState_SpawnBuffAndAttachToCharacter_Params
{
public:
	class UClass*                                Buff;                                              // 0x0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	class APrimalCharacter*                      PrimalCharacter;                                   // 0x8(0x8)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, InstancedReference, DuplicateTransient)
	float                                        ExperiencePoints;                                  // 0x10(0x4)(ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	uint8                                        Pad_24FE[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class APrimalBuff*                           ReturnValue;                                       // 0x18(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.CustomGameState.SetTribeTexture
struct ACustomGameState_SetTribeTexture_Params
{
public:
	int32                                        TribeID;                                           // 0x0(0x4)(Edit, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
	uint8                                        Pad_2501[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	class UPaintingTexture*                      NewTexture;                                        // 0x8(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x14 (0x14 - 0x0)
// Function ShooterGame.CustomGameState.SetScoreDataForTribe
struct ACustomGameState_SetScoreDataForTribe_Params
{
public:
	int32                                        ForTargetingTeam;                                  // 0x0(0x4)(BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FSOTFScoreTribeData                   NewScoreData;                                      // 0x4(0xC)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bReplicateToClients;                               // 0x10(0x1)(BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_2507[0x3];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x58 (0x58 - 0x0)
// Function ShooterGame.CustomGameState.SetScoreDataForPlayer
struct ACustomGameState_SetScoreDataForPlayer_Params
{
public:
	int32                                        LinkedID;                                          // 0x0(0x4)(BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_250B[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	struct FSOTFScorePlayerData                  NewScoreData;                                      // 0x8(0x48)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bReplicateToClients;                               // 0x50(0x1)(BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_250C[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0xA0 (0xA0 - 0x0)
// Function ShooterGame.CustomGameState.SetActionReportItem
struct ACustomGameState_SetActionReportItem_Params
{
public:
	struct FActionReportItem                     Data;                                              // 0x0(0x50)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class FString                                PlayerName;                                        // 0x50(0x10)(ConstParm, ExportObject, Net, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
	class FString                                TribeName;                                         // 0x60(0x10)(ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	class FString                                TimeOfDeath;                                       // 0x70(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                LevelOfDeath;                                      // 0x80(0x10)(ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class FString                                DeathMessage;                                      // 0x90(0x10)(Edit, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
};

// 0x4 (0x4 - 0x0)
// Function ShooterGame.CustomGameState.RemoveTribeFlag
struct ACustomGameState_RemoveTribeFlag_Params
{
public:
	int32                                        TribeID;                                           // 0x0(0x4)(Edit, ZeroConstructor, ReturnParm, Config, GlobalConfig, SubobjectReference)
};

// 0x30 (0x30 - 0x0)
// Function ShooterGame.CustomGameState.ProjectWorldToScreenPosition
struct ACustomGameState_ProjectWorldToScreenPosition_Params
{
public:
	struct FVector                               WorldLocation;                                     // 0x0(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, SubobjectReference)
	class APlayerController*                     ThePC;                                             // 0x18(0x8)(ConstParm, BlueprintReadOnly, ZeroConstructor, ReturnParm, Transient, Config, InstancedReference, SubobjectReference)
	struct FVector2D                             ReturnValue;                                       // 0x20(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.CustomGameState.OnOverrideDynamicMusic
struct ACustomGameState_OnOverrideDynamicMusic_Params
{
public:
	class APrimalCharacter*                      ForCharacter;                                      // 0x0(0x8)(BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, GlobalConfig, SubobjectReference)
	class USoundBase*                            ReturnValue;                                       // 0x8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x20 (0x20 - 0x0)
// Function ShooterGame.CustomGameState.OnNotifyPlayerDied
struct ACustomGameState_OnNotifyPlayerDied_Params
{
public:
	class AShooterCharacter*                     TheShooterChar;                                    // 0x0(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class AShooterPlayerController*              PrevController;                                    // 0x8(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class APawn*                                 InstigatingPawn;                                   // 0x10(0x8)(ConstParm, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class AActor*                                DamageCauser;                                      // 0x18(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, SubobjectReference)
};

// 0x1 (0x1 - 0x0)
// Function ShooterGame.CustomGameState.OnHasGameModeMatchStarted
struct ACustomGameState_OnHasGameModeMatchStarted_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
};

// 0x28 (0x28 - 0x0)
// Function ShooterGame.CustomGameState.OnHandleActorEvent
struct ACustomGameState_OnHandleActorEvent_Params
{
public:
	class AActor*                                ForActor;                                          // 0x0(0x8)(ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	class FName                                  NameParam;                                         // 0x8(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FVector                               VecParam;                                          // 0x10(0x18)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
};

// 0x18 (0x18 - 0x0)
// Function ShooterGame.CustomGameState.OnForceOccludedFloatingHUD
struct ACustomGameState_OnForceOccludedFloatingHUD_Params
{
public:
	class AActor*                                AnActor;                                           // 0x0(0x8)(Edit, ConstParm, ExportObject, Net, ZeroConstructor, Transient, Config, InstancedReference, SubobjectReference)
	class AShooterPlayerController*              ForPC;                                             // 0x8(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, OutParm, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	bool                                         ReturnValue;                                       // 0x10(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_252B[0x7];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.CustomGameState.OnExtraShooterCharacterTick
struct ACustomGameState_OnExtraShooterCharacterTick_Params
{
public:
	class AShooterCharacter*                     ForChar;                                           // 0x0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        DeltaTime;                                         // 0x8(0x4)(BlueprintVisible, Net, ReturnParm, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	uint8                                        Pad_2530[0x4];                                     // Fixing Size Of Struct > TateDumper <
};

// 0x10 (0x10 - 0x0)
// Function ShooterGame.CustomGameState.OnDrawingHUDNotifications
struct ACustomGameState_OnDrawingHUDNotifications_Params
{
public:
	class AShooterHUD*                           HUD;                                               // 0x0(0x8)(BlueprintReadOnly, Parm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig, DuplicateTransient)
	bool                                         ReturnValue;                                       // 0x8(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
