#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x7C9 (0x1971 - 0x11A8)
// WidgetBlueprintGeneratedClass SpawnUI.SpawnUI_C
class USpawnUI_C : public UUI_Spawn
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x11A8(0x8)(Edit, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, SubobjectReference)
	class UWidgetAnimation*                      PhotoIn;                                           // 0x11B0(0x8)(ConstParm, BlueprintVisible, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UWidgetAnimation*                      Close;                                             // 0x11B8(0x8)(ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst)
	class UWidgetAnimation*                      Open;                                              // 0x11C0(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, Transient, Config, EditConst)
	class UDataListButtonVariable_Widget_ASA_C*  ArmLengthSlider;                                   // 0x11C8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UBorder*                               BackgroundMediaIntro;                              // 0x11D0(0x8)(ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UDataListButtonHairLength_Widget_ASA_C* BeardLengthSlider;                                 // 0x11D8(0x8)(Edit, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UScaleBox*                             BedButtonEffect;                                   // 0x11E0(0x8)(Net, OutParm, ZeroConstructor, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UEditableTextBox*                      BedFilter;                                         // 0x11E8(0x8)(ConstParm, BlueprintVisible, OutParm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UOverlay*                              BedFilterOverlay;                                  // 0x11F0(0x8)(BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UWidgetSwitcher*                       BedRegionsSwitcher;                                // 0x11F8(0x8)(ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UScrollBox*                            BedsListScrollBox;                                 // 0x1200(0x8)(BlueprintReadOnly, Parm, ReturnParm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UTextBlock*                            BedsText;                                          // 0x1208(0x8)(ConstParm, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UTextBlock*                            BodyPart;                                          // 0x1210(0x8)(BlueprintReadOnly, EditFixedSize, OutParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_ColorPicker_Widget_ASA_C* BodySlider;                                        // 0x1218(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_BodyTemplatePicker_Widget_C* BodyTemplate_Slider;                               // 0x1220(0x8)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UScaleBox*                             BorderCharacterCreation;                           // 0x1228(0x8)(BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UHorizontalBox*                        BorderFastTravel;                                  // 0x1230(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UImage*                                Bracket;                                           // 0x1238(0x8)(Edit, ExportObject, EditFixedSize, Transient, EditConst, GlobalConfig, SubobjectReference)
	class UCustomButtonWidget*                   CancelLoadBonePresetButton;                        // 0x1240(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   CancelLoadButton;                                  // 0x1248(0x8)(Edit, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UCanvasPanel*                          CanvasPOISpawnMap;                                 // 0x1250(0x8)(ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UCanvasPanel*                          CanvasSpawnRegions;                                // 0x1258(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UUI_PreviewWidget*                     CharacterPreview;                                  // 0x1260(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UImage*                                CharacterPreviewImage;                             // 0x1268(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  ChestSlider;                                       // 0x1270(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   CloseButton;                                       // 0x1278(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   CreateNewPlayerButton;                             // 0x1280(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_86;                      // 0x1288(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, GlobalConfig, DuplicateTransient, RepNotify, Interp, NonTransactional, NoDestructor, AutoWeak)
	class UCustomButtonWidget*                   Debuglightsbutton;                                 // 0x1290(0x8)(ConstParm, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   DefaultDestinationButton;                          // 0x1298(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UImage*                                DisabledPanelImage;                                // 0x12A0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   DoCreateNewPlayerButton;                           // 0x12A8(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   DoReadyCreateSpawnSelection;                       // 0x12B0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   DownloadArkCharacterData;                          // 0x12B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_ColorPicker_Widget_ASA_C* Eye_Iris_Outer_Color;                              // 0x12C0(0x8)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_EyebrowStylePicker_Widget_ASA_C* EyebrowStyleSlider;                                // 0x12C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  EyeSizeSlider;                                     // 0x12D0(0x8)(Edit, BlueprintReadOnly, EditFixedSize, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_ColorPicker_Widget_ASA_C* EyeSlider;                                         // 0x12D8(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  EyeWidthSlider;                                    // 0x12E0(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_ColorPicker_Widget_ASA_C* FacialHairColor;                                   // 0x12E8(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_FacialHairStylePicker_Widget_ASA_C* FacialHairStyle_Slider;                            // 0x12F0(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_ColorPicker_Widget_ASA_C* FacialHairTripColor;                               // 0x12F8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UCustomButton_HUB_ASA_C*               FemaleButton;                                      // 0x1300(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  FootSlider;                                        // 0x1308(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UImage*                                GamepadButtonForPhotoMode;                         // 0x1310(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  HairGradientPercent;                               // 0x1318(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonHairLength_Widget_ASA_C* HairLengthSlider;                                  // 0x1320(0x8)(Edit, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_ColorPicker_Widget_ASA_C* HairSlider;                                        // 0x1328(0x8)(BlueprintVisible, Parm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_HairStylePicker_Widget_ASA_C* HairStyleSlider;                                   // 0x1330(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_ColorPicker_Widget_ASA_C* HairTripColor;                                     // 0x1338(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  HandSlider;                                        // 0x1340(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  HeadDepth;                                         // 0x1348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UASAUIWidget_HorizontalListSelector_Main_Style1_C* Header_GridPanel;                                  // 0x1350(0x8)(Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  HeadHeight;                                        // 0x1358(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  HeadSlider;                                        // 0x1360(0x8)(Edit, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  HeadWidth;                                         // 0x1368(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UScrollBox*                            HiddenBedsList;                                    // 0x1370(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  HipSlider;                                         // 0x1378(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UImage*                                Image;                                             // 0x1380(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance)
	class UImage*                                Image_1;                                           // 0x1388(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, Interp)
	class UImage*                                Image_2;                                           // 0x1390(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, RepNotify, Interp)
	class UImage*                                Image_3;                                           // 0x1398(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, NonTransactional)
	class UImage*                                Image_4;                                           // 0x13A0(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, RepNotify, NonTransactional)
	class UImage*                                Image_5;                                           // 0x13A8(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, Interp, NonTransactional)
	class UImage*                                Image_10;                                          // 0x13B0(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, RepNotify, Interp, EditorOnly)
	class UImage*                                Image_38;                                          // 0x13B8(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, RepNotify, Interp, NonTransactional)
	class UImage*                                Image_131;                                         // 0x13C0(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, NonTransactional, ContainsInstancedReference)
	class UImage*                                Image_286;                                         // 0x13C8(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AssetRegistrySearchable)
	class USlider*                               IntensitySlider;                                   // 0x13D0(0x8)(ConstParm, BlueprintReadOnly, ZeroConstructor, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UImage*                                LBButton;                                          // 0x13D8(0x8)(Edit, ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  LegLengthSlider;                                   // 0x13E0(0x8)(ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   LoadBonePresetConfirmationButton;                  // 0x13E8(0x8)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UScrollBox*                            LoadBonePresetFromFileScrollBox;                   // 0x13F0(0x8)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   LoadConfirmationButton;                            // 0x13F8(0x8)(BlueprintVisible, Net, Parm, OutParm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   LoadFromFileButton;                                // 0x1400(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  LowerArmSlider;                                    // 0x1408(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  LowerFaceSlider;                                   // 0x1410(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  LowerLegSlider;                                    // 0x1418(0x8)(ConstParm, BlueprintVisible, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UCanvasPanel*                          MainCanvasMinimap;                                 // 0x1420(0x8)(ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UCanvasPanel*                          MainCanvasSpawnMap;                                // 0x1428(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UMainMinimapUI_ASA_C*                  MainMinimapUI_ASA;                                 // 0x1430(0x8)(Edit, ConstParm, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, GlobalConfig, InstancedReference)
	class UCustomButton_HUB_ASA_C*               MaleButton;                                        // 0x1438(0x8)(Edit, ConstParm, BlueprintVisible, EditFixedSize, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UTextBlock*                            MapName;                                           // 0x1440(0x8)(Edit, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UMinimapWidget_ASA_C*                  MinimapWidget_ASA;                                 // 0x1448(0x8)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, Transient, EditConst, GlobalConfig, InstancedReference)
	class UBorder*                               ModIconBorder;                                     // 0x1450(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class USizeBox*                              ModIconBox;                                        // 0x1458(0x8)(ConstParm, Net, EditFixedSize, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UEditableTextBox*                      NameBox;                                           // 0x1460(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  NeckLengthSlider;                                  // 0x1468(0x8)(ReturnParm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  NeckSlider;                                        // 0x1470(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UTextBlock*                            NewMessage_Text;                                   // 0x1478(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UCanvasPanel*                          NewPlayerPanel;                                    // 0x1480(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  OverallHeightSlider;                               // 0x1488(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UComboBoxString*                       PlayerVoiceSelectorCombobox;                       // 0x1490(0x8)(ConstParm, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UButton*                               PlayVoiceDemoButton;                               // 0x1498(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   Printcharacter;                                    // 0x14A0(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   RandomizeButton;                                   // 0x14A8(0x8)(BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, EditConst, GlobalConfig, SubobjectReference)
	class UImage*                                RBButton;                                          // 0x14B0(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Abs;                                    // 0x14B8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Adductors;                              // 0x14C0(0x8)(BlueprintVisible, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Arms;                                   // 0x14C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Back;                                   // 0x14D0(0x8)(ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_BackFat;                                // 0x14D8(0x8)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Belly;                                  // 0x14E0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Bicep;                                  // 0x14E8(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Butt;                                   // 0x14F0(0x8)(ConstParm, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Calves_Fat;                             // 0x14F8(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Calves_Muscle;                          // 0x1500(0x8)(ConstParm, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Chest;                                  // 0x1508(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Deltoid;                                // 0x1510(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Face;                                   // 0x1518(0x8)(Edit, Net, OutParm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Forearm;                                // 0x1520(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Glutes;                                 // 0x1528(0x8)(ConstParm, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Hamstring;                              // 0x1530(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Latissimus;                             // 0x1538(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Neck;                                   // 0x1540(0x8)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Obliquies;                              // 0x1548(0x8)(ConstParm, ExportObject, Parm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Pectorals;                              // 0x1550(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Quads;                                  // 0x1558(0x8)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Thighs;                                 // 0x1560(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Trapezius;                              // 0x1568(0x8)(Edit, ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  RegionMask_Triceps;                                // 0x1570(0x8)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UScaleBox*                             RegionsButtonEffect;                               // 0x1578(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UTextBlock*                            RegionsText;                                       // 0x1580(0x8)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   ResetButton;                                       // 0x1588(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, GlobalConfig, SubobjectReference)
	class UCustomButtonWidget*                   RespawnButton;                                     // 0x1590(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UImage*                                RespawnLabelBkg;                                   // 0x1598(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   RespawnPanelButton;                                // 0x15A0(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UScrollBox*                            RespawnScrollBox;                                  // 0x15A8(0x8)(Edit, BlueprintVisible, Net, Parm, ReturnParm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UCustomButtonWidget*                   SaveToFileButton;                                  // 0x15B0(0x8)(ConstParm, ExportObject, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UScrollBox*                            ScrollBox_Values;                                  // 0x15B8(0x8)(Edit, BlueprintVisible, Net, EditFixedSize, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UScrollBox*                            ScrollBoxAllOptionsBed;                            // 0x15C0(0x8)(BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  ShouldersSlider;                                   // 0x15C8(0x8)(Edit, ConstParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UButton*                               ShowBedsButton;                                    // 0x15D0(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UButton*                               ShowRegionsButton;                                 // 0x15D8(0x8)(Edit, ExportObject, ReturnParm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class USlider*                               Slider_53;                                         // 0x15E0(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, Interp, NonTransactional, NoDestructor)
	class UDataListButtonVariable_Widget_ASA_C*  Slider_G_GlobalFat;                                // 0x15E8(0x8)(Edit, ConstParm, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UImage*                                SmallMapImage;                                     // 0x15F0(0x8)(Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class USpawnMapWidget*                       SpawnMapWidget;                                    // 0x15F8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Config, GlobalConfig)
	class UCanvasPanel*                          SpawnPanel;                                        // 0x1600(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, ReturnParm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UWidgetSwitcher*                       SwitcherBodyPart;                                  // 0x1608(0x8)(ConstParm, ExportObject, Net, OutParm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UWidgetSwitcher*                       TabBgSwitcher;                                     // 0x1610(0x8)(Edit, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	class UImage*                                TabSplitImgPlayer;                                 // 0x1618(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	class UImage*                                TabSplitImgRemote;                                 // 0x1620(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, EditConst, InstancedReference, SubobjectReference)
	class UCustomButton_HUB_ASA_C*               TogglePhotoMode;                                   // 0x1628(0x8)(BlueprintVisible, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  TorsoHeight;                                       // 0x1630(0x8)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  TorsoSize;                                         // 0x1638(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  UpperArmSlider;                                    // 0x1640(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  UpperFaceSlider;                                   // 0x1648(0x8)(ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UDataListButtonVariable_Widget_ASA_C*  UpperLegSlider;                                    // 0x1650(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UWidgetSwitcher*                       WidgetSwitcherTravelList;                          // 0x1658(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UMaterialInstanceDynamic*              MeshMaterialDynamicInst;                           // 0x1660(0x8)(BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UPDA_VoiceCollection_C*                VoiceCollection;                                   // 0x1668(0x8)(ConstParm, BlueprintVisible, ExportObject, Parm, Config, DisableEditOnInstance, SubobjectReference)
	class USoundBase*                            Voice_sound_to_play;                               // 0x1670(0x8)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UAudioComponent*                       VoiceAudioComponent;                               // 0x1678(0x8)(Edit, ConstParm, BlueprintVisible, Net, Parm, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector2D                             OffsetMarksOnMap;                                  // 0x1680(0x10)(BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class FString                                EasyString;                                        // 0x1690(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class FString                                MediumString;                                      // 0x16A0(0x10)(Edit, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class FString                                HardString;                                        // 0x16B0(0x10)(Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<class USpawnRegionWidget_ASA_C*>      SpawnRegionsArray;                                 // 0x16C0(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        SelectedRegion;                                    // 0x16D0(0x4)(Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_4E03[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class UBedSpawnWidget_ASA_C*>         BedSpawnsArray;                                    // 0x16D8(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<class UDataListButton_ASA_C*>         BedsButtonsArray;                                  // 0x16E8(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       LastTimeUpdatedAverageBeds;                        // 0x16F8(0x8)(Edit, ConstParm, Parm, OutParm, ZeroConstructor, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       LastTimeUpdatedRespawnLocations;                   // 0x1700(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UBedSpawnWidget_ASA_C*                 MainMultiBed;                                      // 0x1708(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	TSoftClassPtr<class UMinimapData>            MinimapDataSoft;                                   // 0x1710(0x30)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FVector2D>                     MinPosPerBodyPart;                                 // 0x1740(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FVector2D>                     MaxPosPerBodyPart;                                 // 0x1750(0x10)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	TArray<class FString>                        NamePosPerBodyPart;                                // 0x1760(0x10)(BlueprintVisible, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         DefaultBedTab;                                     // 0x1770(0x1)(ConstParm, ExportObject, Net, EditFixedSize, Parm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_4E05[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UHUDNotificationPanel_C*               TempNotificationPanel;                             // 0x1778(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	struct FS_GlobalSettings                     S_Global_Preset_Settings;                          // 0x1780(0x30)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class FString                                ReadyBedString;                                    // 0x17B0(0x10)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               TargetOverrideCameraOffset;                        // 0x17C0(0x18)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         IsAnimating;                                       // 0x17D8(0x1)(ConstParm, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_4E07[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	class UTexture2D*                            BedIcon;                                           // 0x17E0(0x8)(Edit, ExportObject, Net, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UTexture2D*                            TeleportIcon;                                      // 0x17E8(0x8)(Edit, ConstParm, EditFixedSize, Parm, ZeroConstructor, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class FText                                  BedsString;                                        // 0x17F0(0x18)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class FText                                  TeleportsString;                                   // 0x1808(0x18)(Edit, ConstParm, Net, EditFixedSize, Parm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FVector2D                             PreviewDefaultPanExtents;                          // 0x1820(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	int32                                        LastActiveBodySwitcherTab;                         // 0x1830(0x4)(Edit, ConstParm, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_4E08[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       PreviewCamTransitionSpeed;                         // 0x1838(0x8)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       PreviewCamTransitionAlpha;                         // 0x1840(0x8)(ExportObject, Net, EditFixedSize, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FRotator                              PreAnimRot;                                        // 0x1848(0x18)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       PreAnimZoom;                                       // 0x1860(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	struct FVector2D                             PreAnimPan;                                        // 0x1868(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	struct FVector2D                             PreAnimPanExtends;                                 // 0x1878(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	double                                       PreAnimCustomeLimitedPanExtendsY;                  // 0x1888(0x8)(Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	double                                       PreAnimMaxLimitPivotOffset;                        // 0x1890(0x8)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               PreAnimOverrideCameraOffset;                       // 0x1898(0x18)(Net, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	enum class EEasingFunc                       PreviewCamEaseFunc;                                // 0x18B0(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsPreviewInitialized;                             // 0x18B1(0x1)(BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_4E0B[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       CameraFocalOffset;                                 // 0x18B8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	double                                       ShortHairCameraOffset;                             // 0x18C0(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	double                                       LongHairCameraOffset;                              // 0x18C8(0x8)(BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	double                                       HairLocationDelta;                                 // 0x18D0(0x8)(Edit, ConstParm, Net, Parm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         IsLongHair;                                        // 0x18D8(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_4E0D[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       ZoomedInTarget;                                    // 0x18E0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	TSoftObjectPtr<class UBinkMediaPlayer>       IntroBGMediaPlayerLoopClass;                       // 0x18E8(0x30)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	class UBinkMediaPlayer*                      IntroBGMediaPlayerLoop;                            // 0x1918(0x8)(Edit, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TSoftObjectPtr<class UMaterialInstanceConstant> IntroBGMediaMaterial;                              // 0x1920(0x30)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnInstance, EditConst, InstancedReference, SubobjectReference)
	double                                       LastPreviewMeshHeight;                             // 0x1950(0x8)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsAnimatingSizeZoom;                              // 0x1958(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_4E0F[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       SizeZoomTransitionAlpha;                           // 0x1960(0x8)(Edit, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       LongHairFaceZoomMult;                              // 0x1968(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bForceAnimateZoom;                                 // 0x1970(0x1)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class USpawnUI_C* GetDefaultObj();

	struct FCharacterPreset GetGenericCharacterPreset(const struct FCharacterPreset& K2Node_MakeStruct_CharacterPreset, const struct FCharacterPreset& CallFunc_Array_Get_Item, bool* CallFunc_Array_IsValidIndex_ReturnValue);
	bool Get_OverallHeightSlider_bIsEnabled(class UPrimalGameData* CallFunc_BPGetGameData_ReturnValue);
	bool ShowModIcon(class UPrimalGameData* CallFunc_BPGetGameData_ReturnValue);
	struct FCameraLocationSetting GetCameraSettings(int32 TabIndex, const struct FCameraLocationSetting& K2Node_MakeStruct_CameraLocationSetting, bool* CallFunc_Array_IsValidIndex_ReturnValue, bool* CallFunc_Array_IsValidIndex_ReturnValue_1);
