#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x7F1 (0x1359 - 0xB68)
// BlueprintGeneratedClass TrackBinocularsBuff.TrackBinocularsBuff_C
class ATrackBinocularsBuff_C : public APrimalBuff
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xB68(0x8)(Edit, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, SubobjectReference)
	double                                       LastTimeServerUpdateStats;                         // 0xB70(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UBinocularsUI_C*                       BinocularsHUD;                                     // 0xB78(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class AShooterPlayerController*              As_Shooter_Player_Controller;                      // 0xB80(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	double                                       ZoomPercent;                                       // 0xB88(0x8)(Edit, ConstParm, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                BinocularsHUDTemplate;                             // 0xB90(0x8)(Edit, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         HasHitted;                                         // 0xB98(0x1)(BlueprintVisible, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         IsTargetingWIthBinoculars;                         // 0xB99(0x1)(BlueprintVisible, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_53CF[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class AActor*                                TrackingActor;                                     // 0xBA0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class AShooterWeapon*                        BinoWeaponRef;                                     // 0xBA8(0x8)(BlueprintVisible, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class AActor*                                LastTracedActor;                                   // 0xBB0(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	float                                        MaxTraceDistance;                                  // 0xBB8(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_53D0[0x4];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LastChangeTargetingTime;                           // 0xBC0(0x8)(ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class AActor*                                LastOutlineActor;                                  // 0xBC8(0x8)(ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	struct FPostProcessSettings                  DefaultPPSettings;                                 // 0xBD0(0x780)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	class APostProcessVolume*                    GlobalPPVolumeRef;                                 // 0x1350(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, EditConst, InstancedReference, SubobjectReference)
	bool                                         bIsDoFDisabled;                                    // 0x1358(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Transient, Config, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class ATrackBinocularsBuff_C* GetDefaultObj();

	bool Handle_Depth_Of_Field();
	bool ShouldPPBeActive(bool ShouldBeActive, bool CallFunc_IsTimeSince_ReturnValue);
	void BPDeactivated(class AActor** ForInstigator, bool* CallFunc_IsLocallyControlledByPlayer_ReturnValue);
	int32 UpdateCustomDepth(class AActor** ForActor, bool Enable, int32 Temp_int_Array_Index_Variable, const TArray<class USceneComponent*>& CallFunc_GetAllSceneComponents_OutComponents, class USceneComponent* CallFunc_Array_Get_Item, bool* K2Node_DynamicCast_bSuccess, int32 Temp_int_Loop_Counter_Variable);
	float UpdatePP(bool CallFunc_ShouldPPBeActive_ShouldBeActive, bool* K2Node_DynamicCast_bSuccess, bool CallFunc_ShouldPPBeActive_ShouldBeActive_1, double CallFunc_SelectFloat_ReturnValue, class UMaterialInterface* K2Node_DynamicCast_AsMaterial_Interface, bool* K2Node_DynamicCast_bSuccess_1, double CallFunc_SelectFloat_ReturnValue_1, class UObject** CallFunc_GetBlendableFromMIC_ReturnValue, class UMaterialInstanceDynamic* K2Node_DynamicCast_AsMaterial_Instance_Dynamic, bool* K2Node_DynamicCast_bSuccess_2, TArray<class UMaterialInterface*>* K2Node_MakeArray_Array, bool CallFunc_ShouldPPBeActive_ShouldBeActive_2);
	bool AllowPostProcessEffect(bool CallFunc_ShouldPPBeActive_ShouldBeActive);
	float BPGetWaypointsBuff(const TArray<struct FPointOfInterestData_ForCompanion>& IndicatorsOut, class APrimalCharacter** K2Node_DynamicCast_AsPrimal_Character, bool* K2Node_DynamicCast_bSuccess, TArray<struct FPointOfInterestData_ForCompanion>* CallFunc_BPGetWaypointsBuff_IndicatorsOut, class APrimalCharacter** K2Node_DynamicCast_AsPrimal_Character_1, bool* K2Node_DynamicCast_bSuccess_1, double CallFunc_Divide_DoubleFloat_A_ImplicitCast);
	bool TryDeactivateTrackBino();
	bool BPTryMultiUse(class APlayerController** ForPC, bool* CallFunc_EqualEqual_IntInt_ReturnValue);
	int32 GetAllStatPoints(class UPrimalCharacterStatusComponent* Self2, const TArray<int32>& LocalTamedPoints, const TArray<int32>& LocalStatsPoints, int32* Temp_int_Variable, bool CallFunc_IsShooterCharacter_ReturnValue, int32* Temp_int_Variable_1, uint8 CallFunc_GetEnumeratorValueFromIndex_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue, int32* CallFunc_GetMutationPoints_ReturnValue, int32* CallFunc_MakeLiteralInt_ReturnValue);
	void ReplicateCharStats(class APrimalCharacter** Char);
	class APrimalCharacter* ClientUpdateStatsChar(const struct FCharacterStatusReplicatedBinoculars& Update);
	float BuffTickClient();
	enum class EEndPlayReason ReceiveEndPlay();
	void BPSetupForInstigator(class AActor** ForInstigator);
	void SetupZoom(bool* IsTargeting, double ZoomPercent);
	float BuffTickServer();
	void SetupNewTrackActor(class AActor** Actor);
	void TrackCurrentActorTraced();
	int32 InputDismissPOI_BP(class APlayerController** ForPC);
	void ServerClearTrackBino();
	double ExecuteUbergraph_TrackBinocularsBuff(int32* EntryPoint, int32* Temp_int_Variable, int32 CallFunc_Conv_ByteToInt_ReturnValue, float K2Node_Event_DeltaTime_1, bool CallFunc_IsTimeSince_ReturnValue, struct FRotator* CallFunc_GetPlayerViewPoint_Rotation, class APawn* CallFunc_K2_GetPawn_ReturnValue, TArray<class AActor*>* K2Node_MakeArray_Array, class AShooterPlayerController** K2Node_DynamicCast_AsShooter_Player_Controller, bool* K2Node_DynamicCast_bSuccess, int32* CallFunc_MakeLiteralInt_ReturnValue, enum class EEndPlayReason* K2Node_Event_EndPlayReason, class AShooterCharacter* K2Node_DynamicCast_AsShooter_Character, bool* K2Node_DynamicCast_bSuccess_1, class AShooterPlayerController** K2Node_DynamicCast_AsShooter_Player_Controller_1, bool* K2Node_DynamicCast_bSuccess_2, class UPrimalUI* CallFunc_Create_ReturnValue, bool CallFunc_IsLocalPlayerController_ReturnValue, class UBinocularsUI_C* K2Node_DynamicCast_AsBinoculars_UI, bool* K2Node_DynamicCast_bSuccess_3, bool K2Node_SwitchEnum_CmpSuccess, bool K2Node_CustomEvent_IsTargeting, double K2Node_CustomEvent_ZoomPercent, float K2Node_Event_DeltaTime, class UWorld** CallFunc_K2_GetWorld_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, double CallFunc_Vector_Distance_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, class APrimalCharacter** K2Node_DynamicCast_AsPrimal_Character, bool* K2Node_DynamicCast_bSuccess_4, bool* K2Node_DynamicCast_bSuccess_5, bool* CallFunc_EqualEqual_IntInt_ReturnValue, class UWorld** CallFunc_K2_GetWorld_ReturnValue_1, class AWorldSettings** CallFunc_K2_GetWorldSettings_ReturnValue, class AShooterPlayerController** K2Node_DynamicCast_AsShooter_Player_Controller_2, bool* K2Node_DynamicCast_bSuccess_6, class APostProcessVolume** CallFunc_GetGlobalPostProcessVolume_ReturnValue, const struct FCharacterStatusReplicatedBinoculars& K2Node_CustomEvent_Update, int32 CallFunc_Array_Get_Item, int32 CallFunc_Array_Get_Item_1, class APrimalCharacter** K2Node_CustomEvent_Char, float* CallFunc_BPGetCurrentStatusValue_ReturnValue, float* CallFunc_BPGetMaxStatusValue_ReturnValue, float* CallFunc_BPGetCurrentStatusValue_ReturnValue_1, float* CallFunc_BPGetMaxStatusValue_ReturnValue_1, float* CallFunc_BPGetCurrentStatusValue_ReturnValue_2, float* CallFunc_BPGetMaxStatusValue_ReturnValue_2, float* CallFunc_BPGetCurrentStatusValue_ReturnValue_3, float* CallFunc_BPGetMaxStatusValue_ReturnValue_3, float* CallFunc_BPGetMaxStatusValue_ReturnValue_4, float* CallFunc_BPGetMaxStatusValue_ReturnValue_5, const TArray<int32>& CallFunc_GetAllStatPoints_Tamed, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_2, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_3, double CallFunc_Multiply_DoubleFloat_ReturnValue, double CallFunc_Vector_Distance_ReturnValue_1, bool* CallFunc_EqualEqual_IntInt_ReturnValue_1, double CallFunc_MakeLiteralDouble_ReturnValue, bool CallFunc_IsTimeSince_ReturnValue_1, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_1, bool CallFunc_BreakHitResult_bBlockingHit, bool* CallFunc_BreakHitResult_bInitialOverlap, float* CallFunc_BreakHitResult_Distance, struct FVector* CallFunc_BreakHitResult_Location, struct FVector* CallFunc_BreakHitResult_ImpactPoint, struct FVector* CallFunc_BreakHitResult_Normal, struct FVector* CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial** CallFunc_BreakHitResult_PhysMat, class AActor** CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent** CallFunc_BreakHitResult_HitComponent, class FName* CallFunc_BreakHitResult_HitBoneName, class FName* CallFunc_BreakHitResult_BoneName, int32* CallFunc_BreakHitResult_HitItem, int32* CallFunc_BreakHitResult_ElementIndex, int32* CallFunc_BreakHitResult_FaceIndex, bool CallFunc_IsShooterCharacter_ReturnValue, bool* CallFunc_IsPrimalStructure_ReturnValue, bool Temp_bool_Variable, class AActor* K2Node_Select_Default, int32* Temp_int_Variable_1, class APrimalCharacter** K2Node_DynamicCast_AsPrimal_Character_1, bool* K2Node_DynamicCast_bSuccess_7, uint8 CallFunc_GetEnumeratorValueFromIndex_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue_1, float CallFunc_BPDirectSetMaxStatusValue_newValue_ImplicitCast, float CallFunc_BPDirectSetMaxStatusValue_newValue_ImplicitCast_1, float CallFunc_BPDirectSetMaxStatusValue_newValue_ImplicitCast_2, float CallFunc_BPDirectSetMaxStatusValue_newValue_ImplicitCast_3, float CallFunc_BPDirectSetMaxStatusValue_newValue_ImplicitCast_4, float CallFunc_BPDirectSetMaxStatusValue_newValue_ImplicitCast_5, double K2Node_MakeStruct_CurrentFood_2_DC19EC034FDA37A721EED0B6ABB3E033_ImplicitCast, double* K2Node_MakeStruct_MaxFood_4_A5F4CBDF4439E8A0FBD88A97887CC0E7_ImplicitCast, double K2Node_MakeStruct_MaxOxygen_8_8C5113464079DCCEBBF150B3B3508FA9_ImplicitCast, double K2Node_MakeStruct_MaxStamina_12_809881BE4D89FF2D364288BF107D01CE_ImplicitCast, double* K2Node_MakeStruct_MaxWeight_16_0FA5802B4EF85950C2E8C5A90B56BE38_ImplicitCast, double K2Node_MakeStruct_MeleeDamage_18_EE908D7D4D1C2F664DE9FAB35B83616B_ImplicitCast, double CallFunc_Multiply_DoubleFloat_A_ImplicitCast);
};

}


