#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xA8 (0xD8 - 0x30)
// BlueprintGeneratedClass BP_VFX_Spawn_Footprint_AnimNotify.BP_VFX_Spawn_Footprint_AnimNotify_C
class UBP_VFX_Spawn_Footprint_AnimNotify_C : public UAnimNotifyState
{
public:
	class FString                                BoneName;                                          // 0x30(0x10)(ConstParm, Net, DisableEditOnTemplate, Config)
	struct FVector                               BoneOffset;                                        // 0x40(0x18)(ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	FMulticastInlineDelegateProperty_            NewEventDispatcher;                                // 0x58(0x10)(Edit, ConstParm, BlueprintReadOnly, Transient, Config, EditConst, SubobjectReference)
	class UNiagaraSystem*                        Niagara_System;                                    // 0x68(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	struct FVector                               Distance_To_Test_Collision;                        // 0x70(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         Attach_NS_to_bone;                                 // 0x88(0x1)(Edit, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_3C20[0x7];                                     // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              NS_Rotate;                                         // 0x90(0x18)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         backwards;                                         // 0xA8(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         Front;                                             // 0xA9(0x1)(ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance)
	uint8                                        Pad_3C21[0x6];                                     // Fixing Size After Last Property  > TateDumper <
	class UMaterialInterface*                    Footprint_Material;                                // 0xB0(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	int32                                        Render_Index;                                      // 0xB8(0x4)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         bAllowNotifyForPlayerCharacter;                    // 0xBC(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_3C25[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       MaxCamDistanceForVFX;                              // 0xC0(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	double                                       MaxCamDistanceForVFXByAPlayer;                     // 0xC8(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	bool                                         bPlaySound;                                        // 0xD0(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	uint8                                        Pad_3C28[0x3];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        DinoFootprintOpacityScale;                         // 0xD4(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)

	static class UClass* StaticClass();
	static class UBP_VFX_Spawn_Footprint_AnimNotify_C* GetDefaultObj();

	bool LR_FB_Offset(struct FVector* Front_Offset, const struct FVector& Back_Offset, const struct FVector& CallFunc_MakeVector_ReturnValue, const class FString& CallFunc_Right_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, const class FString& CallFunc_Left_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_1, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_1);
	void NewFunction_0(bool* Condition, bool Condition2);
	bool Do_Trace(class AActor** InputPin, double BabyScale, bool* IsPlayer, double* FootPrintSize, bool* Hit_Bool, class UMaterialInterface* FootPrintMaterialBack, class UMaterialInterface** FootPrintMaterialFront, class UMaterialInterface** MI_Back, class UMaterialInterface** MI_Front, const struct FVector& Back_Offset, struct FVector* Front_Offset, struct FVector* CallFunc_Conv_DoubleToVector_ReturnValue, class AShooterCharacter** K2Node_DynamicCast_AsShooter_Character, class UDinoSettings_Base_C** K2Node_DynamicCast_AsDino_Settings_Base, struct FVector* CallFunc_GetForwardVector_ReturnValue, const struct FVector& CallFunc_LR_FB_Offset_Offset, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, struct FVector* CallFunc_Conv_DoubleToVector_ReturnValue_1, struct FMatrix* CallFunc_Conv_TransformToMatrix_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_1, const struct FVector4& CallFunc_Matrix_TransformVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_2, struct FVector* CallFunc_Conv_Vector4ToVector_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, class FName* CallFunc_Conv_StringToName_ReturnValue, class FName* CallFunc_GetSocketBoneName_ReturnValue, const struct FTransform& CallFunc_GetSocketTransform_ReturnValue, struct FRotator* CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_2, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_3, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_4);
	float Spawn_Sound(class USceneComponent** Actor, struct FVector* Location, bool* IsPlayer, class AActor** CallFunc_GetOwner_ReturnValue, class APrimalDinoCharacter* K2Node_DynamicCast_AsPrimal_Dino_Character, bool CallFunc_IsLocallyControlled_ReturnValue, double CallFunc_FClamp_ReturnValue, double CallFunc_FClamp_ReturnValue_1, double CallFunc_FClamp_ReturnValue_2, double CallFunc_FClamp_ReturnValue_3, double CallFunc_FClamp_ReturnValue_4, double CallFunc_FClamp_ReturnValue_5, struct FVector* CallFunc_K2_GetComponentLocation_ReturnValue);
	void Spawn_Anim_Notify();
	float Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration, const struct FAnimNotifyEventReference& EventReference, bool* ReturnValue, bool* IsPlayer, class UMaterialInterface** Material_Front, class UMaterialInterface** Material_Back, double Foot_Print_Size, class AActor** Owner, double BabyScale, double Foot_Velocity_Mult, class UCurveFloat* Curve_foot_vel, class UCurveFloat* Curve_foot_size, double Foot_Size_Mult, struct FColor* Color, class UNiagaraComponent** Niagara_Component, bool DebugPrint_, class AActor** CallFunc_GetOwner_ReturnValue, class APrimalCharacter* K2Node_DynamicCast_AsPrimal_Character, bool* CallFunc_IsShooterCharacter_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool* CallFunc_BooleanAND_ReturnValue, struct FVector* CallFunc_K2_GetComponentLocation_ReturnValue, class AActor** CallFunc_GetOwner_ReturnValue_1, float* CallFunc_GetPrimaryCameraLocationDistanceFromPoint_ReturnValue, double* CallFunc_SelectFloat_ReturnValue, class FName* CallFunc_Conv_StringToName_ReturnValue, class UWorld** CallFunc_K2_GetWorld_ReturnValue, class AWorldSettings* CallFunc_K2_GetWorldSettings_ReturnValue, class APrimalWorldSettings** K2Node_DynamicCast_AsPrimal_World_Settings, struct FRotator* CallFunc_GetSocketRotation_ReturnValue, class APrimalDinoCharacter* K2Node_DynamicCast_AsPrimal_Dino_Character, bool CallFunc_CanSpawnGloballyLimitedParticle_ReturnValue, double CallFunc_Multiply_DoubleFloat_ReturnValue, double CallFunc_Multiply_DoubleFloat_ReturnValue_1, int32* CallFunc_Add_IntInt_ReturnValue, bool* CallFunc_IsConsoleBuild_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class UShooterGameUserSettings** CallFunc_GetShooterGameUserSettings_ReturnValue, bool* CallFunc_BooleanAND_ReturnValue_1, const class FString& CallFunc_Right_ReturnValue, const class FString& CallFunc_Left_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_1, class FName* CallFunc_Conv_StringToName_ReturnValue_1, struct FRotator* CallFunc_GetSocketRotation_ReturnValue_1, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_1, double* CallFunc_Do_Trace_FootPrintSize, bool* CallFunc_Do_Trace_Hit_Bool, struct FHitResult* CallFunc_Do_Trace_OutHit, class UMaterialInterface** CallFunc_Do_Trace_FootPrintMaterialBack, class UMaterialInterface** CallFunc_Do_Trace_FootPrintMaterialFront, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float* CallFunc_BreakHitResult_Time, float* CallFunc_BreakHitResult_Distance, struct FVector* CallFunc_BreakHitResult_Location, struct FVector* CallFunc_BreakHitResult_ImpactPoint, struct FVector* CallFunc_BreakHitResult_Normal, struct FVector* CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial** CallFunc_BreakHitResult_PhysMat, class AActor** CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent** CallFunc_BreakHitResult_HitComponent, class FName* CallFunc_BreakHitResult_HitBoneName, class FName* CallFunc_BreakHitResult_BoneName, int32* CallFunc_BreakHitResult_HitItem, int32* CallFunc_BreakHitResult_ElementIndex, int32* CallFunc_BreakHitResult_FaceIndex, class FName* CallFunc_Conv_StringToName_ReturnValue_2, struct FHitResult* CallFunc_K2_SetWorldLocation_SweepHitResult, double CallFunc_Lerp_A_ImplicitCast, double CallFunc_Lerp_Alpha_ImplicitCast, float CallFunc_SetFloatParameter_Param_ImplicitCast);
	void Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference, bool* ReturnValue);
	void GetNotifyName(class FString* ReturnValue, class FString* CallFunc_Concat_StrStr_ReturnValue);
	void Received_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime, const struct FAnimNotifyEventReference& EventReference, bool* ReturnValue, class USkeletalMeshComponent** Mesh_Comp, double* Line_End_Distance);
	void NewEventDispatcher__DelegateSignature();
};

}


