#pragma once

// Dumped with TateDumper!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x28 - 0x28)
// Class Engine.PrimalReplicationDriver
class UPrimalReplicationDriver : public UObject
{
public:

	static class UClass* StaticClass();
	static class UPrimalReplicationDriver* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.ReplicationDriver
class UReplicationDriver : public UPrimalReplicationDriver
{
public:

	static class UClass* StaticClass();
	static class UReplicationDriver* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.ReplicationConnectionDriver
class UReplicationConnectionDriver : public UObject
{
public:

	static class UClass* StaticClass();
	static class UReplicationConnectionDriver* GetDefaultObj();

};

// 0x208 (0x230 - 0x28)
// Class Engine.PrimalActor
class UPrimalActor : public UObject
{
public:
	uint8                                        Pad_E9[0x8];                                       // Fixing Size After Last Property  > TateDumper <
	uint8                                        BitPad_1 : 7;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bPreventSaving : 1;                                // Mask: 0x80, PropSize: 0x10x30(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bEnableMultiUse : 1;                               // Mask: 0x1, PropSize: 0x10x31(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bBlueprintMultiUseEntries : 1;                     // Mask: 0x2, PropSize: 0x10x31(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_2 : 6;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_EC[0x2];                                       // Fixing Size After Last Property  > TateDumper <
	uint8                                        bUseCanMoveThroughActor : 1;                       // Mask: 0x1, PropSize: 0x10x34(0x1)(BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseBPFilterMultiUseEntries : 1;                   // Mask: 0x2, PropSize: 0x10x34(0x1)(Edit, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_3 : 6;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_ED[0x3];                                       // Fixing Size After Last Property  > TateDumper <
	uint8                                        bUseBPGetMultiUseCenterText : 1;                   // Mask: 0x1, PropSize: 0x10x38(0x1)(ConstParm, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bMultiUseCenterHUD : 1;                            // Mask: 0x2, PropSize: 0x10x38(0x1)(ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseNetworkSpatialization : 1;                     // Mask: 0x4, PropSize: 0x10x38(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bNetworkSpatializationForceRelevancyCheck : 1;     // Mask: 0x8, PropSize: 0x10x38(0x1)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bNetUseClientRelevancy : 1;                        // Mask: 0x10, PropSize: 0x10x38(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bAttachmentReplicationUseNetworkParent : 1;        // Mask: 0x20, PropSize: 0x10x38(0x1)(BlueprintVisible, EditFixedSize, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseBPChangedActorTeam : 1;                        // Mask: 0x40, PropSize: 0x10x38(0x1)(ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bForceNetworkSpatialization : 1;                   // Mask: 0x80, PropSize: 0x10x38(0x1)(Edit, ExportObject, Net, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bForcedHudDrawingRequiresSameTeam : 1;             // Mask: 0x1, PropSize: 0x10x39(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bIsMapActor : 1;                                   // Mask: 0x2, PropSize: 0x10x39(0x1)(BlueprintReadOnly, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseOnlyPointForLevelBounds : 1;                   // Mask: 0x4, PropSize: 0x10x39(0x1)(Edit, Parm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseBPCheckForErrors : 1;                          // Mask: 0x8, PropSize: 0x10x39(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bHasHighVolumeRPCs : 1;                            // Mask: 0x10, PropSize: 0x10x39(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bAutoStasis : 1;                                   // Mask: 0x20, PropSize: 0x10x39(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bClimbable : 1;                                    // Mask: 0x40, PropSize: 0x10x39(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_4 : 1;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_EE[0x2];                                       // Fixing Size After Last Property  > TateDumper <
	uint8                                        bUseBPDrawEntry : 1;                               // Mask: 0x1, PropSize: 0x10x3C(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_5 : 7;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_F0[0x3];                                       // Fixing Size After Last Property  > TateDumper <
	uint8                                        bPreventCliffPlatforms : 1;                        // Mask: 0x1, PropSize: 0x10x40(0x1)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseBPOverrideUILocation : 1;                      // Mask: 0x2, PropSize: 0x10x40(0x1)(BlueprintVisible, ExportObject, EditFixedSize, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bStasised : 1;                                     // Mask: 0x4, PropSize: 0x10x40(0x1)(ConstParm, BlueprintVisible, EditFixedSize, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bPreventActorStasis : 1;                           // Mask: 0x8, PropSize: 0x10x40(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseBPGetBonesToHideOnAllocation : 1;              // Mask: 0x10, PropSize: 0x10x40(0x1)(ConstParm, ExportObject, Net, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bReplicateHidden : 1;                              // Mask: 0x20, PropSize: 0x10x40(0x1)(Edit, Net, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_6 : 1;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bHibernateChange : 1;                              // Mask: 0x80, PropSize: 0x10x40(0x1)(ExportObject, BlueprintReadOnly, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bSavedWhenStasised : 1;                            // Mask: 0x1, PropSize: 0x10x41(0x1)(ConstParm, BlueprintVisible, ExportObject, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bLoadedFromSaveGame : 1;                           // Mask: 0x2, PropSize: 0x10x41(0x1)(Edit, ConstParm, OutParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bPreventCharacterBasing : 1;                       // Mask: 0x4, PropSize: 0x10x41(0x1)(ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventCharacterBasingAllowSteppingUp : 1;        // Mask: 0x8, PropSize: 0x10x41(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bIgnoreNetworkRangeScaling : 1;                    // Mask: 0x10, PropSize: 0x10x41(0x1)(Edit, Net, EditFixedSize, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_7 : 3;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_F2[0x2];                                       // Fixing Size After Last Property  > TateDumper <
	uint8                                        bForceReplicateDormantChildrenWithoutSpatialRelevancy : 1; // Mask: 0x1, PropSize: 0x10x44(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_8 : 7;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_F3[0x3];                                       // Fixing Size After Last Property  > TateDumper <
	uint8                                        bForcePreventSeamlessTravel : 1;                   // Mask: 0x1, PropSize: 0x10x48(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bPreventLevelBoundsRelevant : 1;                   // Mask: 0x2, PropSize: 0x10x48(0x1)(Edit, ConstParm, BlueprintVisible, Net, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseBPInventoryItemUsed : 1;                       // Mask: 0x4, PropSize: 0x10x48(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseBPInventoryItemDropped : 1;                    // Mask: 0x8, PropSize: 0x10x48(0x1)(BlueprintVisible, ExportObject, Parm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseBPOverrideTargetingLocation : 1;               // Mask: 0x10, PropSize: 0x10x48(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bForceAllowNetMulticast : 1;                       // Mask: 0x20, PropSize: 0x10x48(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bBPInventoryItemUsedHandlesDurability : 1;         // Mask: 0x40, PropSize: 0x10x48(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseBPForceAllowsInventoryUse : 1;                 // Mask: 0x80, PropSize: 0x10x48(0x1)(ConstParm, ExportObject, EditFixedSize, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bAlwaysRelevantPrimalStructure : 1;                // Mask: 0x1, PropSize: 0x10x49(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bPreventNPCSpawnFloor : 1;                         // Mask: 0x2, PropSize: 0x10x49(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bForceHiddenReplication : 1;                       // Mask: 0x4, PropSize: 0x10x49(0x1)(Edit, Net, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bNetCritical : 1;                                  // Mask: 0x8, PropSize: 0x10x49(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOnlyReplicateOnNetForcedUpdate : 1;               // Mask: 0x10, PropSize: 0x10x49(0x1)(BlueprintReadOnly, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bPreventRegularForceNetUpdate : 1;                 // Mask: 0x20, PropSize: 0x10x49(0x1)(DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bOnlyInitialReplication : 1;                       // Mask: 0x40, PropSize: 0x10x49(0x1)(ConstParm, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bPreventOnDedicatedServer : 1;                     // Mask: 0x80, PropSize: 0x10x49(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bUseAttachmentReplication : 1;                     // Mask: 0x1, PropSize: 0x10x4A(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bStasisComponentRadiusForceDistanceCheck : 1;      // Mask: 0x2, PropSize: 0x10x4A(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bIgnoredByCharacterEncroachment : 1;               // Mask: 0x4, PropSize: 0x10x4A(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_9 : 5;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bUseBPGetHUDDrawLocationOffset : 1;                // Mask: 0x1, PropSize: 0x10x4B(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseBPPreventAttachments : 1;                      // Mask: 0x2, PropSize: 0x10x4B(0x1)(EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseBPGetShowDebugAnimationComponents : 1;         // Mask: 0x4, PropSize: 0x10x4B(0x1)(BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUnstreamComponentsUseEndOverlap : 1;              // Mask: 0x8, PropSize: 0x10x4B(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bWantsPerformanceThrottledTick : 1;                // Mask: 0x10, PropSize: 0x10x4B(0x1)(Edit, ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_A : 2;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bWantsServerThrottledTick : 1;                     // Mask: 0x80, PropSize: 0x10x4B(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_B : 1;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bBPPreInitializeComponents : 1;                    // Mask: 0x2, PropSize: 0x10x4C(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bBPPostInitializeComponents : 1;                   // Mask: 0x4, PropSize: 0x10x4C(0x1)(Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseBPCustomIsRelevantForClient : 1;               // Mask: 0x8, PropSize: 0x10x4C(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseStasisGrid : 1;                                // Mask: 0x10, PropSize: 0x10x4C(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bAlwaysCreatePhysicsState : 1;                     // Mask: 0x20, PropSize: 0x10x4C(0x1)(ConstParm, BlueprintReadOnly, Net, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bForceInfiniteDrawDistance : 1;                    // Mask: 0x40, PropSize: 0x10x4C(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bIsFromChildActorComponent : 1;                    // Mask: 0x80, PropSize: 0x10x4C(0x1)(Edit, ConstParm, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bIsDestroyedFromChildActorComponent : 1;           // Mask: 0x1, PropSize: 0x10x4D(0x1)(ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bIsValidUnstasisCaster : 1;                        // Mask: 0x2, PropSize: 0x10x4D(0x1)(BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bUseBPAllowActorSpawn : 1;                         // Mask: 0x4, PropSize: 0x10x4D(0x1)(OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_C : 5;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_F4[0x2];                                       // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnTargetingTeamChanged;                            // 0x50(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_F5[0x18];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        TargetingTeam;                                     // 0x78(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	int32                                        CustomActorFlags;                                  // 0x7C(0x4)(Edit, ConstParm, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_F6[0x8];                                       // Fixing Size After Last Property  > TateDumper <
	class AActor*                                ActorUsingQuickAction;                             // 0x88(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class FName                                  CustomTag;                                         // 0x90(0x8)(ConstParm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	int32                                        CustomData;                                        // 0x98(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_F7[0x4];                                       // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnActorCustomEvent;                                // 0xA0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	double                                       LastThrottledTickTime;                             // 0xB0(0x8)(Edit, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        bWantsRealtimeThrottledTick : 1;                   // Mask: 0x1, PropSize: 0x10xB8(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_D : 1;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bRealtimeThrottledTickUseNativeTick : 1;           // Mask: 0x4, PropSize: 0x10xB8(0x1)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        BitPad_E : 5;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_F9[0x7];                                       // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnMatineeUpdated;                                  // 0xC0(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_FA[0x18];                                      // Fixing Size After Last Property  > TateDumper <
	enum class EReplicationGraphBehavior         RepGraphBehavior;                                  // 0xE8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	enum class EReplicationGraphBehavior         DesiredRepGraphBehavior;                           // 0xE9(0x1)(ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bDesiredRepGraphBehaviorHasBeenSet;                // 0xEA(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_FD[0x5];                                       // Fixing Size After Last Property  > TateDumper <
	double                                       ForceMaximumReplicationRateUntilTime;              // 0xF0(0x8)(Edit, ConstParm, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	double                                       LastActorForceReplicationTime;                     // 0xF8(0x8)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_FE[0x4];                                       // Fixing Size After Last Property  > TateDumper <
	float                                        NetworkAndStasisRangeMultiplier;                   // 0x104(0x4)(Edit, ExportObject, BlueprintReadOnly, OutParm, InstancedReference, SubobjectReference)
	float                                        NetworkRangeMultiplier;                            // 0x108(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        NetCullDistanceSquaredDormant;                     // 0x10C(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_FF[0x10];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<class AActor*>                        NetworkSpatializationChildren;                     // 0x120(0x10)(Edit, ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	TArray<class AActor*>                        NetworkSpatializationChildrenDormant;              // 0x130(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class AActor*                                NetworkSpatializationParent;                       // 0x140(0x8)(Edit, BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        DefaultStasisComponentOctreeFlags;                 // 0x148(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        DefaultStasisedOctreeFlags;                        // 0x14C(0x4)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        DefaultUnstasisedOctreeFlags;                      // 0x150(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        OverrideStasisComponentRadius;                     // 0x154(0x4)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class UPrimitiveComponent*                   StasisCheckComponent;                              // 0x158(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	double                                       UnstasisLastInRangeTime;                           // 0x160(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	double                                       LastPreReplicationTime;                            // 0x168(0x8)(ConstParm, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	double                                       LastEnterStasisTime;                               // 0x170(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	double                                       LastExitStasisTime;                                // 0x178(0x8)(Edit, BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class FString                                LastSelectedWindSourceComponentName;               // 0x180(0x10)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_100[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<TWeakObjectPtr<class UActorComponent>> StasisUnRegisteredComponents;                      // 0x1A8(0x10)(Edit, ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        ReplicationIntervalMultiplier;                     // 0x1B8(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	float                                        ClientReplicationSendNowThreshold;                 // 0x1BC(0x4)(Edit, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_101[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	TWeakObjectPtr<class USoundBase>             LastPostProcessVolumeSound;                        // 0x1C4(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_102[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnSemaphoreTaken;                                  // 0x1D0(0x10)(ConstParm, BlueprintReadOnly, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	bool                                         bForceNonBlockingHits;                             // 0x1E0(0x1)(ConstParm, BlueprintVisible, Net, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_103[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	double                                       OriginalCreationTime;                              // 0x1E8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	uint8                                        Pad_104[0x20];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class AMatineeActor*>                 ControllingMatineeActors;                          // 0x210(0x10)(Edit, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	int32                                        NetCriticalPriorityAdjustment;                     // 0x220(0x4)(Edit, ExportObject, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_105[0xC];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UPrimalActor* GetDefaultObj();

	void Unstasis();
	int32 TryMultiUse(class APlayerController* ForPC, int32* UseIndex, bool* ReturnValue);
	void ThrottledTick();
	void TargetingTeamChanged();
	bool SetTickFunctionEnabled();
	enum class EReplicationGraphBehavior SetDesiredRepGraphBehavior();
	void RecieveMatineeUpdated();
	double RealtimeThrottledTick();
	class USoundBase* PreventNotifySound(bool* ReturnValue);
	float PlaySoundOnActor();
	void PerformanceThrottledTick();
	void OnInventoryItemGrind();
	class AHUD* OffsetHUDFromCenterScreenY(float* ReturnValue);
	class AHUD* OffsetHUDFromBottomScreenY(float* ReturnValue);
	bool MulticastPropertyToPlayer();
	bool MulticastProperty();
	int32 ModifyHudMultiUseLoc();
	void MatineeUpdated();
	void K2_GetWorld(class UWorld** ReturnValue);
	class APawn* IsValidLockOnTarget(bool* ReturnValue);
	void IsTargetable(bool* ReturnValue);
	void IsShooterWeapon(bool* ReturnValue);
	void IsShooterPlayerController(bool* ReturnValue);
	void IsShooterCharacter(bool* ReturnValue);
	void IsPrimalStructureTurret(bool* ReturnValue);
	void IsPrimalStructureItemContainer(bool* ReturnValue);
	void IsPrimalStructureExplosive(bool* ReturnValue);
	void IsPrimalStructure(bool* ReturnValue);
	void IsPrimalDino(bool* ReturnValue);
	void IsPrimalCharacterOrStructure(bool* ReturnValue);
	void IsPrimalCharacter(bool* ReturnValue);
	void IsNetworkStressTestClientMode(bool* ReturnValue);
	void IsLocallyControlledByPlayer(bool* ReturnValue);
	void IsInstancedFoliage(bool* ReturnValue);
	void IsFirstPersonMeshVisible(bool* ReturnValue);
	void IsFirstPersonCamera(bool* ReturnValue);
	void IsDead(bool* ReturnValue);
	void IsARaft(bool* ReturnValue);
	int32 InputDismissPOI_BP(class APlayerController* ForPC);
	int32 InputDismissPOI(class APlayerController* ForPC);
	void GetWheelOptionInfoBP(class APlayerController* ForPC, int32* WheelCategory, struct FMultiUseWheelOption* ReturnValue);
	void GetWheelOptionInfo(class APlayerController* ForPC, int32* WheelCategory, struct FMultiUseWheelOption* ReturnValue);
	int32 GetWheelOptionByUseIndex(class APlayerController* ForPC, struct FMultiUseWheelOption* ReturnValue);
	void GetUsablePriority(float* ReturnValue);
	void GetTargetingLocation(class AActor* Attacker, struct FVector* ReturnValue);
	void GetSecondaryMountedActor(class AActor** ReturnValue);
	struct FMultiUseEntry GetMultiUseIconBP(class APlayerController* ForPC, class UTexture2D** ReturnValue);
	struct FMultiUseEntry GetMultiUseIcon(class APlayerController* ForPC, class UTexture2D** ReturnValue);
	int32 GetMultiUseEntries(class APlayerController* ForPC, TArray<struct FMultiUseEntry>* MultiUseEntries);
	void GetInterpolatedVelocity(struct FVector* ReturnValue);
	void GetInterpolatedRotation(struct FRotator* ReturnValue);
	void GetInterpolatedLocation(struct FVector* ReturnValue);
	int32 GetEditTextString(class APlayerController* ForPC, class FString* ReturnValue);
	void GetCharacterController(class AController** ReturnValue);
	void GetAttachedSoundVolumeMultiplier(float* ReturnValue);
	void GetAttachedSoundPitchMultiplier(float* ReturnValue);
	TArray<class USceneComponent*> GetAllSceneComponents();
	void GetAimedTutorialHintString(class FString* ReturnValue);
	void GetActorViewDirection(struct FVector* ReturnValue);
	void ForceReplicateNowIfNoChannel();
	bool ForceReplicateNow();
	class AHUD* DrawBasicFloatingHUD();
	class AHUD* DrawActorFloatingHUD();
	void CurrentlyHasRider(bool* ReturnValue);
	int32 ClientMultiUse(class APlayerController* ForPC, int32* UseIndex);
	void CheckRegisterCharacterMesh();
	class UWorld* CheckBPAllowActorSpawn(struct FVector* AtLocation, const struct FRotator& AtRotation, class AActor* ForOwner, class APawn* ForInstigator, bool* ReturnValue);
	int32 ChangeActorTeam();
	void CanMoveThroughActor(class AActor** Actor, bool* ReturnValue);
	void BPTryMultiUse(class APlayerController* ForPC, int32* UseIndex, bool* ReturnValue);
	void BPSetNetworkAndStasisRangeMultiplier(float Value);
	class UObject* BPPreventAttachments(bool* ReturnValue);
	void BPPreInitializeComponents();
	void BPPostInitializeComponents();
	void BPOverrideUILocation(class APlayerController* ForPC, struct FVector* ReturnValue);
	void BPOverrideServerMultiUseAcceptRange(float* ReturnValue);
	void BPIsMarkedForSeamlessTravel(bool* ReturnValue);
	class UObject* BPInventoryItemUsed();
	class UObject* BPInventoryItemDropped();
	TArray<class USkeletalMeshComponent*> BPGetShowDebugAnimationComponents();
	void BPGetQuickActionUseEntry(class APlayerController* ForPC, struct FQuickActionOption* ReturnValue);
	void BPGetMultiUseEntries(class APlayerController* ForPC, TArray<struct FMultiUseEntry>* MultiUseEntries, TArray<struct FMultiUseEntry>* ReturnValue);
	struct FLinearColor BPGetMultiUseCenterText(class APlayerController* ForPC, int32* UseIndex, bool* ReturnValue);
	int32 BPGetExtraSpecialBlueprintInt(int32* ReturnValue);
	struct FBPNetExecParams BPGetCustomBlueprintData(bool* ReturnValue);
	void BPGetBonesToHideOnAllocation(TArray<class FName>* ReturnValue);
	void BPGetActorEyesViewPoint(struct FVector* Location, struct FRotator* Rotation);
	class UObject* BPForceAllowsInventoryUse(bool* ReturnValue);
	void BPFilterMultiUseEntries(class APlayerController* ForPC, TArray<struct FMultiUseEntry>* MultiUseEntries, TArray<struct FMultiUseEntry>* ReturnValue);
	class UCanvas* BPDrawMultiUseEntry(struct FMultiUseEntry* Entry, class APlayerController* ForPC, const struct FVector2D& CanvasPosition);
	class UCanvas* BPDrawMultiUseCustomEntry(class APlayerController* ForPC, const struct FVector2D& CanvasPosition);
	void BPCustomIsRelevantForClient(class APlayerController* ForPC, bool* ReturnValue);
	struct FHitResult BPControlRigNotify(class FName NotifyCustomTag, struct FVector* Velocity);
	void BPConsumeUsePinCode(class AActor* FromKeypadActor, class APlayerController* ForPC, int32 AppledPinCode, bool bIsActivating, bool* ReturnValue);
	void BPConsumeSetPinCode(class APlayerController* ForPC, int32 AppledPinCode, bool bIsSetting, int32 TheCustomIndex, bool* ReturnValue);
	void BPClientDoMultiUse(class APlayerController* ForPC, int32 ClientUseIndex);
	void BPCheckForErrors(TArray<struct FBPMapCheckEntry>* ReturnValue);
	void BPChangedActorTeam();
	void BPAttachedRootComponent();
	void BPAllowActorSpawn(class UWorld* ForWorld, struct FVector* AtLocation, const struct FRotator& AtRotation, class AActor* ForOwner, class APawn* ForInstigator, bool* ReturnValue);
	void BP_OverrideTargetingLocation(class AActor* Attacker, struct FVector* ReturnValue);
	void BP_GetHUDWorldDrawLocation(class FName HUDTag, struct FVector* ReturnValue);
	void AllowManualMultiUseActivation(class APlayerController* ForPC, bool* ReturnValue);
	void AllowIgnoreCharacterEncroachment(class UPrimitiveComponent* HitComponent, class AActor* EncroachingCharacter, bool* ReturnValue);
	void AllowGrappling(bool* ReturnValue);
	void AllowEmulatedMovement(bool* ReturnValue);
};

// 0x298 (0x4C8 - 0x230)
// Class Engine.Actor
class AActor : public UPrimalActor
{
public:
	struct FActorTickFunction                    PrimaryActorTick;                                  // 0x230(0x38)(ConstParm, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bNetTemporary : 1;                                 // Mask: 0x1, PropSize: 0x10x268(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_F : 1;                                      // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bOnlyRelevantToOwner : 1;                          // Mask: 0x4, PropSize: 0x10x268(0x1)(Edit, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bAlwaysRelevant : 1;                               // Mask: 0x8, PropSize: 0x10x268(0x1)(ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bReplicateMovement : 1;                            // Mask: 0x10, PropSize: 0x10x268(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bCallPreReplication : 1;                           // Mask: 0x20, PropSize: 0x10x268(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bCallPreReplicationForReplay : 1;                  // Mask: 0x40, PropSize: 0x10x268(0x1)(BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bHidden : 1;                                       // Mask: 0x80, PropSize: 0x10x268(0x1)(ConstParm, ExportObject, OutParm, Config)
	uint8                                        bTearOff : 1;                                      // Mask: 0x1, PropSize: 0x10x269(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bForceNetAddressable : 1;                          // Mask: 0x2, PropSize: 0x10x269(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bExchangedRoles : 1;                               // Mask: 0x4, PropSize: 0x10x269(0x1)(Edit, ConstParm, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bNetLoadOnClient : 1;                              // Mask: 0x8, PropSize: 0x10x269(0x1)(ConstParm, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bNetUseOwnerRelevancy : 1;                         // Mask: 0x10, PropSize: 0x10x269(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bRelevantForNetworkReplays : 1;                    // Mask: 0x20, PropSize: 0x10x269(0x1)(ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bRelevantForLevelBounds : 1;                       // Mask: 0x40, PropSize: 0x10x269(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bReplayRewindable : 1;                             // Mask: 0x80, PropSize: 0x10x269(0x1)(Edit, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bAllowTickBeforeBeginPlay : 1;                     // Mask: 0x1, PropSize: 0x10x26A(0x1)(Edit, ConstParm, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bForceHighQualityViewerReplication : 1;            // Mask: 0x2, PropSize: 0x10x26A(0x1)(Edit, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bActorPreventPhysicsSceneRegistration : 1;         // Mask: 0x4, PropSize: 0x10x26A(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bAutoDestroyWhenFinished : 1;                      // Mask: 0x8, PropSize: 0x10x26A(0x1)(BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bCanBeDamaged : 1;                                 // Mask: 0x10, PropSize: 0x10x26A(0x1)(ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bBlockInput : 1;                                   // Mask: 0x20, PropSize: 0x10x26A(0x1)(Edit, Net, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bCollideWhenPlacing : 1;                           // Mask: 0x40, PropSize: 0x10x26A(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bFindCameraComponentWhenViewTarget : 1;            // Mask: 0x80, PropSize: 0x10x26A(0x1)(BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bGenerateOverlapEventsDuringLevelStreaming : 1;    // Mask: 0x1, PropSize: 0x10x26B(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bIgnoresOriginShifting : 1;                        // Mask: 0x2, PropSize: 0x10x26B(0x1)(ConstParm, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bEnableAutoLODGeneration : 1;                      // Mask: 0x4, PropSize: 0x10x26B(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsEditorOnlyActor : 1;                            // Mask: 0x8, PropSize: 0x10x26B(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bActorSeamlessTraveled : 1;                        // Mask: 0x10, PropSize: 0x10x26B(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bDisableRigidBodyAnimNodes : 1;                    // Mask: 0x20, PropSize: 0x10x26B(0x1)(ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bReplicates : 1;                                   // Mask: 0x40, PropSize: 0x10x26B(0x1)(ConstParm, BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bCanBeInCluster : 1;                               // Mask: 0x80, PropSize: 0x10x26B(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bAllowReceiveTickEventOnDedicatedServer : 1;       // Mask: 0x1, PropSize: 0x10x26C(0x1)(ConstParm, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_10 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bReplicateUsingRegisteredSubObjectList : 1;        // Mask: 0x4, PropSize: 0x10x26C(0x1)(Edit, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        BitPad_11 : 5;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        BitPad_12 : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bActorEnableCollision : 1;                         // Mask: 0x10, PropSize: 0x10x26D(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bActorIsBeingDestroyed : 1;                        // Mask: 0x20, PropSize: 0x10x26D(0x1)(ConstParm, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_13 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        BitPad_14 : 3;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bAsyncPhysicsTickEnabled : 1;                      // Mask: 0x8, PropSize: 0x10x26E(0x1)(Edit, BlueprintVisible, Parm, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_15 : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	enum class EActorUpdateOverlapsMethod        UpdateOverlapsMethodDuringLevelStreaming;          // 0x26F(0x1)(BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	enum class EActorUpdateOverlapsMethod        DefaultUpdateOverlapsMethodDuringLevelStreaming;   // 0x270(0x1)(Edit, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, GlobalConfig, InstancedReference)
	uint8                                        Pad_179[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        InitialLifeSpan;                                   // 0x278(0x4)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	float                                        CustomTimeDilation;                                // 0x27C(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	enum class ENetRole                          RemoteRole;                                        // 0x280(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor)
	uint8                                        Pad_17B[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        RayTracingGroupId;                                 // 0x284(0x4)(ConstParm, BlueprintVisible, Net, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	struct FRepAttachment                        AttachmentReplication;                             // 0x288(0x60)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FRepMovement                          ReplicatedMovement;                                // 0x2E8(0x70)(EditFixedSize, OutParm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class AActor*                                Owner;                                             // 0x358(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor)
	class FName                                  NetDriverName;                                     // 0x360(0x8)(Edit, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	enum class ENetRole                          Role;                                              // 0x368(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor)
	enum class ENetDormancy                      NetDormancy;                                       // 0x369(0x1)(ConstParm, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod;                      // 0x36A(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	enum class EAutoReceiveInput                 AutoReceiveInput;                                  // 0x36B(0x1)(ConstParm, ExportObject, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        InputPriority;                                     // 0x36C(0x4)(ConstParm, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       CreationTime;                                      // 0x370(0x8)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig, SubobjectReference)
	class UInputComponent*                       InputComponent;                                    // 0x378(0x8)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, EditConst)
	float                                        NetCullDistanceSquared;                            // 0x380(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NetTag;                                            // 0x384(0x4)(ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        NetUpdateFrequency;                                // 0x388(0x4)(ExportObject, Net, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        MinNetUpdateFrequency;                             // 0x38C(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	float                                        NetPriority;                                       // 0x390(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_17C[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	double                                       LastRenderTime;                                    // 0x398(0x8)(Edit, BlueprintVisible, ExportObject, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       LastRenderTimeOnScreen;                            // 0x3A0(0x8)(Edit, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	double                                       LastRenderTimeIgnoreShadow;                        // 0x3A8(0x8)(Edit, Net, EditFixedSize, OutParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	class APawn*                                 Instigator;                                        // 0x3B0(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Parm, ReturnParm, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	TArray<class AActor*>                        Children;                                          // 0x3B8(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance)
	class USceneComponent*                       RootComponent;                                     // 0x3C8(0x8)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_17F[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<class FName>                          Layers;                                            // 0x3D8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TWeakObjectPtr<class UChildActorComponent>   ParentComponent;                                   // 0x3E8(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class FName>                          Tags;                                              // 0x3F0(0x10)(Edit, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, Config)
	uint8                                        Pad_180[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastSparseDelegateProperty_            OnTakeAnyDamage;                                   // 0x404(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnTakePointDamage;                                 // 0x405(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnTakeRadialDamage;                                // 0x406(0x1)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnActorBeginOverlap;                               // 0x407(0x1)(BlueprintVisible, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnActorEndOverlap;                                 // 0x408(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnBeginCursorOver;                                 // 0x409(0x1)(BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnEndCursorOver;                                   // 0x40A(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnClicked;                                         // 0x40B(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnReleased;                                        // 0x40C(0x1)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchBegin;                                 // 0x40D(0x1)(Edit, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchEnd;                                   // 0x40E(0x1)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchEnter;                                 // 0x40F(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchLeave;                                 // 0x410(0x1)(Edit, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnActorHit;                                        // 0x411(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnDestroyed;                                       // 0x412(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnEndPlay;                                         // 0x413(0x1)(Edit, ConstParm, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_182[0x84];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class UActorComponent*>               InstanceComponents;                                // 0x498(0x10)(ConstParm, Net, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class UActorComponent*>               BlueprintCreatedComponents;                        // 0x4A8(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_183[0x10];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class AActor* GetDefaultObj();

	float WasRecentlyRendered(bool* ReturnValue);
	void UserConstructionScript();
	void TearOff();
	float StopActorSound(class USoundBase* SoundAsset);
	void SetTickGroup(enum class ETickingGroup NewTickGroup);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	bool SetReplicates();
	bool SetReplicateMovement();
	int32 SetRayTracingGroupId();
	void SetOwner(class AActor* NewOwner);
	enum class ENetDormancy SetNetDormancy();
	float SetLifeSpan();
	bool SetAutoDestroyWhenFinished();
	void SetActorTickInterval(float TickInterval);
	void SetActorTickEnabled(bool* bEnabled);
	struct FVector SetActorScale3D();
	struct FVector SetActorRelativeScale3D();
	bool SetActorHiddenInGame();
	bool SetActorEnableCollision();
	bool ServerSendSimpleExecCommandToEveryone(bool* bForceSendToLocalPlayer, bool* bIgnoreRelevancy);
	bool ServerSendExecCommandToPlayer(bool* bForceSendToLocalPlayer, bool* bIgnoreRelevancy);
	bool ServerSendExecCommandToEveryone(bool* bForceSendToLocalPlayer, bool* bIgnoreRelevancy);
	void ReregisterAllComponents();
	class UActorComponent* RemoveTickPrerequisiteComponent();
	class AActor* RemoveTickPrerequisiteActor();
	float ReceiveTick();
	class AActor* ReceiveRadialDamage(float* DamageReceived, class UDamageType** DamageType, struct FHitResult* HitInfo, class AController* InstigatedBy);
	class AActor* ReceivePointDamage(float* Damage, class UDamageType** DamageType, struct FVector* HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* HitComponent, class FName BoneName, struct FVector* ShotFromDirection, class AController* InstigatedBy, struct FHitResult* HitInfo);
	class UPrimitiveComponent* ReceiveHit(class UPrimitiveComponent** MyComp, class AActor** Other, bool* bSelfMoved, struct FVector* HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	float ReceiveAsyncPhysicsTick();
	class AActor* ReceiveAnyDamage(float* Damage, class UDamageType** DamageType, class AController* InstigatedBy);
	struct FKey ReceiveActorOnReleased();
	void ReceiveActorOnInputTouchLeave(enum class ETouchIndex FingerIndex);
	void ReceiveActorOnInputTouchEnter(enum class ETouchIndex FingerIndex);
	void ReceiveActorOnInputTouchEnd(enum class ETouchIndex FingerIndex);
	void ReceiveActorOnInputTouchBegin(enum class ETouchIndex FingerIndex);
	struct FKey ReceiveActorOnClicked();
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveActorEndCursorOver();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorBeginCursorOver();
	void PrestreamTextures(float Seconds, bool* bEnableStreaming, int32* CinematicTextureGroups);
	void OnRep_ReplicateMovement();
	void OnRep_ReplicatedMovement();
	void OnRep_Owner();
	void OnRep_Instigator();
	void OnRep_AttachmentReplication();
	void NetSpawnedActor(class AActor* SpawnedActor);
	bool NetActorSpawnActorUnreliable(class UClass** ActorClass, struct FVector* AtLoc, struct FRotator* AtRot, class USceneComponent** AttachToComponent, class FName BoneName, class AActor** SpawnOwner);
	bool NetActorSpawnActor(class UClass** ActorClass, struct FVector* AtLoc, struct FRotator* AtRot, class USceneComponent** AttachToComponent, class FName BoneName, class AActor** SpawnOwner);
	float MulticastDrawDebugString(bool* EnableInShipping);
	float MulticastDrawDebugSphere(float Radius, int32* Segments, struct FLinearColor* LineColor, bool* EnableInShipping);
	float MulticastDrawDebugPoint(const struct FVector& Position, bool* EnableInShipping);
	float MulticastDrawDebugPlane(struct FVector* Location, bool* EnableInShipping);
	float MulticastDrawDebugLineTraceHitResult(const struct FHitResult& Hit, const struct FVector& TraceStart, const struct FVector& TraceEnd, struct FLinearColor* StartColor, struct FLinearColor* HitColor, float* LineThickness, float* HitSize, bool* bDrawHitNormal, struct FLinearColor* HitNormalColor, float* HitNormalLength, bool* EnableInShipping);
	float MulticastDrawDebugLine(struct FVector* LineStart, struct FVector* LineEnd, struct FLinearColor* LineColor, float Thickness, bool* EnableInShipping);
	float MulticastDrawDebugCylinder(struct FVector* Start, const struct FVector& End, float Radius, int32* Segments, struct FLinearColor* LineColor, bool* EnableInShipping);
	float MulticastDrawDebugCoordinateSystem(struct FVector* AxisLoc, struct FRotator* AxisRot, float Scale, float Thickness, bool* EnableInShipping);
	float MulticastDrawDebugCapsuleWithExtents(float Radius, struct FLinearColor* LineColor, bool bPersistent, bool* EnableInShipping);
	float MulticastDrawDebugCapsule(float* HalfHeight, float Radius, struct FRotator* Rotation, struct FLinearColor* LineColor, bool* EnableInShipping);
	float MulticastDrawDebugCamera(class ACameraActor** CameraActor, struct FLinearColor* CameraColor, bool* EnableInShipping);
	float MulticastDrawDebugBox(struct FLinearColor* LineColor, struct FRotator* Rotation, bool* EnableInShipping);
	float MulticastDrawDebugArrow(struct FVector* LineStart, struct FVector* LineEnd, float* ArrowSize, struct FLinearColor* LineColor, bool* EnableInShipping);
	class FName MakeNoise(float Loudness, class APawn** NoiseInstigator, struct FVector* NoiseLocation, float MaxRange);
	void K2_TeleportTo(struct FVector* DestLocation, struct FRotator* DestRotation, bool* bSimpleTeleport, bool* ReturnValue);
	bool K2_SetActorTransform(struct FHitResult* SweepHitResult, bool* ReturnValue);
	struct FRotator K2_SetActorRotation(bool* bTeleportPhysics, bool* ReturnValue);
	bool K2_SetActorRelativeTransform(struct FTransform* NewRelativeTransform, struct FHitResult* SweepHitResult);
	bool K2_SetActorRelativeRotation(struct FRotator* NewRelativeRotation, struct FHitResult* SweepHitResult);
	bool K2_SetActorRelativeLocation(struct FHitResult* SweepHitResult);
	bool K2_SetActorLocationAndRotation(const struct FVector& NewLocation, struct FHitResult* SweepHitResult, bool* ReturnValue);
	bool K2_SetActorLocation(const struct FVector& NewLocation, struct FHitResult* SweepHitResult, bool* ReturnValue);
	void K2_OnReset();
	class APlayerController* K2_OnEndViewTarget();
	class APlayerController* K2_OnBecomeViewTarget();
	void K2_GetRootComponent(class USceneComponent** ReturnValue);
	void K2_GetComponentsByClass(class UClass* ComponentClass, TArray<class UActorComponent*>* ReturnValue);
	void K2_GetActorRotation(struct FRotator* ReturnValue);
	void K2_GetActorLocation(struct FVector* ReturnValue);
	enum class EDetachmentRule K2_DetachFromActor();
	void K2_DestroyActor();
	enum class EAttachmentRule K2_AttachToComponent(class USceneComponent* Parent, bool* bWeldSimulatedBodies, bool* ReturnValue);
	enum class EAttachmentRule K2_AttachToActor(class AActor** ParentActor, bool* bWeldSimulatedBodies, bool* ReturnValue);
	void K2_AttachRootComponentToActor(class AActor** InParentActor, class FName* InSocketName, enum class EAttachLocation* AttachLocationType, bool* bWeldSimulatedBodies);
	class USceneComponent* K2_AttachRootComponentTo(class FName* InSocketName, enum class EAttachLocation* AttachLocationType, bool* bWeldSimulatedBodies);
	bool K2_AddActorWorldTransformKeepScale(struct FTransform* DeltaTransform, struct FHitResult* SweepHitResult);
	bool K2_AddActorWorldTransform(struct FTransform* DeltaTransform, struct FHitResult* SweepHitResult);
	bool K2_AddActorWorldRotation(struct FRotator* DeltaRotation, struct FHitResult* SweepHitResult);
	bool K2_AddActorWorldOffset(struct FHitResult* SweepHitResult);
	bool K2_AddActorLocalTransform(struct FHitResult* SweepHitResult);
	bool K2_AddActorLocalRotation(struct FRotator* DeltaRotation, struct FHitResult* SweepHitResult);
	bool K2_AddActorLocalOffset(struct FHitResult* SweepHitResult);
	void IsOwnedOrControlledBy(class AActor** TestOwner, bool* ReturnValue);
	void IsOverlappingActor(class AActor** Other, bool* ReturnValue);
	void IsChildActor(bool* ReturnValue);
	void IsActorTickEnabled(bool* ReturnValue);
	void IsActorBeingDestroyed(bool* ReturnValue);
	void HasAuthority(bool* ReturnValue);
	void GetVisibleUnhiddenComponentByClass(class UClass* ComponentClass, class UPrimitiveComponent** ReturnValue);
	void GetVisibleComponentByClass(class UClass* ComponentClass, class UPrimitiveComponent** ReturnValue);
	void GetVerticalDistanceTo(class AActor* OtherActor, float* ReturnValue);
	void GetVelocity(bool* bIsForRagdoll, struct FVector* ReturnValue);
	void GetTransform(struct FTransform* ReturnValue);
	void GetTickableWhenPaused(bool* ReturnValue);
	void GetSquaredHorizontalDistanceTo(class AActor* OtherActor, float* ReturnValue);
	void GetSquaredDistanceTo(class AActor* OtherActor, float* ReturnValue);
	void GetRemoteRole(enum class ENetRole* ReturnValue);
	void GetRayTracingGroupId(int32* ReturnValue);
	void GetParentComponent(class UChildActorComponent** ReturnValue);
	void GetParentActor(class AActor** ReturnValue);
	void GetOwnerController(class APlayerController** ReturnValue);
	void GetOwner(class AActor** ReturnValue);
	void GetOverlappingComponents(const TArray<class UPrimitiveComponent*>& OverlappingComponents);
	void GetOverlappingActors(const TArray<class AActor*>& OverlappingActors, class UClass** ClassFilter);
	void GetLocalRole(enum class ENetRole* ReturnValue);
	void GetLifeSpan(float* ReturnValue);
	void GetLevelTransform(struct FTransform* ReturnValue);
	void GetLevel(class ULevel** ReturnValue);
	void GetInstigatorController(class AController** ReturnValue);
	void GetInstigator(class APawn** ReturnValue);
	void GetInputVectorAxisValue(struct FKey* InputAxisKey, struct FVector* ReturnValue);
	void GetInputAxisValue(class FName* InputAxisName, float* ReturnValue);
	void GetInputAxisKeyValue(struct FKey* InputAxisKey, float* ReturnValue);
	void GetHorizontalDotProductTo(class AActor* OtherActor, float* ReturnValue);
	void GetHorizontalDistanceTo(class AActor* OtherActor, float* ReturnValue);
	void GetGameTimeSinceCreation(float* ReturnValue);
	void GetDotProductTo(class AActor* OtherActor, float* ReturnValue);
	void GetDistanceTo(class AActor* OtherActor, float* ReturnValue);
	class FName GetComponentsByTag(class UClass* ComponentClass, TArray<class UActorComponent*>* ReturnValue);
	void GetComponentsByInterface(class UClass* Interface, TArray<class UActorComponent*>* ReturnValue);
	void GetComponentsByCustomTag(class FName* TheTag, TArray<class UActorComponent*>* ReturnValue);
	void GetComponentByCustomTag(class FName* TheTag, class UActorComponent** ReturnValue);
	void GetComponentByClass(class UClass* ComponentClass, class UActorComponent** ReturnValue);
	void GetAttachParentSocketName(class FName* ReturnValue);
	void GetAttachParentActor(class AActor** ReturnValue);
	TArray<class AActor*> GetAttachedActors(bool* bResetArray, bool* bRecursivelyIncludeAttachedActors);
	void GetAllChildActors(TArray<class AActor*>* ChildActors, bool bIncludeDescendants);
	void GetActorUpVector(struct FVector* ReturnValue);
	void GetActorTimeDilation(float* ReturnValue);
	void GetActorTickInterval(float* ReturnValue);
	void GetActorScale3D(struct FVector* ReturnValue);
	void GetActorRightVector(struct FVector* ReturnValue);
	void GetActorRelativeScale3D(struct FVector* ReturnValue);
	void GetActorForwardVector(struct FVector* ReturnValue);
	void GetActorEyesViewPoint(const struct FVector& OutLocation, const struct FRotator& OutRotation);
	void GetActorEnableCollision(bool* ReturnValue);
	struct FVector GetActorBounds(bool bOnlyCollidingComponents, bool bIncludeFromChildActors);
	void ForceNetUpdate(bool bDormantDontReplicateProperties, bool bAbsoluteForceNetUpdate, bool bDontUpdateChannel);
	void ForceDestroy();
	void FlushNetDormancy();
	void FinishAddComponent(class UActorComponent** Component, bool bManualAttachment, struct FTransform* RelativeTransform);
	void EnableInput(class APlayerController** PlayerController);
	void DisableInput(class APlayerController** PlayerController);
	void DetachRootComponentFromParent(bool* bMaintainWorldPosition);
	void CreateInputComponent(class UClass* InputComponentToCreate);
	void CalculateComponentsBoundingBoxInLocalSpace(bool bNonColliding, bool bIncludeFromChildActors, struct FBox* ReturnValue);
	struct FBPNetExecParams BPServerHandleNetExecCommand(class APlayerController* FromPC, bool* ReturnValue);
	void BPIsA(class UClass* AnActorClass, bool* ReturnValue);
	struct FBPNetExecParams BPClientHandleNetExecCommand(class APlayerController* ForPC, bool* ReturnValue);
	class UActorComponent* AddTickPrerequisiteComponent();
	class AActor* AddTickPrerequisiteActor();
	void AddComponentByClass(class UClass* Class, bool bManualAttachment, struct FTransform* RelativeTransform, bool bDeferredFinish, class UActorComponent** ReturnValue);
	void AddComponent(class FName TemplateName, bool bManualAttachment, struct FTransform* RelativeTransform, class UObject* ComponentTemplateContext, bool bDeferredFinish, class UActorComponent** ReturnValue);
	void ActorPlaySoundUnreliable(class USoundBase* SoundAsset, bool bAttach, class FName BoneName, const struct FVector& LocOffset);
	void ActorPlaySound(class USoundBase* SoundAsset, bool bAttach, class FName BoneName, const struct FVector& LocOffset);
	class FName ActorHasTag(bool* ReturnValue);
};

// 0x0 (0x28 - 0x28)
// Class Engine.BlueprintFunctionLibrary
class UBlueprintFunctionLibrary : public UObject
{
public:

	static class UClass* StaticClass();
	static class UBlueprintFunctionLibrary* GetDefaultObj();

};

// 0xA0 (0xC8 - 0x28)
// Class Engine.StreamableRenderAsset
class UStreamableRenderAsset : public UObject
{
public:
	uint8                                        Pad_197[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       ForceMipLevelsToBeResidentTimestamp;               // 0x40(0x8)(ConstParm, BlueprintVisible, Net, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        NumCinematicMipLevels;                             // 0x48(0x4)(ConstParm, ExportObject, BlueprintReadOnly, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_198[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FPerQualityLevelInt                   NoRefStreamingLODBias;                             // 0x50(0x68)(ConstParm, BlueprintVisible, ExportObject, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        StreamingIndex;                                    // 0xB8(0x4)(ConstParm, BlueprintVisible, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        NeverStream : 1;                                   // Mask: 0x1, PropSize: 0x10xBC(0x1)(BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, Config)
	uint8                                        bGlobalForceMipLevelsToBeResident : 1;             // Mask: 0x2, PropSize: 0x10xBC(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bHasStreamingUpdatePending : 1;                    // Mask: 0x4, PropSize: 0x10xBC(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bForceMiplevelsToBeResident : 1;                   // Mask: 0x8, PropSize: 0x10xBC(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bIgnoreStreamingMipBias : 1;                       // Mask: 0x10, PropSize: 0x10xBC(0x1)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseCinematicMipLevels : 1;                        // Mask: 0x20, PropSize: 0x10xBC(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_199[0xB];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UStreamableRenderAsset* GetDefaultObj();

	void SetForceMipLevelsToBeResident(float Seconds, int32* CinematicLODGroupMask);
};

// 0x110 (0x1D8 - 0xC8)
// Class Engine.Texture
class UTexture : public UStreamableRenderAsset
{
public:
	uint8                                        Pad_19D[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	struct FGuid                                 LightingGuid;                                      // 0xD8(0x10)(ConstParm, BlueprintVisible, ExportObject, Parm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        LevelIndex;                                        // 0xE8(0x4)(ExportObject, Parm, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	struct FPerPlatformInt                       LODBias;                                           // 0xEC(0x4)(BlueprintVisible, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, DuplicateTransient)
	enum class ETextureCompressionSettings       CompressionSettings;                               // 0xF0(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	enum class ETextureFilter                    Filter;                                            // 0xF1(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, Config)
	enum class ETextureMipLoadOptions            MipLoadOptions;                                    // 0xF2(0x1)(Edit, BlueprintVisible, ReturnParm, Config, DuplicateTransient)
	enum class ETextureCookPlatformTilingSettings CookPlatformTilingSettings;                        // 0xF3(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	enum class ETextureGroup                     LODGroup;                                          // 0xF4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Config, GlobalConfig, InstancedReference)
	uint8                                        Pad_19E[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	struct FPerPlatformFloat                     Downscale;                                         // 0xF8(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	enum class ETextureDownscaleOptions          DownscaleOptions;                                  // 0xFC(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        SRGB : 1;                                          // Mask: 0x1, PropSize: 0x10xFD(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst, GlobalConfig, InstancedReference)
	uint8                                        bNoTiling : 1;                                     // Mask: 0x2, PropSize: 0x10xFD(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        VirtualTextureStreaming : 1;                       // Mask: 0x4, PropSize: 0x10xFD(0x1)(ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnInstance, GlobalConfig, InstancedReference, DuplicateTransient)
	uint8                                        CompressionYCoCg : 1;                              // Mask: 0x8, PropSize: 0x10xFD(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bNotOfflineProcessed : 1;                          // Mask: 0x10, PropSize: 0x10xFD(0x1)(Edit, ExportObject, Net, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bAsyncResourceReleaseHasBeenStarted : 1;           // Mask: 0x20, PropSize: 0x10xFD(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_16 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_19F[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<class UAssetUserData*>                AssetUserData;                                     // 0x100(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst)
	uint8                                        Pad_1A0[0xC8];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UTexture* GetDefaultObj();

	struct FLinearColor ComputeTextureSourceChannelMinMax(bool* ReturnValue);
	int64 Blueprint_GetTextureSourceDiskAndMemorySize();
	void Blueprint_GetMemorySize(int64* ReturnValue);
};

// 0x90 (0xB8 - 0x28)
// Class Engine.ActorComponent
class UActorComponent : public UObject
{
public:
	uint8                                        Pad_1AF[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FActorComponentTickFunction           PrimaryComponentTick;                              // 0x30(0x38)(Edit, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<class FName>                          ComponentTags;                                     // 0x68(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<class UAssetUserData*>                AssetUserData;                                     // 0x78(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, EditConst)
	uint8                                        Pad_1B0[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        UCSSerializationIndex;                             // 0x8C(0x4)(ConstParm, ExportObject, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        BitPad_18 : 3;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bNetAddressable : 1;                               // Mask: 0x8, PropSize: 0x10x90(0x1)(Edit, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bReplicateUsingRegisteredSubObjectList : 1;        // Mask: 0x10, PropSize: 0x10x90(0x1)(Edit, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bReplicates : 1;                                   // Mask: 0x20, PropSize: 0x10x90(0x1)(ConstParm, BlueprintVisible, OutParm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        BitPad_19 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1B1[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        BitPad_1A : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bAutoActivate : 1;                                 // Mask: 0x2, PropSize: 0x10x92(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bIsActive : 1;                                     // Mask: 0x4, PropSize: 0x10x92(0x1)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bEditableWhenInherited : 1;                        // Mask: 0x8, PropSize: 0x10x92(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bOnlyRelevantToOwner : 1;                          // Mask: 0x10, PropSize: 0x10x92(0x1)(Edit, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        BitPad_1B : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bCanEverAffectNavigation : 1;                      // Mask: 0x40, PropSize: 0x10x92(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        BitPad_1C : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bIsEditorOnly : 1;                                 // Mask: 0x1, PropSize: 0x10x93(0x1)(BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        BitPad_1D : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1B3[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	enum class EComponentCreationMethod          CreationMethod;                                    // 0x95(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnComponentActivated;                              // 0x96(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnComponentDeactivated;                            // 0x97(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_1B5[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        bStasisPreventUnregister : 1;                      // Mask: 0x1, PropSize: 0x10xA8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bOnlyInitialReplication : 1;                       // Mask: 0x2, PropSize: 0x10xA8(0x1)(ConstParm, Parm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bPreventOnDedicatedServer : 1;                     // Mask: 0x4, PropSize: 0x10xA8(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bPreventOnConsoles : 1;                            // Mask: 0x8, PropSize: 0x10xA8(0x1)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bPreventOnClient : 1;                              // Mask: 0x10, PropSize: 0x10xA8(0x1)(Edit, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bPreventOnNonDedicatedHost : 1;                    // Mask: 0x20, PropSize: 0x10xA8(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bDedicatedForceTickingEveryFrame : 1;              // Mask: 0x40, PropSize: 0x10xA8(0x1)(ConstParm, EditFixedSize, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bAlwaysReplicatePropertyConditional : 1;           // Mask: 0x80, PropSize: 0x10xA8(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bUseBPOnComponentTick : 1;                         // Mask: 0x1, PropSize: 0x10xA9(0x1)(Edit, ConstParm, Net, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bUseBPOnComponentDestroyed : 1;                    // Mask: 0x2, PropSize: 0x10xA9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bUseBPOnComponentCreated : 1;                      // Mask: 0x4, PropSize: 0x10xA9(0x1)(ExportObject, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        BitPad_1E : 5;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_1B7[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	class FName                                  CustomTag;                                         // 0xAC(0x8)(ConstParm, OutParm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)
	int32                                        CustomData;                                        // 0xB4(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst, SubobjectReference)

	static class UClass* StaticClass();
	static class UActorComponent* GetDefaultObj();

	void ToggleActive();
	void SetTickGroup(enum class ETickingGroup NewTickGroup);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	void SetOwner(class AActor* NewOwner);
	void SetIsReplicated(bool ShouldReplicate);
	void SetComponentTickIntervalAndCooldown(float TickInterval);
	void SetComponentTickInterval(float TickInterval);
	void SetComponentTickEnabled(bool* bEnabled);
	void SetAutoActivate(bool bNewAutoActivate);
	bool SetActive(bool bNewActive);
	void ReregisterComponent();
	class UActorComponent* RemoveTickPrerequisiteComponent();
	class AActor* RemoveTickPrerequisiteActor();
	float ReceiveTick();
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	float ReceiveAsyncPhysicsTick();
	void OnRep_IsActive();
	void K2_DestroyComponent(class UObject** Object);
	void IsComponentTickEnabled(bool* ReturnValue);
	void IsBeingDestroyed(bool* ReturnValue);
	void IsActive(bool* ReturnValue);
	void GetOwner(class AActor** ReturnValue);
	void GetComponentTickInterval(float* ReturnValue);
	void Deactivate();
	class FName ComponentHasTag(bool* ReturnValue);
	float BPTickComponent();
	float BPOnComponentTick();
	void BPOnComponentDestroyed();
	void BPOnComponentCreated();
	class UActorComponent* AddTickPrerequisiteComponent();
	class AActor* AddTickPrerequisiteActor();
	void AddedAsPrimalItemAttachment();
	bool Activate();
};

// 0x210 (0x2C8 - 0xB8)
// Class Engine.SceneComponent
class USceneComponent : public UActorComponent
{
public:
	uint8                                        Pad_27A[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	TWeakObjectPtr<class APhysicsVolume>         PhysicsVolume;                                     // 0xC0(0x8)(Edit, ConstParm, BlueprintReadOnly, Net, Transient, Config, GlobalConfig)
	class USceneComponent*                       AttachParent;                                      // 0xC8(0x8)(Edit, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	class FName                                  AttachSocketName;                                  // 0xD0(0x8)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	TArray<class USceneComponent*>               AttachChildren;                                    // 0xD8(0x10)(EditFixedSize, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	TArray<class USceneComponent*>               ClientAttachedChildren;                            // 0xE8(0x10)(BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_27B[0x48];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RelativeLocation;                                  // 0x140(0x18)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Config, EditConst, SubobjectReference)
	struct FRotator                              RelativeRotation;                                  // 0x158(0x18)(Edit, ConstParm, ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               RelativeScale3D;                                   // 0x170(0x18)(ConstParm, Net, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	struct FVector                               ComponentVelocity;                                 // 0x188(0x18)(ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bClientSyncAlwaysUpdatePhysicsCollision : 1;       // Mask: 0x1, PropSize: 0x10x1A0(0x1)(Edit, ConstParm, OutParm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_21 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_27C[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bComponentToWorldUpdated : 1;                      // Mask: 0x1, PropSize: 0x10x1A4(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_22 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bAbsoluteLocation : 1;                             // Mask: 0x4, PropSize: 0x10x1A4(0x1)(BlueprintVisible, ExportObject, Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	uint8                                        bAbsoluteRotation : 1;                             // Mask: 0x8, PropSize: 0x10x1A4(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAbsoluteScale : 1;                                // Mask: 0x10, PropSize: 0x10x1A4(0x1)(BlueprintVisible, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bVisible : 1;                                      // Mask: 0x20, PropSize: 0x10x1A4(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bShouldBeAttached : 1;                             // Mask: 0x40, PropSize: 0x10x1A4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bShouldSnapLocationWhenAttached : 1;               // Mask: 0x80, PropSize: 0x10x1A4(0x1)(BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bShouldSnapRotationWhenAttached : 1;               // Mask: 0x1, PropSize: 0x10x1A5(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bShouldSnapScaleWhenAttached : 1;                  // Mask: 0x2, PropSize: 0x10x1A5(0x1)(BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bShouldUpdatePhysicsVolume : 1;                    // Mask: 0x4, PropSize: 0x10x1A5(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bHiddenInGame : 1;                                 // Mask: 0x8, PropSize: 0x10x1A5(0x1)(ConstParm, OutParm, Config)
	uint8                                        BitPad_23 : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_27D[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bAttachedSoundsForceHighPriority : 1;              // Mask: 0x1, PropSize: 0x10x1A8(0x1)(Edit, BlueprintVisible, Parm, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_24 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_27E[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bBoundsChangeTriggersStreamingDataRebuild : 1;     // Mask: 0x1, PropSize: 0x10x1AC(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseAttachParentBound : 1;                         // Mask: 0x2, PropSize: 0x10x1AC(0x1)(Edit, ConstParm, Net, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bComputeFastLocalBounds : 1;                       // Mask: 0x4, PropSize: 0x10x1AC(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bComputeBoundsOnceForGame : 1;                     // Mask: 0x8, PropSize: 0x10x1AC(0x1)(Edit, BlueprintVisible, Net, Parm, ZeroConstructor, Config, EditConst, SubobjectReference)
	uint8                                        bComputedBoundsOnceForGame : 1;                    // Mask: 0x10, PropSize: 0x10x1AC(0x1)(ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsNotRenderAttachmentRoot : 1;                    // Mask: 0x20, PropSize: 0x10x1AC(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_25 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_27F[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	enum class EComponentMobility                Mobility;                                          // 0x1AE(0x1)(Parm, OutParm, ZeroConstructor, Transient, EditConst)
	enum class EDetailMode                       DetailMode;                                        // 0x1AF(0x1)(ConstParm, ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	FMulticastSparseDelegateProperty_            PhysicsVolumeChangedDelegate;                      // 0x1B0(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ZeroConstructor, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_280[0x10F];                                    // Fixing Size After Last Property  > TateDumper <
	uint8                                        bIgnoreParentTransformUpdate : 1;                  // Mask: 0x1, PropSize: 0x10x2C0(0x1)(Edit, ConstParm, ExportObject, ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUpdateChildOverlaps : 1;                          // Mask: 0x2, PropSize: 0x10x2C0(0x1)(ZeroConstructor, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_26 : 6;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_281[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        AttachmentChangedIncrementer;                      // 0x2C4(0x4)(Edit, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, Config, EditConst, GlobalConfig, SubobjectReference)

	static class UClass* StaticClass();
	static class USceneComponent* GetDefaultObj();

	bool ToggleVisibility();
	float StopSound();
	struct FVector SetWorldScale3D();
	bool SetVisibility();
	bool SetShouldUpdatePhysicsVolume();
	struct FVector SetRelativeScale3D();
	enum class EComponentMobility SetMobility();
	bool SetHiddenInGame();
	bool SetAbsolute();
	void ResetRelativeTransform();
	bool OnRep_Visibility();
	void OnRep_Transform();
	void OnRep_AttachSocketName();
	void OnRep_AttachParent();
	void OnRep_AttachChildren();
	bool K2_SetWorldTransform(struct FHitResult* SweepHitResult);
	bool K2_SetWorldRotation(struct FHitResult* SweepHitResult);
	bool K2_SetWorldLocationAndRotation(const struct FVector& NewLocation, struct FHitResult* SweepHitResult);
	bool K2_SetWorldLocation(const struct FVector& NewLocation, struct FHitResult* SweepHitResult);
	bool K2_SetRelativeTransform(struct FHitResult* SweepHitResult);
	bool K2_SetRelativeRotation(struct FHitResult* SweepHitResult);
	bool K2_SetRelativeLocationAndRotation(const struct FVector& NewLocation, struct FHitResult* SweepHitResult);
	bool K2_SetRelativeLocation(const struct FVector& NewLocation, struct FHitResult* SweepHitResult);
	void K2_GetComponentToWorld(struct FTransform* ReturnValue);
	void K2_GetComponentScale(struct FVector* ReturnValue);
	void K2_GetComponentRotation(struct FRotator* ReturnValue);
	void K2_GetComponentLocation(struct FVector* ReturnValue);
	enum class EDetachmentRule K2_DetachFromComponent(bool* bCallModify);
	enum class EAttachmentRule K2_AttachToComponent(class USceneComponent* Parent, bool* bWeldSimulatedBodies, bool* ReturnValue);
	class USceneComponent* K2_AttachTo(class FName* InSocketName, enum class EAttachLocation* AttachType, bool* bWeldSimulatedBodies, bool* ReturnValue);
	bool K2_AddWorldTransformKeepScale(struct FTransform* DeltaTransform, struct FHitResult* SweepHitResult);
	bool K2_AddWorldTransform(struct FTransform* DeltaTransform, struct FHitResult* SweepHitResult);
	bool K2_AddWorldRotation(struct FRotator* DeltaRotation, struct FHitResult* SweepHitResult);
	bool K2_AddWorldOffset(struct FHitResult* SweepHitResult);
	bool K2_AddRelativeRotation(struct FRotator* DeltaRotation, struct FHitResult* SweepHitResult);
	bool K2_AddRelativeLocation(struct FHitResult* SweepHitResult);
	bool K2_AddLocalTransform(struct FTransform* DeltaTransform, struct FHitResult* SweepHitResult);
	bool K2_AddLocalRotation(struct FRotator* DeltaRotation, struct FHitResult* SweepHitResult);
	bool K2_AddLocalOffset(struct FHitResult* SweepHitResult);
	void IsVisible(bool* ReturnValue);
	void IsSimulatingPhysics(class FName BoneName, bool* ReturnValue);
	void IsAnySimulatingPhysics(bool* ReturnValue);
	void GetUpVector(struct FVector* ReturnValue);
	void GetSocketTransform(class FName* InSocketName, enum class ERelativeTransformSpace* TransformSpace, struct FTransform* ReturnValue);
	void GetSocketRotation(class FName* InSocketName, struct FRotator* ReturnValue);
	void GetSocketQuaternion(class FName* InSocketName, struct FQuat* ReturnValue);
	void GetSocketLocation(class FName* InSocketName, struct FVector* ReturnValue);
	void GetShouldUpdatePhysicsVolume(bool* ReturnValue);
	void GetRightVector(struct FVector* ReturnValue);
	void GetRelativeTransform(struct FTransform* ReturnValue);
	void GetPhysicsVolume(class APhysicsVolume** ReturnValue);
	TArray<class USceneComponent*> GetParentComponents();
	void GetNumChildrenComponents(int32* ReturnValue);
	void GetForwardVector(struct FVector* ReturnValue);
	void GetComponentVelocity(struct FVector* ReturnValue);
	void GetChildrenComponents(bool* bIncludeAllDescendants, TArray<class USceneComponent*>* Children);
	void GetChildComponent(int32* ChildIndex, class USceneComponent** ReturnValue);
	void GetAttachSocketName(class FName* ReturnValue);
	void GetAttachParent(class USceneComponent** ReturnValue);
	void GetAllSocketNames(TArray<class FName>* ReturnValue);
	void DoesSocketExist(class FName* InSocketName, bool* ReturnValue);
	void DetachFromParent(bool* bMaintainWorldPosition, bool* bCallModify);
};

// 0x3D0 (0x698 - 0x2C8)
// Class Engine.PrimitiveComponent
class UPrimitiveComponent : public USceneComponent
{
public:
	uint8                                        Pad_3C3[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        MinDrawDistance;                                   // 0x2E0(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	float                                        LDMaxDrawDistance;                                 // 0x2E4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	float                                        CachedMaxDrawDistance;                             // 0x2E8(0x4)(Edit, ExportObject, Net, Parm, OutParm, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	enum class ESceneDepthPriorityGroup          DepthPriorityGroup;                                // 0x2EC(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	enum class ESceneDepthPriorityGroup          ViewOwnerDepthPriorityGroup;                       // 0x2ED(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	enum class EIndirectLightingCacheQuality     IndirectLightingCacheQuality;                      // 0x2EE(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	enum class ELightmapType                     LightmapType;                                      // 0x2EF(0x1)(BlueprintVisible, Net, EditFixedSize, Parm, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	enum class EHLODBatchingPolicy               HLODBatchingPolicy;                                // 0x2F0(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bEnableAutoLODGeneration : 1;                      // Mask: 0x1, PropSize: 0x10x2F1(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsActorTextureStreamingBuiltData : 1;             // Mask: 0x2, PropSize: 0x10x2F1(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsValidTextureStreamingBuiltData : 1;             // Mask: 0x4, PropSize: 0x10x2F1(0x1)(ConstParm, ExportObject, EditFixedSize, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bNeverDistanceCull : 1;                            // Mask: 0x8, PropSize: 0x10x2F1(0x1)(EditFixedSize, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_35 : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        BitPad_36 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bAlwaysCreatePhysicsState : 1;                     // Mask: 0x2, PropSize: 0x10x2F2(0x1)(ConstParm, BlueprintReadOnly, Net, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bGenerateOverlapEvents : 1;                        // Mask: 0x4, PropSize: 0x10x2F2(0x1)(ConstParm, BlueprintVisible, Net, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bMultiBodyOverlap : 1;                             // Mask: 0x8, PropSize: 0x10x2F2(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bTraceComplexOnMove : 1;                           // Mask: 0x10, PropSize: 0x10x2F2(0x1)(Edit, BlueprintReadOnly, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bReturnMaterialOnMove : 1;                         // Mask: 0x20, PropSize: 0x10x2F2(0x1)(Edit, BlueprintVisible, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseViewOwnerDepthPriorityGroup : 1;               // Mask: 0x40, PropSize: 0x10x2F2(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAllowCullDistanceVolume : 1;                      // Mask: 0x80, PropSize: 0x10x2F2(0x1)(Edit, ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bVisibleInReflectionCaptures : 1;                  // Mask: 0x1, PropSize: 0x10x2F3(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bVisibleInRealTimeSkyCaptures : 1;                 // Mask: 0x2, PropSize: 0x10x2F3(0x1)(ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bVisibleInRayTracing : 1;                          // Mask: 0x4, PropSize: 0x10x2F3(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bRenderInMainPass : 1;                             // Mask: 0x8, PropSize: 0x10x2F3(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bRenderInDepthPass : 1;                            // Mask: 0x10, PropSize: 0x10x2F3(0x1)(Edit, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bReceivesDecals : 1;                               // Mask: 0x20, PropSize: 0x10x2F3(0x1)(Net, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bHoldout : 1;                                      // Mask: 0x40, PropSize: 0x10x2F3(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOwnerNoSee : 1;                                   // Mask: 0x80, PropSize: 0x10x2F3(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bOnlyOwnerSee : 1;                                 // Mask: 0x1, PropSize: 0x10x2F4(0x1)(BlueprintVisible, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bTreatAsBackgroundForOcclusion : 1;                // Mask: 0x2, PropSize: 0x10x2F4(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseAsOccluder : 1;                                // Mask: 0x4, PropSize: 0x10x2F4(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bSelectable : 1;                                   // Mask: 0x8, PropSize: 0x10x2F4(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bForceMipStreaming : 1;                            // Mask: 0x10, PropSize: 0x10x2F4(0x1)(Edit, ConstParm, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bHasPerInstanceHitProxies : 1;                     // Mask: 0x20, PropSize: 0x10x2F4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        CastShadow : 1;                                    // Mask: 0x40, PropSize: 0x10x2F4(0x1)(Edit, ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, Transient, Config, EditConst)
	uint8                                        bEmissiveLightSource : 1;                          // Mask: 0x80, PropSize: 0x10x2F4(0x1)(ConstParm, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAffectDynamicIndirectLighting : 1;                // Mask: 0x1, PropSize: 0x10x2F5(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAffectIndirectLightingWhileHidden : 1;            // Mask: 0x2, PropSize: 0x10x2F5(0x1)(ExportObject, Net, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bAffectDistanceFieldLighting : 1;                  // Mask: 0x4, PropSize: 0x10x2F5(0x1)(Edit, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCastDynamicShadow : 1;                            // Mask: 0x8, PropSize: 0x10x2F5(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCastStaticShadow : 1;                             // Mask: 0x10, PropSize: 0x10x2F5(0x1)(Edit, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_37 : 3;                                     // Fixing Bit-Field Size  > TateDumper <
	enum class EShadowCacheInvalidationBehavior  ShadowCacheInvalidationBehavior;                   // 0x2F6(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCastVolumetricTranslucentShadow : 1;              // Mask: 0x1, PropSize: 0x10x2F7(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCastContactShadow : 1;                            // Mask: 0x2, PropSize: 0x10x2F7(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bSelfShadowOnly : 1;                               // Mask: 0x4, PropSize: 0x10x2F7(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCastFarShadow : 1;                                // Mask: 0x8, PropSize: 0x10x2F7(0x1)(BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCastInsetShadow : 1;                              // Mask: 0x10, PropSize: 0x10x2F7(0x1)(Edit, ConstParm, Net, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCastCinematicShadow : 1;                          // Mask: 0x20, PropSize: 0x10x2F7(0x1)(ExportObject, BlueprintReadOnly, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCastHiddenShadow : 1;                             // Mask: 0x40, PropSize: 0x10x2F7(0x1)(ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bCastShadowAsTwoSided : 1;                         // Mask: 0x80, PropSize: 0x10x2F7(0x1)(ConstParm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bLightAsIfStatic : 1;                              // Mask: 0x1, PropSize: 0x10x2F8(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bLightAttachmentsAsGroup : 1;                      // Mask: 0x2, PropSize: 0x10x2F8(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bExcludeFromLightAttachmentGroup : 1;              // Mask: 0x4, PropSize: 0x10x2F8(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bReceiveMobileCSMShadows : 1;                      // Mask: 0x8, PropSize: 0x10x2F8(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bSingleSampleShadowFromStationaryLights : 1;       // Mask: 0x10, PropSize: 0x10x2F8(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIgnoreRadialImpulse : 1;                          // Mask: 0x20, PropSize: 0x10x2F8(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIgnoreRadialForce : 1;                            // Mask: 0x40, PropSize: 0x10x2F8(0x1)(BlueprintVisible, Net, Parm, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bApplyImpulseOnDamage : 1;                         // Mask: 0x80, PropSize: 0x10x2F8(0x1)(ExportObject, BlueprintReadOnly, Parm, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bReplicatePhysicsToAutonomousProxy : 1;            // Mask: 0x1, PropSize: 0x10x2F9(0x1)(ConstParm, BlueprintVisible, Parm, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bFillCollisionUnderneathForNavmesh : 1;            // Mask: 0x2, PropSize: 0x10x2F9(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        AlwaysLoadOnClient : 1;                            // Mask: 0x4, PropSize: 0x10x2F9(0x1)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        AlwaysLoadOnServer : 1;                            // Mask: 0x8, PropSize: 0x10x2F9(0x1)(Net, EditFixedSize, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseEditorCompositing : 1;                         // Mask: 0x10, PropSize: 0x10x2F9(0x1)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsBeingMovedByEditor : 1;                         // Mask: 0x20, PropSize: 0x10x2F9(0x1)(ExportObject, EditFixedSize, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bRenderCustomDepth : 1;                            // Mask: 0x40, PropSize: 0x10x2F9(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bVisibleInSceneCaptureOnly : 1;                    // Mask: 0x80, PropSize: 0x10x2F9(0x1)(BlueprintReadOnly, Net, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bHiddenInSceneCapture : 1;                         // Mask: 0x1, PropSize: 0x10x2FA(0x1)(BlueprintVisible, Net, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bRayTracingFarField : 1;                           // Mask: 0x2, PropSize: 0x10x2FA(0x1)(Edit, ExportObject, BlueprintReadOnly, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_38 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bHasNoStreamableTextures : 1;                      // Mask: 0x8, PropSize: 0x10x2FA(0x1)(BlueprintVisible, ExportObject, OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bStaticWhenNotMoveable : 1;                        // Mask: 0x10, PropSize: 0x10x2FA(0x1)(OutParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_39 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bIgnoreUpdatingOwnersLastRenderTime : 1;           // Mask: 0x80, PropSize: 0x10x2FA(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3DB[0x1D];                                     // Fixing Size After Last Property  > TateDumper <
	enum class EHasCustomNavigableGeometry       bHasCustomNavigableGeometry;                       // 0x318(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3DD[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	enum class ECanBeCharacterBase               CanCharacterStepUpOn;                              // 0x31A(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, Config, EditConst, SubobjectReference)
	struct FLightingChannels                     LightingChannels;                                  // 0x31B(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, EditConst)
	int32                                        RayTracingGroupId;                                 // 0x31C(0x4)(ConstParm, BlueprintVisible, Net, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	int32                                        VisibilityId;                                      // 0x320(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	int32                                        CustomDepthStencilValue;                           // 0x324(0x4)(ConstParm, BlueprintReadOnly, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	struct FCustomPrimitiveData                  CustomPrimitiveData;                               // 0x328(0x10)(Edit, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst)
	struct FCustomPrimitiveData                  CustomPrimitiveDataInternal;                       // 0x338(0x10)(Edit, ConstParm, ReturnParm, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3DE[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        TranslucencySortPriority;                          // 0x350(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, GlobalConfig, SubobjectReference)
	float                                        TranslucencySortDistanceOffset;                    // 0x354(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, GlobalConfig, SubobjectReference)
	TArray<class URuntimeVirtualTexture*>        RuntimeVirtualTextures;                            // 0x358(0x10)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, GlobalConfig, SubobjectReference)
	int8                                         VirtualTextureLodBias;                             // 0x368(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, GlobalConfig, SubobjectReference)
	int8                                         VirtualTextureCullMips;                            // 0x369(0x1)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, EditConst, GlobalConfig, SubobjectReference)
	int8                                         VirtualTextureMinCoverage;                         // 0x36A(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, EditConst, GlobalConfig, SubobjectReference)
	enum class ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType;                      // 0x36B(0x1)(BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3DF[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        BoundsScale;                                       // 0x37C(0x4)(Edit, BlueprintVisible, ExportObject, OutParm, ZeroConstructor, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3E0[0x20];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class AActor*>                        MoveIgnoreActors;                                  // 0x3A0(0x10)(BlueprintVisible, OutParm, ZeroConstructor, EditConst, GlobalConfig, SubobjectReference)
	TArray<class UPrimitiveComponent*>           MoveIgnoreComponents;                              // 0x3B0(0x10)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3E1[0x60];                                     // Fixing Size After Last Property  > TateDumper <
	struct FBodyInstance                         BodyInstance;                                      // 0x420(0x150)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, EditConst)
	FMulticastSparseDelegateProperty_            OnComponentHit;                                    // 0x570(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnComponentBeginOverlap;                           // 0x571(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnComponentEndOverlap;                             // 0x572(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnComponentWake;                                   // 0x573(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnComponentSleep;                                  // 0x574(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_3E3[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastSparseDelegateProperty_            OnComponentPhysicsStateChanged;                    // 0x576(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, Transient, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnBeginCursorOver;                                 // 0x577(0x1)(BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnEndCursorOver;                                   // 0x578(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnClicked;                                         // 0x579(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnReleased;                                        // 0x57A(0x1)(ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchBegin;                                 // 0x57B(0x1)(Edit, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchEnd;                                   // 0x57C(0x1)(ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchEnter;                                 // 0x57D(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastSparseDelegateProperty_            OnInputTouchLeave;                                 // 0x57E(0x1)(Edit, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	enum class ERayTracingGroupCullingPriority   RayTracingGroupCullingPriority;                    // 0x57F(0x1)(BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	enum class ERendererStencilMask              CustomDepthStencilWriteMask;                       // 0x580(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3E7[0x1F];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        ExcludeFromHLODLevels;                             // 0x5A0(0x1)(Edit, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3E8[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	class UPrimitiveComponent*                   LODParentPrimitive;                                // 0x5A8(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bForcePreventBlockingProjectiles : 1;              // Mask: 0x1, PropSize: 0x10x5B0(0x1)(ConstParm, BlueprintVisible, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bForceOverlapEvents : 1;                           // Mask: 0x2, PropSize: 0x10x5B0(0x1)(Edit, ConstParm, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIsInForeground : 1;                               // Mask: 0x4, PropSize: 0x10x5B0(0x1)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseInternalOctree : 1;                            // Mask: 0x8, PropSize: 0x10x5B0(0x1)(BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseInternalOctreeOnClient : 1;                    // Mask: 0x10, PropSize: 0x10x5B0(0x1)(ConstParm, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3A : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bForceDynamicPhysics : 1;                          // Mask: 0x40, PropSize: 0x10x5B0(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventCharacterBasing : 1;                       // Mask: 0x80, PropSize: 0x10x5B0(0x1)(ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3B : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bIsAbstractBasingComponent : 1;                    // Mask: 0x2, PropSize: 0x10x5B1(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bClimbable : 1;                                    // Mask: 0x4, PropSize: 0x10x5B1(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bUseAbsoluteMaxDrawDisatance : 1;                  // Mask: 0x8, PropSize: 0x10x5B1(0x1)(Edit, ConstParm, BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bMovableUseDynamicDrawDistance : 1;                // Mask: 0x10, PropSize: 0x10x5B1(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIncludeBoundsRadiusInDrawDistances : 1;           // Mask: 0x20, PropSize: 0x10x5B1(0x1)(BlueprintVisible, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bExcludeFromLevelBounds : 1;                       // Mask: 0x40, PropSize: 0x10x5B1(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bIgnoredByCharacterEncroachment : 1;               // Mask: 0x80, PropSize: 0x10x5B1(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        bPreventDamage : 1;                                // Mask: 0x1, PropSize: 0x10x5B2(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_3C : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_3F2[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        ObjectLayer;                                       // 0x5B4(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	float                                        OverrideStepHeight;                                // 0x5B8(0x4)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3F4[0x98];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        InternalOctreeMask;                                // 0x654(0x4)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3F5[0x1C];                                     // Fixing Size After Last Property  > TateDumper <
	uint32                                       ProxyMeshID;                                       // 0x674(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	bool                                         bIsProxyMeshParent;                                // 0x678(0x1)(ConstParm, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, Config, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_3F7[0x1F];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UPrimitiveComponent* GetDefaultObj();

	void WasRecentlyVisible(bool* ReturnValue);
	float WasRecentlyRendered(bool* ReturnValue);
	void WakeRigidBody(class FName BoneName);
	void WakeAllRigidBodies();
	struct FWalkableSlopeOverride SetWalkableSlopeOverride();
	bool SetVisibleInSceneCaptureOnly();
	bool SetVisibleInRayTracing();
	class FName SetVectorParameterForDefaultCustomPrimitiveData(const struct FVector4& Value);
	class FName SetVectorParameterForCustomPrimitiveData(const struct FVector4& Value);
	void SetUseCCD(bool* InUseCCD, class FName BoneName);
	int32 SetTranslucentSortPriority();
	float SetTranslucencySortDistanceOffset();
	bool SetStaticWhenNotMoveable();
	bool SetSingleSampleShadowFromStationaryLights();
	bool SetSimulatePhysics();
	class FName SetScalarParameterForDefaultCustomPrimitiveData(float Value);
	class FName SetScalarParameterForCustomPrimitiveData(float Value);
	bool SetRenderInMainPass();
	bool SetRenderInDepthPass();
	bool SetRenderCustomDepth();
	bool SetReceivesDecals();
	class UPhysicalMaterial* SetPhysMaterialOverride();
	float SetPhysicsMaxAngularVelocityInRadians(bool* bAddToCurrent, class FName BoneName);
	float SetPhysicsMaxAngularVelocityInDegrees(bool* bAddToCurrent, class FName BoneName);
	void SetPhysicsLinearVelocity(struct FVector* NewVel, bool* bAddToCurrent, class FName BoneName);
	void SetPhysicsAngularVelocityInRadians(struct FVector* NewAngVel, bool* bAddToCurrent, class FName BoneName);
	void SetPhysicsAngularVelocityInDegrees(struct FVector* NewAngVel, bool* bAddToCurrent, class FName BoneName);
	bool SetOwnerNoSee();
	bool SetOnlyOwnerSee();
	bool SetNotifyRigidBodyCollision();
	class UMaterialInterface* SetMaterialByName();
	class UMaterialInterface* SetMaterial(int32 ElementIndex);
	void SetMassScale(class FName BoneName, float* InMassScale);
	bool SetMassOverrideInKg(class FName BoneName, float MassInKg);
	void SetLinearDamping(float* InDamping);
	bool SetLightingChannels();
	bool SetLightAttachmentsAsGroup();
	bool SetInternalOctreeMask();
	bool SetHoldout();
	bool SetHiddenInSceneCapture();
	bool SetGenerateOverlapEvents();
	bool SetExcludeFromLightAttachmentGroup();
	TArray<int32> SetExcludeForSpecificHLODLevels();
	bool SetExcludedFromHLODLevel(enum class EHLODLevelExclusion HLODLevel);
	bool SetEnableGravity();
	bool SetEmissiveLightSource();
	int32 SetDefaultCustomPrimitiveDataVector4(const struct FVector4& Value);
	int32 SetDefaultCustomPrimitiveDataVector3(const struct FVector& Value);
	int32 SetDefaultCustomPrimitiveDataVector2(const struct FVector2D& Value);
	int32 SetDefaultCustomPrimitiveDataFloat(float Value);
	int32 SetCustomPrimitiveDataVector4(const struct FVector4& Value);
	int32 SetCustomPrimitiveDataVector3(const struct FVector& Value);
	int32 SetCustomPrimitiveDataVector2(const struct FVector2D& Value);
	int32 SetCustomPrimitiveDataFloat(float Value);
	enum class ERendererStencilMask SetCustomDepthStencilWriteMask();
	void SetCustomDepthStencilValue(int32 Value);
	float SetCullDistance();
	void SetConstraintMode(enum class EDOFMode* ConstraintMode);
	enum class ECollisionChannel SetCollisionResponseToChannel(enum class ECollisionResponse* NewResponse);
	void SetCollisionResponseToAllChannels(enum class ECollisionResponse* NewResponse);
	void SetCollisionResponseSet(struct FCollisionResponseSet* Responses);
	void SetCollisionProfileName(class FName* InCollisionProfileName, bool* bUpdateOverlaps);
	enum class ECollisionChannel SetCollisionObjectType();
	void SetCollisionEnabled(enum class ECollisionEnabled* NewType);
	void SetCenterOfMass(struct FVector* CenterOfMassOffset, class FName BoneName);
	void SetCastShadow(bool* NewCastShadow);
	void SetCastInsetShadow(bool* bInCastInsetShadow);
	void SetCastHiddenShadow(bool* NewCastHiddenShadow);
	void SetCastContactShadow(bool* bInCastContactShadow);
	void SetBoundsScale(float* NewBoundsScale);
	void SetAngularDamping(float* InDamping);
	void SetAllUseCCD(bool* InUseCCD);
	void SetAllPhysicsLinearVelocity(struct FVector* NewVel, bool* bAddToCurrent);
	void SetAllPhysicsAngularVelocityInRadians(struct FVector* NewAngVel, bool* bAddToCurrent);
	void SetAllPhysicsAngularVelocityInDegrees(struct FVector* NewAngVel, bool* bAddToCurrent);
	void SetAllMassScale(float* InMassScale);
	void SetAffectIndirectLightingWhileHidden(bool* bNewAffectIndirectLightingWhileHidden);
	void SetAffectDynamicIndirectLighting(bool* bNewAffectDynamicIndirectLighting);
	void SetAffectDistanceFieldLighting(bool* NewAffectDistanceFieldLighting);
	void ScaleByMomentOfInertia(struct FVector* InputVector, class FName BoneName, struct FVector* ReturnValue);
	void PutRigidBodyToSleep(class FName BoneName);
	struct FHitResult K2_SphereTraceComponent(const struct FVector& TraceStart, const struct FVector& TraceEnd, float SphereRadius, bool bShowTrace, bool bPersistentShowTrace, struct FVector* HitLocation, const struct FVector& HitNormal, class FName BoneName, bool* ReturnValue);
	struct FHitResult K2_SphereOverlapComponent(const struct FVector& InSphereCentre, float InSphereRadius, bool bShowTrace, bool bPersistentShowTrace, struct FVector* HitLocation, const struct FVector& HitNormal, class FName BoneName, bool* ReturnValue);
	struct FHitResult K2_LineTraceComponent(const struct FVector& TraceStart, const struct FVector& TraceEnd, bool bShowTrace, bool bPersistentShowTrace, struct FVector* HitLocation, const struct FVector& HitNormal, class FName BoneName, bool* ReturnValue);
	void K2_IsQueryCollisionEnabled(bool* ReturnValue);
	void K2_IsPhysicsCollisionEnabled(bool* ReturnValue);
	void K2_IsCollisionEnabled(bool* ReturnValue);
	struct FHitResult K2_BoxOverlapComponent(const struct FVector& InBoxCentre, const struct FBox& InBox, bool bShowTrace, bool bPersistentShowTrace, struct FVector* HitLocation, const struct FVector& HitNormal, class FName BoneName, bool* ReturnValue);
	class UPrimitiveComponent* IsOverlappingComponent(bool* ReturnValue);
	void IsOverlappingActor(class AActor** Other, bool* ReturnValue);
	void IsGravityEnabled(bool* ReturnValue);
	void IsExcludedFromHLODLevel(enum class EHLODLevelExclusion HLODLevel, bool* ReturnValue);
	void IsAnyRigidBodyAwake(bool* ReturnValue);
	void InvalidateLumenSurfaceCache();
	void IgnoreComponentWhenMoving(class UPrimitiveComponent** Component, bool bShouldIgnore);
	void IgnoreActorWhenMoving(class AActor** Actor, bool bShouldIgnore);
	void GetWalkableSlopeOverride(struct FWalkableSlopeOverride* ReturnValue);
	void GetStaticWhenNotMoveable(bool* ReturnValue);
	struct FVector GetPhysicsLinearVelocityAtPoint(class FName BoneName, struct FVector* ReturnValue);
	void GetPhysicsLinearVelocity(class FName BoneName, struct FVector* ReturnValue);
	void GetPhysicsAngularVelocityInRadians(class FName BoneName, struct FVector* ReturnValue);
	void GetPhysicsAngularVelocityInDegrees(class FName BoneName, struct FVector* ReturnValue);
	TArray<class UPrimitiveComponent*> GetOverlappingComponents();
	void GetOverlappingActors(const TArray<class AActor*>& OverlappingActors, class UClass** ClassFilter);
	void GetNumMaterials(int32* ReturnValue);
	void GetMaterialFromCollisionFaceIndex(int32 FaceIndex, int32* SectionIndex, class UMaterialInterface** ReturnValue);
	void GetMaterial(int32 ElementIndex, class UMaterialInterface** ReturnValue);
	void GetMassScale(class FName BoneName, float* ReturnValue);
	void GetMass(float* ReturnValue);
	void GetLinearDamping(float* ReturnValue);
	void GetInertiaTensor(class FName BoneName, struct FVector* ReturnValue);
	void GetGenerateOverlapEvents(bool* ReturnValue);
	void GetExcludeForSpecificHLODLevels(TArray<int32>* ReturnValue);
	class FName GetCustomPrimitiveDataIndexForVectorParameter(int32* ReturnValue);
	class FName GetCustomPrimitiveDataIndexForScalarParameter(int32* ReturnValue);
	enum class ECollisionChannel GetCollisionResponseToChannel(enum class ECollisionResponse* ReturnValue);
	void GetCollisionResponseSet(struct FCollisionResponseSet* OutResponses);
	void GetCollisionProfileName(class FName* ReturnValue);
	void GetCollisionObjectType(enum class ECollisionChannel* ReturnValue);
	void GetCollisionEnabled(enum class ECollisionEnabled* ReturnValue);
	struct FVector GetClosestPointOnCollision(class FName BoneName, float* ReturnValue);
	void GetCenterOfMass(class FName BoneName, struct FVector* ReturnValue);
	int32 GetBodyInstanceAsyncPhysicsTickHandle(class FName BoneName, struct FBodyInstanceAsyncPhysicsTickHandle* ReturnValue);
	void GetAngularDamping(float* ReturnValue);
	class FName CreateDynamicMaterialInstance(int32 ElementIndex, class UMaterialInstanceDynamic** ReturnValue);
	void CreateAndSetMaterialInstanceDynamicFromMaterial(int32 ElementIndex, class UMaterialInterface* Parent, class UMaterialInstanceDynamic** ReturnValue);
	void CreateAndSetMaterialInstanceDynamic(int32 ElementIndex, class UMaterialInstanceDynamic** ReturnValue);
	void CopyArrayOfMoveIgnoreComponents(TArray<class UPrimitiveComponent*>* ReturnValue);
	void CopyArrayOfMoveIgnoreActors(TArray<class AActor*>* ReturnValue);
	void ClearMoveIgnoreComponents();
	void ClearMoveIgnoreActors();
	void CanCharacterStepUp(class APawn* Pawn, bool* ReturnValue);
	struct FVector AddVelocityChangeImpulseAtLocation(struct FVector* Location, class FName BoneName);
	bool AddTorqueInRadians(class FName BoneName);
	bool AddTorqueInDegrees(class FName BoneName);
	bool AddRadialImpulse(float Radius);
	bool AddRadialForce(float Radius);
	struct FVector AddImpulseAtLocation(struct FVector* Location, class FName BoneName);
	bool AddImpulse(class FName BoneName);
	struct FVector AddForceAtLocationLocal(struct FVector* Location, class FName BoneName);
	struct FVector AddForceAtLocation(struct FVector* Location, class FName BoneName);
	bool AddForce(class FName BoneName);
	bool AddAngularImpulseInRadians(class FName BoneName);
	bool AddAngularImpulseInDegrees(class FName BoneName);
};

// 0x0 (0x698 - 0x698)
// Class Engine.FXSystemComponent
class UFXSystemComponent : public UPrimitiveComponent
{
public:

	static class UClass* StaticClass();
	static class UFXSystemComponent* GetDefaultObj();

	struct FVector SetVectorParameter();
	void SetUseAutoManageAttachment(bool* bAutoManage);
	int32 SetIntParameter();
	float SetFloatParameter();
	class FName SetEmitterEnable(bool* bNewEnableState);
	struct FLinearColor SetColorParameter();
	bool SetBoolParameter();
	enum class EAttachmentRule SetAutoAttachmentParameters(class USceneComponent* Parent);
	class AActor* SetActorParameter();
	void ReleaseToPool();
	void GetFXSystemAsset(class UFXSystemAsset** ReturnValue);
};

// 0x8 (0x30 - 0x28)
// Class Engine.BlueprintAsyncActionBase
class UBlueprintAsyncActionBase : public UObject
{
public:
	uint8                                        Pad_42F[0x8];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UBlueprintAsyncActionBase* GetDefaultObj();

	void Activate();
};

// 0x48 (0x70 - 0x28)
// Class Engine.FXSystemAsset
class UFXSystemAsset : public UObject
{
public:
	uint32                                       MaxPoolSize;                                       // 0x28(0x4)(Edit, ConstParm, BlueprintVisible, Net, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint32                                       PoolPrimeSize;                                     // 0x2C(0x4)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_430[0x40];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UFXSystemAsset* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class Engine.AnimNotifyState
class UAnimNotifyState : public UObject
{
public:
	uint8                                        Pad_43F[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	bool                                         bIgnoreOnDediServer;                               // 0x29(0x1)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bCanClobberEventReference;                         // 0x2A(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_440[0x5];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimNotifyState* GetDefaultObj();

	void Received_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime, const struct FAnimNotifyEventReference& EventReference, bool* ReturnValue);
	void Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference, bool* ReturnValue);
	void Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration, const struct FAnimNotifyEventReference& EventReference, bool* ReturnValue);
	void GetNotifyName(class FString* ReturnValue);
	void GetDefaultTriggerWeightThreshold(float* ReturnValue);
};

// 0x18 (0x40 - 0x28)
// Class Engine.AnimNotify
class UAnimNotify : public UObject
{
public:
	uint8                                        Pad_446[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	bool                                         bIgnoreOnDediServer;                               // 0x38(0x1)(BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bCanClobberEventReference;                         // 0x39(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_447[0x6];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimNotify* GetDefaultObj();

	void Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference, bool* ReturnValue);
	void GetNotifyName(class FString* ReturnValue);
	void GetDefaultTriggerWeightThreshold(float* ReturnValue);
};

// 0x0 (0x4C8 - 0x4C8)
// Class Engine.TrueSkyActorParent
class ATrueSkyActorParent : public AActor
{
public:

	static class UClass* StaticClass();
	static class ATrueSkyActorParent* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class Engine.Subsystem
class USubsystem : public UObject
{
public:
	uint8                                        Pad_44A[0x8];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class USubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.DynamicSubsystem
class UDynamicSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass();
	static class UDynamicSubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.EngineSubsystem
class UEngineSubsystem : public UDynamicSubsystem
{
public:

	static class UClass* StaticClass();
	static class UEngineSubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.OnlineBlueprintCallProxyBase
class UOnlineBlueprintCallProxyBase : public UBlueprintAsyncActionBase
{
public:

	static class UClass* StaticClass();
	static class UOnlineBlueprintCallProxyBase* GetDefaultObj();

};

// 0x28 (0x50 - 0x28)
// Class Engine.Player
class UPlayer : public UObject
{
public:
	uint8                                        Pad_44B[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	class APlayerController*                     PlayerController;                                  // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, GlobalConfig)
	int32                                        CurrentNetSpeed;                                   // 0x38(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        ConfiguredInternetSpeed;                           // 0x3C(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	int32                                        ConfiguredLanSpeed;                                // 0x40(0x4)(ConstParm, BlueprintVisible, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	uint8                                        Pad_44C[0xC];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UPlayer* GetDefaultObj();

};

// 0x1D98 (0x1DE8 - 0x50)
// Class Engine.NetConnection
class UNetConnection : public UPlayer
{
public:
	TArray<class UChildConnection*>              Children;                                          // 0x50(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Config, DisableEditOnInstance)
	class UNetDriver*                            Driver;                                            // 0x60(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                PackageMapClass;                                   // 0x68(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UPackageMap*                           PackageMap;                                        // 0x70(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, Transient, Config, GlobalConfig)
	TArray<class UChannel*>                      OpenChannels;                                      // 0x78(0x10)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class AActor*>                        SentTemporaries;                                   // 0x88(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class AActor*                                ViewTarget;                                        // 0x98(0x8)(ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, Config, InstancedReference, SubobjectReference)
	class AActor*                                OwningActor;                                       // 0xA0(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxPacket;                                         // 0xA8(0x4)(BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        InternalAck : 1;                                   // Mask: 0x1, PropSize: 0x10xAC(0x1)(Edit, ExportObject, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_40 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_44E[0xBB];                                     // Fixing Size After Last Property  > TateDumper <
	struct FUniqueNetIdRepl                      PlayerID;                                          // 0x168(0x30)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        Pad_44F[0x48];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LastReceiveTime;                                   // 0x1E0(0x8)(Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_450[0x11E0];                                   // Fixing Size After Last Property  > TateDumper <
	int32                                        DefaultMaxChannelSize;                             // 0x13C8(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_451[0x304];                                    // Fixing Size After Last Property  > TateDumper <
	TArray<class UChannel*>                      ChannelsToTick;                                    // 0x16D0(0x10)(BlueprintVisible, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_453[0x700];                                    // Fixing Size After Last Property  > TateDumper <
	uint8                                        bHasArkLoginLock : 1;                              // Mask: 0x1, PropSize: 0x10x1DE0(0x1)(Edit, ConstParm, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_454[0x7];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UNetConnection* GetDefaultObj();

};

// 0x768 (0x790 - 0x28)
// Class Engine.NetDriver
class UNetDriver : public UObject
{
public:
	uint8                                        Pad_455[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	class FString                                NetConnectionClassName;                            // 0x30(0x10)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	class FString                                ReplicationDriverClassName;                        // 0x40(0x10)(BlueprintVisible, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class FString                                ReplicationBridgeClassName;                        // 0x50(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaxDownloadSize;                                   // 0x60(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bClampListenServerTickRate : 1;                    // Mask: 0x1, PropSize: 0x10x64(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_41 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_458[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        NetServerMaxTickRate;                              // 0x68(0x4)(BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	int32                                        MaxNetTickRate;                                    // 0x6C(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	int32                                        MaxInternetClientRate;                             // 0x70(0x4)(ConstParm, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	int32                                        MaxClientRate;                                     // 0x74(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	float                                        ServerTravelPause;                                 // 0x78(0x4)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	float                                        SpawnPrioritySeconds;                              // 0x7C(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	float                                        RelevantTimeout;                                   // 0x80(0x4)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	float                                        KeepAliveTime;                                     // 0x84(0x4)(ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	float                                        InitialConnectTimeout;                             // 0x88(0x4)(Edit, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	float                                        ConnectionTimeout;                                 // 0x8C(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	float                                        TimeoutMultiplierForUnoptimizedBuilds;             // 0x90(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	uint8                                        Pad_45B[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	class UNetConnection*                        ServerConnection;                                  // 0x98(0x8)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class UNetConnection*>                ClientConnections;                                 // 0xA0(0x10)(BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_45C[0x60];                                     // Fixing Size After Last Property  > TateDumper <
	int32                                        RecentlyDisconnectedTrackingTime;                  // 0x110(0x4)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	uint8                                        Pad_45D[0x3C];                                     // Fixing Size After Last Property  > TateDumper <
	class UWorld*                                World;                                             // 0x150(0x8)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	class UPackage*                              WorldPackage;                                      // 0x158(0x8)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_45E[0x20];                                     // Fixing Size After Last Property  > TateDumper <
	class UClass*                                NetConnectionClass;                                // 0x180(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                ReplicationDriverClass;                            // 0x188(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                ReplicationBridgeClass;                            // 0x190(0x8)(Edit, ConstParm, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_45F[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	class FName                                  NetDriverName;                                     // 0x1A8(0x8)(Edit, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FChannelDefinition>            ChannelDefinitions;                                // 0x1B0(0x10)(BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, GlobalConfig)
	TMap<class FName, struct FChannelDefinition> ChannelDefinitionMap;                              // 0x1C0(0x50)(Edit, ConstParm, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<class UChannel*>                      ActorChannelPool;                                  // 0x210(0x10)(ConstParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_460[0x21];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        BitPad_42 : 6;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bNoTimeouts : 1;                                   // Mask: 0x40, PropSize: 0x10x241(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bNeverApplyNetworkEmulationSettings : 1;           // Mask: 0x80, PropSize: 0x10x241(0x1)(ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_461[0x4DE];                                    // Fixing Size After Last Property  > TateDumper <
	class UReplicationDriver*                    ReplicationDriver;                                 // 0x720(0x8)(OutParm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst)
	uint8                                        Pad_462[0x68];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UNetDriver* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.OnlineEngineInterface
class UOnlineEngineInterface : public UObject
{
public:

	static class UClass* StaticClass();
	static class UOnlineEngineInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.OnlineSession
class UOnlineSession : public UObject
{
public:

	static class UClass* StaticClass();
	static class UOnlineSession* GetDefaultObj();

};

// 0x40 (0x6D8 - 0x698)
// Class Engine.MeshComponent
class UMeshComponent : public UPrimitiveComponent
{
public:
	TArray<class UMaterialInterface*>            OverrideMaterials;                                 // 0x698(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, SubobjectReference)
	class UMaterialInterface*                    OverlayMaterial;                                   // 0x6A8(0x8)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	float                                        OverlayMaterialMaxDrawDistance;                    // 0x6B0(0x4)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_474[0x14];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        bEnableMaterialParameterCaching : 1;               // Mask: 0x1, PropSize: 0x10x6C8(0x1)(Edit, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        BitPad_43 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_475[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	class UClass*                                DamageFXActorToSpawn;                              // 0x6D0(0x8)(ConstParm, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, GlobalConfig, SubobjectReference)

	static class UClass* StaticClass();
	static class UMeshComponent* GetDefaultObj();

	class FName SetVectorParameterValueOnMaterials(const struct FVector& ParameterValue);
	class FName SetScalarParameterValueOnMaterials(float ParameterValue);
	void SetOverlayMaterialMaxDrawDistance(float InMaxDrawDistance);
	void SetOverlayMaterial(class UMaterialInterface* NewOverlayMaterial);
	void PrestreamTextures(float Seconds, bool* bPrioritizeCharacterTextures, int32* CinematicTextureGroups);
	void MulticastShowInstance(int32* OriginalIndex);
	void MulticastHideInstance(int32* OriginalIndex, struct FVector* HitDirection, float* Damage, float* TotalHealth, bool* bCheckHideAttachedDecals);
	class FName IsMaterialSlotNameValid(bool* ReturnValue);
	void GetOverlayMaterial(class UMaterialInterface** ReturnValue);
	void GetMaterialSlotNames(TArray<class FName>* ReturnValue);
	void GetMaterials(TArray<class UMaterialInterface*>* ReturnValue);
	class FName GetMaterialIndex(int32* ReturnValue);
};

// 0x88 (0xB0 - 0x28)
// Class Engine.MaterialExpression
class UMaterialExpression : public UObject
{
public:
	int32                                        MaterialExpressionEditorX;                         // 0x28(0x4)(ExportObject, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	int32                                        MaterialExpressionEditorY;                         // 0x2C(0x4)(ConstParm, ExportObject, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UEdGraphNode*                          GraphNode;                                         // 0x30(0x8)(BlueprintVisible, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UMaterialExpression*                   SubgraphExpression;                                // 0x38(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_479[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	struct FGuid                                 MaterialExpressionGuid;                            // 0x50(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UMaterial*                             Material;                                          // 0x60(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, Config, DisableEditOnInstance)
	class UMaterialFunction*                     Function;                                          // 0x68(0x8)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor)
	class FString                                Desc;                                              // 0x70(0x10)(Edit, ConstParm, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, InstancedReference, SubobjectReference)
	uint8                                        Pad_47C[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bRealtimePreview : 1;                              // Mask: 0x1, PropSize: 0x10x84(0x1)(Edit, BlueprintVisible, Net, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bNeedToUpdatePreview : 1;                          // Mask: 0x2, PropSize: 0x10x84(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_45 : 6;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_47D[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bIsParameterExpression : 1;                        // Mask: 0x1, PropSize: 0x10x88(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        BitPad_46 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_47E[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bCommentBubbleVisible : 1;                         // Mask: 0x1, PropSize: 0x10x8C(0x1)(ConstParm, EditFixedSize, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bShowOutputNameOnPin : 1;                          // Mask: 0x2, PropSize: 0x10x8C(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bShowMaskColorsOnPin : 1;                          // Mask: 0x4, PropSize: 0x10x8C(0x1)(BlueprintVisible, ExportObject, Net, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bHidePreviewWindow : 1;                            // Mask: 0x8, PropSize: 0x10x8C(0x1)(ConstParm, Net, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bCollapsed : 1;                                    // Mask: 0x10, PropSize: 0x10x8C(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bShaderInputData : 1;                              // Mask: 0x20, PropSize: 0x10x8C(0x1)(Edit, ConstParm, BlueprintReadOnly, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bShowInputs : 1;                                   // Mask: 0x40, PropSize: 0x10x8C(0x1)(BlueprintVisible, ExportObject, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bShowOutputs : 1;                                  // Mask: 0x80, PropSize: 0x10x8C(0x1)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_480[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<class FText>                          MenuCategories;                                    // 0x90(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	TArray<struct FExpressionOutput>             Outputs;                                           // 0xA0(0x10)(ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)

	static class UClass* StaticClass();
	static class UMaterialExpression* GetDefaultObj();

};

// 0x48 (0x70 - 0x28)
// Class Engine.Channel
class UChannel : public UObject
{
public:
	class UNetConnection*                        Connection;                                        // 0x28(0x8)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, GlobalConfig, SubobjectReference)
	uint8                                        Pad_482[0x40];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UChannel* GetDefaultObj();

};

// 0x18 (0x88 - 0x70)
// Class Engine.ControlChannel
class UControlChannel : public UChannel
{
public:
	uint8                                        Pad_483[0x18];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UControlChannel* GetDefaultObj();

};

// 0x198 (0x1C0 - 0x28)
// Class Engine.GameInstance
class UGameInstance : public UObject
{
public:
	uint8                                        Pad_488[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class ULocalPlayer*>                  LocalPlayers;                                      // 0x38(0x10)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	class UOnlineSession*                        OnlineSession;                                     // 0x48(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst)
	TArray<class UObject*>                       ReferencedObjects;                                 // 0x50(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_489[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnPawnControllerChangedDelegates;                  // 0x78(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_48A[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnInputDeviceConnectionChange;                     // 0xA0(0x10)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnUserInputDevicePairingChange;                    // 0xB0(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, DisableEditOnTemplate, Config, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_48B[0x100];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UGameInstance* GetDefaultObj();

	void ReceiveShutdown();
	void ReceiveInit();
	enum class ETravelFailure HandleTravelError();
	bool HandleNetworkError();
	int32 DebugRemovePlayer();
	int32 DebugCreatePlayer();
};

// 0x0 (0x30 - 0x30)
// Class Engine.GameInstanceSubsystem
class UGameInstanceSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass();
	static class UGameInstanceSubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.WorldSubsystem
class UWorldSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass();
	static class UWorldSubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.RecentPlayersWorldSubsystemBase
class URecentPlayersWorldSubsystemBase : public UWorldSubsystem
{
public:

	static class UClass* StaticClass();
	static class URecentPlayersWorldSubsystemBase* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.AssetImportData
class UAssetImportData : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAssetImportData* GetDefaultObj();

};

// 0x368 (0xA40 - 0x6D8)
// Class Engine.SkinnedMeshComponent
class USkinnedMeshComponent : public UMeshComponent
{
public:
	uint8                                        Pad_556[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	class USkeletalMesh*                         SkeletalMesh;                                      // 0x6E0(0x8)(Edit, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, GlobalConfig)
	class USkinnedAsset*                         SkinnedAsset;                                      // 0x6E8(0x8)(BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, GlobalConfig)
	TWeakObjectPtr<class USkinnedMeshComponent>  LeaderPoseComponent;                               // 0x6F0(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	TArray<enum class ESkinCacheUsage>           SkinCacheUsage;                                    // 0x6F8(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	bool                                         bSetMeshDeformer;                                  // 0x708(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_558[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	class UMeshDeformer*                         MeshDeformer;                                      // 0x710(0x8)(BlueprintVisible, ReturnParm, DisableEditOnTemplate, Transient, EditConst)
	class UMeshDeformerInstanceSettings*         MeshDeformerInstanceSettings;                      // 0x718(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst)
	class UMeshDeformerInstance*                 MeshDeformerInstance;                              // 0x720(0x8)(Edit, ConstParm, ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, EditConst)
	uint8                                        Pad_55B[0x178];                                    // Fixing Size After Last Property  > TateDumper <
	class UPhysicsAsset*                         PhysicsAssetOverride;                              // 0x8A0(0x8)(ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	int32                                        ForcedLodModel;                                    // 0x8A8(0x4)(Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	int32                                        MinLodModel;                                       // 0x8AC(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_55D[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        StreamingDistanceMultiplier;                       // 0x8B8(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig, InstancedReference)
	uint8                                        Pad_55E[0xC];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<struct FSkelMeshComponentLODInfo>     LODInfo;                                           // 0x8C8(0x10)(BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_55F[0x24];                                     // Fixing Size After Last Property  > TateDumper <
	enum class EVisibilityBasedAnimTickOption    VisibilityBasedAnimTickOption;                     // 0x8FC(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        Pad_561[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        BitPad_4E : 3;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bOverrideMinLod : 1;                               // Mask: 0x8, PropSize: 0x10x8FE(0x1)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUseBoundsFromLeaderPoseComponent : 1;             // Mask: 0x10, PropSize: 0x10x8FE(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bForceWireframe : 1;                               // Mask: 0x20, PropSize: 0x10x8FE(0x1)(ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDisableMorphTarget : 1;                           // Mask: 0x40, PropSize: 0x10x8FE(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bHideSkin : 1;                                     // Mask: 0x80, PropSize: 0x10x8FE(0x1)(Edit, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bPerBoneMotionBlur : 1;                            // Mask: 0x1, PropSize: 0x10x8FF(0x1)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bComponentUseFixedSkelBounds : 1;                  // Mask: 0x2, PropSize: 0x10x8FF(0x1)(ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bConsiderAllBodiesForBounds : 1;                   // Mask: 0x4, PropSize: 0x10x8FF(0x1)(Edit, ExportObject, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bSyncAttachParentLOD : 1;                          // Mask: 0x8, PropSize: 0x10x8FF(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bCanHighlightSelectedSections : 1;                 // Mask: 0x10, PropSize: 0x10x8FF(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bRecentlyRendered : 1;                             // Mask: 0x20, PropSize: 0x10x8FF(0x1)(BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bCastCapsuleDirectShadow : 1;                      // Mask: 0x40, PropSize: 0x10x8FF(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bCastCapsuleIndirectShadow : 1;                    // Mask: 0x80, PropSize: 0x10x8FF(0x1)(Edit, ExportObject, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bCPUSkinning : 1;                                  // Mask: 0x1, PropSize: 0x10x900(0x1)(ConstParm, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bEnableUpdateRateOptimizations : 1;                // Mask: 0x2, PropSize: 0x10x900(0x1)(ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDisplayDebugUpdateRateOptimizations : 1;          // Mask: 0x4, PropSize: 0x10x900(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bRenderStatic : 1;                                 // Mask: 0x8, PropSize: 0x10x900(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bIgnoreLeaderPoseComponentLOD : 1;                 // Mask: 0x10, PropSize: 0x10x900(0x1)(Edit, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        BitPad_4F : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bCachedLocalBoundsUpToDate : 1;                    // Mask: 0x80, PropSize: 0x10x900(0x1)(Edit, ExportObject, OutParm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bCachedWorldSpaceBoundsUpToDate : 1;               // Mask: 0x1, PropSize: 0x10x901(0x1)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_50 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bForceMeshObjectUpdate : 1;                        // Mask: 0x4, PropSize: 0x10x901(0x1)(BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bForceUpdateDynamicDataImmediately : 1;            // Mask: 0x8, PropSize: 0x10x901(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_51 : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        BitPad_52 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bFollowerShouldTickPose : 1;                       // Mask: 0x2, PropSize: 0x10x902(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_53 : 6;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_570[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        CapsuleIndirectShadowMinVisibility;                // 0x904(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_571[0x38];                                     // Fixing Size After Last Property  > TateDumper <
	struct FBoxSphereBounds                      CachedWorldOrLocalSpaceBounds;                     // 0x940(0x38)(Edit, ConstParm, ExportObject, Net, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_572[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	struct FMatrix                               CachedWorldToLocalTransform;                       // 0x980(0x80)(BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_573[0x18];                                     // Fixing Size After Last Property  > TateDumper <
	uint8                                        bForceUpdateKinematic : 1;                         // Mask: 0x1, PropSize: 0x10xA18(0x1)(BlueprintReadOnly, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bChartDistanceFactor : 1;                          // Mask: 0x2, PropSize: 0x10xA18(0x1)(Edit, BlueprintVisible, Parm, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bFreeSpaceBasesOnUnregister : 1;                   // Mask: 0x4, PropSize: 0x10xA18(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bForceTickPoseWithinRange : 1;                     // Mask: 0x8, PropSize: 0x10xA18(0x1)(ExportObject, Net, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bAlwaysUpdateMeshForShadowRendering : 1;           // Mask: 0x10, PropSize: 0x10xA18(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bAddAttachedParentBounds : 1;                      // Mask: 0x20, PropSize: 0x10xA18(0x1)(ExportObject, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bBasedPawnsTriggerChildTick : 1;                   // Mask: 0x40, PropSize: 0x10xA18(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_54 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_578[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        ForceTickPoseWithinRangeSquared;                   // 0xA1C(0x4)(ExportObject, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	class USkinnedMeshComponent*                 OverrideTickingVisiblityMesh;                      // 0xA20(0x8)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	float                                        ShadowedRecentlyRenderedBoundsScaleMultiplier;     // 0xA28(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_579[0x14];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class USkinnedMeshComponent* GetDefaultObj();

	void UnsetMeshDeformer();
	void UnloadSkinWeightProfile(class FName* InProfileName);
	void UnHideBoneByName(class FName BoneName);
	struct FRotator TransformToBoneSpace(class FName BoneName, struct FVector* OutPosition, const struct FRotator& OutRotation);
	struct FRotator TransformFromBoneSpace(class FName BoneName, struct FVector* OutPosition, const struct FRotator& OutRotation);
	int32 ShowMaterialSection(int32* SectionIndex, bool* bShow, int32 LODIndex);
	void ShowAllMaterialSections(int32 LODIndex);
	int32 SetVertexOffsetUsage(int32 LODIndex);
	TArray<struct FLinearColor> SetVertexColorOverride_LinearColor(int32 LODIndex);
	void SetSkinWeightProfile(class FName* InProfileName, bool* ReturnValue);
	TArray<struct FSkelMeshSkinWeightInfo> SetSkinWeightOverride(int32 LODIndex);
	class USkinnedAsset* SetSkinnedAssetAndUpdate(bool* bReinitPose);
	bool SetRenderStatic();
	TArray<struct FVector> SetPreSkinningOffsets(int32 LODIndex);
	TArray<struct FVector> SetPostSkinningOffsets(int32 LODIndex);
	void SetPhysicsAsset(class UPhysicsAsset** NewPhysicsAsset, bool* bForceReInit);
	void SetMinLOD(int32* InNewMinLOD);
	void SetMeshDeformer(class UMeshDeformer** InMeshDeformer);
	class USkinnedMeshComponent* SetLeaderPoseComponent(bool* bForceUpdate, bool* bInFollowerShouldTickPose);
	void SetForcedLOD(int32* InNewForcedLOD);
	bool SetCastCapsuleIndirectShadow();
	bool SetCastCapsuleDirectShadow();
	float SetCapsuleIndirectShadowMinVisibility();
	void IsUsingSkinWeightProfile(bool* ReturnValue);
	int32 IsMaterialSectionShown(int32 LODIndex, bool* ReturnValue);
	void IsBoneHiddenByName(class FName BoneName, bool* ReturnValue);
	void HideBoneByName(class FName BoneName, enum class EPhysBodyOp* PhysBodyOption);
	void GetVertexOffsetUsage(int32 LODIndex, int32* ReturnValue);
	void GetTwistAndSwingAngleOfDeltaRotationFromRefPose(class FName BoneName, float* OutTwistAngle, float* OutSwingAngle, bool* ReturnValue);
	void GetSocketBoneName(class FName* InSocketName, class FName* ReturnValue);
	void GetSkinnedAsset(class USkinnedAsset** ReturnValue);
	void GetSkeletalMesh_DEPRECATED(class USkeletalMesh** ReturnValue);
	int32 GetRefPoseTransform(struct FTransform* ReturnValue);
	int32 GetRefPosePosition(struct FVector* ReturnValue);
	void GetPredictedLODLevel(int32* ReturnValue);
	void GetParentBone(class FName BoneName, class FName* ReturnValue);
	void GetNumLODs(int32* ReturnValue);
	void GetNumBones(int32* ReturnValue);
	void GetMeshDeformerInstance(class UMeshDeformerInstance** ReturnValue);
	void GetForcedLOD(int32* ReturnValue);
	void GetDeltaTransformFromRefPose(class FName BoneName, class FName BaseName, struct FTransform* ReturnValue);
	void GetCurrentSkinWeightProfileName(class FName* ReturnValue);
	int32 GetBoneName(class FName* ReturnValue);
	void GetBoneIndex(class FName BoneName, int32* ReturnValue);
	void FindClosestBone_K2(struct FVector* TestLocation, struct FVector* BoneLocation, float* IgnoreScale, bool* bRequirePhysicsAsset, class FName* ReturnValue);
	void ClearVertexColorOverride(int32 LODIndex);
	void ClearSkinWeightProfile();
	void ClearSkinWeightOverride(int32 LODIndex);
	void BoneIsChildOf(class FName BoneName, class FName* ParentBoneName, bool* ReturnValue);
};

// 0x9C8 (0x1408 - 0xA40)
// Class Engine.SkeletalMeshComponent
class USkeletalMeshComponent : public USkinnedMeshComponent
{
public:
	uint8                                        Pad_7F2[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	class USkeletalMesh*                         SkeletalMeshAsset;                                 // 0xA48(0x8)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, Transient, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	class UClass*                                AnimBlueprintGeneratedClass;                       // 0xA50(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, DisableEditOnInstance, GlobalConfig)
	class UClass*                                AnimClass;                                         // 0xA58(0x8)(ExportObject, BlueprintReadOnly, Net, Parm, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	class UAnimInstance*                         AnimScriptInstance;                                // 0xA60(0x8)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	class UAnimInstance*                         PostProcessAnimInstance;                           // 0xA68(0x8)(Edit, Net, Parm, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	struct FSingleAnimationPlayData              AnimationData;                                     // 0xA70(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, ReturnParm, EditConst, GlobalConfig)
	uint8                                        Pad_7F7[0x10];                                     // Fixing Size After Last Property  > TateDumper <
	struct FVector                               RootBoneTranslation;                               // 0xA98(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               LineCheckBoundsScale;                              // 0xAB0(0x18)(Edit, ConstParm, ExportObject, Parm, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_7F8[0x30];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<class UAnimInstance*>                 LinkedInstances;                                   // 0xAF8(0x10)(ConstParm, Parm, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FTransform>                    CachedBoneSpaceTransforms;                         // 0xB08(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FTransform>                    CachedComponentSpaceTransforms;                    // 0xB18(0x10)(BlueprintVisible, Net, EditFixedSize, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_7FC[0xB0];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        GlobalAnimRateScale;                               // 0xBD8(0x4)(Edit, ExportObject, BlueprintReadOnly, EditFixedSize, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bAllowKinematicUpdateStaggering : 1;               // Mask: 0x1, PropSize: 0x10xBDC(0x1)(ExportObject, EditFixedSize, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_64 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_800[0xB];                                      // Fixing Size After Last Property  > TateDumper <
	enum class EKinematicBonesUpdateToPhysics    KinematicBonesUpdateType;                          // 0xBE8(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	enum class EPhysicsTransformUpdateMode       PhysicsTransformUpdateMode;                        // 0xBE9(0x1)(Edit, BlueprintVisible, ExportObject, Net, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_802[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	enum class ECollisionEnabled                 PreSleepingKinematicsCollisionType;                // 0xBEB(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	enum class EAnimationMode                    AnimationMode;                                     // 0xBEC(0x1)(Edit, ConstParm, BlueprintReadOnly, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_808[0x1];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bDisablePostProcessBlueprint : 1;                  // Mask: 0x1, PropSize: 0x10xBEE(0x1)(BlueprintVisible, ReturnParm, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_65 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bUpdateOverlapsOnAnimationFinalize : 1;            // Mask: 0x4, PropSize: 0x10xBEE(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_66 : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bHasValidBodies : 1;                               // Mask: 0x10, PropSize: 0x10xBEE(0x1)(Edit, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bBlendPhysics : 1;                                 // Mask: 0x20, PropSize: 0x10xBEE(0x1)(Edit, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bEnablePhysicsOnDedicatedServer : 1;               // Mask: 0x40, PropSize: 0x10xBEE(0x1)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUpdateMeshWhenKinematic : 1;                      // Mask: 0x80, PropSize: 0x10xBEE(0x1)(Edit, ConstParm, EditFixedSize, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUpdateJointsFromAnimation : 1;                    // Mask: 0x1, PropSize: 0x10xBEF(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bAllowClothActors : 1;                             // Mask: 0x2, PropSize: 0x10xBEF(0x1)(Edit, ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDisableClothSimulation : 1;                       // Mask: 0x4, PropSize: 0x10xBEF(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_68 : 5;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_812[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bDisableRigidBodyAnimNode : 1;                     // Mask: 0x1, PropSize: 0x10xBF4(0x1)(BlueprintReadOnly, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bAllowAnimCurveEvaluation : 1;                     // Mask: 0x2, PropSize: 0x10xBF4(0x1)(ConstParm, Parm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_69 : 3;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bCollideWithEnvironment : 1;                       // Mask: 0x20, PropSize: 0x10xBF4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bCollideWithAttachedChildren : 1;                  // Mask: 0x40, PropSize: 0x10xBF4(0x1)(ConstParm, BlueprintVisible, Net, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bForceCollisionUpdate : 1;                         // Mask: 0x80, PropSize: 0x10xBF4(0x1)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bLocalSpaceSimulation : 1;                         // Mask: 0x1, PropSize: 0x10xBF5(0x1)(ConstParm, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bResetAfterTeleport : 1;                           // Mask: 0x2, PropSize: 0x10xBF5(0x1)(Edit, ConstParm, EditFixedSize, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_6A : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bDeferKinematicBoneUpdate : 1;                     // Mask: 0x8, PropSize: 0x10xBF5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bNoSkeletonUpdate : 1;                             // Mask: 0x10, PropSize: 0x10xBF5(0x1)(Edit, ConstParm, ExportObject, Net, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bPauseAnims : 1;                                   // Mask: 0x20, PropSize: 0x10xBF5(0x1)(BlueprintVisible, Net, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUseRefPoseOnInitAnim : 1;                         // Mask: 0x40, PropSize: 0x10xBF5(0x1)(ExportObject, BlueprintReadOnly, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bEnablePerPolyCollision : 1;                       // Mask: 0x80, PropSize: 0x10xBF5(0x1)(Edit, ConstParm, ExportObject, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bForceRefpose : 1;                                 // Mask: 0x1, PropSize: 0x10xBF6(0x1)(Edit, ConstParm, OutParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bOnlyAllowAutonomousTickPose : 1;                  // Mask: 0x2, PropSize: 0x10xBF6(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bIsAutonomousTickPose : 1;                         // Mask: 0x4, PropSize: 0x10xBF6(0x1)(ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bOldForceRefPose : 1;                              // Mask: 0x8, PropSize: 0x10xBF6(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bShowPrePhysBones : 1;                             // Mask: 0x10, PropSize: 0x10xBF6(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bRequiredBonesUpToDate : 1;                        // Mask: 0x20, PropSize: 0x10xBF6(0x1)(Edit, ExportObject, EditFixedSize, Parm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bAnimTreeInitialised : 1;                          // Mask: 0x40, PropSize: 0x10xBF6(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bIncludeComponentLocationIntoBounds : 1;           // Mask: 0x80, PropSize: 0x10xBF6(0x1)(Edit, ConstParm, ExportObject, Net, Parm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bEnableLineCheckWithBounds : 1;                    // Mask: 0x1, PropSize: 0x10xBF7(0x1)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bPropagateCurvesToFollowers : 1;                   // Mask: 0x2, PropSize: 0x10xBF7(0x1)(ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnInstance, EditConst, SubobjectReference)
	uint8                                        bSkipKinematicUpdateWhenInterpolating : 1;         // Mask: 0x4, PropSize: 0x10xBF7(0x1)(Edit, ExportObject, Parm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bSkipBoundsUpdateWhenInterpolating : 1;            // Mask: 0x8, PropSize: 0x10xBF7(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bPreventDediServerAutoUnregistration : 1;          // Mask: 0x10, PropSize: 0x10xBF7(0x1)(BlueprintVisible, Net, EditFixedSize, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_6B : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bNeedsQueuedAnimEventsDispatched : 1;              // Mask: 0x80, PropSize: 0x10xBF7(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_821[0x2];                                      // Fixing Size After Last Property  > TateDumper <
	uint16                                       CachedAnimCurveUidVersion;                         // 0xBFA(0x2)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        ClothBlendWeight;                                  // 0xBFC(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	bool                                         bWaitForParallelClothTask;                         // 0xC00(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_826[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<class FName>                          DisallowedAnimCurves;                              // 0xC08(0x10)(Edit, ConstParm, Net, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	class UBodySetup*                            BodySetup;                                         // 0xC18(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, GlobalConfig)
	uint8                                        Pad_828[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        ClothMaxDistanceScale;                             // 0xC24(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnConstraintBroken;                                // 0xC28(0x10)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnPlasticDeformation;                              // 0xC38(0x10)(ConstParm, ZeroConstructor, Transient, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                ClothingSimulationFactory;                         // 0xC48(0x8)(Edit, ExportObject, BlueprintReadOnly, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
	uint8                                        Pad_82C[0xF8];                                     // Fixing Size After Last Property  > TateDumper <
	float                                        TeleportDistanceThreshold;                         // 0xD48(0x4)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        TeleportRotationThreshold;                         // 0xD4C(0x4)(ConstParm, BlueprintVisible, Net, EditFixedSize, Parm, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_82D[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	uint32                                       LastPoseTickFrame;                                 // 0xD58(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_82F[0x94];                                     // Fixing Size After Last Property  > TateDumper <
	class UClothingSimulationInteractor*         ClothingInteractor;                                // 0xDF0(0x8)(Edit, ConstParm, BlueprintVisible, Net, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, GlobalConfig)
	uint8                                        Pad_831[0xC8];                                     // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnAnimInitialized;                                 // 0xEC0(0x10)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_833[0x1B0];                                    // Fixing Size After Last Property  > TateDumper <
	double                                       PreventSoundCuesTime;                              // 0x1080(0x8)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_834[0x14C];                                    // Fixing Size After Last Property  > TateDumper <
	float                                        DinoIKAnimationLegZOffsetingMultiplier;            // 0x11D4(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        DinoIKDelayedTraceFreezeDurationMultiplier;        // 0x11D8(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Parm, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        DinoIKSlopeMatchingRootHeightOffset;               // 0x11DC(0x4)(ConstParm, ExportObject, Parm, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        DistanceFromGroundToStartIK;                       // 0x11E0(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        DistanceFromGroundToStartIKBias;                   // 0x11E4(0x4)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        FeetAlignmentLimit;                                // 0x11E8(0x4)(Net, EditFixedSize, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        ForceUpdateValuesTimeLimit;                        // 0x11EC(0x4)(ConstParm, BlueprintReadOnly, EditFixedSize, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        IkFabrikInterpSpeed;                               // 0x11F0(0x4)(Edit, ConstParm, BlueprintVisible, EditFixedSize, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        IkFeetAlignmentInterpSpeed;                        // 0x11F4(0x4)(Edit, ExportObject, BlueprintReadOnly, Net, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        IkGroundPlaneInterpSpeed;                          // 0x11F8(0x4)(BlueprintVisible, ExportObject, Net, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        IkInterpSpeed;                                     // 0x11FC(0x4)(BlueprintVisible, Net, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        IkInterpSpeedUp;                                   // 0x1200(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_83A[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               IkRootLocationOffset;                              // 0x1208(0x18)(BlueprintReadOnly, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	struct FRotator                              IkRootRotationOffset;                              // 0x1220(0x18)(Edit, BlueprintVisible, OutParm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        IkRootOffsetInterpSpeed;                           // 0x1238(0x4)(ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        IkRootOffsetInterpSpeedUp;                         // 0x123C(0x4)(ConstParm, ExportObject, Net, EditFixedSize, Parm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        IkRootWorldOffsetInterpSpeed;                      // 0x1240(0x4)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        IkRootWorldOffsetInterpSpeedUp;                    // 0x1244(0x4)(Edit, ConstParm, ExportObject, EditFixedSize, Parm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        LegLimitRatioFromCylinderHeight;                   // 0x1248(0x4)(ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        MatchSlopeRotationSpeed;                           // 0x124C(0x4)(Edit, BlueprintVisible, ExportObject, Net, Parm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        RootPitchRotationLimit;                            // 0x1250(0x4)(Edit, Net, Parm, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        RootRollRotationLimit;                             // 0x1254(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Parm, Transient, EditConst, InstancedReference, SubobjectReference)
	int32                                        MaxIterations;                                     // 0x1258(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, OutParm, InstancedReference, SubobjectReference)
	uint8                                        Pad_846[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FVector                               TwoLegVirtualHitLocationWS;                        // 0x1260(0x18)(Edit, ConstParm, BlueprintVisible, Parm, Transient, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               TwoLegVirtualHitLocationWSTarget;                  // 0x1278(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Transient, EditConst, InstancedReference, SubobjectReference)
	struct FVector                               TwoLegVirtualHitLocationCS;                        // 0x1290(0x18)(ExportObject, Net, EditFixedSize, Transient, EditConst, InstancedReference, SubobjectReference)
	float                                        RootOffset;                                        // 0x12A8(0x4)(ExportObject, EditFixedSize, Parm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        Pad_847[0x4];                                      // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              RootRotationOffset;                                // 0x12B0(0x18)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        bForceTickDisabled : 1;                            // Mask: 0x1, PropSize: 0x10x12C8(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bFreezeGroundPlaneIK : 1;                          // Mask: 0x2, PropSize: 0x10x12C8(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bSuppressAnimNotifies : 1;                         // Mask: 0x4, PropSize: 0x10x12C8(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        UseWorldSpaceFeetAlignment : 1;                    // Mask: 0x8, PropSize: 0x10x12C8(0x1)(Edit, ExportObject, BlueprintReadOnly, Net, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bRotateFeetToAlignWithGround : 1;                  // Mask: 0x10, PropSize: 0x10x12C8(0x1)(ConstParm, ExportObject, Net, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bEnableMultiFabrik : 1;                            // Mask: 0x20, PropSize: 0x10x12C8(0x1)(Net, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKUseExperimentalInvalidTraceZeroing : 1;     // Mask: 0x40, PropSize: 0x10x12C8(0x1)(ConstParm, ExportObject, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bAlignRootOnlyToGround : 1;                        // Mask: 0x80, PropSize: 0x10x12C8(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKAnimationLegZOffseting : 1;                 // Mask: 0x1, PropSize: 0x10x12C9(0x1)(ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bIKRotationEnabled : 1;                            // Mask: 0x2, PropSize: 0x10x12C9(0x1)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bMovedLastFrame : 1;                               // Mask: 0x4, PropSize: 0x10x12C9(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKLerpFeet : 1;                               // Mask: 0x8, PropSize: 0x10x12C9(0x1)(ConstParm, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKLerpLegs : 1;                               // Mask: 0x10, PropSize: 0x10x12C9(0x1)(Edit, ExportObject, EditFixedSize, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKRootWorldSpaceLerpZ : 1;                    // Mask: 0x20, PropSize: 0x10x12C9(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKSmoothGroundPlaneLerping : 1;               // Mask: 0x40, PropSize: 0x10x12C9(0x1)(ConstParm, ExportObject, Net, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKSlopeMatchingRootHeightOffsetMultiplier : 1; // Mask: 0x80, PropSize: 0x10x12C9(0x1)(ConstParm, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bDinoIKUseLegLimits : 1;                           // Mask: 0x1, PropSize: 0x10x12CA(0x1)(Edit, ConstParm, BlueprintVisible, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bEnableIkOnlyWhenIdle : 1;                         // Mask: 0x2, PropSize: 0x10x12CA(0x1)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bEnableSimpleIK : 1;                               // Mask: 0x4, PropSize: 0x10x12CA(0x1)(ConstParm, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bForceSimpleIK : 1;                                // Mask: 0x8, PropSize: 0x10x12CA(0x1)(ConstParm, ExportObject, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bSetAttachmentMasterPoseComponent : 1;             // Mask: 0x10, PropSize: 0x10x12CA(0x1)(ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bInterpolateRootPhys : 1;                          // Mask: 0x20, PropSize: 0x10x12CA(0x1)(Edit, BlueprintVisible, ExportObject, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_6C : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_862[0x35];                                     // Fixing Size After Last Property  > TateDumper <
	TArray<float>                                OriginalBonesOffsets;                              // 0x1300(0x10)(ConstParm, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FIKLegInfo>                    IkLegs;                                            // 0x1310(0x10)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FIKGroundPlaneOverrideInfo>    IkGroundPlaneOverrides;                            // 0x1320(0x10)(ConstParm, BlueprintReadOnly, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FIKRootAdjustmentInfo>         IkRootAdjustmentPoints;                            // 0x1330(0x10)(ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	float                                        MinHitNormalZForFeetAlignment;                     // 0x1340(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	float                                        ComponentMassScale;                                // 0x1344(0x4)(BlueprintVisible, ExportObject, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	float                                        GroundBoneInstantSyncTillTime;                     // 0x1348(0x4)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	float                                        MinLinearDamping;                                  // 0x134C(0x4)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	float                                        MinAngularDamping;                                 // 0x1350(0x4)(Edit, ExportObject, Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	float                                        CachedFootZDiff;                                   // 0x1354(0x4)(Net, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bOnlyTickWhenRenderedDontDisableOnDedicatedServer : 1; // Mask: 0x1, PropSize: 0x10x1358(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bSkipUpdateTransformIfBlendedPhysics : 1;          // Mask: 0x2, PropSize: 0x10x1358(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        AnimationFrozen : 1;                               // Mask: 0x4, PropSize: 0x10x1358(0x1)(ConstParm, ExportObject, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bInitOffset : 1;                                   // Mask: 0x8, PropSize: 0x10x1358(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, InstancedReference, SubobjectReference)
	uint8                                        bUpdatedKinematics : 1;                            // Mask: 0x10, PropSize: 0x10x1358(0x1)(Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUpdatedKinematicsOnce : 1;                        // Mask: 0x20, PropSize: 0x10x1358(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bSetKinematicsSleeping : 1;                        // Mask: 0x40, PropSize: 0x10x1358(0x1)(ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bNeverTickOnDediServer : 1;                        // Mask: 0x80, PropSize: 0x10x1358(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bAlwaysTeleportKinematic : 1;                      // Mask: 0x1, PropSize: 0x10x1359(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bForceDisablePhysicsOnDediServer : 1;              // Mask: 0x2, PropSize: 0x10x1359(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bForceDisablePhysicsOnDediServerAllowRagdoll : 1;  // Mask: 0x4, PropSize: 0x10x1359(0x1)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bSleepKinematicsWhenNotRefreshingBones : 1;        // Mask: 0x8, PropSize: 0x10x1359(0x1)(Edit, ConstParm, BlueprintReadOnly, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bPhysicsRequiredOnDediServer : 1;                  // Mask: 0x10, PropSize: 0x10x1359(0x1)(BlueprintVisible, Net, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bAlwaysForceUpdateKinematicsOnDedicatedServer : 1; // Mask: 0x20, PropSize: 0x10x1359(0x1)(BlueprintVisible, ExportObject, ZeroConstructor, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bRotateToMatchWalkingSlope : 1;                    // Mask: 0x40, PropSize: 0x10x1359(0x1)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bFootZDiffIsCached : 1;                            // Mask: 0x80, PropSize: 0x10x1359(0x1)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bShouldCacheFootZDiff : 1;                         // Mask: 0x1, PropSize: 0x10x135A(0x1)(ExportObject, Net, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bEnableIKTraceFreezing : 1;                        // Mask: 0x2, PropSize: 0x10x135A(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_6D : 6;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_87C[0x5];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bModifyBoneAnimNodeUseCurrentBoneModifiers : 1;    // Mask: 0x1, PropSize: 0x10x1360(0x1)(ConstParm, BlueprintVisible, EditFixedSize, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_6E : 1;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bHumanIKUseBoneModiferLegScalars : 1;              // Mask: 0x4, PropSize: 0x10x1360(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bApplyGroundBoneModifiers : 1;                     // Mask: 0x8, PropSize: 0x10x1360(0x1)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_6F : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_880[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	uint8                                        bEnableIKCartGroundConforming : 1;                 // Mask: 0x1, PropSize: 0x10x1364(0x1)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_70 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_882[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	struct FRotator                              RotOffset;                                         // 0x1368(0x18)(Edit, BlueprintReadOnly, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUseRotOffset : 1;                                 // Mask: 0x1, PropSize: 0x10x1380(0x1)(Edit, ExportObject, Parm, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUseItemSlotAttachmentTranformOffsets : 1;         // Mask: 0x2, PropSize: 0x10x1380(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bInitializedArticulated : 1;                       // Mask: 0x4, PropSize: 0x10x1380(0x1)(ExportObject, Net, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_71 : 5;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_889[0xF];                                      // Fixing Size After Last Property  > TateDumper <
	float                                        BoneModifiersLegLengthPercentage;                  // 0x1390(0x4)(Edit, ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_88A[0x24];                                     // Fixing Size After Last Property  > TateDumper <
	double                                       LastStartedRenderingTime;                          // 0x13B8(0x8)(ConstParm, ExportObject, EditFixedSize, OutParm, ReturnParm, DisableEditOnTemplate, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_88B[0x48];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class USkeletalMeshComponent* GetDefaultObj();

	void UnlinkAnimClassLayers(class UClass* InClass);
	bool UnbindClothFromLeaderPoseComponent();
	void ToggleDisablePostProcessBlueprint();
	void TermBodiesBelow(class FName* ParentBoneName);
	void SuspendClothingSimulation();
	void Stop();
	struct FPoseSnapshot SnapshotPose();
	bool SetUpdateClothInEditor();
	bool SetUpdateAnimationInEditor();
	void SetupBetweenAnimationBlueprintBlending();
	float SetTeleportRotationThreshold();
	float SetTeleportDistanceThreshold();
	class USkeletalMesh* SetSkeletalMeshAsset();
	bool SetPosition();
	float SetPlayRate();
	void SetPhysicsBlendWeight(float PhysicsBlendWeight);
	bool SetNotifyRigidBodyCollisionBelow(class FName BoneName);
	bool SetMorphTarget(class FName* MorphTargetName, float Value);
	bool SetEnablePhysicsBlending();
	bool SetEnableGravityOnAllBodiesBelow(class FName BoneName);
	bool SetEnableBodyGravity(class FName BoneName);
	bool SetDisablePostProcessBlueprint();
	bool SetDisableAnimCurves();
	bool SetConstraintProfileForAll(class FName ProfileName);
	bool SetConstraintProfile(class FName JointName, class FName ProfileName);
	void SetClothMaxDistanceScale(float Scale);
	bool SetBodyNotifyRigidBodyCollision(class FName BoneName);
	class UClass* SetAnimClass();
	enum class EAnimationMode SetAnimationMode();
	class UAnimationAsset* SetAnimation();
	float SetAngularLimits();
	bool SetAllowRigidBodyAnimNode();
	TArray<class FName> SetAllowedAnimCurvesEvaluation(bool bAllow);
	bool SetAllowClothActors();
	bool SetAllowAnimCurveEvaluation();
	bool SetAllMotorsAngularVelocityDrive(bool* bSkipCustomPhysicsType);
	bool SetAllMotorsAngularPositionDrive(bool* bSkipCustomPhysicsType);
	float SetAllMotorsAngularDriveParams(float* InDamping, bool* bSkipCustomPhysicsType);
	bool SetAllBodiesSimulatePhysics();
	void SetAllBodiesPhysicsBlendWeight(float PhysicsBlendWeight, bool* bSkipCustomPhysicsType);
	bool SetAllBodiesBelowSimulatePhysics();
	bool SetAllBodiesBelowPhysicsDisabled(bool bDisabled);
	bool SetAllBodiesBelowPhysicsBlendWeight(float PhysicsBlendWeight, bool* bSkipCustomPhysicsType);
	bool SetAllBodiesBelowLinearVelocity();
	void ResumeClothingSimulation();
	void ResetClothTeleportMode();
	void ResetAnimInstanceDynamics(enum class ETeleportType* InTeleportType);
	void ResetAllowedAnimCurveEvaluation();
	void ResetAllBodiesSimulatePhysics();
	bool PlayAnimation();
	bool Play();
	float OverrideAnimationData(float Position);
	class FName LinkAnimGraphByTag(class UClass* InClass);
	void LinkAnimClassLayers(class UClass* InClass);
	struct FVector K2_GetClosestPointOnPhysicsAsset(struct FVector* WorldPosition, class FName BoneName, float Distance, bool* ReturnValue);
	class UAnimMontage* IsPlayingMontage(float TimeFromEndToConsiderFinished, bool* ReturnValue);
	void IsPlayingAnimationMontagesOnSlotName(class FName SlotName, bool* ReturnValue);
	void IsPlaying(bool* ReturnValue);
	void IsClothingSimulationSuspended(bool* ReturnValue);
	void IsBodyGravityEnabled(class FName BoneName, bool* ReturnValue);
	int32 IncrementIKLegMute();
	void HasValidAnimationInstance(bool* ReturnValue);
	void GetTrueBasedPawns(TArray<class APawn*>* ReturnValue);
	enum class ECustomBoneAttributeLookup GetTransformAttribute_Ref(class FName BoneName, bool* ReturnValue);
	enum class ECustomBoneAttributeLookup GetTransformAttribute(class FName BoneName, const struct FTransform& DefaultValue, bool* ReturnValue);
	void GetTeleportRotationThreshold(float* ReturnValue);
	void GetTeleportDistanceThreshold(float* ReturnValue);
	enum class ECustomBoneAttributeLookup GetStringAttribute_Ref(class FName BoneName, bool* ReturnValue);
	enum class ECustomBoneAttributeLookup GetStringAttribute(class FName BoneName, const class FString& DefaultValue, bool* ReturnValue);
	void GetSkeletalMeshAsset(class USkeletalMesh** ReturnValue);
	void GetSkeletalCenterOfMass(struct FVector* ReturnValue);
	void GetPostProcessInstance(class UAnimInstance** ReturnValue);
	void GetPosition(float* ReturnValue);
	void GetPlayRate(float* ReturnValue);
	void GetMorphTarget(class FName* MorphTargetName, float* ReturnValue);
	void GetLinkedAnimLayerInstanceByGroup(class FName InGroup, class UAnimInstance** ReturnValue);
	void GetLinkedAnimLayerInstanceByClass(class UClass* InClass, class UAnimInstance** ReturnValue);
	TArray<class UAnimInstance*> GetLinkedAnimGraphInstancesByTag();
	class FName GetLinkedAnimGraphInstanceByTag(class UAnimInstance** ReturnValue);
	enum class ECustomBoneAttributeLookup GetIntegerAttribute_Ref(class FName BoneName, bool* ReturnValue);
	enum class ECustomBoneAttributeLookup GetIntegerAttribute(class FName BoneName, int32 DefaultValue, bool* ReturnValue);
	enum class ECustomBoneAttributeLookup GetFloatAttribute_Ref(class FName BoneName, bool* ReturnValue);
	enum class ECustomBoneAttributeLookup GetFloatAttribute(class FName BoneName, float DefaultValue, bool* ReturnValue);
	void GetFirstBoneWithChildren(class FName* ReturnValue);
	void GetDisablePostProcessBlueprint(bool* ReturnValue);
	void GetDisableAnimCurves(bool* ReturnValue);
	float GetCurrentJointAngles();
	TArray<struct FConstraintInstanceAccessor> GetConstraintsFromBody(class FName* BodyName);
	TArray<struct FConstraintInstanceAccessor> GetConstraints();
	bool GetConstraintByName(struct FConstraintInstanceAccessor* ReturnValue);
	void GetClothMaxDistanceScale(float* ReturnValue);
	void GetClothingSimulationInteractor(class UClothingSimulationInteractor** ReturnValue);
	bool GetBoneMass(class FName BoneName, float* ReturnValue);
	class FName GetBoneLinearVelocity(struct FVector* ReturnValue);
	void GetAnimInstance(class UAnimInstance** ReturnValue);
	void GetAnimClass(class UClass** ReturnValue);
	void GetAnimationMode(enum class EAnimationMode* ReturnValue);
	void GetAllowRigidBodyAnimNode(bool* ReturnValue);
	void GetAllowedAnimCurveEvaluate(bool* ReturnValue);
	void GetAllowClothActors(bool* ReturnValue);
	void ForceClothNextUpdateTeleportAndReset();
	void ForceClothNextUpdateTeleport();
	int32 FindConstraintBoneName(class FName* ReturnValue);
	struct FVector EnableRagdoll();
	int32 DecrementIKLegMute();
	void ClearMorphTargets();
	class FName BreakConstraint(struct FVector* HitLocation);
	int32 BPValidBoneToUnhide(bool* ReturnValue);
	float BPTickPose();
	TArray<struct FBoneModifierNamed> BPSetBoneModifiers();
	void BPRefreshBoneTransforms();
	void BindClothToLeaderPoseComponent();
	class FName AllowAnimCurveEvaluation(bool bAllow);
	bool AddImpulseToAllBodiesBelow(class FName BoneName);
	bool AddForceToAllBodiesBelow(class FName BoneName);
	float AccumulateAllBodiesBelowPhysicsBlendWeight(bool* bSkipCustomPhysicsType);
};

// 0x320 (0x348 - 0x28)
// Class Engine.AnimInstance
class UAnimInstance : public UObject
{
public:
	class USkeleton*                             CurrentSkeleton;                                   // 0x28(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	enum class ERootMotionMode                   RootMotionMode;                                    // 0x30(0x1)(Edit, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUseMultiThreadedAnimationUpdate : 1;              // Mask: 0x1, PropSize: 0x10x31(0x1)(BlueprintReadOnly, Net, EditFixedSize, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUsingCopyPoseFromMesh : 1;                        // Mask: 0x2, PropSize: 0x10x31(0x1)(BlueprintVisible, Net, EditFixedSize, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_85 : 2;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        bReceiveNotifiesFromLinkedInstances : 1;           // Mask: 0x10, PropSize: 0x10x31(0x1)(ReturnParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bPropagateNotifiesToLinkedInstances : 1;           // Mask: 0x20, PropSize: 0x10x31(0x1)(Edit, BlueprintVisible, ExportObject, Net, EditFixedSize, Parm, OutParm, ZeroConstructor, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bUseMainInstanceMontageEvaluationData : 1;         // Mask: 0x40, PropSize: 0x10x31(0x1)(BlueprintReadOnly, EditFixedSize, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bQueueMontageEvents : 1;                           // Mask: 0x80, PropSize: 0x10x31(0x1)(Edit, BlueprintVisible, EditFixedSize, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B48[0x6];                                      // Fixing Size After Last Property  > TateDumper <
	FMulticastInlineDelegateProperty_            OnMontageBlendingOut;                              // 0x38(0x10)(Edit, ExportObject, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig)
	FMulticastInlineDelegateProperty_            OnMontageStarted;                                  // 0x48(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	FMulticastInlineDelegateProperty_            OnMontageEnded;                                    // 0x58(0x10)(BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig)
	FMulticastInlineDelegateProperty_            OnAllMontageInstancesEnded;                        // 0x68(0x10)(ConstParm, BlueprintVisible, ExportObject, Net, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B4A[0xD8];                                     // Fixing Size After Last Property  > TateDumper <
	struct FAnimNotifyQueue                      NotifyQueue;                                       // 0x150(0x70)(Edit, ConstParm, BlueprintVisible, Net, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FAnimNotifyEvent>              ActiveAnimNotifyState;                             // 0x1C0(0x10)(Edit, ConstParm, ExportObject, BlueprintReadOnly, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FAnimNotifyEventReference>     ActiveAnimNotifyEventReference;                    // 0x1D0(0x10)(Edit, ConstParm, ExportObject, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B4B[0x168];                                    // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UAnimInstance* GetDefaultObj();

	void WasAnimNotifyTriggeredInStateMachine(int32 MachineIndex, class UClass** AnimNotifyType, bool* ReturnValue);
	void WasAnimNotifyTriggeredInSourceState(int32 MachineIndex, int32 StateIndex, class UClass** AnimNotifyType, bool* ReturnValue);
	void WasAnimNotifyTriggeredInAnyState(class UClass** AnimNotifyType, bool* ReturnValue);
	void WasAnimNotifyStateActiveInStateMachine(int32 MachineIndex, class UClass** AnimNotifyStateType, bool* ReturnValue);
	void WasAnimNotifyStateActiveInSourceState(int32 MachineIndex, int32 StateIndex, class UClass** AnimNotifyStateType, bool* ReturnValue);
	void WasAnimNotifyStateActiveInAnyState(class UClass** AnimNotifyStateType, bool* ReturnValue);
	class FName WasAnimNotifyNameTriggeredInStateMachine(int32 MachineIndex, bool* ReturnValue);
	class FName WasAnimNotifyNameTriggeredInSourceState(int32 MachineIndex, int32 StateIndex, bool* ReturnValue);
	class FName WasAnimNotifyNameTriggeredInAnyState(bool* ReturnValue);
	void UnlockAIResources(bool* bUnlockMovement, bool* UnlockAILogic);
	void UnlinkAnimClassLayers(class UClass* InClass);
	void TryGetPawnOwner(class APawn** ReturnValue);
	void StopSlotAnimation(float InBlendOutTime, class FName SlotNodeName);
	struct FPoseSnapshot SnapshotPose();
	void SetUseMainInstanceMontageEvaluationData(bool* bSet);
	void SetRootMotionMode(enum class ERootMotionMode Value);
	void SetReceiveNotifiesFromLinkedInstances(bool* bSet);
	void SetPropagateNotifiesToLinkedInstances(bool* bSet);
	void SetMorphTarget(class FName* MorphTargetName, float Value);
	class FName SavePoseSnapshot();
	void ResetDynamics(enum class ETeleportType* InTeleportType);
	class FName RequestTransitionEvent(double* RequestTimeout, enum class ETransitionRequestQueueMode* QueueMode, enum class ETransitionRequestOverwriteMode* OverwriteMode, bool* ReturnValue);
	class UBlendProfile* RequestSlotGroupInertialization(class FName* InSlotGroupName);
	class FName RemovePoseSnapshot();
	class FName QueryTransitionEvent(int32 MachineIndex, bool* ReturnValue);
	class FName QueryAndMarkTransitionEvent(int32 MachineIndex, bool* ReturnValue);
	int32 PlaySlotAnimationAsDynamicMontage_WithBlendSettings(class UAnimSequenceBase** Asset, class FName SlotNodeName, const struct FMontageBlendSettings& BlendInSettings, const struct FMontageBlendSettings& BlendOutSettings, float InPlayRate, float* BlendOutTriggerTime, float InTimeToStartMontageAt, class UAnimMontage** ReturnValue);
	int32 PlaySlotAnimationAsDynamicMontage_WithBlendArgs(class UAnimSequenceBase** Asset, class FName SlotNodeName, const struct FAlphaBlendArgs& BlendOut, float InPlayRate, float* BlendOutTriggerTime, float InTimeToStartMontageAt, class UAnimMontage** ReturnValue);
	int32 PlaySlotAnimationAsDynamicMontage(class UAnimSequenceBase** Asset, class FName SlotNodeName, float* BlendInTime, float* BlendOutTime, float InPlayRate, float* BlendOutTriggerTime, float InTimeToStartMontageAt, class UAnimMontage** ReturnValue);
	void OnCharacterStepped(struct FVector* PrevLocation, const struct FVector& NewLocation);
	void MontageSync_StopFollowing(class UAnimMontage** MontageFollower);
	void MontageSync_Follow(class UAnimMontage** MontageFollower, class UAnimInstance** OtherAnimInstance, class UAnimMontage** MontageLeader);
	class UAnimMontage* Montage_StopWithBlendSettings(const struct FMontageBlendSettings& BlendOutSettings);
	class UAnimMontage* Montage_StopWithBlendOut(const struct FAlphaBlendArgs& BlendOut);
	void Montage_StopGroupByName(float InBlendOutTime, class FName GroupName);
	class UAnimMontage* Montage_Stop(float InBlendOutTime);
	float Montage_SetPosition();
	class UAnimMontage* Montage_SetPlayRate(float NewPlayRate);
	class UAnimMontage* Montage_SetNextSection(class FName SectionNameToChange, class FName NextSection);
	class UAnimMontage* Montage_Resume();
	void Montage_PlayWithBlendSettings(class UAnimMontage* MontageToPlay, const struct FMontageBlendSettings& BlendInSettings, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages, float* ReturnValue);
	struct FAlphaBlendArgs Montage_PlayWithBlendIn(class UAnimMontage* MontageToPlay, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages, float* ReturnValue);
	void Montage_Play_WithBlending(class UAnimMontage* MontageToPlay, float* BlendInTime, float* BlendOutTime, float InPlayRate, bool* bPauseOnFinish, float* ReturnValue);
	void Montage_Play(class UAnimMontage* MontageToPlay, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages, bool* bPauseOnFinish, float* ReturnValue);
	class UAnimMontage* Montage_Pause();
	class UAnimMontage* Montage_JumpToSectionsEnd(class FName* SectionName);
	class UAnimMontage* Montage_JumpToSection(class FName* SectionName);
	class UAnimMontage* Montage_IsPlaying(float TimeFromEndToConsiderFinished, bool* ReturnValue);
	class UAnimMontage* Montage_IsActive(bool* ReturnValue);
	class UAnimMontage* Montage_GetPosition(float* ReturnValue);
	class UAnimMontage* Montage_GetPlayRate(float* ReturnValue);
	class UAnimMontage* Montage_GetIsStopped(bool* ReturnValue);
	class UAnimMontage* Montage_GetEffectivePlayRate(float* ReturnValue);
	class UAnimMontage* Montage_GetCurrentTime(float MontageTimeRemaining, float TotalMontageDuration, bool* ReturnValue);
	class UAnimMontage* Montage_GetCurrentSection(class FName* ReturnValue);
	class UAnimMontage* Montage_GetBlendTime(float* ReturnValue);
	void LockAIResources(bool bLockMovement, bool LockAILogic);
	class FName LinkAnimGraphByTag(class UClass* InClass);
	void LinkAnimClassLayers(class UClass* InClass);
	void IsUsingRootTransform(bool* ReturnValue);
	void IsUsingMainInstanceMontageEvaluationData(bool* ReturnValue);
	void IsSyncGroupBetweenMarkers(class FName InSyncGroupName, class FName PreviousMarker, class FName NextMarker, bool bRespectMarkerOrder, bool* ReturnValue);
	void IsPlayingSlotAnimation(class UAnimSequenceBase** Asset, class FName SlotNodeName, bool* ReturnValue);
	void IsAnyMontagePlaying(bool* ReturnValue);
	void HasMarkerBeenHitThisFrame(class FName SyncGroup, class FName* MarkerName, bool* ReturnValue);
	void GetTimeToClosestMarker(class FName SyncGroup, class FName* MarkerName, float OutMarkerTime, bool* ReturnValue);
	void GetSyncGroupPosition(class FName InSyncGroupName, struct FMarkerSyncAnimPosition* ReturnValue);
	void GetRelevantAnimTimeRemainingFraction(int32 MachineIndex, int32 StateIndex, float* ReturnValue);
	void GetRelevantAnimTimeRemaining(int32 MachineIndex, int32 StateIndex, float* ReturnValue);
	void GetRelevantAnimTimeFraction(int32 MachineIndex, int32 StateIndex, float* ReturnValue);
	void GetRelevantAnimTime(int32 MachineIndex, int32 StateIndex, float* ReturnValue);
	void GetRelevantAnimLength(int32 MachineIndex, int32 StateIndex, float* ReturnValue);
	void GetReceiveNotifiesFromLinkedInstances(bool* ReturnValue);
	void GetPropagateNotifiesToLinkedInstances(bool* ReturnValue);
	void GetOwningComponent(class USkeletalMeshComponent** ReturnValue);
	void GetOwningActor(class AActor** ReturnValue);
	TArray<class UAnimInstance*> GetLinkedAnimLayerInstancesByGroup(class FName InGroup);
	void GetLinkedAnimLayerInstanceByGroupAndClass(class FName InGroup, class UClass* InClass, class UAnimInstance** ReturnValue);
	void GetLinkedAnimLayerInstanceByGroup(class FName InGroup, class UAnimInstance** ReturnValue);
	void GetLinkedAnimLayerInstanceByClass(class UClass* InClass, class UAnimInstance** ReturnValue);
	TArray<class UAnimInstance*> GetLinkedAnimGraphInstancesByTag();
	class FName GetLinkedAnimGraphInstanceByTag(class UAnimInstance** ReturnValue);
	int32 GetInstanceTransitionTimeElapsedFraction(int32 MachineIndex, float* ReturnValue);
	int32 GetInstanceTransitionTimeElapsed(int32 MachineIndex, float* ReturnValue);
	int32 GetInstanceTransitionCrossfadeDuration(int32 MachineIndex, float* ReturnValue);
	void GetInstanceStateWeight(int32 MachineIndex, int32 StateIndex, float* ReturnValue);
	void GetInstanceMachineWeight(int32 MachineIndex, float* ReturnValue);
	void GetInstanceCurrentStateElapsedTime(int32 MachineIndex, float* ReturnValue);
	void GetInstanceAssetPlayerTimeFromEndFraction(int32 AssetPlayerIndex, float* ReturnValue);
	void GetInstanceAssetPlayerTimeFromEnd(int32 AssetPlayerIndex, float* ReturnValue);
	void GetInstanceAssetPlayerTimeFraction(int32 AssetPlayerIndex, float* ReturnValue);
	void GetInstanceAssetPlayerTime(int32 AssetPlayerIndex, float* ReturnValue);
	void GetInstanceAssetPlayerLength(int32 AssetPlayerIndex, float* ReturnValue);
	void GetDeltaSeconds(float* ReturnValue);
	float GetCurveValueWithDefault(float DefaultValue, bool* ReturnValue);
	class FName GetCurveValue(float* ReturnValue);
	void GetCurrentStateName(int32 MachineIndex, class FName* ReturnValue);
	void GetCurrentActiveMontage(class UAnimMontage** ReturnValue);
	void GetAllCurveNames(const TArray<class FName>& OutNames);
	void GetActiveCurveNames(enum class EAnimCurveType* CurveType, const TArray<class FName>& OutNames);
	struct FHitResult ControlRigNotify(class FName NotifyCustomTag, struct FVector* Velocity);
	class FName ClearTransitionEvents();
	void ClearMorphTargets();
	void ClearAllTransitionEvents();
	void CalculateDirection(struct FVector* Velocity, const struct FRotator& BaseRotation, float* ReturnValue);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	float BlueprintTriggerAnimationEvent(class FName AnimationEventName);
	float BlueprintThreadSafeUpdateAnimation();
	void BlueprintPostEvaluateAnimation();
	float BlueprintPlayAnimationEvent(bool* bPauseOnFinish);
	void BlueprintLinkedAnimationLayersInitialized();
	void BlueprintInitializeAnimation();
	void BlueprintBeginPlay();
};

// 0x150 (0x370 - 0x220)
// Class Engine.BlueprintGeneratedClass
class UBlueprintGeneratedClass : public UClass
{
public:
	uint8                                        Pad_B61[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	int32                                        NumReplicatedProperties;                           // 0x228(0x4)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, Parm, ReturnParm, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	uint8                                        bHasNativizedParent : 1;                           // Mask: 0x1, PropSize: 0x10x22C(0x1)(Edit, BlueprintReadOnly, Parm, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bHasCookedComponentInstancingData : 1;             // Mask: 0x2, PropSize: 0x10x22C(0x1)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_87 : 6;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_B62[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<class UDynamicBlueprintBinding*>      DynamicBindingObjects;                             // 0x230(0x10)(Edit, ConstParm, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	TArray<class UActorComponent*>               ComponentTemplates;                                // 0x240(0x10)(Edit, ExportObject, Net, EditFixedSize, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	TArray<class UTimelineTemplate*>             Timelines;                                         // 0x250(0x10)(Edit, ConstParm, Net, EditFixedSize, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	TArray<struct FBPComponentClassOverride>     ComponentClassOverrides;                           // 0x260(0x10)(ConstParm, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	class USimpleConstructionScript*             SimpleConstructionScript;                          // 0x270(0x8)(ExportObject, BlueprintReadOnly, Net, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, Config, DisableEditOnInstance, GlobalConfig)
	class UInheritableComponentHandler*          InheritableComponentHandler;                       // 0x278(0x8)(ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, GlobalConfig)
	class UStructProperty*                       UberGraphFramePointerProperty;                     // 0x280(0x8)(ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_B65[0x8];                                      // Fixing Size After Last Property  > TateDumper <
	class UFunction*                             UberGraphFunction;                                 // 0x290(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	TMap<class FName, struct FGuid>              CookedPropertyGuids;                               // 0x298(0x50)(BlueprintVisible, Net, ZeroConstructor, EditConst, InstancedReference, SubobjectReference)
	TMap<class FName, struct FBlueprintCookedComponentInstancingData> CookedComponentInstancingData;                     // 0x2E8(0x50)(BlueprintReadOnly, Net, EditFixedSize, OutParm, DisableEditOnTemplate, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        Pad_B66[0x38];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UBlueprintGeneratedClass* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class Engine.TimecodeProvider
class UTimecodeProvider : public UObject
{
public:
	float                                        FrameDelay;                                        // 0x28(0x4)(ExportObject, BlueprintReadOnly, ReturnParm, DisableEditOnTemplate, EditConst)
	uint8                                        Pad_B72[0x4];                                      // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UTimecodeProvider* GetDefaultObj();

	void GetTimecode(struct FTimecode* ReturnValue);
	void GetSynchronizationState(enum class ETimecodeProviderSynchronizationState* ReturnValue);
	void GetQualifiedFrameTime(struct FQualifiedFrameTime* ReturnValue);
	void GetFrameRate(struct FFrameRate* ReturnValue);
	void GetDelayedTimecode(struct FTimecode* ReturnValue);
	void GetDelayedQualifiedFrameTime(struct FQualifiedFrameTime* ReturnValue);
	void FetchTimecode(struct FQualifiedFrameTime* OutFrameTime, bool* ReturnValue);
	void FetchAndUpdate();
};

// 0x0 (0x28 - 0x28)
// Class Engine.MeshDeformer
class UMeshDeformer : public UObject
{
public:

	static class UClass* StaticClass();
	static class UMeshDeformer* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.MeshDeformerInstanceSettings
class UMeshDeformerInstanceSettings : public UObject
{
public:

	static class UClass* StaticClass();
	static class UMeshDeformerInstanceSettings* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.MeshDeformerInstance
class UMeshDeformerInstance : public UObject
{
public:

	static class UClass* StaticClass();
	static class UMeshDeformerInstance* GetDefaultObj();

};

// 0x0 (0x4C8 - 0x4C8)
// Class Engine.Info
class AInfo : public AActor
{
public:

	static class UClass* StaticClass();
	static class AInfo* GetDefaultObj();

};

// 0xA0 (0x568 - 0x4C8)
// Class Engine.GameModeBase
class AGameModeBase : public AInfo
{
public:
	class FString                                OptionsString;                                     // 0x4C8(0x10)(ConstParm, BlueprintVisible, Parm, OutParm, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                GameSessionClass;                                  // 0x4D8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                GameStateClass;                                    // 0x4E0(0x8)(ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, EditFixedSize, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class UClass*                                PlayerControllerClass;                             // 0x4E8(0x8)(Edit, BlueprintReadOnly, Net, EditFixedSize, OutParm, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                PlayerStateClass;                                  // 0x4F0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, SubobjectReference)
	class UClass*                                HUDClass;                                          // 0x4F8(0x8)(BlueprintVisible, ExportObject, Net, EditFixedSize, OutParm, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                DefaultPawnClass;                                  // 0x500(0x8)(Edit, ConstParm, Net, EditFixedSize, OutParm, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                SpectatorClass;                                    // 0x508(0x8)(Edit, ConstParm, ExportObject, BlueprintReadOnly, EditFixedSize, OutParm, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                ReplaySpectatorPlayerControllerClass;              // 0x510(0x8)(ExportObject, EditFixedSize, OutParm, EditConst, InstancedReference, SubobjectReference)
	class UClass*                                ServerStatReplicatorClass;                         // 0x518(0x8)(ConstParm, ExportObject, BlueprintReadOnly, Net, OutParm, EditConst, InstancedReference, SubobjectReference)
	class AGameSession*                          GameSession;                                       // 0x520(0x8)(BlueprintVisible, EditFixedSize, ReturnParm)
	class AGameStateBase*                        GameState;                                         // 0x528(0x8)(Edit, ConstParm, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, GlobalConfig)
	class AServerStatReplicator*                 ServerStatReplicator;                              // 0x530(0x8)(Edit, ConstParm, BlueprintVisible, EditFixedSize, ZeroConstructor, Transient, DisableEditOnInstance, GlobalConfig)
	class FText                                  DefaultPlayerName;                                 // 0x538(0x18)(BlueprintReadOnly, Net, OutParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bUseSeamlessTravel : 1;                            // Mask: 0x1, PropSize: 0x10x550(0x1)(ConstParm, BlueprintVisible, Net, OutParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bStartPlayersAsSpectators : 1;                     // Mask: 0x2, PropSize: 0x10x550(0x1)(ExportObject, BlueprintReadOnly, OutParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bPauseable : 1;                                    // Mask: 0x4, PropSize: 0x10x550(0x1)(ConstParm, BlueprintReadOnly, OutParm, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_BBF[0x17];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class AGameModeBase* GetDefaultObj();

	void StartPlay();
	class AController* SpawnDefaultPawnFor(class AActor* StartSpot, class APawn** ReturnValue);
	class AController* SpawnDefaultPawnAtTransform(struct FTransform* SpawnTransform, class APawn** ReturnValue);
	void ShouldReset(class AActor** ActorToReset, bool* ReturnValue);
	void ReturnToMainMenuHost();
	class AController* RestartPlayerAtTransform(struct FTransform* SpawnTransform);
	class AController* RestartPlayerAtPlayerStart(class AActor* StartSpot);
	class AController* RestartPlayer();
	void ResetLevel();
	class APlayerController* PlayerCanRestart(bool* ReturnValue);
	void MustSpectate(class APlayerController** NewPlayerController, bool* ReturnValue);
	class APlayerController* K2_PostLogin();
	void K2_OnSwapPlayerControllers(class APlayerController* OldPC, class APlayerController* NewPC);
	class AController* K2_OnRestartPlayer();
	void K2_OnLogout(class AController* ExitingController);
	void K2_OnChangeName(class AController** Other, const class FString& NewName, bool bNameChange);
	class AController* K2_FindPlayerStart(const class FString& IncomingName, class AActor** ReturnValue);
	class AController* InitStartSpot(class AActor* StartSpot);
	class APlayerController* InitializeHUDForPlayer();
	void HasMatchStarted(bool* ReturnValue);
	void HasMatchEnded(bool* ReturnValue);
	class APlayerController* HandleStartingNewPlayer();
	void GetNumSpectators(int32* ReturnValue);
	void GetNumPlayers(int32* ReturnValue);
	class AController* GetDefaultPawnClassForController(class UClass** ReturnValue);
	class AController* FindPlayerStart(const class FString& IncomingName, class AActor** ReturnValue);
	class AController* ChoosePlayerStart(class AActor** ReturnValue);
	void ChangeName(class AController** Controller, const class FString& NewName, bool bNameChange);
	void CanSpectate(class APlayerController* Viewer, class APlayerState* ViewTarget, bool* ReturnValue);
};

// 0x0 (0x28 - 0x28)
// Class Engine.EngineCustomTimeStep
class UEngineCustomTimeStep : public UObject
{
public:

	static class UClass* StaticClass();
	static class UEngineCustomTimeStep* GetDefaultObj();

};

// 0x0 (0x4C8 - 0x4C8)
// Class Engine.PartitionActor
class APartitionActor : public AActor
{
public:

	static class UClass* StaticClass();
	static class APartitionActor* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class Engine.TickableWorldSubsystem
class UTickableWorldSubsystem : public UWorldSubsystem
{
public:
	uint8                                        Pad_BC8[0x10];                                     // Fixing Size Of Struct > TateDumper <

	static class UClass* StaticClass();
	static class UTickableWorldSubsystem* GetDefaultObj();

};

// 0x38 (0x500 - 0x4C8)
// Class Engine.Brush
class ABrush : public AActor
{
public:
	enum class EBrushType                        BrushType;                                         // 0x4C8(0x1)(Edit, ConstParm, ExportObject, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        Pad_BCC[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	struct FColor                                BrushColor;                                        // 0x4CC(0x4)(Edit, BlueprintVisible, Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	int32                                        PolyFlags;                                         // 0x4D0(0x4)(ConstParm, ExportObject, EditFixedSize, Parm, OutParm, Config, DisableEditOnInstance, InstancedReference, SubobjectReference)
	uint8                                        bColored : 1;                                      // Mask: 0x1, PropSize: 0x10x4D4(0x1)(Parm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bSolidWhenSelected : 1;                            // Mask: 0x2, PropSize: 0x10x4D4(0x1)(ConstParm, BlueprintVisible, BlueprintReadOnly, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bPlaceableFromClassBrowser : 1;                    // Mask: 0x4, PropSize: 0x10x4D4(0x1)(ExportObject, Net, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        bNotForClientOrServer : 1;                         // Mask: 0x8, PropSize: 0x10x4D4(0x1)(BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_88 : 4;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_BD3[0x3];                                      // Fixing Size After Last Property  > TateDumper <
	class UModel*                                Brush;                                             // 0x4D8(0x8)(Edit, BlueprintVisible, ExportObject, EditFixedSize, Parm, OutParm, ReturnParm, EditConst)
	class UBrushComponent*                       BrushComponent;                                    // 0x4E0(0x8)(Edit, ConstParm, BlueprintVisible, Net, OutParm, ZeroConstructor, ReturnParm, DisableEditOnTemplate, DisableEditOnInstance, GlobalConfig)
	uint8                                        bInManipulation : 1;                               // Mask: 0x1, PropSize: 0x10x4E8(0x1)(Edit, ConstParm, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)
	uint8                                        BitPad_89 : 7;                                     // Fixing Bit-Field Size  > TateDumper <
	uint8                                        Pad_BD6[0x7];                                      // Fixing Size After Last Property  > TateDumper <
	TArray<struct FGeomSelection>                SavedSelections;                                   // 0x4F0(0x10)(ConstParm, ExportObject, EditFixedSize, ZeroConstructor, ReturnParm, DisableEditOnTemplate, Transient, EditConst, InstancedReference, SubobjectReference)

	static class UClass* StaticClass();
	static class ABrush* GetDefaultObj();

};

// 0x18 (0x518 - 0x500)
// Class Engine.Volume
class AVolume : public ABrush
{
public:
